{
  "id": "9f19e16d-17a6-487a-a471-b38444d28857",
  "title": "Could DOGE cut $2T? The legal and practical reality of government reform",
  "link": "https://thedispatch.com/newsletter/techne/doge-versus-the-bureaucracy/",
  "description": "Article URL: https://thedispatch.com/newsletter/techne/doge-versus-the-bureaucracy/ Comments URL: https://news.ycombinator.com/item?id=42160528 Points: 4 # Comments: 0",
  "author": "wrineha2",
  "published": "Sat, 16 Nov 2024 23:32:45 +0000",
  "source": "https://hnrss.org/frontpage",
  "categories": null,
  "byline": "Will Rinehart",
  "length": 15580,
  "excerpt": "Elon Musk and Vivek Ramaswamy might not cut trillions in spending, but there are thousands of ways to make government better.",
  "siteName": "The Dispatch",
  "favicon": "https://thedispatch.com/wp-content/uploads/2024/05/cropped-TheDispatchFavicon.png?w=192",
  "text": "Elon Musk and Vivek Ramaswamy might not cut trillions in spending, but there are thousands of ways to make government better. Getty illustration. Published November 14, 2024  • Updated November 15, 2024 Welcome back to Techne! Scientists and historians are converging on an answer to one of the most perplexing origin stories: Copper miners moving ore deep within the ancient mines in the Carpathian Mountains likely created the very first wheels. Taking a Swing at the Size and Cost of Government When people talk about Illinois politics, they often reference Chicago. But when Chicagoans talk about politics, they talk about Springfield, the state capital where I was born and raised. Quite literally, I grew up in the shadow of politics. As a kid, I’d often bike to the statehouse just to relax beneath the statue of Lincoln.  Given this background, it is not surprising that my professional career has been shaped by concerns over poorly designed public policy. So, I felt hopeful when President-elect Donald Trump announced that entrepreneurs Elon Musk and Vivek Ramaswamy would lead what Trump calls the Department of Government Efficiency (DOGE) with the aim of tackling government waste. While the “department” is not a government agency and details are lacking, Trump has said that DOGE will “provide advice and guidance from outside of Government, and will partner with the White House and Office of Management \u0026 Budget to drive large scale structural reform, and create an entrepreneurial approach to Government.” And all of this is to be done “no later than July 4, 2026,” the 250th anniversary of the signing of the Declaration of Independence. Musk has been more explicit in his goals, however unrealistic. He wants to cut $2 trillion from the budget, do away with what he calls the “Kafkaesque” rules of government, and make it easier to fire bad employees. Musk’s long history of clashes with the Federal Aviation Administration as head of SpaceX underscores the potential conflicts of interest that this effort could generate. While I appreciate the optimism from Musk, he and Trump will face pushback and obstacles that could derail DOGE’s aspirations.  For one, Trump already attempted a dramatic reduction of government back in 2017 but couldn’t make headway with Congress, which ultimately decides if agencies are created or cut. On top of this, the United States already ranks near the bottom of rich countries when it comes to government spending per total size of economy. Reducing this spending even more will prove difficult, if not impossible. More importantly, Trump has taken reform of Social Security and Medicare off the table, which means that two huge entitlement programs that could drive significant savings won’t be touched.   Given these constraints, DOGE could be effective by focusing on more mundane problems in government rather than radical changes. It should work to clear the backlog of already proposed reforms, make processes more rational, and solicit reforms from people working in government. They wouldn’t be flashy changes, but they could actually make things better. It’s been tried before. The U.S. government is massive. Over the last fiscal year, which ran from October 2023 to September 2024, the federal government spent $6.75 trillion. The largest chunk of this went to Social Security ($1.46 trillion); then health ($912 billion), which includes Medicaid; interest payments on debt ($882 billion); Medicare ($874 billion); national defense ($874 billion); and veterans benefits ($325 billion).  Reducing these outlays will be difficult, given the promises Trump has made. What DOGE should tackle is fraud, which is a known problem. According to the Government Accountability Office’s first ever study of the problem, released late last year, the federal government likely loses between $233 billion and $521 billion annually to fraud. During the pandemic alone, the Small Business Administration’s Office of Inspector General estimated the agency disbursed $200 billion in potentially fraudulent payments, between 11 and 15 percent of its total spending.  In early 2023, for example, Edward Whitaker and Schunda Coleman pleaded guilty to operating a nationwide scheme that helped people forge documents for COVID relief loans and commit millions of dollars in fraud. Similarly, in Medicare and Social Security, fraud schemes often involve billing for unnecessary medical procedures, stealing personal information to collect benefits, or creating fake identities to siphon funds from these essential programs.   But hiring auditors and doing the necessary technical upgrades to combat fraud requires spending that’s often a tough sell politically. Reducing headcount might trim budgets, but it is likely to make fraud worse. There is also a similar sort of tension in undoing the regulatory state. While Musk seems more focused on cutting the size of government, Ramaswamy has been talking about curbing bureaucratic regulations, which he characterizes as a legal mandate from the Supreme Court. In part, he’s got a point. A number of recent court cases have limited agency authority to push regulations. But undoing all of those mandates will require more lawyers. Undoing the regulatory state is likely to mean more government workers in the near term, rather than fewer.    And as much as I am a fan of slimming budgets, the United States already ranks at the bottom of public sector spending. Public sector employment in the United States only constitutes about 14 percent of all employment, far lower than Canada at 19 percent and lower than the United Kingdom at 16 percent. A vast majority of this employment comes from local, not federal, government.  As Francis Fukuyama recently wrote in an open letter to Musk,  There are basically the same number of full-time federal employees today as there were back in 1969, about 2.3 million. This is despite the fact that the government now disburses more than five times as many dollars as it did back then. In fact, you can argue that the government is understaffed, due to relentless pressure over the decades to keep headcounts down. The Center for Medicare and Medicaid Services, for example, oversees the spending of $1.4 trillion, or one fifth of the entire federal budget, with a staff of only 6,400 full-time employees. Instead of trying to thin the ranks of federal employees, some have also suggested that entire agencies should be axed. The Department of Education has especially drawn ire. But the president doesn’t have unilateral power to shutter an agency. Congress would need to initiate that process and it has been resistant to reforms. When Trump tried in 2017 to cut $2.5 trillion in spending, Congress passed a budget that was broadly in line with years previous and he signed it into law. Timing also complicates structural reform. If DOGE indeed finishes its recommendations by July 2026, the earliest the president could try to implement reforms would be in a budget for the 2028 fiscal year, by which time the House could be controlled by Democrats.  The short timeline will inherently limit what DOGE can do. The Base Realignment and Closure (BRAC) process is often cited as an example of a successful reorganization and downsizing by the government. Unlike DOGE, this was a congressionally authorized process that allowed the Department of Defense (DOD) to reorganize its facilities, resulting in 350 base closures and a combined savings of $12 billion annually. But BRAC happened over the course of five rounds, beginning in 1988 and ending in 2005. Part of what made the effort successful was that it was slow and deliberate, giving the DOD time to adjust and unravel all of its interests. Quick changes and deep cuts will face steep opposition.  Cleaning up regulations and processes. The new administration already has a lot of options to make the government better. In fact, it has roughly 5,372 options. The Government Accountability Office (GAO) has published thousands of recommendations over the years to improve efficiency, accountability, and transparency across federal agencies. As it currently stands, more than 5,000 recommendations are currently open and 499 are priority recommendations. By the GAO’s own estimates, implementing these recommendations could save between $106 billion and $208 billion. Additionally, the inspectors general have put forward 14,000 more suggestions to boost government efficiency. DOGE should think of ways to clear this backlog of recommendations.  One of the ways that DOGE could be useful is in soliciting advice from administrators on hangups that slow deployment. Jennifer Pahlka, former deputy chief technology officer under Obama and author of Recoding America, recently explained the problem of cascades, as she calls it, that desperately needs to be resolved:   The story that I’ve probably told the most is about a friend of mine who worked on a project at the Air Force. Back in 2014, we were trying to get new software on the satellites that manage GPS, and the project was extremely delayed and way over budget. They had inserted a huge enterprise service bus (ESB) in the middle of a really simple protocol; it was so complex and Rube Goldberg-y that it caused timeouts between the ground stations and the satellite.  He asked why this ESB was in there, and someone said that it’s a requirement in the contract. As he pulled the thread, he found out that everybody believed this was required by Congress. So he went back and looked at the Clinger Cohen Act, which requires all agencies to have a plan for how they’re going to handle technology. At some point, somebody wrote some guidance around that, which suggested interoperability using ESBs — for software developers who are asking, “Why is she talking about ESBs?”, this was in the ‘90s. As it descended from the federal enterprise architecture to the Department of Defense enterprise architecture to the US Air Force enterprise architecture to an actual contract, it went from being a suggestion to a requirement. Pahlka’s book details a number of programs that are burdened by these cascades. Finding these suggestions that seemingly became requirements could go a long way to making the government operate better.  Big government versus small government. DOGE fits into a long line of efforts by presidents to reduce the size of government. Barack Obama signed the “Delivering an Efficient, Effective, and Accountable Government” executive order and Bill Clinton advanced the “National Partnership for Reinventing Government.” Both initiatives had some success, but neither was able to fully deliver on their promises. Perhaps I am too cynical, but I expect DOGE to suffer the same fate, especially since Trump has promised to not touch entitlements.  Ultimately, DOGE could help everyone by recommending incremental, pragmatic changes that enhance accountability and transparency without derailing essential services. By focusing on cutting waste, streamlining processes, and addressing the cascade of outdated standards, DOGE has the potential to become a meaningful force in government reform. To me, that would still be a big win. Until next week, 🚀 Will Notes and Quotes President-elect Donald Trump has tapped former New York Rep. Lee Zeldin to head the Environmental Protection Agency. After Monday’s announcement, Zeldin explained his goals: “We will restore US energy dominance, revitalize our auto industry to bring back American jobs, and make the US the global leader of AI.” A man from Montana was sentenced to six months in prison in September for trafficking a cloned specimen of one of the largest sheep species in the world. But it seems that this sheep is probably the sire of countless sleep. Wired reports on this strange story.   Casey Handmer, founder of Terraform Industries, lays out what will be needed to power a colony on Mars.  President Joe Biden isn’t done yet. Under the White House’s road map unveiled Tuesday, the U.S. is set to deploy an additional 200 gigawatts of nuclear energy capacity by 2050. Trump is doubling back and is now expected to try to halt a TikTok ban. Relatedly, TikTok Canada’s Chinese owner has been ordered to dissolve operations amid national security concerns, but the site is still operational in Canada.   From my former boss, legal scholar Geoffrey Manne: “The judge’s full opinion in FTC v. Meta is now available, and it doesn’t bode well for the FTC. I highlight the court’s distinct skepticism in this thread.” This is a beast of a paper, 223 pages on state permitting. In announcing its publication, permitting guru Thomas Hochman pointed out that, “75% of federal permits are actually issued by the states. And states have their own enviro laws too. Most permitting, then, is at the state level.” Something I didn’t know: “There used to be 50,000 pay toilets in cities across America until a group of college students in 1970 decided it wasn’t fair to have to pay for a natural bodily function and successfully lobbied to get them banned in 12 states and now you can’t find public toilets f–kin anywhere in many US cities.” A cautionary tale indeed. TSMC is suspending production of advanced AI chips for China. In a ruling issued this week, the D.C. Circuit Court held that the Council on Environmental Quality lacks statutory authority to issue rules under the National Environmental Policy Act. I will be tracking what could be a very big deal. As I noted last week, space policy could get wild: “What does seem clear is that, for the first time in 15 years, canceling the Space Launch System rocket or dramatically reducing its influence is on the table. This will be an acid test for Musk and Trump’s rhetoric on government efficiency, since the base of support for Artemis is in the deep-red South: states like Alabama, Mississippi, Louisiana, and Florida.” AI Roundup  AI expert Gary Marcus thinks that large language models have reached their limits.  And here’s more discussion about the performance of GPTs being maxed out. Tariffs could jeopardize AI innovation, especially since many chip materials cannot be reshored. Taylor Barkley, Neil Chilson, and Logan Whitehair of the Abundance Institute just published their final installment on AI’s influence on the election, finding “no evidence that generative AI negatively affected the process or the outcome of the 2024 U.S. election.” Chilson and fellow AI policy expert Adam Thierer offer a sensible approach to AI policy.  Will Rinehart Will Rinehart is author of Techne and a senior fellow at the American Enterprise Institute.",
  "image": "https://thedispatch.com/wp-content/uploads/2024/11/GettyImages-504703130.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\n    \n    \n\u003csection\u003e\n    \u003cdiv\u003e\n                            \n                        \n                            \u003cp\u003e\n                    Elon Musk and Vivek Ramaswamy might not cut trillions in spending, but there are thousands of ways to make government better.                \u003c/p\u003e\n                                \u003c/div\u003e\n            \u003cfigure\u003e\n            \u003cp\u003e\u003cimg src=\"https://thedispatch.com/wp-content/uploads/2024/11/GettyImages-504703130.jpg?w=1024\" alt=\"\" loading=\"eager\"/\u003e\n            \u003c/p\u003e\n                            \u003cfigcaption\u003e\n                    Getty illustration.                \u003c/figcaption\u003e\n                    \u003c/figure\u003e\n    \u003c/section\u003e\n    \u003csection id=\"article-contents\"\u003e\n        \u003cdiv id=\"post-details\"\u003e\n                        \n            \u003cp\u003e\u003ctime datetime=\"2024-11-17 01:12:28\"\u003e\n                Published November 14, 2024            \u003c/time\u003e\n            \n                             • Updated November 15, 2024                    \u003c/p\u003e\u003c/div\u003e\n        \u003cdiv id=\"article-body\"\u003e\n                \u003cp\u003eWelcome back to \u003cstrong\u003eTechne\u003c/strong\u003e! \u003ca href=\"https://www.yahoo.com/news/scientists-may-finally-found-origin-120000994.html\"\u003eScientists\u003c/a\u003e and historians are converging on an answer to one of the most perplexing origin stories: Copper miners moving ore deep within the ancient mines in the Carpathian Mountains likely created the very first wheels.\u003c/p\u003e\n\n\u003cp\u003e\u003ch2 id=\"h-taking-a-swing-at-the-size-and-cost-of-government\"\u003e\u003cstrong\u003eTaking a Swing at the Size and Cost of Government\u003c/strong\u003e\u003c/h2\u003e\n\u003c/p\u003e\n\n\u003cp\u003eWhen people talk about Illinois politics, they often reference Chicago. But when Chicagoans talk about politics, they talk about Springfield, the state capital where I was born and raised. Quite literally, I grew up in the shadow of politics. As a kid, I’d often bike to the statehouse just to relax beneath \u003ca href=\"http://www.ilstatehouse.com/exterior_statuary.htm\"\u003ethe statue of Lincoln\u003c/a\u003e. \u003c/p\u003e\n\n\u003cp\u003eGiven this background, it is not surprising that my professional career has been shaped by concerns over poorly designed public policy. So,\u003cstrong\u003e \u003c/strong\u003eI felt hopeful when President-elect Donald Trump \u003ca href=\"https://x.com/realDonaldTrump/status/1856658569124262092\"\u003eannounced\u003c/a\u003e that entrepreneurs Elon Musk and Vivek Ramaswamy would lead what Trump calls the Department of Government Efficiency (DOGE) with the aim of tackling government waste.\u003c/p\u003e        \n\n\n\u003cp\u003eWhile the “department” is not a government agency and details are lacking, Trump has said that DOGE will “provide advice and guidance from outside of Government, and will partner with the White House and Office of Management \u0026amp; Budget to drive large scale structural reform, and create an entrepreneurial approach to Government.” And all of this is to be done “no later than July 4, 2026,” the 250th anniversary of the signing of the Declaration of Independence.\u003c/p\u003e\n\n\u003cp\u003eMusk has been more explicit in his goals, however unrealistic. He wants to cut $2 trillion from the budget, do away with what he calls \u003ca href=\"https://x.com/elonmusk/status/1855837662952968304\"\u003ethe “Kafkaesque” rules of government\u003c/a\u003e, and make it easier to \u003ca href=\"https://x.com/atrupar/status/1852734873460510875\"\u003efire bad employees\u003c/a\u003e. Musk’s long history of clashes with the Federal Aviation Administration as head of SpaceX underscores the potential conflicts of interest that this effort could generate. While I appreciate the optimism from Musk, he and Trump will face pushback and obstacles that could derail DOGE’s aspirations. \u003c/p\u003e\n\n\u003cp\u003eFor one, Trump already attempted \u003ca href=\"https://www.npr.org/2017/03/17/520483474/why-eliminating-government-agencies-is-a-lot-easier-said-than-done\"\u003ea dramatic reduction of government back in 2017\u003c/a\u003e but couldn’t make headway with Congress, which ultimately decides if agencies are created or cut. On top of this, the United States \u003ca href=\"https://www.imf.org/external/datamapper/exp@FPP/USA/FRA/JPN/GBR/SWE/ESP/ITA/ZAF/IND\"\u003ealready ranks\u003c/a\u003e near the bottom of rich countries when it comes to government spending per total size of economy. Reducing this spending even more will prove difficult, if not impossible. More importantly, Trump has taken reform of Social Security and Medicare off the table, which means that two huge entitlement programs that could drive significant savings won’t be touched.  \u003c/p\u003e\n\n\u003cp\u003eGiven these constraints, DOGE could be effective by focusing on more mundane problems in government rather than radical changes. It should work to clear the backlog of already proposed reforms, make processes more rational, and solicit reforms from people working in government. They wouldn’t be flashy changes, but they could actually make things better.\u003c/p\u003e\n\n\u003cp\u003e\u003ch3 id=\"h-it-s-been-tried-before\"\u003e\u003cstrong\u003eIt’s been tried before.\u003c/strong\u003e\u003c/h3\u003e\n\u003c/p\u003e\n\n\u003cp\u003eThe U.S. government is massive. Over the last fiscal year, which ran from October 2023 to September 2024, the federal government \u003ca href=\"https://www.fiscal.treasury.gov/files/reports-statements/mts/mts0924.pdf\"\u003espent $6.75 trillion\u003c/a\u003e. The largest chunk of this went to Social Security ($1.46 trillion); then health ($912 billion), which includes Medicaid\u003cstrong\u003e;\u003c/strong\u003e interest payments on debt ($882 billion); Medicare ($874 billion); national defense ($874 billion);\u003cstrong\u003e \u003c/strong\u003eand veterans benefits ($325 billion). \u003c/p\u003e\n\n\u003cp\u003eReducing these outlays will be difficult, given \u003ca href=\"https://www.forbes.com/sites/alisondurkee/2024/11/06/how-trump-could-affect-social-security-and-medicare-group-warns-funds-could-run-out-in-6-years-under-his-plans/\"\u003ethe promises Trump has made\u003c/a\u003e. What DOGE should tackle is fraud, which is a known problem. According to the Government Accountability Office’s \u003ca href=\"https://www.gao.gov/products/gao-24-105833\"\u003efirst ever study of the problem\u003c/a\u003e, released late last year, the federal government likely loses between $233 billion and $521 billion annually to fraud. During the pandemic alone, the Small Business Administration’s Office of Inspector General \u003ca href=\"https://www.sba.gov/document/report-23-09-covid-19-pandemic-eidl-ppp-loan-fraud-landscape\"\u003eestimated\u003c/a\u003e the agency disbursed $200 billion in potentially fraudulent payments, between 11 and 15 percent of its total spending. \u003c/p\u003e\n\n\u003cp\u003eIn early 2023, for example, Edward Whitaker and Schunda Coleman \u003ca href=\"https://www.irs.gov/compliance/criminal-investigation/over-20-defendants-sentenced-to-prison-in-multimillion-dollar-national-covid-19-fraud-scheme\"\u003epleaded guilty to operating\u003c/a\u003e a nationwide scheme that helped people forge documents for COVID relief loans and commit millions of dollars in fraud. Similarly, in Medicare and Social Security, fraud schemes often involve billing for unnecessary medical procedures, stealing personal information to collect benefits, or creating fake identities to siphon funds from these essential programs.  \u003c/p\u003e\n\n\u003cp\u003eBut hiring auditors and doing the necessary technical upgrades to combat fraud requires spending that’s often a tough sell politically. Reducing headcount might trim budgets, but it is likely to make fraud worse.\u003c/p\u003e\n\n\u003cp\u003eThere is also a similar sort of tension in undoing the regulatory state. While Musk seems more focused on cutting the size of government, Ramaswamy has been talking about curbing bureaucratic regulations, \u003ca href=\"https://x.com/VivekGRamaswamy/status/1856725762130260383\"\u003ewhich he characterizes\u003c/a\u003e as a legal mandate from the Supreme Court.\u003cstrong\u003e \u003c/strong\u003eIn part, he’s got a point. \u003ca href=\"https://thedispatch.com/article/loper-bright-and-the-end-of-administrative-exceptionalism/\"\u003eA number of recent court cases\u003c/a\u003e have limited agency authority to push regulations. But undoing all of those mandates will require more lawyers. Undoing the regulatory state is likely to mean more government workers in the near term, rather than fewer.  \u003cstrong\u003e \u003c/strong\u003e\u003c/p\u003e\n\n\u003cp\u003eAnd as much as I am a fan of slimming budgets, the United States already ranks at the bottom of public sector spending. Public sector employment in the United States \u003ca href=\"https://www.statista.com/statistics/1235570/share-of-people-employed-in-government/\"\u003eonly constitutes about 14 percent\u003c/a\u003e of all employment, far lower than Canada at 19 percent and lower than the United Kingdom at 16 percent. A vast majority of this employment comes from local, not federal, government. \u003c/p\u003e\n\n\u003cp\u003eAs Francis Fukuyama \u003ca href=\"https://www.persuasion.community/p/a-letter-to-elon-musk\"\u003erecently wrote\u003c/a\u003e in an open letter to Musk, \u003c/p\u003e\n\n\u003cdiv\u003e\u003cblockquote\u003e\n\u003cp\u003eThere are basically the same number of full-time federal employees today as there were back in 1969, about 2.3 million. This is despite the fact that the government now disburses more than five times as many dollars as it did back then. In fact, you can argue that the government is understaffed, due to relentless pressure over the decades to keep headcounts down. The Center for Medicare and Medicaid Services, for example, oversees the spending of $1.4 trillion, or one fifth of the entire federal budget, with a staff of only 6,400 full-time employees.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003c/div\u003e\n\n\u003cp\u003eInstead of trying to thin the ranks of federal employees, some have also suggested that entire agencies should be axed. \u003ca href=\"https://x.com/detroitnews/status/1834052823815774235\"\u003eThe Department of Education\u003c/a\u003e has especially drawn ire. But the president doesn’t have unilateral power to shutter an agency. Congress would need to initiate that process and it has been resistant to reforms. When Trump tried in 2017 to \u003ca href=\"https://www.cbpp.org/research/trump-budget-gets-two-thirds-of-its-cuts-from-programs-for-low-and-moderate-income-people\"\u003ecut $2.5 trillion in spending\u003c/a\u003e, Congress passed a budget that was broadly in line with years previous and he signed it into law.\u003c/p\u003e\n\n\u003cp\u003eTiming also complicates structural reform. If DOGE indeed finishes its recommendations by July 2026, the earliest the president could try to implement reforms would be in a budget for the 2028 fiscal year, by which time the House could be controlled by Democrats. \u003c/p\u003e\n\n\u003cp\u003eThe short timeline will inherently limit what DOGE can do. The Base Realignment and Closure (BRAC) process is often cited as an example of a successful reorganization and downsizing by the government. Unlike DOGE, this was a congressionally authorized process that allowed the Department of Defense (DOD) to reorganize its facilities, resulting in 350 base closures and \u003ca href=\"https://sgp.fas.org/crs/natsec/R45705.pdf\"\u003ea combined savings of $12 billion annually\u003c/a\u003e. But BRAC happened over the course of five rounds, beginning in 1988 and ending in 2005. Part of what made the effort successful was that it was slow and deliberate, giving the DOD time to adjust and unravel all of its interests. Quick changes and deep cuts will face steep opposition. \u003c/p\u003e\n\n\u003cp\u003e\u003ch3 id=\"h-cleaning-up-regulations-and-processes\"\u003e\u003cstrong\u003eCleaning up regulations and processes.\u003c/strong\u003e\u003c/h3\u003e\n\u003c/p\u003e\n\n\u003cp\u003eThe new administration already has a lot of options to make the government better. In fact, it has roughly \u003ca href=\"https://www.gao.gov/reports-testimonies/recommendations-database\"\u003e5,372 options\u003c/a\u003e. The Government Accountability Office (GAO) has published thousands of recommendations over the years to improve efficiency, accountability, and transparency across federal agencies. As it currently stands, more than 5,000 recommendations are currently open and 499 are priority recommendations. By the GAO’s own estimates, implementing these recommendations could save \u003ca href=\"https://www.gao.gov/products/gao-24-107146\"\u003ebetween $106 billion and $208 billion\u003c/a\u003e. Additionally, the inspectors general have put forward \u003ca href=\"https://www.oversight.gov/recommendations\"\u003e14,000 more suggestions\u003c/a\u003e to boost government efficiency. DOGE should think of ways to clear this backlog of recommendations. \u003c/p\u003e\n\n\u003cp\u003eOne of the ways that DOGE could be useful is in soliciting advice from administrators on hangups that slow deployment. Jennifer Pahlka, former deputy chief technology officer under Obama and author of \u003cem\u003eRecoding America\u003c/em\u003e, \u003ca href=\"https://www.statecraft.pub/p/how-to-build-state-capacity\"\u003erecently explained the problem of cascades\u003c/a\u003e, as she calls it, that desperately needs to be resolved:  \u003c/p\u003e\n\n\u003cdiv\u003e\u003cblockquote\u003e\n\u003cp\u003eThe story that I’ve probably told the most is about a friend of mine who worked on a project at the Air Force. Back in 2014, we were trying to get new software on the satellites that manage GPS, and the project was extremely delayed and way over budget. They had inserted a huge enterprise service bus (ESB) in the middle of a really simple protocol; it was so complex and Rube Goldberg-y that it caused timeouts between the ground stations and the satellite. \u003c/p\u003e\n\u003c/blockquote\u003e\n\u003c/div\u003e\n\n\u003cdiv\u003e\u003cblockquote\u003e\n\u003cp\u003eHe asked why this ESB was in there, and someone said that it’s a requirement in the contract. As he pulled the thread, he found out that everybody believed this was required by Congress. So he went back and looked at the Clinger Cohen Act, which requires all agencies to have a plan for how they’re going to handle technology. At some point, somebody wrote some guidance around that, which suggested interoperability using ESBs — for software developers who are asking, “Why is she talking about ESBs?”, this was in the ‘90s. As it descended from the federal enterprise architecture to the Department of Defense enterprise architecture to the US Air Force enterprise architecture to an actual contract, it went from being a suggestion to a requirement.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003c/div\u003e\n\n\u003cp\u003ePahlka’s book details a number of programs that are burdened by these cascades. Finding these suggestions that seemingly became requirements could go a long way to making the government operate better. \u003c/p\u003e\n\n\u003cp\u003e\u003ch3 id=\"h-big-government-versus-small-government\"\u003e\u003cstrong\u003eBig government versus small government.\u003c/strong\u003e\u003c/h3\u003e\n\u003c/p\u003e\n\n\u003cp\u003eDOGE fits into a long line of efforts by presidents to reduce the size of government. Barack Obama signed the “Delivering an Efficient, Effective, and Accountable Government” executive order and Bill Clinton advanced the “National Partnership for Reinventing Government.” Both initiatives had some success, but neither was able to fully deliver on their promises. Perhaps I am too cynical, but I expect DOGE to suffer the same fate, especially since Trump has promised to not touch entitlements. \u003c/p\u003e\n\n\u003cp\u003eUltimately, DOGE could help everyone by recommending incremental, pragmatic changes that enhance accountability and transparency without derailing essential services. By focusing on cutting waste, streamlining processes, and addressing the cascade of outdated standards, DOGE has the potential to become a meaningful force in government reform. To me, that would still be a big win.\u003c/p\u003e\n\n\u003cp\u003eUntil next week,\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003e🚀 \u003c/strong\u003eWill\u003c/p\u003e\n\n\u003cp\u003e\u003ch2 id=\"h-notes-and-quotes\"\u003e\u003cstrong\u003eNotes and Quotes\u003c/strong\u003e\u003c/h2\u003e\n\u003c/p\u003e\n\n\u003cdiv\u003e\u003cul\u003e\n\u003cli\u003ePresident-elect Donald Trump has tapped former New York Rep. Lee Zeldin to head the Environmental Protection Agency. After Monday’s announcement, \u003ca href=\"https://x.com/LeeMZeldin/status/1856068555865026956\"\u003eZeldin explained his goals\u003c/a\u003e: “We will restore US energy dominance, revitalize our auto industry to bring back American jobs, and make the US the global leader of AI.”\u003c/li\u003e\n\u003cli\u003eA man from Montana was sentenced to six months in prison in September for trafficking a cloned specimen of one of the largest sheep species in the world. But it seems that this sheep is probably the sire of countless sleep. \u003cem\u003eWired\u003c/em\u003e \u003ca href=\"https://www.wired.com/story/the-us-has-a-cloned-sheep-contraband-problem-montana-mountain-king/\"\u003ereports on this strange story\u003c/a\u003e.  \u003c/li\u003e\n\u003cli\u003eCasey Handmer, founder of Terraform Industries, \u003ca href=\"https://caseyhandmer.wordpress.com/2024/11/05/powering-the-mars-base/\"\u003elays out what will be needed\u003c/a\u003e to power a colony on Mars. \u003c/li\u003e\n\u003cli\u003ePresident Joe Biden isn’t done yet. Under the White House’s \u003ca href=\"https://www.whitehouse.gov/wp-content/uploads/2024/11/US-Nuclear-Energy-Deployment-Framework.pdf\"\u003eroad map\u003c/a\u003e unveiled Tuesday, the U.S. is set to deploy an additional 200 gigawatts of nuclear energy capacity by 2050.\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.washingtonpost.com/business/2024/11/12/trump-tiktok-ban-sale/\"\u003eTrump is doubling back\u003c/a\u003e and is now expected to try to halt a TikTok ban. Relatedly, \u003ca href=\"https://www.wsj.com/world/americas/canada-orders-tiktok-canada-unit-to-dissolve-operations-on-national-security-concerns-a9d9e8f2?mod=tech_lead_pos2\"\u003eTikTok Canada\u003c/a\u003e’s Chinese owner has been ordered to dissolve operations amid national security concerns, but the site is still operational in Canada.  \u003c/li\u003e\n\u003cli\u003eFrom my former boss, \u003ca href=\"https://x.com/geoffmanne/status/1856850155665813992?s=46\u0026amp;t=QxxclWnUrcxYlTvhOzRIfQ\"\u003elegal scholar Geoffrey Manne\u003c/a\u003e: “The judge’s full opinion in \u003cem\u003eFTC v. Meta\u003c/em\u003e is now available, and it doesn’t bode well for the FTC. I highlight the court’s distinct skepticism in this thread.”\u003c/li\u003e\n\u003cli\u003eThis is \u003ca href=\"https://cdn.sanity.io/files/d8lrla4f/staging/cca1b0e8b57426cb7ec0b5c1f3c0e4ce1bbf22f4.pdf\"\u003ea beast of a paper\u003c/a\u003e, 223 pages on state permitting. In announcing its publication, permitting guru Thomas Hochman \u003ca href=\"https://twitter.com/ThomasHochman/status/1856336138098651462\"\u003epointed out\u003c/a\u003e that, \u003cem\u003e“75%\u003c/em\u003e of federal permits are actually issued by the states. And states have their own enviro laws too. \u003cem\u003eMost\u003c/em\u003e permitting, then, is at the state level.”\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://x.com/hyperdiscogirl/status/1855399792379134176\"\u003eSomething\u003c/a\u003e I \u003ca href=\"https://en.wikipedia.org/wiki/Committee_to_End_Pay_Toilets_in_America\"\u003edidn’t know\u003c/a\u003e: “There used to be 50,000 pay toilets in cities across America until a group of college students in 1970 decided it wasn’t fair to have to pay for a natural bodily function and successfully lobbied to get them banned in 12 states and now you can’t find public toilets f–kin anywhere in many US cities.” A cautionary tale indeed.\u003c/li\u003e\n\u003cli\u003eTSMC is suspending \u003ca href=\"https://www.reuters.com/technology/artificial-intelligence/tsmc-suspend-production-advanced-ai-chips-china-monday-ft-reports-2024-11-08/\"\u003eproduction of advanced AI chips for China\u003c/a\u003e.\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.pillsburylaw.com/en/news-and-insights/washington-dc-white-house-council-environmental-quality-national-environmental-policy-act.html#:~:text=On%20November%2011%2C%202024%2C%20in,regulations%20implementing%20the%20National%20Environmental\"\u003eIn a ruling issued this week\u003c/a\u003e, the D.C. Circuit Court held that the Council on Environmental Quality lacks statutory authority to issue rules under the National Environmental Policy Act. I will be tracking what could be a very big deal.\u003c/li\u003e\n\u003cli\u003eAs I \u003ca href=\"https://thedispatch.com/newsletter/techne/what-our-leaders-need-to-know-about-tech-policy/\"\u003enoted\u003c/a\u003e last week, \u003ca href=\"https://arstechnica.com/space/2024/11/space-policy-is-about-to-get-pretty-wild-yall/\"\u003espace policy could get wild\u003c/a\u003e: “What does seem clear is that, for the first time in 15 years, canceling the Space Launch System rocket or dramatically reducing its influence is on the table. This will be an acid test for Musk and Trump’s rhetoric on government efficiency, since the base of support for Artemis is in the deep-red South: states like Alabama, Mississippi, Louisiana, and Florida.”\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\u003cp\u003e\u003ch2 id=\"h-ai-roundup-nbsp\"\u003e\u003cstrong\u003eAI Roundup \u003c/strong\u003e\u003c/h2\u003e\n\u003c/p\u003e\n\n\u003cdiv\u003e\u003cul\u003e\n\u003cli\u003eAI expert Gary Marcus \u003ca href=\"https://garymarcus.substack.com/p/confirmed-llms-have-indeed-reached\"\u003ethinks that large language models have reached their limits\u003c/a\u003e. \u003c/li\u003e\n\u003cli\u003eAnd here’s more discussion about the performance of \u003ca href=\"https://www.thealgorithmicbridge.com/p/gpts-are-maxed-out\"\u003eGPTs being maxed out\u003c/a\u003e.\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://digitalspirits.substack.com/p/trumps-ai-choice-compete-or-control?utm_source=post-email-title\u0026amp;publication_id=1490510\u0026amp;post_id=151389956\u0026amp;utm_campaign=email-post-title\u0026amp;isFreemail=true\u0026amp;r=3o9\u0026amp;triedRedirect=true\u0026amp;utm_medium=email\"\u003eTariffs could jeopardize\u003c/a\u003e AI innovation, especially since many chip materials cannot be reshored.\u003c/li\u003e\n\u003cli\u003eTaylor Barkley, Neil Chilson, and Logan Whitehair of the Abundance Institute just published \u003ca href=\"https://nowandnext.substack.com/p/part-v-the-abundance-institute-ai?triedRedirect=true\"\u003etheir final installment on AI’s influence on the election\u003c/a\u003e, finding\u003cstrong\u003e \u003c/strong\u003e“no evidence that generative AI negatively affected the process or the outcome of the 2024 U.S. election.”\u003c/li\u003e\n\u003cli\u003eChilson and fellow AI policy expert Adam Thierer \u003ca href=\"https://rtp.fedsoc.org/blog/a-sensible-approach-to-state-ai-policy/\"\u003eoffer a sensible approach to AI policy\u003c/a\u003e. \u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n            \u003c/div\u003e\n    \u003c/section\u003e\n\n    \n    \u003cdiv id=\"article-authors\"\u003e\n                                                    \u003cp\u003e\u003ca href=\"https://thedispatch.com/author/will-rinehart\"\u003e\n                                    \u003cimg src=\"https://thedispatch.com/wp-content/uploads/2024/05/Will-Reinhart.png\" loading=\"lazy\" alt=\"Will Rinehart\u0026#39;s Headshot\"/\u003e\n                                \u003c/a\u003e\n                            \u003c/p\u003e\n                                                \u003cp\u003e\n                            \u003ca href=\"https://thedispatch.com/author/will-rinehart\"\u003e\n                                \u003ch3\u003e\n                                    Will Rinehart                                \u003c/h3\u003e\n                            \u003c/a\u003e\n                                                                                \u003c/p\u003e\n                                                    \u003cp\u003e\n                                Will Rinehart is author of Techne and a senior fellow at the American Enterprise Institute.                            \u003c/p\u003e\n                                            \u003c/div\u003e\n\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "17 min read",
  "publishedTime": "2024-11-14T22:38:57Z",
  "modifiedTime": "2024-11-15T15:50:21Z"
}
