{
  "id": "ad12c10e-e9bc-4018-b5b5-d66b25072dc7",
  "title": "396: Transforming Federal Research into Startups with HIGHWAY Ventures",
  "link": "http://startupjunkiespodcast.com/396-transforming-federal-research-into-startups-with-highway-ventures",
  "description": "Summary In this episode of Startup Junkies, hosts Caleb Talley, Daniel Koonce, and Jeff Amerine sit down with Lane Patterson, founder of HIGHWAY Ventures, a startup studio that incubates and launches mobility companies in Northwest Arkansas. Unlike conventional venture studios that build minimum viable products, HIGHWAY Ventures focuses on leveraging federally funded technologies from various research labs to solve existing problems and create market-ready companies. HIGHWAY Ventures’ unique model includes licensing technology solutions, assembling executive teams, and facilitating innovation within specific fields. This year alone there is a projected two-hundred billion in funding for federal research and development going directly towards new technology innovation. However, the resources required to bolster that tech out of the lab and commercialized in the private sector are vastly underfunded. That’s where HIGHWAY Ventures comes in as the bridge over the valley of death that exists where technology is running out of funding and dying in the lab. Throughout the episode, the conversation highlights Lane’s dynamic journey from his origins at Kansas State University to gaining significant experience in the entrepreneurial landscape. Lane shares anecdotes from his early career in the telecommunications sector and his evolution into the startup world, emphasizing the challenges and rewards of entrepreneurial ventures and the importance of resilience and strategic planning. Additionally, Caleb, Daniel, Jeff, and Lane dive into the complexities of commercializing federal research, addressing challenges such as navigating outdated patents and ensuring the applicability of technologies across different sectors. Lane also touches on the motivations and dynamics of founding teams and the importance of aligning incentives to drive success. Listen now!   Show Notes (0:00) Introduction (0:47) Lane’s Origin Story (4:25) Why HIGHWAY Ventures Was Established in NW (6:02) About HIGHWAY Ventures (9:33) Utilizing Technology to Start a Company (12:51) The Startup Studio Cycle and Impact (17:07) The Importance of an Exit Plan (21:19) Advice to Younger Self (22:47) Closing Question   Links Caleb Talley Daniel Koonce Jeff Amerine Startup Junkie Startup Junkie YouTube Lane Patterson HIGHWAY Ventures",
  "author": "",
  "published": "Mon, 14 Oct 2024 10:00:00 +0000",
  "source": "https://startupjunkie.libsyn.com/rss",
  "categories": null,
  "byline": "",
  "length": 0,
  "excerpt": "",
  "siteName": "",
  "favicon": "",
  "text": "",
  "image": "",
  "html": "",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
