{
  "id": "c34d6f88-a848-4206-aeca-4f57abfcb449",
  "title": "Government-Mandated RTO Sees Roaches and Desk Shortages",
  "link": "https://www.inc.com/reuters/government-mandated-rto-sees-roaches-and-desk-shortages/91162118",
  "description": "Donald Trump mandated undreds of thousands of U.S. federal government employees return to their offices.",
  "author": "Reuters",
  "published": "Sun, 16 Mar 2025 20:12:53 -0400",
  "source": "https://www.inc.com/rss/",
  "categories": [
    "Lead"
  ],
  "byline": "Reuters",
  "length": 10173,
  "excerpt": "Donald Trump mandated undreds of thousands of U.S. federal government employees return to their offices.",
  "siteName": "Inc",
  "favicon": "https://www.inc.com/_public/icons/apple-icon.png",
  "text": "At NASA headquarters in Washington, just a mile from the U.S. Capitol, employees returned to an infestation of cockroaches and some are working in chairs with no desks, according to two people familiar with conditions there. In a private chat, staffers at U.S. Citizenship and Immigration Services likened the hunt for desks in some regional offices to “The Hunger Games,” the popular series of novels and films where young people must fight to the death in a government-sanctioned contest. And at an Internal Revenue Service office in Memphis, Tennessee, tax assessors sharing a training room are unable to discuss sensitive tax matters with clients over the phone out of fear of breaching privacy laws, according to one IRS manager who spoke to Reuters. Hundreds of thousands of U.S. federal government employees, many of whom have been working from home since the COVID-19 pandemic, were subjected to full-time RTO policies by President Donald Trump on January 20. But many have arrived at workplaces unprepared for their return, according to 10 federal workers who spoke to Reuters. RTO policies The federal employees work inside eight different government agencies across the U.S. who have returned to their office buildings, sometimes after years of working remotely. All spoke on the condition of anonymity out of fear of reprisal. Some critics of the move – including governance experts, federal union representatives and civil servants – have said the lack of preparation is no accident. They see it as a deliberate effort to make offices so unpleasant to work in that it will force more government employees to resign. Trump wants to slash and reshape the 2.3-million strong federal civilian workforce. Governance experts and labor unions say Trump’s return to office order is also emblematic of a wider problem with the way in which the Republican president and his top adviser, tech billionaire Elon Musk, are approaching the government overhaul. “It’s the move fast and break things approach, without really thinking through the implications of a range of different choices you are making,” said Pam Herd, a professor of social policy at the University of Michigan. “So they tell everyone to return to work without considering the fact that they don’t have the space to accommodate everyone.” Trump and Musk have insisted their goal is to make the U.S. government bureaucracy less costly for taxpayers and more efficient, and to eliminate waste and fraud. A spokesperson for the Office of Personnel Management, the government’s human resources department, said the goal of Trump’s return-to-office order is for federal employees to work efficiently to best serve the American people. “We are prioritizing in-person work to strengthen collaboration, accountability, and service delivery across the federal workforce,” an OPM spokesperson said. A White House official said in response to Reuters questions that facilities staff at the General Services Administration, which manages federal real estate, “work tirelessly to address reported issues to a satisfactory outcome.” A spokesperson for Musk’s Department of Government Efficiency did not respond to a request for comment. Fights for chairs and desks While most of the workers are returning to workplaces they left at the start of the 2020 pandemic, many others are teleworkers who had been working full-time from home or had a hybrid schedule that meant they worked only part of the time in an office. Federal employees described fights for desks and chairs, internet outages, a lack of parking spaces, with some sitting on floors and others told to use their personal smartphone hotspots to gain computer access to government data. Reuters also viewed three back-to-work memos sent to staff, informing some of them that they won’t have a workspace or internet access when they return. The U.S. Food and Drug Administration told staff this week it cannot guarantee desks or parking spots for the roughly 18,000 employees expected to report to offices on Monday. A manager at the IRS’ Washington headquarters told colleagues on a conference call on Tuesday she was sitting on a floor with her computer on her lap because she didn’t have a desk, according to an IRS manager who was on the call. An IRS human resources official in California was told to work in a supply closet, according to one person familiar with the arrangement. The IRS did not immediately respond to requests for comment. Chaos To date more than 100,000 workers have left the federal government after being fired or taking a buyout, according to Trump administration figures and a Reuters tally of those fired. More large-scale cuts are under way. Some labor unions say the chaotic execution of the return-to-work order is a deliberate ploy to force more federal workers to leave government by making workplaces stressful. “Bringing people back to work was nothing but a ploy to cause more confusion and get people to quit,” said Steve Lenkart, executive director of the National Federation of Federal Employees, which represents 110,000 government workers. Musk and DOGE have a mandate to make the federal bureaucracy more efficient, but all the workers who spoke to Reuters said the return to office order is currently having the opposite effect. “It’s complete chaos at NASA headquarters,” said Matt Biggs, president of the International Federation of Professional \u0026 Technical Engineers, a union that represents 8,000 federal NASA workers. “If you don’t have a desk or a computer you cannot do your job. People are much more unproductive.” Biggs and a staff member at NASA headquarters said when employees returned to the building last month there were cockroaches on floors and bugs that came out of faucets. Cheryl Warner, a NASA spokesperson, said in the past 30 days about 1,000 people have been entering NASA headquarters each day. She said the building, built in 1992, was lightly used during hybrid work, but it has been maintained. She said the building’s helpdesk had received only five requests regarding facilities issues since the full-scale return to work order. “Our team took immediate action to address those concerns, including talking to our regularly scheduled exterminator,” Warner said. Biggs and another NASA staff member said the noise and crush inside NASA’s Goddard Space Flight Center in Maryland has led some people to take meetings by phone inside their cars, using their personal hotspot to get internet access. Some NASA workers ordered back to Goddard live up to 50 miles away, and are so worried about the commute time and traffic they are turning up before dawn and sleeping in their vehicles before it’s time to start work, Biggs and the staff member said. NASA spokesperson Warner said there have been no reports of people working from their vehicles. Regarding seating, she said, “we have more than enough space to accommodate our HQ workforce.” The White House said shortly after Trump’s January inauguration that only 6 percent of federal employees work in person, but government data shows that remote work is more limited. About 46 percent of federal workers, or 1.1 million people, were eligible for remote work, and about 228,000 of them had been fully remote, meaning working from home either all or part of the time, according to a report issued by the Office of Management and Budget in August. Enough room Some government agencies downsized their office space to reduce costs after the COVID-19 pandemic work from home order, adding to the space crunch. Shortly before former Democratic President Joe Biden left office, the Office of Justice Programs in Washington, the Justice Department’s largest grant-making division, moved from a building with eight floors and an entire parking garage in Chinatown to another building nearby with four floors and only one level of parking. The new facility has 157 parking spaces to accommodate 400 employees with parking passes, and a lack of workspaces, spurring some to arrive well before dawn. The return to office mandate is inducing anxiety and making it difficult for staff to focus on their jobs, according to a person familiar with the matter. A Department of Justice spokesman said Trump and his attorney general, Pam Bondi, “expect federal workers paid for by hardworking taxpayers to show up in the office like millions of other Americans.” Washington’s Democratic mayor, Muriel Bowser, supports Trump’s return-to-office order as a way to revitalize the city economy. She met with Trump in December after his election victory and believes a lack of federal workers in D.C. has been shrinking the city’s tax revenue. But the pain of the return-to-office order is being felt among federal workers across the country. Immigration staff at the U.S. Citizenship and Immigration Services regional office in Chicago were temporarily forced to work on boxes in a storage room that served as a temporary office, one staffer said. “Employees whose salaries are paid for by American taxpayers should show up to work,” DHS spokesperson Tricia McLaughlin said in an email. “This isn’t complicated and isn’t controversial.” A USCIS spokesperson said, “With more employees in the office, of course the offices are more crowded. This is normal. All employees have adequate space to work and serve the American people.” That is not the experience of one employee at the Department of Agriculture’s headquarters building in Washington. Staff are fighting for office space each day while facilities workers haul furniture around to create temporary workstations. Workers returned to bathrooms with no paper towels. “It’s a zoo,” the employee said. A USDA spokesperson said the agency has “sufficient space” for all workers, including those who used to work remotely. (Reporting by Tim Reid, Ted Hesson, Sarah N. Lynch and Leah Douglas, editing by Ross Colvin and Michael Learmonth) The preferred-rate application deadline for the 2025 Inc. 5000 is this Friday, March 21, at 11:59 p.m. PT. Apply Today.",
  "image": "https://img-cdn.inc.com/image/upload/f_webp,q_auto,c_fit/vip/2025/03/gettyimages-157418740-170667a.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eAt NASA headquarters in Washington, just a mile from the U.S. Capitol, employees \u003ca href=\"https://www.inc.com/jon-shanahan/rto-mandates-business-imperative-or-costly-mistake/91160321\"\u003ereturned\u003c/a\u003e to an infestation of cockroaches and some are working in chairs with no desks, according to two people familiar with conditions there.\u003c/p\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eIn a private chat, staffers at U.S. Citizenship and Immigration Services likened the \u003ca href=\"https://www.inc.com/bruce-crumley/workers-are-coming-to-offices-less-in-2025-despite-rise-in-rto-orders/91160336\"\u003ehunt for desks\u003c/a\u003e in some regional offices to “The Hunger Games,” the popular series of novels and films where young people must fight to the death in a government-sanctioned contest.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd at an Internal Revenue Service office in Memphis, Tennessee, tax assessors sharing a training room are unable to discuss sensitive tax matters with clients over the phone out of fear of breaching privacy laws, according to one IRS manager who spoke to Reuters.\u003c/p\u003e\n\n\n\n\u003cp\u003eHundreds of thousands of U.S. federal government employees, many of whom have been working from home since the COVID-19 pandemic, were subjected to full-time RTO policies by President Donald Trump on January 20.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eBut many have arrived at workplaces unprepared for their return, according to 10 federal workers who spoke to Reuters.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-rto-policies\"\u003eRTO policies\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe federal employees work inside eight different government agencies across the U.S. who have returned to their office buildings, sometimes after years of working remotely. All spoke on the condition of anonymity out of fear of reprisal.\u003c/p\u003e\n\n\n\n\u003cp\u003eSome critics of the move – including governance experts, federal union representatives and civil servants – have said the lack of preparation is no accident.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eThey see it as a deliberate effort to make offices so unpleasant to work in that it will force more government employees to resign. Trump wants to slash and reshape the 2.3-million strong federal civilian workforce.\u003c/p\u003e\n\n\n\n\u003cp\u003eGovernance experts and labor unions say Trump’s return to office order is also emblematic of a wider problem with the way in which the Republican president and his top adviser, tech billionaire Elon Musk, are approaching the government overhaul.\u003c/p\u003e\n\n\n\n\u003cp\u003e“It’s the move fast and break things approach, without really thinking through the implications of a range of different choices you are making,” said Pam Herd, a professor of social policy at the University of Michigan. “So they tell everyone to return to work without considering the fact that they don’t have the space to accommodate everyone.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eTrump and Musk have insisted their goal is to make the U.S. government bureaucracy less costly for taxpayers and more efficient, and to eliminate waste and fraud.\u003c/p\u003e\n\n\n\n\u003cp\u003eA spokesperson for the Office of Personnel Management, the government’s human resources department, said the goal of Trump’s return-to-office order is for federal employees to work efficiently to best serve the American people.\u003c/p\u003e\n\n\n\n\u003cp\u003e“We are prioritizing in-person work to strengthen collaboration, accountability, and service delivery across the federal workforce,” an OPM spokesperson said.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eA White House official said in response to Reuters questions that facilities staff at the General Services Administration, which manages federal real estate, “work tirelessly to address reported issues to a satisfactory outcome.”\u003c/p\u003e\n\n\n\n\u003cp\u003eA spokesperson for Musk’s Department of Government Efficiency did not respond to a request for comment.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-fights-for-chairs-and-desks\"\u003eFights for chairs and desks\u003c/h2\u003e\n\n\n\n\u003cp\u003eWhile most of the workers are returning to workplaces they left at the start of the 2020 pandemic, many others are teleworkers who had been working full-time from home or had a hybrid schedule that meant they worked only part of the time in an office.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eFederal employees described fights for desks and chairs, internet outages, a lack of parking spaces, with some sitting on floors and others told to use their personal smartphone hotspots to gain computer access to government data.\u003c/p\u003e\n\n\n\n\u003cp\u003eReuters also viewed three back-to-work memos sent to staff, informing some of them that they won’t have a workspace or internet access when they return. The U.S. Food and Drug Administration told staff this week it cannot guarantee desks or parking spots for the roughly 18,000 employees expected to report to offices on Monday.\u003c/p\u003e\n\n\n\n\u003cp\u003eA manager at the IRS’ Washington headquarters told colleagues on a conference call on Tuesday she was sitting on a floor with her computer on her lap because she didn’t have a desk, according to an IRS manager who was on the call.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eAn IRS human resources official in California was told to work in a supply closet, according to one person familiar with the arrangement.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe IRS did not immediately respond to requests for comment.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-chaos\"\u003eChaos\u003c/h2\u003e\n\n\n\n\u003cp\u003eTo date more than 100,000 workers have left the federal government after being fired or taking a buyout, according to Trump administration figures and a Reuters tally of those fired. More large-scale cuts are under way.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eSome labor unions say the chaotic execution of the return-to-work order is a deliberate ploy to force more federal workers to leave government by making workplaces stressful.\u003c/p\u003e\n\n\n\n\u003cp\u003e“Bringing people back to work was nothing but a ploy to cause more confusion and get people to quit,” said Steve Lenkart, executive director of the National Federation of Federal Employees, which represents 110,000 government workers.\u003c/p\u003e\n\n\n\n\u003cp\u003eMusk and DOGE have a mandate to make the federal bureaucracy more efficient, but all the workers who spoke to Reuters said the return to office order is currently having the opposite effect.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003e“It’s complete chaos at NASA headquarters,” said Matt Biggs, president of the International Federation of Professional \u0026amp; Technical Engineers, a union that represents 8,000 federal NASA workers. “If you don’t have a desk or a computer you cannot do your job. People are much more unproductive.”\u003c/p\u003e\n\n\n\n\u003cp\u003eBiggs and a staff member at NASA headquarters said when employees returned to the building last month there were cockroaches on floors and bugs that came out of faucets.\u003c/p\u003e\n\n\n\n\u003cp\u003eCheryl Warner, a NASA spokesperson, said in the past 30 days about 1,000 people have been entering NASA headquarters each day.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eShe said the building, built in 1992, was lightly used during hybrid work, but it has been maintained. She said the building’s helpdesk had received only five requests regarding facilities issues since the full-scale return to work order.\u003c/p\u003e\n\n\n\n\u003cp\u003e“Our team took immediate action to address those concerns, including talking to our regularly scheduled exterminator,” Warner said.\u003c/p\u003e\n\n\n\n\u003cp\u003eBiggs and another NASA staff member said the noise and crush inside NASA’s Goddard Space Flight Center in Maryland has led some people to take meetings by phone inside their cars, using their personal hotspot to get internet access.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eSome NASA workers ordered back to Goddard live up to 50 miles away, and are so worried about the commute time and traffic they are turning up before dawn and sleeping in their vehicles before it’s time to start work, Biggs and the staff member said.\u003c/p\u003e\n\n\n\n\u003cp\u003eNASA spokesperson Warner said there have been no reports of people working from their vehicles. Regarding seating, she said, “we have more than enough space to accommodate our HQ workforce.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThe White House said shortly after Trump’s January inauguration that only 6 percent of federal employees work in person, but government data shows that remote work is more limited.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eAbout 46 percent of federal workers, or 1.1 million people, were eligible for remote work, and about 228,000 of them had been fully remote, meaning working from home either all or part of the time, according to a report issued by the Office of Management and Budget in August.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-enough-room\"\u003eEnough room\u003c/h2\u003e\n\n\n\n\u003cp\u003eSome government agencies downsized their office space to reduce costs after the COVID-19 pandemic work from home order, adding to the space crunch.\u003c/p\u003e\n\n\n\n\u003cp\u003eShortly before former Democratic President Joe Biden left office, the Office of Justice Programs in Washington, the Justice Department’s largest grant-making division, moved from a building with eight floors and an entire parking garage in Chinatown to another building nearby with four floors and only one level of parking.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eThe new facility has 157 parking spaces to accommodate 400 employees with parking passes, and a lack of workspaces, spurring some to arrive well before dawn. The return to office mandate is inducing anxiety and making it difficult for staff to focus on their jobs, according to a person familiar with the matter.\u003c/p\u003e\n\n\n\n\u003cp\u003eA Department of Justice spokesman said Trump and his attorney general, Pam Bondi, “expect federal workers paid for by hardworking taxpayers to show up in the office like millions of other Americans.”\u003c/p\u003e\n\n\n\n\u003cp\u003eWashington’s Democratic mayor, Muriel Bowser, supports Trump’s return-to-office order as a way to revitalize the city economy. She met with Trump in December after his election victory and believes a lack of federal workers in D.C. has been shrinking the city’s tax revenue.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eBut the pain of the return-to-office order is being felt among federal workers across the country. Immigration staff at the U.S. Citizenship and Immigration Services regional office in Chicago were temporarily forced to work on boxes in a storage room that served as a temporary office, one staffer said.\u003c/p\u003e\n\n\n\n\u003cp\u003e“Employees whose salaries are paid for by American taxpayers should show up to work,” DHS spokesperson Tricia McLaughlin said in an email. “This isn’t complicated and isn’t controversial.”\u003c/p\u003e\n\n\n\n\u003cp\u003eA USCIS spokesperson said, “With more employees in the office, of course the offices are more crowded. This is normal. All employees have adequate space to work and serve the American people.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003eThat is not the experience of one employee at the Department of Agriculture’s headquarters building in Washington.\u003c/p\u003e\n\n\n\n\u003cp\u003eStaff are fighting for office space each day while facilities workers haul furniture around to create temporary workstations. Workers returned to bathrooms with no paper towels. “It’s a zoo,” the employee said.\u003c/p\u003e\n\n\n\n\u003cp\u003eA USDA spokesperson said the agency has “sufficient space” for all workers, including those who used to work remotely.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e(Reporting by Tim Reid, Ted Hesson, Sarah N. Lynch and Leah Douglas, editing by Ross Colvin and Michael Learmonth)\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003c/div\u003e\u003cp\u003e\u003ci\u003eThe preferred-rate application deadline for the 2025 \u003ca href=\"https://www.inc.com/inc5000/apply\"\u003eInc. 5000\u003c/a\u003e is this Friday, March 21, at 11:59 p.m. PT. \u003ca href=\"https://www.inc.com/inc5000/apply\"\u003eApply Today\u003c/a\u003e. \u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2025-03-17T00:12:53Z",
  "modifiedTime": "2025-03-17T00:12:54Z"
}
