{
  "id": "d10ff6f6-ee0e-4a0a-97b4-776d234851ce",
  "title": "Baidu CEO: AI 'bubble' will burst 99 percent of players",
  "link": "https://www.theregister.com/2024/10/20/asia_tech_news_roundup/",
  "description": "Article URL: https://www.theregister.com/2024/10/20/asia_tech_news_roundup/ Comments URL: https://news.ycombinator.com/item?id=41909481 Points: 12 # Comments: 2",
  "author": "teleforce",
  "published": "Mon, 21 Oct 2024 23:05:40 +0000",
  "source": "https://hnrss.org/frontpage",
  "categories": null,
  "byline": "Laura Dobberstein",
  "length": 7245,
  "excerpt": "Plus: Australian bank glitch empties accounts; China online slang crackdown; Toshiba teams with Airbus; and more",
  "siteName": "The Register",
  "favicon": "https://www.theregister.com/design_picker/13249a2e80709c7ff2e57dd3d49801cd534f2094/graphics/favicons/apple-touch-icon.png",
  "text": "Asia In Brief Baidu CEO Robin Li has proclaimed that hallucinations produced by large language models are no longer a problem, and predicted a massive wipeout of AI startups when the \"bubble\" bursts. \"The most significant change we're seeing over the past 18 to 20 months is the accuracy of those answers from the large language models,\" gushed the CEO at last week's Harvard Business Review Future of Business Conference. \"I think over the past 18 months, that problem has pretty much been solved – meaning when you talk to a chatbot, a frontier model-based chatbot, you can basically trust the answer,\" he added. Li also described the AI sector as in an \"inevitable bubble,\" similar to the dot-com bubble in the '90s. \"Probably one percent of the companies will stand out and become huge and will create a lot of value or will create tremendous value for the people, for the society. And I think we are just going through this kind of process,\" stated Li. The CEO also guesstimated it will be another 10 to 30 years before human jobs are displaced by the technology. \"Companies, organizations, governments and ordinary people all need to prepare for that kind of paradigm shift,\" he warned. Australian bank glitch empties accounts Australia's Commonwealth Bank experienced intermittent outages over the weekend while attempting to address an issue that saw it duplicate transactions – and empty some customers' accounts. The bank told customers a glitch saw it repeat up to several days' worth of debits – a mess that saw some customers' balances plunge into the red. As those impacted tried to understand the situation, the bank's app became unavailable. Service has since been restored, duplicate debits deleted, and customers have been told any fees incurred by those whose balances became negative will be waived. The bank has not explained the nature of the problem, but has done the \"We apologize and promise to do better\" thing. DJI sues after \"misunderstanding\" at US border Chinese drone maker DJI has told The Register the reason some of its products didn't make it into the US was a glitch rather than policy, a day before it filed a lawsuit against the Department of Defense for including it on its blacklist. \"A customs-related misunderstanding is currently affecting DJI's ability to import select drones into the United States. This action appears to be part of a broader initiative by the Department of Homeland Security to scrutinize the origins of products, particularly in the case of Chinese-made drones,\" a spokesperson told The Register. The Reg was told that DJI is proactively engaging with US Customs and Border Protection, verifying compliance through documentation and confirming that its supply chain and manufacturing process adhere to regulations. \"We are confident that this issue will be swiftly resolved if CBP assesses it on its merits,\" said the spokesperson. A blog post further alleged that US Customs and Border Protection (CBP) has incorrectly cited the Uyghur Forced Labor Prevention Act (UFLPA) as the reason for the current holdups. But according to John Moolenar, chairman of The Select Committee on the Chinese Communist Party, this is not true. \"For years CCP drone manufacturer DJI has been rightfully blacklisted by the US government for actively aiding the CCP in carrying out surveillance for their genocidal crimes against Uyghurs in Xinjiang. Now we have discovered that DJI is not only aiding this genocide but also forcing Uyghur slave labor in Xinjiang to manufacture the very drones used to surveil the human rights abuses against them in direct violation of the Uyghur Forced Labor Prevention Act,\" stated Moolenar. An act called the Countering CCP Drones Act is currently under consideration by Congress. If passed it would prohibit the Federal Communications Commission (FCC) from approving or reviewing authorizations for new drones and software from Chinese manufacturers like DJI. On Friday, DJI dropped a lawsuit on the US Defense Department, challenging its inclusion on a list of entities allegedly linked to the Chinese military. DJI claims the listing has caused severe financial harm, damaged its reputation, and led to the loss of business contracts. Tesla FSD faces yet another probe after fatal low-visibility crash Richard Branson to take balloon ride to edge of space AWS boss: Don't want to come back to the office? Go work somewhere else X to allow third parties to train their AI models with social media users' data Tech giants set to pay through the nose for nuclear power that's still years away Fujitsu Japan leads disinformation detection effort Fujitsu Japan last week revealed it will work with a group of \"leading Japanese organizations,\" both private and public, to develop a platform the counters disinformation. Among those organizations are NEC Corporation, universities and research institutes. The Japanese tech sumo detailed it was selected as a primary operator for this initiative in July 2024. The platform is intended to detect, analyze, and assess false information and should be completed by the end of fiscal year 2025. China takes offense to Gen Z slang Beijing has announced a further crackdown on the use of slang online. The Cyberspace Administration of China (CAC) recently described the effort – which is part of its \"Clear and Bright\" campaign – as to \"rectify the chaos of the irregular use of Chinese and other characters on the internet and to create an online environment and education ecology conducive to the healthy growth of minors.\" Common words that could sound like or reference criticism of the Chinese Communist Party (CCP) are a target for the campaign. The terms \"lie flat\" and \"leek,\" which denote opting out of China's \"996\" culture of long working hours with little perceived reward, are currently considered a veiled criticism of the Party and therefore the sort of thing of which the CAC wants to see less online. Among the directives issued are that all local internet information and education departments work cohesively, focusing on \"minors and other special groups,\" while \"concentrating on cleaning up information related to non-standard and uncivilized online language and writing.\" APAC Dealbook Recent alliances and deals spotted by The Register across the region last week include: South Korea's Hyosung Corp. pledged to double its investment in Vietnam by spending $4 billion to expand into high-tech sectors such as datacenters, carbon fiber manufacturing, and sustainable aviation fuel – positioning itself as both a South Korean and Vietnamese enterprise, while fostering partnerships with Middle Eastern investors. Airbus and Toshiba have agreed to partner on superconductivity research for future hydrogen-powered aircraft. A number of deals from telcos were announced last week, including: Motorola Solutions will maintain and support critical radio communications across Singapore's public transport operator; South Korean mobile carrier KT Corp will build a domestic 5G network in partnership with Samsung Electronics; Sweden's Ericsson reportedly received a multi-billion dollar contract with India's Bharti Airtel for 5G equipment. ®",
  "image": "https://regmedia.co.uk/2023/03/21/shutterstock_editorial_only_baidu.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"body\"\u003e\n\u003cp\u003e\u003cspan\u003eAsia In Brief\u003c/span\u003e Baidu CEO Robin Li has proclaimed that hallucinations produced by large language models are no longer a problem, and predicted a massive wipeout of AI startups when the \u0026#34;bubble\u0026#34; bursts.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The most significant change we\u0026#39;re seeing over the past 18 to 20 months is the accuracy of those answers from the large language models,\u0026#34; gushed the CEO at last week\u0026#39;s Harvard Business Review Future of Business Conference. \u0026#34;I think over the past 18 months, that problem has pretty much been solved – meaning when you talk to a chatbot, a frontier model-based chatbot, you can basically trust the answer,\u0026#34; he added.\u003c/p\u003e\n\u003cp\u003eLi also described the AI sector as in an \u0026#34;inevitable bubble,\u0026#34; similar to the dot-com bubble in the \u0026#39;90s.\u003c/p\u003e\n\n    \n\n\u003cp\u003e\u0026#34;Probably one percent of the companies will stand out and become huge and will create a lot of value or will create tremendous value for the people, for the society. And I think we are just going through this kind of process,\u0026#34; stated Li.\u003c/p\u003e\n\n        \n\n\n        \n\n\u003cp\u003eThe CEO also guesstimated it will be another 10 to 30 years before human jobs are displaced by the technology.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Companies, organizations, governments and ordinary people all need to prepare for that kind of paradigm shift,\u0026#34; he warned.\u003c/p\u003e\n\u003ch3\u003eAustralian bank glitch empties accounts\u003c/h3\u003e\n\u003cp\u003eAustralia\u0026#39;s Commonwealth Bank experienced intermittent outages over the weekend while attempting to address an issue that saw it duplicate transactions – and empty some customers\u0026#39; accounts.\u003c/p\u003e\n\u003cp\u003eThe bank told customers a glitch saw it repeat up to several days\u0026#39; worth of debits – a mess that saw some customers\u0026#39; balances plunge into the red.\u003c/p\u003e\n\n        \n\n\u003cp\u003eAs those impacted tried to understand the situation, the bank\u0026#39;s app became unavailable.\u003c/p\u003e\n\u003cp\u003eService has since been restored, duplicate debits deleted, and customers have been told any fees incurred by those whose balances became negative will be waived. The bank has not explained the nature of the problem, but has done the \u0026#34;We apologize and promise to do better\u0026#34; thing.\u003c/p\u003e\n\u003ch3\u003eDJI sues after \u0026#34;misunderstanding\u0026#34; at US border\u003c/h3\u003e\n\u003cp\u003eChinese drone maker DJI has told \u003ci\u003eThe Register\u003c/i\u003e the reason some of its products didn\u0026#39;t make it into the US was a glitch rather than policy, a day before it filed a lawsuit against the Department of Defense for including it on its blacklist.\u003c/p\u003e\n\u003cp\u003e\u0026#34;A customs-related misunderstanding is currently affecting DJI\u0026#39;s ability to import select drones into the United States. This action appears to be part of a broader initiative by the Department of Homeland Security to scrutinize the origins of products, particularly in the case of Chinese-made drones,\u0026#34; a spokesperson told \u003ci\u003eThe Register\u003c/i\u003e.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eThe Reg\u003c/i\u003e was told that DJI is proactively engaging with US Customs and Border Protection, verifying compliance through documentation and confirming that its supply chain and manufacturing process adhere to regulations.\u003c/p\u003e\n\n        \n\n\u003cp\u003e\u0026#34;We are confident that this issue will be swiftly resolved if CBP assesses it on its merits,\u0026#34; said the spokesperson.\u003c/p\u003e\n\u003cp\u003eA \u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://viewpoints.dji.com/blog/navigating-u.s.-customs-demonstrating-djis-commitment-to-ethical-production-labor-practices\"\u003eblog post\u003c/a\u003e further alleged that US Customs and Border Protection (CBP) has incorrectly cited the Uyghur Forced Labor Prevention Act (UFLPA) as the reason for the current holdups.\u003c/p\u003e\n\u003cp\u003eBut according to John Moolenar, chairman of The Select Committee on the Chinese Communist Party, this is not true.\u003c/p\u003e\n\u003cp\u003e\u0026#34;For years CCP drone manufacturer DJI has been rightfully blacklisted by the US government for actively aiding the CCP in carrying out surveillance for their genocidal crimes against Uyghurs in Xinjiang. Now we have discovered that DJI is not only aiding this genocide but also forcing Uyghur slave labor in Xinjiang to manufacture the very drones used to surveil the human rights abuses against them in direct violation of the Uyghur Forced Labor Prevention Act,\u0026#34; stated Moolenar.\u003c/p\u003e\n\u003cp\u003eAn act called the Countering CCP Drones Act is currently under consideration by Congress. If passed it would prohibit the Federal Communications Commission (FCC) from approving or reviewing authorizations for new drones and software from Chinese manufacturers like DJI.\u003c/p\u003e\n\u003cp\u003eOn Friday, DJI \u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://www.reuters.com/legal/chinese-dronemaker-dji-sues-pentagon-over-chinese-military-listing-2024-10-19/\"\u003edropped a lawsuit on\u003c/a\u003e the US Defense Department, challenging its inclusion on a list of entities allegedly linked to the Chinese military. DJI claims the listing has caused severe financial harm, damaged its reputation, and led to the loss of business contracts.\u003c/p\u003e\n\u003cul\u003e\n\n\u003cli\u003e\u003ca href=\"https://www.theregister.com/2024/10/18/tesla_fsd_lowvisibility_accident/\"\u003eTesla FSD faces yet another probe after fatal low-visibility crash\u003c/a\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003ca href=\"https://www.theregister.com/2024/10/18/branson_space_perspective_balloon/\"\u003eRichard Branson to take balloon ride to edge of space\u003c/a\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003ca href=\"https://www.theregister.com/2024/10/18/aws_rto/\"\u003eAWS boss: Don\u0026#39;t want to come back to the office? Go work somewhere else\u003c/a\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003ca href=\"https://www.theregister.com/2024/10/18/x_train_data/\"\u003eX to allow third parties to train their AI models with social media users\u0026#39; data\u003c/a\u003e\u003c/li\u003e\n\n\u003cli\u003e\u003ca href=\"https://www.theregister.com/2024/10/18/big_tech_nuclear_power/\"\u003eTech giants set to pay through the nose for nuclear power that\u0026#39;s still years away\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eFujitsu Japan leads disinformation detection effort\u003c/h3\u003e\n\u003cp\u003eFujitsu Japan last week revealed it will work with a group of \u0026#34;leading Japanese organizations,\u0026#34; both private and public, to develop a platform the counters disinformation.\u003c/p\u003e\n\u003cp\u003eAmong those organizations are NEC Corporation, universities and research institutes.\u003c/p\u003e\n\u003cp\u003eThe Japanese tech sumo \u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://www.fujitsu.com/global/about/resources/news/press-releases/2024/1016-01.html\"\u003edetailed\u003c/a\u003e it was selected as a primary operator for this initiative in July 2024.\u003c/p\u003e\n\u003cp\u003eThe platform is intended to detect, analyze, and assess false information and should be completed by the end of fiscal year 2025.\u003c/p\u003e\n\u003ch3\u003eChina takes offense to Gen Z slang\u003c/h3\u003e\n\u003cp\u003eBeijing has announced a further crackdown on the use of slang online.\u003c/p\u003e\n\u003cp\u003eThe Cyberspace Administration of China (CAC) recently \u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://www.cac.gov.cn/2024-10/11/c_1730337883698872.htm\"\u003edescribed\u003c/a\u003e the effort – which is part of its \u0026#34;Clear and Bright\u0026#34; campaign – as to \u0026#34;rectify the chaos of the irregular use of Chinese and other characters on the internet and to create an online environment and education ecology conducive to the healthy growth of minors.\u0026#34;\u003c/p\u003e\n\u003cp\u003eCommon words that could sound like or reference criticism of the Chinese Communist Party (CCP) are a target for the campaign.\u003c/p\u003e\n\u003cp\u003eThe terms \u0026#34;lie flat\u0026#34; and \u0026#34;leek,\u0026#34; which denote opting out of China\u0026#39;s \u0026#34;996\u0026#34; culture of long working hours with little perceived reward, are currently considered a veiled criticism of the Party and therefore the sort of thing of which the CAC wants to see less online.\u003c/p\u003e\n\u003cp\u003eAmong the directives issued are that all local internet information and education departments work cohesively, focusing on \u0026#34;minors and other special groups,\u0026#34; while \u0026#34;concentrating on cleaning up information related to non-standard and uncivilized online language and writing.\u0026#34;\u003c/p\u003e\n\u003ch3\u003eAPAC Dealbook\u003c/h3\u003e\n\u003cp\u003eRecent alliances and deals spotted by \u003ci\u003eThe Register\u003c/i\u003e across the region last week include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSouth Korea\u0026#39;s Hyosung Corp. \u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://e.vnexpress.net/news/business/companies/south-korea-s-hyosung-to-invest-4b-more-in-vietnam-4804287.html\"\u003epledged\u003c/a\u003e to double its investment in Vietnam by spending $4 billion to expand into high-tech sectors such as datacenters, carbon fiber manufacturing, and sustainable aviation fuel – positioning itself as both a South Korean and Vietnamese enterprise, while fostering partnerships with Middle Eastern investors.\u003c/li\u003e\n\n\u003cli\u003eAirbus and Toshiba have \u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://www.global.toshiba/ww/news/energy/2024/10/news-20241016-02.html\"\u003eagreed\u003c/a\u003e to partner on superconductivity research for future hydrogen-powered aircraft.\u003c/li\u003e\n\n\u003cli\u003eA number of deals from telcos were announced last week, including:\u003c/li\u003e\n\n\u003cli\u003eMotorola Solutions will maintain and support critical radio communications across Singapore\u0026#39;s public transport operator;\u003c/li\u003e\n\n\u003cli\u003eSouth Korean mobile carrier KT Corp will \u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://en.yna.co.kr/view/AEN20241015005400320?section=k-biz/index\u0026amp;input=rss\"\u003ebuild\u003c/a\u003e a domestic 5G network in partnership with Samsung Electronics;\u003c/li\u003e\n\n\u003cli\u003eSweden\u0026#39;s Ericsson \u003ca target=\"_blank\" rel=\"nofollow\" href=\"https://www.reuters.com/business/media-telecom/ericsson-gets-new-5g-contract-indias-bharti-airtel-sources-2024-10-14/\"\u003ereportedly\u003c/a\u003e received a multi-billion dollar contract with India\u0026#39;s Bharti Airtel for 5G equipment.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e®\u003c/p\u003e                                \n\n\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-10-20T23:45:06Z",
  "modifiedTime": null
}
