{
  "id": "f50b484f-a838-419a-9f42-77ccdc1647b5",
  "title": "HP Is Laying Off Up to 2,000 Employees 'All Over the Company'",
  "link": "https://www.entrepreneur.com/business-news/hp-is-laying-off-up-to-2000-employees-by-october/487780",
  "description": "HP is aiming to save $300 million through job cuts by October.",
  "author": "Sherin Shibu",
  "published": "Fri, 28 Feb 2025 22:04:22 GMT",
  "source": "http://feeds.feedburner.com/entrepreneur/latest",
  "categories": [
    "false"
  ],
  "byline": "Sherin Shibu",
  "length": 1914,
  "excerpt": "HP is expected to conduct layoffs impacting 1,000 to 2,000 employees across the company by the end of its fiscal year 2025 in October.",
  "siteName": "Entrepreneur",
  "favicon": "",
  "text": "HP is laying off up to 2,000 people of its 58,000-person global workforce. The computer and printer giant disclosed the news in an SEC filing on Thursday.\"HP expects incremental gross workforce reductions of approximately 1,000 to 2,000 employees,\" the filing reads. \"The changes to the workforce will vary by country, based on local legal requirements and consultations with employee works councils and other employee representatives, as appropriate.\"The layoffs are expected to occur before the close of HP's fiscal year 2025, which ends in October. The cuts could help HP save up to $300 million, per the filing. HP has not specified the departments set to be affected by the cuts or the roles that will be impacted. CEO Enrique Lores told Bloomberg on Friday that the latest round of layoffs will occur \"all over the company\" and that HP has been \"very selective and very strategic\" about where to make cuts.Related: HP Wants You to 'Never Own A Printer Again,' Launches Rental Subscription\"It's not only cuts, we are also doing rebalancing,\" Lores said. \"At the same time, we're investing in other areas.\"Lores specified that HP's high-priority investment areas include AI and customer experience.HP CEO Enrique Lores. Photographer: Annabelle Chih/Bloomberg via Getty ImagesThe layoffs are part of HP's cost-cutting initiative \"Future Now,\" which the company introduced in November 2022, per The Wall Street Journal. The initiative originally aimed to lay off 7,000 employees. With the new round of cuts, the total number of laid-off workers could tick up to 9,000 employees, with overall savings reaching $1.9 billion.The layoff news arrived as HP posted its fiscal first quarter 2025 earnings on Thursday. Net revenue for the company was up 2.4% year-over-year, reaching $13.5 billion.Related: Humane's 'Ai Pin' Wanted to Be the Next Smartphone. Now the Company Is Being Sold to HP For Parts.",
  "image": "https://assets.entrepreneur.com/content/3x2/2000/1740778425-HP-GettyImages-2155222015.jpg?format=pjeg\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n      \u003cp\u003eHP is laying off up to 2,000 people of its \u003ca href=\"https://stockanalysis.com/stocks/hpq/employees/\" rel=\"follow\" target=\"_self\"\u003e58,000-person\u003c/a\u003e global workforce. The computer and printer giant disclosed the news in \u003ca href=\"https://d18rn0p25nwr6d.cloudfront.net/CIK-0000047217/cb995c46-25d4-4c73-b349-cc571a37431c.pdf\" rel=\"follow\" target=\"_self\"\u003ean SEC filing\u003c/a\u003e on Thursday.\u003c/p\u003e\u003cp\u003e\u0026#34;HP expects incremental gross workforce reductions of approximately 1,000 to 2,000 employees,\u0026#34; the filing reads. \u0026#34;The changes to the workforce will vary by country, based on local legal requirements and consultations with employee works councils and other employee representatives, as appropriate.\u0026#34;\u003c/p\u003e\u003cp\u003eThe layoffs are expected to occur before the close of HP\u0026#39;s fiscal year 2025, which ends in October. The cuts could help HP save up to $300 million, per the filing.\u003c/p\u003e\n  \n  \n  \n\n  \u003cp\u003eHP has not specified the departments set to be affected by the cuts or the roles that will be impacted. CEO Enrique Lores \u003ca href=\"https://www.bloomberg.com/news/videos/2025-02-28/hp-ceo-on-planned-job-cuts-manufacturing-plans-and-ai-video\" rel=\"follow\" target=\"_self\"\u003etold Bloomberg\u003c/a\u003e on Friday that the latest round of layoffs will occur \u0026#34;all over the company\u0026#34; and that HP has been \u0026#34;very selective and very strategic\u0026#34; about where to make cuts.\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated: \u003c/b\u003e\u003ca href=\"https://www.entrepreneur.com/business-news/hp-wants-you-to-never-own-a-printer-again-launches-rental/470541\" rel=\"follow\" target=\"_self\"\u003eHP Wants You to \u0026#39;Never Own A Printer Again,\u0026#39; Launches Rental Subscription\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s not only cuts, we are also doing rebalancing,\u0026#34; Lores said. \u0026#34;At the same time, we\u0026#39;re investing in other areas.\u0026#34;\u003c/p\u003e\u003cp\u003eLores specified that HP\u0026#39;s high-priority investment areas include AI and customer experience.\u003c/p\u003e\u003cp\u003e\u003cimg alt=\"\" loading=\"lazy\" role=\"presentation\" src=\"https://assets.entrepreneur.com/images/misc/1740778461_HP-GettyImages-2155222015.jpg?width=1000\" width=\"1000\" height=\"667\"/\u003e\u003csup\u003e\u003ci\u003eHP CEO Enrique Lores. Photographer: Annabelle Chih/Bloomberg via Getty Images\u003c/i\u003e\u003c/sup\u003e\u003c/p\u003e\u003cp\u003eThe layoffs are part of HP\u0026#39;s cost-cutting initiative \u0026#34;Future Now,\u0026#34; which the company introduced in November 2022, per\u003ca href=\"https://www.wsj.com/business/hp-to-trim-up-to-2-000-more-jobs-in-expanded-cost-cutting-push-1a4c298d\" rel=\"follow\" target=\"_self\"\u003e The Wall Street Journal\u003c/a\u003e.\u003c/p\u003e\n\n  \u003cp\u003eThe initiative originally aimed to lay off 7,000 employees. With the new round of cuts, the total number of laid-off workers could tick up to 9,000 employees, with overall savings reaching $1.9 billion.\u003c/p\u003e\u003cp\u003eThe layoff news arrived as HP posted its fiscal first quarter 2025 earnings on Thursday. Net revenue for the company was up 2.4% year-over-year, reaching\u003ca href=\"https://finance.yahoo.com/video/hp-releases-q1-earnings-beat-212902793.html\" rel=\"follow\" target=\"_self\"\u003e $13.5 billion\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cb\u003eRelated: \u003c/b\u003e\u003ca href=\"https://www.entrepreneur.com/business-news/humanes-ai-pin-aimed-to-replace-the-iphone-what-happened/478226\" rel=\"follow\" target=\"_self\"\u003eHumane\u0026#39;s \u0026#39;Ai Pin\u0026#39; Wanted to Be the Next Smartphone. Now the Company Is Being Sold to HP For Parts.\u003c/a\u003e\u003c/p\u003e\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-28T22:04:22Z",
  "modifiedTime": "2025-02-28T22:04:22Z"
}
