[
  {
    "id": "a2788c98-5fbe-4a4d-a48f-d5bee39e710d",
    "title": "rice straw bundles atop wooden A-frame craft jige-inspired chair by sukchulmok",
    "link": "https://www.designboom.com/design/rice-straw-bundles-wooden-frame-jige-inspired-chair-sukchulmok-mok-04-01-10-2025/",
    "description": "a modern cross-shaped design honors the practicality of the traditional jige carrying tool. The post rice straw bundles atop wooden A-frame craft jige-inspired chair by sukchulmok  appeared first on designboom | architecture \u0026 design magazine.",
    "author": "sukchulmok",
    "published": "Fri, 10 Jan 2025 22:01:04 +0000",
    "image": "",
    "source": "https://www.designboom.com/design/feed",
    "categories": [
      "design",
      "readers",
      "chair design",
      "korean design",
      "sukchulmok studio",
      "wood and timber architecture and design"
    ]
  },
  {
    "id": "3b6ad862-4964-4480-b5dd-90ad4f8e4cea",
    "title": "white oak angular chair by sukchulmok reinterprets korean jige carrying tool",
    "link": "https://www.designboom.com/design/white-oak-angular-chair-sukchulmok-korean-jige-carrying-tool-mok-03-01-09-2025/",
    "description": "a bundle of interwoven branches mirrors the jige’s load-carrying functionality. The post white oak angular chair by sukchulmok reinterprets korean jige carrying tool appeared first on designboom | architecture \u0026 design magazine.",
    "author": "sukchulmok",
    "published": "Thu, 09 Jan 2025 11:30:25 +0000",
    "image": "",
    "source": "https://www.designboom.com/design/feed",
    "categories": [
      "design",
      "readers",
      "chair design",
      "korean design",
      "sukchulmok studio",
      "wood and timber architecture and design"
    ]
  },
  {
    "id": "60b8665b-e0e5-4a7f-8de2-18765d4bc0a6",
    "title": "F5: Karim El-Ishmawi on Boston City Hall, Art Installations + More",
    "link": "https://design-milk.com/f5-karim-el-ishmawi-on-boston-city-hall-art-installations-more/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=f5-karim-el-ishmawi-on-boston-city-hall-art-installations-more",
    "description": "Karim El-Ishmawi, co-founder of Kinzo, shares his favorite installations at Salone del Mobile, a tea pavilion in Portugal, Boston City Hall, and more.",
    "author": "Anna Zappia",
    "published": "Fri, 10 Jan 2025 14:00:56 +0000",
    "image": "https://design-milk.com/images/2024/12/F5-Karim-El-Ishmawi-Kinzo-Works-0-PUBG-Krafton-810x540.jpg",
    "source": "https://design-milk.com/category/interior-design/feed/",
    "categories": [
      "Architecture",
      "Interior Design",
      "Main",
      "Friday Five",
      "Karim El-Ishmawi",
      "KINZO"
    ]
  },
  {
    "id": "65fc2dde-f827-4bdd-a2f4-51e77f8b9541",
    "title": "Case Study-Inspired Revival in the Heart of Los Angeles",
    "link": "https://design-milk.com/case-study-inspired-revival-in-the-heart-of-los-angeles/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=case-study-inspired-revival-in-the-heart-of-los-angeles",
    "description": "Jordan Bakva reimagines Park Lane, a mid-century Los Angeles residence, blending original features with contemporary materials.",
    "author": "Leo Lei",
    "published": "Thu, 09 Jan 2025 14:00:23 +0000",
    "image": "https://design-milk.com/images/2024/12/parklane-jordanbakva-2-810x540.jpg",
    "source": "https://design-milk.com/category/interior-design/feed/",
    "categories": [
      "Interior Design",
      "Main",
      "California",
      "Case Study Houses",
      "Ceppo marble",
      "house",
      "interior design",
      "Jordan Bakva",
      "Los Angeles",
      "micro-cement",
      "mid-century",
      "pocket doors",
      "residential",
      "terrazzo"
    ]
  },
  {
    "id": "210a1912-6512-42f7-a48f-a0019790bfa4",
    "title": "This Adorable Valentine's Day Find Will Instantly Cozy Up Any Room",
    "link": "https://www.apartmenttherapy.com/moma-rechargable-heart-light-bulb-37451294?utm_source=RSS\u0026utm_medium=feed\u0026utm_campaign=Category%2FChannel%3A+design",
    "description": "Add a little light to your life. READ MORE...",
    "author": "Nina Derwin",
    "published": "Sat, 11 Jan 2025 11:30:00 -0500",
    "image": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_660/at/house%20tours/2023-House-Tours/2023-May/rory-r/tours-los-angeles-rory-rockmore-1011",
    "source": "https://www.apartmenttherapy.com/design.rss",
    "categories": [
      "Design Ideas",
      "Decor \u0026 Accessories",
      "Edit Shopping",
      "Ideas \u0026 Inspiration",
      "lamps",
      "Shopping",
      "Valentine's Day"
    ]
  },
  {
    "id": "12604317-2e3a-4e34-bb45-518782c384f0",
    "title": "I Fell in Love With This Chic West Elm Lamp at My Friend’s House",
    "link": "https://www.apartmenttherapy.com/west-elm-remy-table-lamp-review-ll-37451671?utm_source=RSS\u0026utm_medium=feed\u0026utm_campaign=Category%2FChannel%3A+design",
    "description": "It's so unique. READ MORE...",
    "author": "Haley Lyndes",
    "published": "Fri, 10 Jan 2025 16:45:00 -0500",
    "image": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_660/at/house%20tours%20stock%20archive/3a1a4bfead21a324dd2cbe56c6588d598f79edfd",
    "source": "https://www.apartmenttherapy.com/design.rss",
    "categories": [
      "Design Ideas",
      "Decor \u0026 Accessories",
      "decor ideas",
      "lamps",
      "Shopping",
      "West Elm"
    ]
  },
  {
    "id": "ab20ff0e-88d5-4027-8cb1-b5f0edbad051",
    "title": "Core77 Weekly Roundup (1-6-25 to 1-10-25)",
    "link": "https://www.core77.com/posts/134884/Core77-Weekly-Roundup-1-6-25-to-1-10-25",
    "description": "Here's what we looked at this week:The Travel Heavy, an aluminum 12\" LP carrier for traveling DJs, is an upgrade from milk crates. Nifty tool: A tiny universal workholding device for watchmakers.Now available in the U.S.: This electric-assist screwdriver from Japan. An impressive exploration of material: This monomaterial bamboo projectile weapon.Forever object: This minimalist Mark Two pen, by Studio Neat, is a beautiful piece of industrial design.The cuckoo clock's unlikely origin story, plus a more modern interpretation of the design.Steller Floors produces a hardwood floor system where you can actually remove one piece at a time.Annabell, by industrial designer Elizabeth Salonen, is a pendant lamp inspired by Finland's natural light.Sony's Afeela 1 is a car that's not so much about driving.A small design touch by Yardsale improves the UX of ski poles.Not good: Robot vacuums are now growing arms.A desk for industrial designers who sketch? Basically a drafting table with a monitor mount.To tackle unusually narrow French vineyard rows, tractor manufacturer turned to Pininfarina for a solution.The g.stand, by ID firm grape lab, is a laptop stand made from a single sheet of recycled paper.This Nyala Chair, by industrial designer Jomo Tariku, warns of the extinction of the antelope that inspired its design.Design for how people actually behave: The Stupid Car Tray.Similar functions, different forms: Umbilical cord scissors vs. PEX cutters.Swippitt: A system that fully charges your phone in two seconds.ID firm SGW Designworks explains how to design military-grade products.",
    "author": "Rain Noe",
    "published": "",
    "image": "https://s3files.core77.com/blog/images/lead_n_spotlight/1619385_lead_400_134884_.jpg",
    "source": "http://feeds.feedburner.com/core77/blog",
    "categories": [
      "Object Culture|Object-Culture"
    ]
  },
  {
    "id": "40d1ab3e-d676-45a8-b030-2ebf4091e1e5",
    "title": "Industrial Design Firm on How to Design Military-Grade Products",
    "link": "https://www.core77.com/posts/134975/Industrial-Design-Firm-on-How-to-Design-Military-Grade-Products",
    "description": "In this age of EDC, objects claiming to be mil-spec are prized. But that label is easy to slap onto an object; what does it take to actually design a military-grade product? SGW Designworks, an Idaho-based industrial design and engineering consultancy with defense and military clients, knows first-hand. They've written the following helpful guide:---Understanding and Designing to Military Specifications: The Essential GuideIn today's world, there's an increasing requirement for products that can withstand extreme conditions. This need spans across various sectors, from consumer electronics to industrial equipment, emphasizing the importance of designing to military specifications, often referred to as mil-spec, MIL-STD, or military standard. But what does it mean to design a product to meet these rigorous standards, and why is it becoming increasingly relevant outside the military sector? The Essence of MIL-SPEC and MIL-STDOriginally established by the United States Military, military specifications, or MIL-SPEC, and military standards, MIL-STD, were designed to set a definitive level of performance, durability, and maintainability for military equipment. These standards ensure that military-grade products can reliably perform under a wide array of harsh environmental conditions.MIL-SPEC has become a synonymous term with ruggedness and reliability, qualities that are now sought after in consumer, commercial, and industrial products. Although initially exclusive to military equipment, the term \"military-grade\" has found its way into the marketing strategies of various products, from smartphones and laptops to vehicles and portable storage units.The most commonly referenced standard in relation to MIL-SPEC products is MIL-STD-810. This standard outlines the environmental engineering considerations and laboratory tests that equipment should undergo based on its operational environment. It covers a broad spectrum of environmental effects, including but not limited to, temperature variations, humidity, vibration, shock, and exposure to liquids or particulate matter.When and Why to Design to MIL-SPECThe surge in demand for rugged design in everyday products raises the question: should all product designers aim to meet military standards? The answer is nuanced. For products intended for military use or those developed under military contracts, adhering to MIL-SPEC is non-negotiable. However, for consumer goods, the application of MIL-STDs can vary based on the product's intended use and the level of ruggedness desired.Designing to MIL-SPEC, even for non-military products, offers several benefits. It sets a clear and quantifiable benchmark for product durability, which can significantly enhance product credibility and appeal in the eyes of consumers. Moreover, it allows manufacturers to tap into the growing market segment that values durability and reliability, potentially leading to increased brand loyalty.However, it's crucial to note that the term \"military-grade\" is often used more as a marketing claim than a strict certification. Without standardized oversight outside the Department of Defense, the burden of proof for MIL-SPEC compliance falls on manufacturers and vendors. This makes it vital for consumers to scrutinize the ruggedness claims of products labeled as MIL-SPEC. How to Design According to MIL-SPECDesigning a product to meet MIL-SPEC standards involves a meticulous process of defining product requirements and selecting applicable standards based on the intended use case. This process, known as \"tailoring,\" ensures that the product undergoes relevant tests to validate its compliance with MIL-STD-810 or other relevant standards.The design must consider various environmental factors, material and component selection, and rigorous testing protocols. For instance, components used in MIL-SPEC products often conform to specific sizes, finishes, and performance criteria to ensure they can withstand the conditions outlined in the MIL-STDs. This could mean selecting more expensive or specialized components to meet the desired specifications.Testing is a critical step in the MIL-SPEC design process. It involves subjecting the product or prototype to the conditions specified in the selected MIL-STDs to verify compliance. While some companies may conduct these tests in-house, independent third-party testing facilities are frequently used for their expertise and unbiased reporting. MIL-SPEC in Practice: Real-world ExamplesSeveral products have been successfully designed to meet MIL-SPEC standards, demonstrating the feasibility and benefits of such an approach. For instance, rugged container systems designed for military use have been adapted for consumer use, offering unparalleled durability and weather resistance. Similarly, electronic devices like rugged laptops and smartphones have been developed to meet specific MIL-STD-810G criteria, making them ideal for outdoor and industrial applications.d The Future of MIL-SPEC: Industrial IoT and BeyondThe integration of Industrial Internet of Things (IIoT) technology into heavy-duty industries presents new opportunities for MIL-SPEC design. As equipment becomes increasingly reliant on electronic sensors and data connectivity, the need for rugged, reliable components that can survive harsh environments becomes paramount. While not all IIoT devices may require full MIL-SPEC compliance, applying military standard environmental test methods can guide the design process to ensure optimal performance and durability.The growing IIoT market, projected to reach significant financial milestones in the coming years, underscores the expanding relevance of MIL-SPEC design principles in industrial and consumer products alike.ConclusionThe application of military specifications and standards in product design transcends traditional military equipment, offering valuable guidelines for creating durable, reliable products across various sectors. By understanding and leveraging MIL-SPEC and MIL-STD, manufacturers can meet the rising consumer demand for rugged products, differentiate their offerings, and build lasting brand loyalty. As technology continues to evolve and integrate into all aspects of life, the principles of MIL-SPEC design will remain a cornerstone for innovation and quality in product development.---You can read more SGW Designworks wisdom here.",
    "author": "Rain Noe",
    "published": "",
    "image": "https://s3files.core77.com/blog/images/lead_n_spotlight/1621770_lead_400_134975_.jpg",
    "source": "http://feeds.feedburner.com/core77/blog",
    "categories": [
      "Design Business|Design-Business"
    ]
  },
  {
    "id": "0271b3a7-6f05-4d93-afc5-88d481b75e48",
    "title": "New Course: Unlock Your Creative Potential with Mood Board Magic",
    "link": "https://www.decor8blog.com/blog/2024/10/1/new-course-unlock-your-creative-potential-with-mood-board-magic",
    "description": "I’m so excited to introduce you to Mood Board Magic, a course that could truly transform how you bring your creative ideas to life. If you've ever had that spark of a brilliant idea but felt stuck, unsure of how to communicate it or bring it into the world—this course is for you.",
    "author": "Holly Becker",
    "published": "Tue, 01 Oct 2024 07:23:00 +0000",
    "image": "https://images.squarespace-cdn.com/content/v1/58b56e5cd2b857960a275c83/1727767317354-JC8YDN19T89QCX5ROHXH/Screenshot+2024-09-24+at+21-51-05+Holly+Becker+%28%40decor8%29+%E2%80%A2+Instagram+photos+and+videos.png?format=1500w",
    "source": "https://www.decor8blog.com/blog?format=rss",
    "categories": null
  },
  {
    "id": "907e8e79-fa2c-4f79-b4ad-216b1f6a7527",
    "title": "Fashion Meets Interiors: Harlequin's New Collaboration with Henry Holland",
    "link": "https://www.decor8blog.com/blog/2024/8/20/fashion-meets-interior-design-harlequins-new-collaboration-with-henry-holland",
    "description": "I have long loved a good collaboration between brands and thankfully, we’ve seen a lot of them coming out of the UK/USA over the years yet it never gets old when the collabs are good.",
    "author": "Holly Becker",
    "published": "Tue, 20 Aug 2024 10:35:32 +0000",
    "image": "https://images.squarespace-cdn.com/content/v1/58b56e5cd2b857960a275c83/1724150229872-0TWI5BCISEMOXPDY2OOU/Screenshot+2024-08-20+at+12-22-35+Harlequin_3.png+%28WEBP+Image+700+%C3%97+955+pixels%29+%E2%80%94+Scaled+%2896%25%29.png?format=1500w",
    "source": "https://www.decor8blog.com/blog?format=rss",
    "categories": null
  },
  {
    "id": "3a3ce3f1-f3f9-41ff-a75c-3ac7faed152c",
    "title": "Impressive Images from the Oscar Winning Movie Dune",
    "link": "https://www.fubiz.net/2023/01/11/impressive-images-from-the-oscar-winning-movie-dunes/",
    "description": "Le film Dune de Denis Villeneuve a remporté six statuettes le 24 mars à 94e cérémonie des Oscars. Un franc succès pour ce film monumental avec Timothée Chalamet et Zendaya à l’affiche. Adaptation du roman fleuve de Franck Herbert de 1965, le film de science-fiction remporte les prix du Meilleur montage, Meilleure musique originale, Meilleur son, […]",
    "author": "Romain",
    "published": "Tue, 10 Jan 2023 23:43:49 +0000",
    "image": "/wp-content/uploads/2022/04/Main_Page-5-4-scaled.jpg",
    "source": "http://feeds.feedburner.com/fubiz",
    "categories": [
      "Cinéma",
      "Pop Culture"
    ]
  },
  {
    "id": "01d24be8-bb74-4a7e-a494-6fdd0189e57c",
    "title": "Beautiful Japanese Watercolours",
    "link": "https://www.fubiz.net/2023/01/10/beautiful-japanese-watercolours__trashed/",
    "description": "Sous les mains expertes de l’artiste serbe Endre Penovác, l’encre coule. Vivant son histoire naturellement, elle occupe l’espace sur le papier. Le peintre vient ensuite souligner quelques traits, dessiner des yeux, apporter une touche de couleur ou ajouter des détails qui viennent créer une texture. En ressortent des animaux sauvages et domestiques à l’allure quasi […]",
    "author": "Manon",
    "published": "Tue, 10 Jan 2023 17:13:21 +0000",
    "image": "/wp-content/uploads/2022/03/EP6.png",
    "source": "http://feeds.feedburner.com/fubiz",
    "categories": [
      "Graphic",
      "Painting",
      "Illustration",
      "painting"
    ]
  },
  {
    "id": "7fb4e441-16e5-49ac-8704-dee36054cb48",
    "title": "The low-slung furniture trend could be the most relaxing trend of 2025 - it’s also perfect for small spaces",
    "link": "https://www.idealhome.co.uk/all-rooms/all-rooms-decor/low-slung-furniture-trend",
    "description": "It's time to sit back and relax",
    "author": "",
    "published": "Sat, 11 Jan 2025 12:00:00 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/3yRkdSUWw8NymgXd548TWm.jpg",
    "source": "https://www.idealhome.co.uk/feed",
    "categories": [
      "All rooms decor",
      "All rooms"
    ]
  },
  {
    "id": "a091ca71-9de8-4d65-9b75-e92a6556888d",
    "title": "Stacey Dooley has found the best way to hide a TV in a living room – this is how she's done it",
    "link": "https://www.idealhome.co.uk/living-room/living-room-decor/stacey-dooley-hidden-tv",
    "description": "'It’s giving luxe Wallace and Gromit' – and we’re obsessed",
    "author": "",
    "published": "Sat, 11 Jan 2025 08:00:00 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/LGFN8R4neyFp4ZiD7iEVjE.jpg",
    "source": "https://www.idealhome.co.uk/feed",
    "categories": [
      "Living room decor",
      "Living room"
    ]
  },
  {
    "id": "bf5e818e-9b1f-4007-9b73-3ad89e101eed",
    "title": "Golden Hues \u0026 Modern Views: Shining Spotlight on the Amber Apartment",
    "link": "https://www.home-designing.com/golden-hues-modern-views-shining-spotlight-on-the-amber-apartment",
    "description": "Amber Apartment: Golden Hues, Smart Design, and Modern Elegance in a Studio Space",
    "author": "Anzah",
    "published": "Fri, 10 Jan 2025 12:30:36 +0000",
    "image": "https://www.home-designing.com/wp-content/uploads/2024/12/modern-white-bed-separated-with-curtain-1024x682.jpg",
    "source": "http://www.home-designing.com/feed",
    "categories": [
      "House Tours",
      "house tour"
    ]
  },
  {
    "id": "dfea5806-99c6-4650-ac8a-adc1445d2f8b",
    "title": "Ebony Harmony Dining Room: Board with Shopping List",
    "link": "https://www.home-designing.com/ebony-harmony-dining-room",
    "description": "Modern dining room design featuring a harmonious blend of black and cream tones, with contemporary furniture, abstract wall art, and botanical accents creating an elegant yet minimalist aesthetic",
    "author": "Hanna",
    "published": "Thu, 09 Jan 2025 12:30:00 +0000",
    "image": "https://www.home-designing.com/wp-content/uploads/2025/01/ebony-harmony-dining-room-1024x768.jpg",
    "source": "http://www.home-designing.com/feed",
    "categories": [
      "Product Board",
      "dining room",
      "minimalist"
    ]
  },
  {
    "id": "869a8262-0d9e-48d3-8bfd-926d07983823",
    "title": "My Kitchen Has A Spacious New Look!",
    "link": "https://inmyownstyle.com/my-kitchen-has-a-spacious-new-look.html",
    "description": "This post is from the blog, InMyOwnStyle.com Happy New Year! I hope you had a wonderful holiday and were able to take a break to enjoy some downtime. I took a couple of weeks off to decompress, enjoy family and friends, and find inspiration for all aspects of my life, but mostly ideas to share with you... If you enjoyed this post you may also enjoy the easy to follow DIY Decorating Tutorials and Creative Ideas on my blog, In My Own Style.com Republishing this article in full or in part is a violation of Copyright law @2009-2021, all rights reserved",
    "author": "Diane Henkler",
    "published": "Tue, 07 Jan 2025 18:48:57 +0000",
    "image": "https://inmyownstyle.com/wp-content/uploads/2025/01/Removing-popcorn-ceiling-from-a-room-225x300.jpg",
    "source": "https://inmyownstyle.com/feed",
    "categories": [
      "Drafts"
    ]
  },
  {
    "id": "c0732a9b-12a8-4c08-8343-5221b4e2bb32",
    "title": "Style Scouting: Vol. 223",
    "link": "https://inmyownstyle.com/style-scouting-vol-223.html",
    "description": "This post is from the blog, InMyOwnStyle.com Thanks for stopping by for this week’s Style Scouting. My Sunday post where I share the random stuff that captured my attention or inspired me that I found online. Hello December 22nd! How did you arrive so quickly. Are you ready for the holidays? I had plans to get a few more... If you enjoyed this post you may also enjoy the easy to follow DIY Decorating Tutorials and Creative Ideas on my blog, In My Own Style.com Republishing this article in full or in part is a violation of Copyright law @2009-2021, all rights reserved",
    "author": "Diane Henkler",
    "published": "Sun, 22 Dec 2024 10:00:00 +0000",
    "image": "https://inmyownstyle.com/wp-content/uploads/2023/12/Christmas-Santa-Dining-Table-Setting-9-200x300.jpg",
    "source": "https://inmyownstyle.com/feed",
    "categories": [
      "Style Scouting"
    ]
  },
  {
    "id": "4d547c07-3304-440b-967d-4703030dc0ac",
    "title": "The Malin co-working club in East Austin features light and dark workspaces",
    "link": "https://www.dezeen.com/2025/01/11/the-malin-east-austin-coworking-club/",
    "description": "Co-working brand The Malin has opened a location in Austin, Texas, offering bright open workspaces and cosy burgundy lounges for its members. The Malin's first location in the Lone Star State and its sixth nationally is situated in East Austin, inside a modernist-style new build by local architectural firm Chioco. As with the brand's other The post The Malin co-working club in East Austin features light and dark workspaces appeared first on Dezeen.",
    "author": "Dan Howarth",
    "published": "Sat, 11 Jan 2025 18:00:30 +0000",
    "image": "http://static.dezeen.com/uploads/2025/01/the-malin-east-austin_alpha-smoot_dezeen_sq2-411x411.jpg",
    "source": "https://www.dezeen.com/interiors/feed/",
    "categories": [
      "all",
      "Interiors",
      "USA",
      "Texas",
      "Austin",
      "Co-working",
      "offices",
      "The Malin"
    ]
  },
  {
    "id": "32b42458-f322-4964-80ed-f61b9ffe6f62",
    "title": "Seven listening bars that are easy on the eyes and ears",
    "link": "https://www.dezeen.com/2025/01/11/seven-listening-bars-lookbooks/",
    "description": "From a communist-era apartment block in Bucharest to a hot pink Australian bar created to emulate the inside of a jumbo speaker, our latest lookbook collects atmospheric listening bar interiors from around the world. Listening bars are having a moment. Native to Japan, these spaces first emerged during the late 1920s as intimate settings to The post Seven listening bars that are easy on the eyes and ears appeared first on Dezeen.",
    "author": "Jane Englefield",
    "published": "Sat, 11 Jan 2025 10:00:36 +0000",
    "image": "http://static.dezeen.com/uploads/2025/01/ebba-charlotte-taylor-listening-bar-411x411.jpg",
    "source": "https://www.dezeen.com/interiors/feed/",
    "categories": [
      "Restaurants and bars",
      "all",
      "Interiors",
      "Lookbooks",
      "Bars",
      "Roundups",
      "Listening bars"
    ]
  },
  {
    "id": "04d99ed1-fe0a-489f-9d17-5faafdc70304",
    "title": "My Biggest Makeovers of 2024! {And Plans for 2025.}",
    "link": "https://www.thriftydecorchick.com/2025/01/biggest-DIY-makeovers-2024-plans-for-2025.html",
    "description": "Top DIY projects and makeovers of 2024! I've gathered my biggest DIY makeovers completed in 2024 and what I hope to accomplish this year! This is always a fun post to write, as it makes me feel super accomplished after a VERY lazy Christmas break. :) I tackled a bunch of big projects last year and am super proud of what I created. 1. Linen closet redo Since it's the season of decluttering and organizing, let's start with the closet that was a huge pain in my butt for years: I finally got down to business and removed the shallow wire shelving and replaced them with deeper wood shelves: This post may contain affiliate links for your convenience.I may earn a small commission when you make a purchase through links. See my policies and disclosure page for more information.    SO much better! I added a pretty touch to the back wall with some leftover wallpaper. It's a sweet hint of color when you open the door. 2. Main bedroom makeoverThe dark gray paint color I painted our bedroom years ago was proving to be difficult to work with, so I had an idea to brighten things up: Read the full postThis content is property of Thrifty Decor Chick LLC. If you are reading this on any other site other than www.thriftydecorchick.com or one of the blog's social media platforms, please contact TDC immediately (thriftydecorchick at gmail dot com). Any other use of this content is strictly forbidden.",
    "author": "Thrifty Decor Chick",
    "published": "Wed, 08 Jan 2025 18:04:00 +0000",
    "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh6QtHATTsqmMU1JTGD2rPnCpPM-k7zAlN39KiA8CdA7rko4Z343lRsYGDMOIyJaRGwkLdH3AzRvv5hoULnqpEKb_I1qHKCZecifPCrO0HiI5lSs96Q-U8bidcPvFDoHgbVmg_jTp69m-zKw-4GOeALCtrwl0IHtpi5H5d7nsMxJN6tloRQk1LtD7LqXT8/s16000/linen%20closet%20%20redo%20with%20shelves.jpg",
    "source": "http://feeds.feedburner.com/blogspot/ZBcZ",
    "categories": [
      "before and after",
      "DIY"
    ]
  },
  {
    "id": "ff86dc03-18f6-4690-9b8b-393a23a066b4",
    "title": "Brilliant Tips and Hacks for Christmas Decor Storage",
    "link": "https://www.thriftydecorchick.com/2021/01/great-tips-for-holiday-storage-that.html",
    "description": "Christmas decor storage ideas and hacks that will make next year's decorating easier!I've figured out some great holiday storage solutions over the years that have helped to keep our Christmas decor better organized. These methods have made pulling out decor for the next Christmas much more efficient. These little tips save my sanity each November when the holiday decor comes out and when I put them away for the year. In general I find packing holiday decor away is faster and easier than setting it up! Am I the only one? I quite like the process, it feels cathartic to clean up the house and simplify everything for the new year. Here are my Christmas decor organization methods and a few tips I've figured out along the way!  1. Label your decor for next year My first tip is to label as much as you can -- especially the stuff you put up in the same spot every year. I've found over the years that labeling light strands I use for specific areas helps a TON!:  This post may contain affiliate links for your convenience.I may earn a small commission when you make a purchase through links. See my policies and disclosure page for more information.  You can find my awesome label maker here! This smaller version works great too -- it's just a little more basic. Both are super easy to use.  I label any spot that uses more than one strand of lights -- both inside and outside. So when I get them out I know exactly how many bushes or trees are covered by that group of lights. I also label them inside, like the strands on our stair garland. That way I'm not trying to figure out how many I used the year before.  I use a LOT of these remote plugs and switches for our indoor lights. (That one is my favorite because I can use one remote for five items.) I store them away with the items that need a remote, like for the garland on our stairs. I just keep them plugged into the light strand.  I also keep any needed extension cords attached and stored away with the lights. If you have more than one set of these remotes, you know the joy of trying to figure out which one goes with which remote. ;) I label the matching sets so we know what goes with what: Read the full postThis content is property of Thrifty Decor Chick LLC. If you are reading this on any other site other than www.thriftydecorchick.com or one of the blog's social media platforms, please contact TDC immediately (thriftydecorchick at gmail dot com). Any other use of this content is strictly forbidden.",
    "author": "Thrifty Decor Chick",
    "published": "Tue, 31 Dec 2024 17:00:00 +0000",
    "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh_CIaFwhQKmbYWEUHjI8LEFpOFbJOFad86M__VAUK4HuCf4tcmlaw7dgO-0z1P8JlF-h4GoFfMUS249Ps-O1TH4Yp3R3KZpH-ABvvfsA4phyphenhyphengkNQ_fFcMxvefcoqWDBlNUSWMiG72foaI/w480-h640/label+maker+organization.jpgimgmax=1600",
    "source": "http://feeds.feedburner.com/blogspot/ZBcZ",
    "categories": [
      "Christmas",
      "garage",
      "organization"
    ]
  },
  {
    "id": "eb7bb781-0790-489d-9b7d-fdb085ddf47c",
    "title": "A Phrase to Inspire You and Your Home in the New Year",
    "link": "https://theinspiredroom.net/a-phrase-to-inspire-you-and-your-home-in-the-new-year/",
    "description": "Do you ever choose a word (or words) of the year to inspire you? This year I decided a word isn’t enough, I need an entire phrase. “A place for everything and everything in its place” is a very motivating and inspiring phrase for me right now! It’s not just motivating me to simplify or [...]",
    "author": "",
    "published": "Tue, 07 Jan 2025 03:12:44 +0000",
    "image": "https://theinspiredroom.net/wp-content/uploads/2025/01/cottage-bedroom-rattan-mirr-r-scalloped-inspired-room-450x600.jpg",
    "source": "https://theinspiredroom.net/feed/",
    "categories": [
      "Decorating Inspiration",
      "clean + simple",
      "HomeBody Gathering Place",
      "My New House",
      "Organization"
    ]
  },
  {
    "id": "98a74d43-232b-4ebf-a906-f7b76c20a7a0",
    "title": "Top 21 Favorite Decor in 2024",
    "link": "https://theinspiredroom.net/top-21-favorite-decor-in-2024/",
    "description": "Happy New Year, friends! As we kick off a fresh new year (can't believe it's 2025!), I thought it would be fun to take a look back at The Inspired Room readers’ favorite decor items from the 2024.",
    "author": "",
    "published": "Mon, 06 Jan 2025 18:35:05 +0000",
    "image": "https://theinspiredroom.net/wp-content/uploads/2025/01/2024-best-selling-decor-the-inspired-room-blog-338x600.jpg",
    "source": "https://theinspiredroom.net/feed/",
    "categories": [
      "Decorating Inspiration",
      "Mood Boards",
      "My New House"
    ]
  },
  {
    "id": "3f8683fa-de79-4513-8418-e45c8dd4cf78",
    "title": "The Best Home Finds of 2024: Cozy Cottage Favorites You’ll Love",
    "link": "https://www.lizmarieblog.com/2025/01/the-best-home-finds-of-2024-cozy-cottage-favorites-youll-love/",
    "description": "As we wrap up an incredible year, I thought it would be the perfect time to reflect on some of the most-loved and most-used products in our home this year. These treasures are not only beautifully functional but also come at prices that rival even the biggest sale days of the year. If you’re still […]",
    "author": "Liz Marie",
    "published": "Thu, 02 Jan 2025 14:44:45 +0000",
    "image": "",
    "source": "https://www.lizmarieblog.com/feed/",
    "categories": [
      "LizMarieBlog",
      "Home Decor"
    ]
  },
  {
    "id": "73e55ddc-5d40-4087-b98b-7ce0e768015a",
    "title": "New Valentine’s Day Items at Target: Cozy and Charming Finds!",
    "link": "https://www.lizmarieblog.com/2024/12/new-valentines-day-items-at-target-cozy-and-charming-finds/",
    "description": "Valentine’s Day is just around the corner, and Target has outdone itself this year with a stunning collection of heartfelt goodies. Whether you’re decorating your home, finding a sweet gift, or treating yourself, Target’s lineup of Valentine’s Day treasures has something for everyone. I’ve rounded up some of my favorite picks to make your holiday […]",
    "author": "Jose Galvan",
    "published": "Tue, 31 Dec 2024 03:28:45 +0000",
    "image": "",
    "source": "https://www.lizmarieblog.com/feed/",
    "categories": [
      "LizMarieBlog"
    ]
  },
  {
    "id": "b15b3f47-296d-44b4-b911-f869e7123a34",
    "title": "45 Modern Shipping Container Homes for Every Budget",
    "link": "https://www.trendir.com/modern-shipping-container-homes/",
    "description": "Modern shipping container homes are popular due to their versatility and affordability. Despite having a pre-made shape containers can be stacked in a lot of different ways to produce unusual forms for modern dwellings.. Thanks to their low price (about 2,000 per container) they can be used to produce not only modern houses and retreats for […] The post 45 Modern Shipping Container Homes for Every Budget appeared first on Trendir.",
    "author": "Tania Karpova",
    "published": "Thu, 11 Nov 2021 16:22:33 +0000",
    "image": "https://cdn.trendir.com/wp-content/uploads/2016/06/shipping-container-home-900x1200.jpg",
    "source": "https://www.trendir.com/feed/",
    "categories": [
      "Architectural",
      "shipping container home"
    ]
  },
  {
    "id": "7bd8b9ed-2778-4e12-be77-adacef944c9a",
    "title": "These 20 Colonial Style Homes Will Have You Feeling Warm and Cozy",
    "link": "https://www.trendir.com/colonial-style-homes/",
    "description": "A fireplace, several stories high, brick and family-oriented scenes inside, there’s something so special and welcoming about these kinds of houses. Vintage vibes have a way of tugging at our heartstrings and these 15 colonial-style homes will have you feeling warm and cozy with just a peek in their direction. Scroll through some of our […] The post These 20 Colonial Style Homes Will Have You Feeling Warm and Cozy appeared first on Trendir.",
    "author": "Grace Lynne Fleming",
    "published": "Fri, 22 Oct 2021 08:55:09 +0000",
    "image": "https://cdn.trendir.com/wp-content/uploads/2017/09/Beautiful-Colonial-homes--900x600.png",
    "source": "https://www.trendir.com/feed/",
    "categories": [
      "Architectural",
      "colonial home",
      "colonial home style",
      "colonial style home"
    ]
  },
  {
    "id": "4f2eb15f-0322-4f60-ba57-10b3690b110e",
    "title": "This Pen Honors Dongju Yun’s Legacy with Artistic Design and Thoughtful Innovation",
    "link": "https://www.yankodesign.com/2025/01/11/this-pen-honors-dongju-yuns-legacy-with-artistic-design-and-thoughtful-innovation/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=this-pen-honors-dongju-yuns-legacy-with-artistic-design-and-thoughtful-innovation",
    "description": "This Pen Honors Dongju Yun’s Legacy with Artistic Design and Thoughtful InnovationThe legacy of Dongju Yun (1917.12.30 – 1945.02.16), a renowned Korean poet and independence activist, has inspired many across generations. With a life marked by...",
    "author": "Tanvi Joshi",
    "published": "Sat, 11 Jan 2025 23:30:21 +0000",
    "image": "https://www.yankodesign.com/images/design_news/2024/12/this-pen-honors-dongju-yuns-legacy-with-artistic-design-and-thoughtful-innovation/Poet_pen_stationery_01.jpg",
    "source": "http://feeds.feedburner.com/yankodesign",
    "categories": [
      "Product Design",
      "Stationery",
      "pens"
    ]
  },
  {
    "id": "b3e631a6-468f-4904-96a6-0bd5da77c1b8",
    "title": "I Can’t Stop Thinking About Lenovo’s Brilliant Modular Mouse Concept at CES 2025",
    "link": "https://www.yankodesign.com/2025/01/11/i-cant-stop-thinking-about-lenovos-brilliant-modular-mouse-concept-at-ces-2025/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=i-cant-stop-thinking-about-lenovos-brilliant-modular-mouse-concept-at-ces-2025",
    "description": "I Can’t Stop Thinking About Lenovo’s Brilliant Modular Mouse Concept at CES 2025You go to a tech expo like CES expecting to be absolutely wowed by phones, laptops, GPUs, cars, and all sorts of prominent product categories....",
    "author": "Sarang Sheth",
    "published": "Sat, 11 Jan 2025 21:45:24 +0000",
    "image": "https://www.yankodesign.com/images/design_news/2025/01/i-cant-stop-thinking-about-lenovos-brilliant-modular-mouse-concept-at-ces-2025/lenovo_adaptx_mouse_poc_ces_2025_1.jpg",
    "source": "http://feeds.feedburner.com/yankodesign",
    "categories": [
      "CES",
      "Gadgets",
      "CES 2025",
      "Lenovo",
      "Modular",
      "wireless mouse"
    ]
  },
  {
    "id": "327105f1-b428-49e7-b66b-5fd6c22a4be7",
    "title": "A Creative Bondi Family’s Renovated Art Deco Apartment",
    "link": "https://thedesignfiles.wpenginepowered.com/2025/01/architecture-bondi-junction-studio-pulp/",
    "description": "The owners of this art deco apartment purchased the Bondi property with a mission to update the space and add character, whilst preserving the period charm of the building. The three-bedroom apartment still had most of its original features, but the layout was pokey, and more recent updates has stripped the interiors of personality. A largely cosmetic renovation by Studio Pulp has addressed these issues and more, creating a ‘practically quirky’ base where the Sydney family happily reside, relax, and entertain.",
    "author": "The Design Files",
    "published": "Thu, 09 Jan 2025 19:00:21 +0000",
    "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2024/12/Bondi-StudiPulp-tdf-archi3-1000x640.jpg",
    "source": "https://thedesignfiles.net/feed/",
    "categories": null
  },
  {
    "id": "130d5e6a-ee9a-45d2-9348-b42a015a98d1",
    "title": "This Federation Home In Sydney Hides A Refreshingly Modern Twist",
    "link": "https://thedesignfiles.wpenginepowered.com/2025/01/architecture-studio-prineas-alpha-house/",
    "description": "This federation home in Sydney’s lower North Shore has been adapted to accommodate a family of five — all at very different stages of life. Studio Prineas were tasked with creating a contemporary extension that would embrace the site’s sprawling gardens, without being visible from the street. The resulting Alpha House now balances colour-blocked spaces with classic features, and there’s enough room for the whole family inside.",
    "author": "The Design Files",
    "published": "Wed, 08 Jan 2025 19:00:23 +0000",
    "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2024/12/AlphaHouse-Prinneas-tdf-archi4-1000x640.jpg",
    "source": "https://thedesignfiles.net/feed/",
    "categories": null
  },
  {
    "id": "dff6a1bd-4233-4d4a-ad3a-58d5f5445fbb",
    "title": "Creative Ways To Elevate Your Kitchen Cabinets And Shelves",
    "link": "https://www.decoist.com/elevate-your-kitchen-cabinets-and-shelves/",
    "description": "The kitchen is often considered the heart of the home, a place filled with warmth, indulgence, and love. Yet, it’s easy for this space to become overlooked when it comes to decor as were usually busy focusing on something else when we’re there. If your kitchen cabinets and shelves are looking a bit tired, it […] You're reading Creative Ways To Elevate Your Kitchen Cabinets And Shelves, originally posted on Decoist. If you enjoyed this post, be sure to follow Decoist on Twitter, Facebook and Pinterest.",
    "author": "Daniel Mitchell",
    "published": "Sat, 11 Jan 2025 15:00:56 +0000",
    "image": "https://www.decoist.com/wp-content/uploads/sites/48/2025/01/modern-light-green-luxurious-kitchen-with-dining-t-2024-10-18-08-01-57-utc-60496-scaled.jpg",
    "source": "https://www.decoist.com/feed/",
    "categories": [
      "Kitchens",
      "Design Ideas",
      "decor",
      "design",
      "kitchen",
      "shelves"
    ]
  },
  {
    "id": "fc73c2be-9e3d-4f2f-8f6f-8afa2ea960cb",
    "title": "7 Unique DIY Accent Wall Ideas",
    "link": "https://www.decoist.com/unique-diy-accent-wall-ideas/",
    "description": "An accent wall can transform a room from ordinary to extraordinary, offering a focal point that draws the eye and adds a ton of personality to your space. Whether you’re looking to add a splash of color, texture, or pattern, a DIY accent wall is a fantastic way to express your creativity while elevating your […] You're reading 7 Unique DIY Accent Wall Ideas, originally posted on Decoist. If you enjoyed this post, be sure to follow Decoist on Twitter, Facebook and Pinterest.",
    "author": "Daniel Mitchell",
    "published": "Thu, 09 Jan 2025 15:00:51 +0000",
    "image": "https://www.decoist.com/wp-content/uploads/sites/48/2025/01/red-blanket-on-blue-sofa-next-to-bike-in-modern-li-2024-10-18-10-18-44-utc-86718-scaled.jpg",
    "source": "https://www.decoist.com/feed/",
    "categories": [
      "Design Ideas",
      "DIY Projects",
      "accent",
      "diy",
      "ideas",
      "wall"
    ]
  },
  {
    "id": "ce0542a0-651d-4d65-97d7-8e4314aed5fe",
    "title": "Rosemary: A Boutique Hotel in Marrakesh Artfully Melds Tradition and Modernity",
    "link": "https://www.yatzer.com/rosemary-marrakech",
    "description": "Marrakesh has long captivated travellers with its enigmatic charm. A crossroads of civilizations for centuries, this city is a living mosaic of Berber, Arab, and European influences, all seamlessly woven into its architecture, cuisine, music, and traditions. From the labyrinthine souks to tranquil gardens and ornate palaces to modern art galleries, the city boasts a rich tapestry of contrasts bridging historic periods and cultures.",
    "author": "",
    "published": "Sun, 12 Jan 2025 06:00:00 +0000",
    "image": "https://www.yatzer.com/sites/default/files/styles/alpha/public/01_rosemary_hotel_marrakech_marina_denisova_yatzer.jpg?itok=x1SlK70w",
    "source": "https://www.yatzer.com/rss.xml",
    "categories": null
  },
  {
    "id": "2e1e0806-41cd-41f7-ae9f-5f9af1554968",
    "title": "Mistovia Studio Injects Two Cabins in the Polish Countryside with Modernist Nostalgia",
    "link": "https://www.yatzer.com/mistovia-studio-plener-istebna",
    "description": "Polish interior design studio Mistovia has a reputation for transforming small apartments into convivial dwellings characterised by a sense of retro-modern sophistication, contrasting patterns and vivid colours.",
    "author": "",
    "published": "Thu, 09 Jan 2025 06:00:00 +0000",
    "image": "https://www.yatzer.com/sites/default/files/styles/alpha/public/media/slideshow/09_mistovia_plener_istebna_oni_studio_yatzer.jpg?itok=BlsE7bLa",
    "source": "https://www.yatzer.com/rss.xml",
    "categories": null
  },
  {
    "id": "7fd8b6dc-c5b7-462a-b8cd-6f74de4fe56d",
    "title": "2024 Holiday Gift Guides",
    "link": "https://www.younghouselove.com/holiday-gift-guides-2024/",
    "description": "Just like we did for our 2023 Gift Guides and our 2022 Gift Guides, we’ve got all three of our gift lists in one singular post right here. So let’s dive right into the 3 categories that we cover each year: Gift Ideas for Grown-Ups Gift Ideas for Kids Gift Ideas Under $12.99 Every year that we make these, we love including actual things that we own and enjoy, as well as things that we’re buying for others (like our own kids, each other, and relatives/friends). Also feels like a good moment to mention that nothing was sponsored/gifted to get into this guide. If something is on these lists, we just genuinely love it and think it would make a good gift (and in some cases, we already own it and truly like it). Quick note: The “Under $12.99” list isn’t the only one with items priced that low – for example, there are also two gifts under $12.99 on the kids list. Continue reading 2024 Holiday Gift Guides at Young House Love.",
    "author": "Sherry Petersik",
    "published": "Thu, 21 Nov 2024 05:12:16 +0000",
    "image": "https://www.younghouselove.com/wp-content/uploads//2024/11/2024-Holiday-Gift-Guide-Featured-Image-650x390.jpg",
    "source": "https://www.younghouselove.com/feed/",
    "categories": [
      "Holiday \u0026 Entertaining"
    ]
  },
  {
    "id": "67189166-e730-421f-848a-1d3597a5649c",
    "title": "Downsizing Update: Almost 5 Years Later",
    "link": "https://www.younghouselove.com/downsizing-update-5-years-later/",
    "description": "In November of 2020, we published a post called “What’s It Like To Downsize” after living in our smaller home for 6 months. We covered a range of experiences – like the good things about moving to a smaller home (owning less stuff! saving money!) and some of its challenges, especially in the initial stages of downsizing (paring down! figuring out storage!). We still agree with everything in that post, but it had only been six months… and since it has now been over 4.5 years (!!!), we feel like we have a few more to add about the long-haul downsizing experience. Let’s get into it. I won’t recap our entire decision to downsize (you can see the full explanation here) but the highlights are: We used to live in a 3,150 sq. ft. home in suburban Richmond, Virginia Now we live in a 1,400 sq. Continue reading Downsizing Update: Almost 5 Years Later at Young House Love.",
    "author": "John Petersik",
    "published": "Thu, 14 Nov 2024 16:48:19 +0000",
    "image": "https://www.younghouselove.com/wp-content/uploads//2023/08/Ep183-Featured-Image-Exterior-House-Outside-Horizontal-650x459.jpg",
    "source": "https://www.younghouselove.com/feed/",
    "categories": [
      "Our Current House",
      "Small Space Solutions"
    ]
  }
]
