[
  {
    "id": "ababa731-c88d-4b2d-ab70-e20921adc292",
    "title": "Are These the World's Chicest Jelly Sandals?",
    "link": "https://www.whowhatwear.com/fashion/chloe-jelly-tpu-sandal-review",
    "description": "They made a splash on the Chloé runway and are about to be on every stylish person's feet.",
    "author": "Tara Gonzalez",
    "published": "Tue, 24 Jun 2025 22:29:46 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/g6LsjvkTv45iNe2cLJfAvJ.jpg",
    "source": "https://www.whowhatwear.com/rss",
    "categories": [
      "Fashion"
    ]
  },
  {
    "id": "dc94aaa4-088d-4b7b-a874-bd1889451b6d",
    "title": "Spotted at the Ritz Paris: The Flat-Shoe Trend Chic Parisians Wear With Capris, Miniskirts, and Jeans",
    "link": "https://www.whowhatwear.com/fashion/celebrity-style/french-girl-ballet-flats-lila-moss",
    "description": "A do-it-all type of shoes.",
    "author": "Eliza Huber",
    "published": "Tue, 24 Jun 2025 19:47:13 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/eSc9oqwXUe8grrbehuT6oZ.jpg",
    "source": "https://www.whowhatwear.com/rss",
    "categories": [
      "Celebrity Style",
      "Fashion",
      "Celebrity"
    ]
  },
  {
    "id": "fad2e497-065a-478b-9c9c-ca58a08efc33",
    "title": "The Best Summer Dresses For When It’s Too Hot To Wear Anything Else",
    "link": "https://www.refinery29.com/en-us/summer-dresses-best-reviews?utm_source=feed\u0026utm_medium=rss",
    "description": "When it’s sweltering out, the only thing more appealing than blasting the AC is slipping into an ultra-lightweight dress that barely skims the body. Whether it’s a floaty cotton dress that breathes easily, a poplin midi with cut-outs for added airflow, or a linen maxi made for getaways, these summer-ready silhouettes are what we’ll be living in from now through Labor Day.This edit includes the most breathable summer dresses we could find — many with open backs, strategic slits, or draped shapes that won’t cling, bunch, or stick to sweaty skin. We’ve got all the trends covered, too: shift dresses that go from desk to drinks, tiered and flowy dresses made for triple-digit temps, picnic-ready gingham, bubble hems that bring volume without weight, and standout hues like butter yellow and poppy. Consider this your guide to surviving the heat in style — whether your summer plans include a sardine-girl stroll through the city, a fisherman-coded coastal escape, or a destination wedding abroad (hello, European aesthetic). Mini Dresses Short, swingy, and made to float away from the body, these minis are your best defense against summer’s stickiest days. But heat-proof doesn’t mean shapeless or void of detail — our favorites include ruched accents, exaggerated babydoll silhouettes, and not-overly-clingy smocking. Midi Dresses Midi lengths strike the perfect balance between ease and polish — ideal for office days, dinner plans, or anything in between. Refresh your assortment with of-the-moment silhouettes featuring halter necklines, milkmaid-esque puff sleeves, and beautifully embroidered handkerchief designs. Maxi Dresses Maxis may offer the most coverage, but the best ones still feel easy, airy, and perfectly cool on hot days. Reach for a cut-out design or open back for date night, a cotton shirt dress for a day full of shopping and lunch, or a printed option that feels just right for a summer wedding or dinner outing. Like what you see? How about some more R29 goodness, right here?The 21 Best Plus-Size Dresses On Amazon16 Workout Dresses For Active (\u0026 Inactive) WearWhy I’m Only Dressing In This Happy Color",
    "author": "Emily Ruane",
    "published": "Tue, 24 Jun 2025 20:11:18 +0000",
    "image": "https://www.refinery29.com/images/11908754.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/fashion/rss.xml",
    "categories": null
  },
  {
    "id": "c284ceb9-005a-4a42-822f-f425849d64c1",
    "title": "Refinery29 Loves: Everything To See \u0026 Shop In June",
    "link": "https://www.refinery29.com/en-us/fashion-beauty-news-june?utm_source=feed\u0026utm_medium=rss",
    "description": "Welcome to Refinery29 Loves, the monthly news bulletin where you’ll find our editor-approved lineup of the best to shop and see in fashion and beauty right now. When it comes to fashion and beauty, the end of May was defined by one thing and one thing only: The Cannes Film Festival. After a so-called “decency” rule that cracked down on nudity and long trains on the famed red carpet, some could assume that the looks would be more reserved and restrained. But thankfully, our favorite stars still brought the heat to the South of France, including Charli XCX wearing a lilac feathered YSL silk slip and Dakota Johnson partying in a sheer crystal-embellished Gucci gown. Even in the rain, Rihanna made the case for aquamarine being the color of the season, attending the Highest 2 Lowest premiere in a blue knotted Alaïa dress — complete with an umbrella. When it came to beauty, Julia Garner turned heads in a dark vampy lip and slick bleached hair, while Gabriette kept it all about the eyes with heavy black liner and a nude lip. But it was Bella Hadid that really got everybody talking — likely making tobacco blonde the salon request of the summer. As we look ahead to June, we’re turning our attention away from the red carpet and towards the store shelves, with a never-ending selection of beauty and fashion launches coming our way this month.To discover all our favorite products and collections dropping this June, click through the slideshow ahead.Skims x Roberto CavalliYour swimsuit collection just got an upgrade courtesy of Skims x Roberto Cavalli. Kim Kardashian’s brand has teamed up with the Italian label to create a collection of form-fitting swimwear with archival Cavalli prints — think a scoop-neck one-piece splashed with a tiger face, separates adorned with florals, and matching flowy coverups. “We paired Cavalli’s most iconic prints with our signature swim silhouettes to deliver a sexy collection that empowers everybody to own swim season, no matter where they vacation,” Kardashian said in a press release. Shop on June 27 at Skims Hill House Launches Event Dressing Capsule Get ready to take your Nap Dress outside, because Hill House has debuted a capsule collection for event dressing. The occasion-ready line includes five pieces to suit all your dressed-up summer fashion needs. There’s the Eden Dress, a one-shoulder mini with a train that can be clipped to your back that’s available in black and powder blue; the Isabelle Dress, a floral organza gown with a dual-tier skirt; the mermaid-skirted Marietta Dress, with a lush print and corset-inspired bodice; and the Renee maxi dress, a halter style with a plunging neckline. Prices range from $398 to $498.Shop now at Hill House Hill House The Isabelle Dress, $, available at Hill HouseLoveShackFancy x Dallas Cowboys Cheerleaders 'America's Sweetheart' Cotton CollectionJust in time for the second season of hit Netflix docuseries America's Sweethearts, LoveShackFancy and Cotton have teamed up for a collection inspired by the iconic Dallas Cowboys Cheerleaders — who also star in the campaign. The 28-piece line features a range of elevated basics in red, white, blue, and pink hues all made with lightweight cotton. Find flag pullover sweaters, ruffled skirts with cherry prints, on-trend gingham pieces, and breezy sun dresses in an array of silhouettes and prints, plus matching styles for children. Prices range from $25 to $695. Shop now at LoveShackFancy LoveShackFancy x Cotton Ty Cotton Flag Pullover, $, available at loveshackfancyLoveShackFancy x Cotton Trishelle Cotton Gingham Halter Dress, $, available at loveshackfancyLoveShackFancy x Cotton Soira Cotton Cherry Mini Dress, $, available at loveshackfancyMango x Supriya LeleThose searching for their new resort wardrobe can stop right now. British Indian designer Supriya Lele has teamed up with Mango to create a hot-weather-ready collection, dubbed \"A Summer Reverie.\" Featuring 34 pieces, the selection includes a glittering gold two-piece, a sheer black maxi dress, and an ’80s-inspired metallic blue swimsuit. But our favorite of the collection has to be the crochet-knit mini with feathered trim, based on one of Lele’s existing designs. The collection stands as the first Mango Collective drop, a platformaiming to celebrate niche designers.Available to shop now at MangoSupriya Lele x Mango Puffed Open-Back Bodysuit, $, available at MangoGlossier Lip GlazeLip oils have become all the rage in the last few years. From Dior’s Lip Glow Oil to NYX’s Fat Oil Lip Drip, the glazed look isn’t going anywhere. Just in time for summer, the new Glossier Lip Glaze touts itself as the “next generation” of lip oil, with a melt-on-the-mouth sheer finish and cooling menthol effect. Infused with ingredients like liquid shea butter and jojoba oil, the lip gloss replacement promises to leave lips feeling hydrated and nourished. Available in six different tints (including a frosty lilac and rich russet red), it’s the non-sticky summer formula we’re ready for.Available to shop now at GlossierGlossier Lip Glaze, $, available at GlossierConverse x Isabel Marant Converse and Isabel Marant are reuniting to bring back the wedge sneaker. The footwear brand's latest collab with the Parisian label reimagines two beloved Converse styles — the Chuck 70 (in both high- and low-top silhouettes) and Chuck Wedge — with artful bandana-scarf prints borrowed from the latter's spring/summer 2025 collection. “Good design will always be noticeable, and you’ll never get bored of something that is well achieved — much like the Chuck,\" Marant said in a press release. \"This collection speaks to a cool, easy, and playful attitude.\"  Find the new sneakers in brown and red colorways. Shop on June 3 at Isabel Marant and June 5 at Converse.Kylie Cosmetics Hybrid BlushCream blush has been on trend, but some find the staying power lacking. That’s why cream-to-powder products are on our radar this summer, including Kylie Cosmetics' latest Hybrid Blush. Combining the easy-to-blend nature of cream makeup and the smoothing effect of a powder, the new product brands itself as “mistake-proof.” Available in eight different shades, our favorite hues include Sienna (a terracotta orange) and Slow Jam (a punchy grape shade).Available to shop now at Kylie Cosmetics Kylie Cosmetics Hybrid Blush, $, available at Kylie CosmeticsLevi’s x Sacai collection Levi’s might be an all-American classic, but it’s bringing something fresh to the table this summer thanks to a collaboration with Japanese luxury fashion brand Sacai. Known for its experimental, patchwork takes on formal wear, Sacai is now bringing its love of fusion to Levi’s denim, with a blazer-denim jacket hybrid and belted dark-wash jeans. However, it’s the full-length flared denim jumpsuit that has really caught our eye, modeled by Chase Sui Wonders in the latest campaign. Available to shop now at Levi’sAnastasia Beverly Hills Smooth Blur Contour StickStick applicators have redefined contouring, making it easier than ever to accentuate cheekbones and add dimension to the face. Now, Anastasia Beverly Hills is joining the conversation with the launch of its Smooth Blur Contour Stick. The gel-like creamy formula is meant to sculpt while maintaining a dewy look and lightweight coverage. Available in four different cool-tone shades, the sticks promise a non-greasy, non-comedogenic formula, enriched with vitamin E for added moisture.Available to shop on June 23 at Anastasia Beverly HillsPeachy Summer CollectionLondon label Peachy Den has made a major name for itself thanks to It-Girls like Raye, Lila Moss, and Dua Lipa sporting its looks around town. Now for summer, its latest collection is reinventing its bestselling Kylie dress, Deba top, and Cindy co-ord in all new colorways, as well as new pieces including a khaki frill mini dress, a sunset tank top, and white mini shorts. Available to shop now at Peachy Denpeachy den The Souvenir Top, $, available at peachy denpeachy den The Dylan Bustle Shorts, $, available at peachy denJVN Perféct The Essential Dry ShampooWhile many people see dry shampoo as a last resort product, plenty of hairdressers have long proclaimed the benefits of using it to enhance styling as well as an all-over refresh. JVN is launching its first formula, promising a product without residue, buildup or a white cast, while still providing oil reduction, volume and lift. With ingredients like micellar for cleansing, rosemary for scalp circulation and hemisqualane for hair health, the product is formulated to be kind to strands in between wash days. Plus, the fragrance combines warming amber, violet leaf and crisp apple, making it a treat for those around you, too.Available to shop now at JVN JVN Perféct The Essential Dry Shampoo, $, available at JVNConverse 1908 Collection, Curated by Tyler, The CreatorTeaming up with long-time collaborator Tyler, The Creator, Converse is bringing the nostalgia this summer with a new vintage-inspired collection. Featuring two footwear styles, the 1908 drop reinvents the Naut-1 (a classic sailing style shoe) and the Coach Jogger (a slimline running trainer). For those interested in a ‘70s trackstar look, the forest green Le Fleur Coach Jogger with gum sole is the go-to, while the stone Naut-1’s with floral embroidery are perfect for those wanting something more preppy.Available to shop June 20th at ConverseConverse GOLF Le Fleur* Jogger, $, available at ConverseLike what you see? How about some more R29 goodness, right here?Refinery29 Loves: Everything To See \u0026 Shop In MayThis Weekend's Best Sales, According To UsWe Tested e.l.f.'s Suntouchable Invisi-Stick SPF",
    "author": "Alicia Lansom",
    "published": "Tue, 24 Jun 2025 19:32:31 +0000",
    "image": "https://www.refinery29.com/images/11908850.jpg?auto=webp\u0026width=2500\u0026height=1858\u0026quality=85\u0026crop=1250:929",
    "source": "https://www.refinery29.com/fashion/rss.xml",
    "categories": null
  },
  {
    "id": "bc30ea31-74a1-41f6-a842-8e0ac7e28b16",
    "title": "20 Years Later, I Finally Tried an Hervé Léger Bandage Dress",
    "link": "https://www.popsugar.com/fashion/herve-leger-bandage-dress-review-49448552",
    "description": "When the majority of my high school friends selected bandage dresses for prom junior year, I was less than thrilled. I knew for sure I wouldn't be partaking, and that I'd be in something looser-fit, but I still felt an overwhelming sense of FOMO (as one does in high school). Watching everyone else jump on the bandage dress bandwagon was stressful, knowing I simply didn't have the confidence to wear something that so visibly traced every line of my body. Fast forward to college and I finally invested in a bandage skirt (pictured above), but this is the only photo I have to show for it as I remember feeling uneasy about my head-to-toe appearance. And maybe that's why, 20 years later, I was apprehensive to try a trend that used to keep me up at night. A familiar sense of fear creeped over me as I pulled the Hervé Léger Elise Dress ($690) over my head and procrastinated peering into the mirror. Would I like the shape of my thighs? Would I be able to make out my period bloat belly straight-on, before even turning to the side? All the same ridiculous questions popped into my head as I asked myself why I signed up to try the skintight silhouette that's enjoying a resurgence thanks to models like Kaia Gerber and Hailey Bieber. The design carries a certain energy that harks back to an early aughts party vibe, but feels versatile all the same. But then I looked at myself, and suddenly, my 33-year-old common sense and wisdom returned back to me. All my insecurities about wearing a tight dress (most of which society imparts on us) melted away - and not just because I actually liked the way I looked. While the idea of a bandage dress feels nostalgic, I felt very much like current-day me trying on a new aesthetic. Rather than being intimidated by the cut of the iconic mini, I was inspired to create a personal look that incorporated my favorite accessories du jour. This is, in part, because the Hervé Léger dress is comfortable (more on that in a bit) and because its construct and very intention has evolved. \"The original bandage dress was a study in form and discipline,\" creative director Michelle Ochs tells Popsugar. \"Hervé's vision was to sculpt the body like a piece of art - his use of paneled, knit strips drew from couture techniques and a fascination with shape and structure. It wasn't just about sex appeal; it was about strength, symmetry, and empowerment. Over the past four decades, the silhouette has evolved with changing attitudes about femininity and self-expression. We're no longer bound by the idea of perfection - it's about ease, versatility, and individuality.\" Now, having worn the dress for a dinner date with my fiancé at Williamsburg hot spot Sungold, Ochs's sentiment very much resonates with me. Rather than being worried about defining lines, I felt confident in emphasizing my shape because it's mine. That change in perspective certainly took some time, but here we are 20 years later - when bandage dresses are so back - and I'm finally ready to offer my review. Expert Featured in This Article Michelle Ochs is the creative director of Hervé Léger and founder of Et Ochs. About the Hervé Léger Bandage Dress The dress is cut from gradient bandage paneling that's softer and more fluid than past designs. With a halter neckline, it's made to contour the body in zones of compression and release, lifting and shaping without boning or lining. It's made from 91 percent eco-friendly recycled rayon, eight percent nylon, and one percent spandex. It's available in bright blue or black and sizes XXS to XL. You can split your purchase into four interest-free payments through Klarna. What I Like About the Hervé Léger Bandage Dress At first touch, I was surprised by the clear quality and weight of Hervé Léger's bandage dress material. It doesn't feel at all like my old bandage skirts from college, which were stiff and paper-thin. Ochs explains, \"While the DNA remains, today's bandage is softer, more fluid, and reinterpreted through mixed media, matte jersey, and architectural tailoring. It's no longer just a dress, it's an attitude.\" In that regard, I definitely felt like my personal style was challenged the moment I slipped into The Elise. The design carries a certain energy that harks back to an early aughts party vibe, but feels versatile all the same - like I could easily team it with my vintage Gucci sandals and Jacquemus Rond Carré Shoulder Bag ($119 a month at Vivrelle) and still feel like me. While it definitely formed to my curves, which made me a bit self-conscious as I feasted on bucatini, strip steak, and focaccia, it simultaneously lifted with support, keeping that \"snatched\" feeling present on my night out. \"It's a meticulous process that involves mapping the body almost like an architect maps a blueprint,\" Ochs says of the magical effect I'm describing. \"Most high-street versions replicate the look, but not the performance. Ours is engineered to move with you while still sculpting the silhouette in a clean, elevated way.\" What to Consider Before Buying the Hervé Léger Bandage Dress I'd be remiss not to acknowledge the high price point of The Elise (and all Hervé Léger bandage dresses for that matter), but as described above, there's no denying the craftsmanship that distinguishes this bandage dress as higher caliber, so it's unsurprising that the retail price reflects this. That being said, I wish there was a wider size range and hope the brand has plans to expand in the future. According to Ochs, \"Inclusivity and wearability are absolutely central to our evolution. We embrace curves!\" So far, Hervé Léger has introduced additional length options, sleeves, styles, and fabrications, including lightweight rib knits and stretch suiting that \"offer more ease without sacrificing structure.\" Ochs tells PS, \"Comfort and confidence aren't mutually exclusive; it's about giving women options that allow them to define sensuality on their own terms.\" Where Is the Hervé Léger Bandage Dress Available? The Hervé Léger Elise dress is available on the brand's website, at Neiman Marcus, and Bloomingdale's. To get the look at a more affordable price point, rent a similar Hervé Léger Cross Back Mini Dress at Rent the Runway, or try the Akira Serpenti Plunge Mini Dress ($60), Meilun Celebrity Bandage Bodycon Dress ($67) or Superdown Isidora Strapless Mini Dress ($88). Rating Sarah Wasilak (she/her) is the PS Shopping Director. With plenty of experience in the fashion industry and over 11 years as an editor at the brand, she enjoys writing and creating social videos across the lifestyle, health, and fitness categories. She is the host of the \"Dinner for Shoes\" podcast and has bylines at InStyle, Elle, Refinery29, Who What Wear, Elite Daily, Byrdie, and The Quality Edit.",
    "author": "Sarah Wasilak",
    "published": "Tue, 24 Jun 2025 13:03:09 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/1s0RujsXZjUk1sjeh1yTL9Wa1N4/133x772:2033x2672/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2025/06/24/669/n/1922564/1752464b685abe436955e6.57104742_.jpg",
    "source": "https://www.popsugar.com/fashion/feed",
    "categories": [
      "Product Reviews",
      "Fashion Shopping",
      "Fashion Trends",
      "Dresses",
      "Shopping"
    ]
  },
  {
    "id": "3466f009-d7a6-46f4-a19f-ca05247ca361",
    "title": "Taylor Swift's Reformation Corset Is the Star of Her Date Night Look - Shop It Here",
    "link": "https://www.popsugar.com/fashion/taylor-swift-reformation-corset-top-49448397",
    "description": "Image Source: Getty Images | Gotham Image Source: Reformation Taylor Swift is just a girl like the rest of us - and like any true fashion lover, she's got a thing for corset tops. Honestly, who can blame her? They cinch you in all the right places, add a flirty touch, and somehow make even the simplest outfit look totally put together. Whether you're pairing one with jeans, leather pants, a skirt, or shorts, they just work. Case in point: Swift's latest date night look with boyfriend Travis Kelce featured a soft blue corset from Reformation - the Seren Top ($168). And surprise, surprise - it's still in stock. We were kind of shocked too, since most things she wears sell out in seconds. The fact that this piece is still available feels like a minor miracle. Priced under $200, it's a no-brainer - cute, stylish, and perfect for summer nights. If it's good enough for Taylor Swift's date night, it's definitely good enough for ours. We're adding one to our cart ASAP, and if you're a Swift fan, this one's definitely worth it for you, too. What Is the Reformation Seren Top? Taylor Swift wore the cornflower shade of Reformation's Seren Top for a date night out with boyfriend Travis Kelce in NYC. The top is still available in all four colors on Reformation's website, so you can take your pick. It's designed to fit snugly and is made from a heavyweight crepe fabric that's thick enough to hold its shape, giving it that polished, structured look you want from a corset-style top. The fabric is mostly made from Naia Renew acetate (fancy talk for a sustainable material that comes from wood pulp), mixed with some polyester to make it tougher and last longer. It feels crisp and smooth - not super soft or silky - which helps maintain that clean, sharp look when you wear it. If you're not too focused on the eco-friendly aspect, there's a similar option on Amazon: the Lizynuty Crop Top ($13). It nails the same look, but is made from 100 percent polyester, so it's less green and can feel a bit less comfy on your skin. Definitely not the same quality, but hey - options are always nice, right?",
    "author": "Haley Lyndes",
    "published": "Mon, 23 Jun 2025 10:55:02 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/3fQiP01a6R0f7UqSLwdKDXM1ujI/464x0:3646x3182/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2025/06/23/759/n/1922398/d102eab168598b4c30ba19.44889872_.jpg",
    "source": "https://www.popsugar.com/fashion/feed",
    "categories": [
      "Taylor Swift",
      "Fashion Shopping",
      "Celebrity Style",
      "Reformation",
      "Tops"
    ]
  },
  {
    "id": "1fb74173-32e9-42f7-bd8d-b6b100569a8b",
    "title": "The Nike Air Rift Is This Summer’s Hottest Shoe",
    "link": "https://www.elle.com/fashion/shopping/a65156949/nike-air-rift-trend-2025/",
    "description": "The archive silhouette has returned—and it’s still in stock.",
    "author": "",
    "published": "Tue, 24 Jun 2025 22:07:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/fashion.xml/",
    "categories": null
  },
  {
    "id": "55b6bc94-7117-445a-8327-c05c349b8a96",
    "title": "The Best Summer Dresses on Amazon—Vetted by ELLE Editors",
    "link": "https://www.elle.com/fashion/shopping/g65090653/best-amazon-dresses/",
    "description": "From linen midis to beach-ready minis, these are the styles that passed our fashion editor test.",
    "author": "",
    "published": "Tue, 24 Jun 2025 21:07:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/fashion.xml/",
    "categories": null
  },
  {
    "id": "76fe9721-556b-4f57-8824-8af0a59bb8f4",
    "title": "‘Fashion murder’: Carolyn Bessette Kennedy fans aghast at first images from Netflix series",
    "link": "https://www.theguardian.com/fashion/2025/jun/20/fashion-outrage-american-love-story-carolyn-bessette-kennedy",
    "description": "Style watchers quick to disapprove of late publicist’s portrayal in Ryan Murphy’s American Love StoryIn fashion, only the real favourites have acronyms. See SJP for Sarah Jessica Parker, ALT for the fashion editor André Leon Talley and – particularly relevant right now – CBK for Carolyn Bessette Kennedy.The wife of John F Kennedy Jr who died in a plane crash in 1999 is sometimes seen as America’s answer to Diana, Princess of Wales. Like Diana, she was loved for her style – called minimalist, chic or “quiet luxury”. Instagram is full of accounts posting archive images of her, influential brands such as The Row, Toteme and Gabriela Hearst design clothes that channel her approach to dressing and there have been books and auctions in recent years. Continue reading...",
    "author": "Lauren Cochrane",
    "published": "Fri, 20 Jun 2025 15:46:07 GMT",
    "image": "",
    "source": "https://www.theguardian.com/fashion/rss",
    "categories": [
      "Fashion",
      "The Kennedys",
      "Ryan Murphy",
      "US news",
      "Life and style",
      "Television \u0026 radio",
      "Culture"
    ]
  },
  {
    "id": "295b0525-fda1-49b4-8806-82e3e6446b31",
    "title": "Prada’s pared-back military chic offers simplicity in turbulent times",
    "link": "https://www.theguardian.com/fashion/2025/jun/23/prada-military-chic-milan",
    "description": "Plimsolls, khaki and raffia at Milan menswear collection straddle line between escapism and political statementMiuccia Prada may argue that her collections are not a response to the global political landscape. But in keeping with the theme for her spring/summer 2026 menswear collection shown in Milan on Sunday, there may be a change of tone.The show notes shared with journalists described the collection as representing “a shift of attitude – dismantling of meaning and dismantling power”. Continue reading...",
    "author": "Scarlett Conlon in Milan",
    "published": "Mon, 23 Jun 2025 09:32:41 GMT",
    "image": "",
    "source": "https://www.theguardian.com/fashion/rss",
    "categories": [
      "Prada",
      "Men's fashion",
      "Fashion",
      "Life and style"
    ]
  },
  {
    "id": "07c0f235-7992-408f-97de-5c6187be9168",
    "title": "Must Read: G-III Files $250 Million Lawsuit Against PVH Corp., CaaStle Files for Bankruptcy",
    "link": "https://fashionista.com/2025/06/g-iii-pvh-250-million-lawsuit",
    "description": "These are the stories making headlines in fashion on Tuesday. After three years of building tensions, G-III Apparel Group has filed a $250 million breach of contract lawsuit against PVH Corporation in New York state court. The two companies had successfully worked together for nearly 20 years ...Continue reading",
    "author": "Brooke Frischer",
    "published": "Tue, 24 Jun 2025 16:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjE1ODQ2OTk2MjI3OTI1MzU5/g-iii-pvh-lawsuit.jpg",
    "source": "https://fashionista.com/.rss/excerpt/",
    "categories": [
      "Iran",
      "PVH Corp",
      "Bankruptcy",
      "PvH",
      "G-iii",
      "Politics",
      "Claire's",
      "Savile Row",
      "Lawsuits",
      "lawsuit",
      "Network",
      "Tariffs",
      "News",
      "suits"
    ]
  },
  {
    "id": "4bd49198-c789-4c9d-8761-0b99373e38aa",
    "title": "PhotoBook Is Seeking Editorial Interns In New York, NY (Remote)",
    "link": "https://fashionista.com/2025/06/photobook-is-seeking-editorial-interns-in-new-york-ny",
    "description": "PhotoBook Magazine, a digital high-fashion publication dedicated to celebrating diversity, sustainability, inclusivity, and the ethical treatment of animals, advocating for cruelty-free fashion and responsible industry practices through compelling photography and insightful writing. PhotoBook ...Continue reading",
    "author": "Winnie Liu",
    "published": "Tue, 24 Jun 2025 15:01:20 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjE1ODQ2NTkzODQzMTc2OTc5/candicekinglowrescover.jpg",
    "source": "https://fashionista.com/.rss/excerpt/",
    "categories": [
      "Careers",
      "PhotoBook",
      "Sponsored Content",
      "Job Listings",
      "Network",
      "internships",
      "How To Make It",
      "NYC Job Listings"
    ]
  },
  {
    "id": "1533d49a-d588-4a9c-b947-2ae0e2d4483f",
    "title": "Dress Code: Range",
    "link": "https://www.fashionbeans.com/article/range/",
    "description": "",
    "author": "FashionBeans Editors",
    "published": "Mon, 23 Jun 2025 12:18:00 +0000",
    "image": "",
    "source": "https://www.fashionbeans.com/rss-feed/?category=fashion",
    "categories": [
      "Dress Code"
    ]
  },
  {
    "id": "1ac0bc60-aa13-4fba-a482-4c76176abf84",
    "title": "How to Break in Doc Martens in 2025 – Guide + Video",
    "link": "https://www.fashionbeans.com/article/how-to-break-in-doc-martens/",
    "description": "Breaking in a new pair of Doc Martens in less than a week can be challenging and a pain-filled experience; they can leave you with nasty blisters and sore feet that take weeks to heal. However, there are several tips that can help you expedite the process. In this post, I will show you how … Continue reading How to Break in Doc Martens in 2025 – Guide + Video →",
    "author": "Foday Kamara",
    "published": "Mon, 23 Jun 2025 09:25:48 +0000",
    "image": "",
    "source": "https://www.fashionbeans.com/rss-feed/?category=fashion",
    "categories": [
      "Men's Fashion Guides"
    ]
  },
  {
    "id": "084c3ad2-412e-4d67-961d-b8aeed94012e",
    "title": "A Trove Of Princess Diana’s Personal Belongings Is Going Up For Auction",
    "link": "https://www.nytimes.com/2025/06/24/style/princess-diana-auction-clothing.html",
    "description": "A large trove of the princess’ belongings including her Lady Dior handbag, will be auctioned this week. For some buyers, more intimate items are the main draw.",
    "author": "Yola Mzizi",
    "published": "Tue, 24 Jun 2025 16:38:49 +0000",
    "image": "https://static01.nyt.com/images/2025/06/24/multimedia/24DIANA-AUCTION-01-qvfj/24DIANA-AUCTION-01-qvfj-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/FashionandStyle.xml",
    "categories": [
      "Diana, Princess of Wales",
      "Auctions",
      "Julien's Auctions",
      "Royal Families",
      "Collectors and Collections",
      "Christie's"
    ]
  },
  {
    "id": "28b0c3c4-252e-49d7-bace-79377025df9c",
    "title": "Can Savile Row Be Saved by Women Who Want Power Suits?",
    "link": "https://www.nytimes.com/2025/06/24/style/daisy-knatchbull-savile-row-womens-tailoring.html",
    "description": "Daisy Knatchbull set up shop as a dedicated women’s tailor on the world’s most famous street for men’s clothing. Now her sights are set on America.",
    "author": "Elizabeth Paton",
    "published": "Tue, 24 Jun 2025 18:16:20 +0000",
    "image": "https://static01.nyt.com/images/2025/06/24/multimedia/24ST-KNATCHBULL-TAILOR-01-zjgb/24ST-KNATCHBULL-TAILOR-01-zjgb-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/FashionandStyle.xml",
    "categories": [
      "Fashion and Apparel",
      "Suits (Apparel)",
      "Seamstresses and Tailors",
      "Women and Girls",
      "Savile Row (London, England)",
      "London (England)",
      "Knatchbull, Daisy",
      "Knatchbull"
    ]
  }
]
