[
  {
    "id": "8a5c6cb0-f585-482c-9167-6cb61a49910d",
    "title": "Jennifer Lawrence Wore the Skirt Trend I've Avoided Since 2006 (But Suddenly Need to Own Again)",
    "link": "https://www.whowhatwear.com/jennifer-lawrence-ombre-skirt-cannes-film-festival",
    "description": "It's coming back with a vengeance.",
    "author": "Drew Elovitz",
    "published": "Mon, 02 Jun 2025 21:49:43 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/RvwXYdQRqyVqXgbUxmCcZa.jpg",
    "source": "https://www.whowhatwear.com/rss",
    "categories": [
      "Celebrity Style",
      "Fashion",
      "Celebrity"
    ]
  },
  {
    "id": "60deed04-befc-4de0-93a9-eb545df5f2a7",
    "title": "We Rigorously Tested 13 of the Best BB Creams—These 8 Passed",
    "link": "https://www.whowhatwear.com/beauty/skin/bb-creams",
    "description": "We test, you trust.",
    "author": "",
    "published": "Mon, 02 Jun 2025 21:01:27 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/whowhatwear/posts/289264/best-bb-creams-289264-1677280905812-square.jpg",
    "source": "https://www.whowhatwear.com/rss",
    "categories": [
      "Skin",
      "Beauty"
    ]
  },
  {
    "id": "545d3a48-0354-4a86-8b48-e9ae47b17e1f",
    "title": "Jonathan Anderson: the esoteric designer taking on the mantle at Dior",
    "link": "https://www.theguardian.com/fashion/2025/jun/02/jonathan-anderson-profile-dior-loewe",
    "description": "Appointment of Northern Irishman behind Loewe hype machine sets storied fashion house on experimental pathLong before the designer Jonathan Anderson stepped down from his role at Loewe in March, it was rumoured he would be heading for Dior. So when it was finally announced – six months after Dior’s menswear designer left, and four days after its womenswear head, Maria Grazia Chiuri, showed a collection in Rome – it surprised no one.Yet Anderson’s newfound position at luxury’s centre of gravity still sets Dior, a grand fashion institution, careering down an experimental path. As Delphine Arnault, the chair and chief executive of Christian Dior Couture, told Vogue Business: “For any house, having new artistic direction can be a challenge.” Continue reading...",
    "author": "Morwenna Ferrier and Jess Cartner-Morley",
    "published": "Mon, 02 Jun 2025 16:11:15 GMT",
    "image": "",
    "source": "https://www.theguardian.com/fashion/rss",
    "categories": [
      "Fashion",
      "Fashion industry",
      "Life and style",
      "Dior",
      "UK news",
      "Northern Ireland",
      "Rihanna",
      "Maria Grazia Chiuri"
    ]
  },
  {
    "id": "6684487e-b0cc-4da8-979c-69a9b99b25cf",
    "title": "Jess Cartner-Morley’s June style essentials: from treat-yourself dresses to high-street bling",
    "link": "https://www.theguardian.com/thefilter/2025/jun/01/june-style-essentials",
    "description": "It’s our fashion guru’s birthday month, and she’s being sensible … mostly• Women’s spring wardrobe essentials: 27 easy-to-wear piecesI try to be realistic about what people will spend when I do these edits. When we’re shopping and see something we like, the first thing almost all of us do is look at the price. What with money not growing on trees and all that. If I see something nice in a shop, then check the tag and find it to be out of my budget (or just overpriced), I move swiftly on. By the same logic, if I spot a contender for this monthly roundup but then discover it’s prohibitively expensive – which happens a lot these days, “sticker shock” being a familiar syndrome in an era of fashion hyperinflation – I am not inclined to include it.But we can’t be sensible all the time. I don’t need to remind you that it’s better to buy fewer good, long-lasting things than loads of cheap tat. Then there’s the fact that, sometimes, an object is worth spending money on not because it’s objectively worth a lot of money, but just because it’s worth a lot to you. Plus, June is my birthday month, so you have to indulge me, OK? So, there’s a couple of splurges in here, should you be in the market for a dreamy dress or two. But also: the £46.75 swimsuit that’s in every chic holiday luggage, and some utterly brilliant earrings for less than £20. Because, that’s real life. Continue reading...",
    "author": "Jess Cartner-Morley",
    "published": "Sun, 01 Jun 2025 07:00:06 GMT",
    "image": "",
    "source": "https://www.theguardian.com/fashion/rss",
    "categories": [
      "Fashion",
      "Life and style",
      "Women's shoes",
      "Accessories",
      "Women's tops",
      "Women's trousers",
      "Dresses"
    ]
  },
  {
    "id": "ac34c15b-d0fa-4de6-b1bf-c433dd443c37",
    "title": "These Airy Linen Dresses Feel Like Wearing Nothing—In the Best Way",
    "link": "https://www.elle.com/fashion/shopping/a64920093/best-linen-dresses-for-women/",
    "description": "They’re breezy, breathable, and made for heatwave season.",
    "author": "",
    "published": "Mon, 02 Jun 2025 19:11:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/fashion.xml/",
    "categories": null
  },
  {
    "id": "46266449-8c36-4bfa-b6fe-11b77e515a9d",
    "title": "Where to Buy Art Online: A Beginner’s Guide to Curating Your First Collection",
    "link": "https://www.elle.com/fashion/shopping/a64841590/where-to-buy-art-online/",
    "description": "By a beginner, for beginners.",
    "author": "",
    "published": "Mon, 02 Jun 2025 18:42:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/fashion.xml/",
    "categories": null
  },
  {
    "id": "09f89208-a4ba-4487-b34d-a11008efac7b",
    "title": "Must Read: Kizik Names Former Nike Executive as CEO, Gap Braces for $300 Million Tariff-Related Costs",
    "link": "https://fashionista.com/2025/06/kizik-names-new-ceo-gareth-hosford",
    "description": "These are the stories making headlines in fashion on Monday. Footwear brand Kizik announced on Monday that Gareth Hosford, a former executive at Nike and Converse, will be its new CEO. Kizik's former CEO of the last six years, Monte Deere, will remain a member of the board and assist with new ...Continue reading",
    "author": "Brooke Frischer",
    "published": "Mon, 02 Jun 2025 16:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjE1MzM3MDA0NTYzNDQxMTcx/kizik-names-new-ceo.jpg",
    "source": "https://fashionista.com/.rss/excerpt/",
    "categories": [
      "Tariffs",
      "Acquisitions",
      "hair tools",
      "Gap Inc",
      "Kizik",
      "Nike",
      "shoes",
      "Gap",
      "Network",
      "CEO",
      "News",
      "Matthew Williams"
    ]
  },
  {
    "id": "5404ed14-45d8-4605-9184-c6f07b768c12",
    "title": "Worldclass: A Nonprofit Clothing Brand that Advocates for Colonoscopies",
    "link": "https://fashionista.com/2025/06/worldclass-clothing-brand-colonoscopies",
    "description": "Brand Bio is Fashionista's guide to the best independent fashion and beauty brands — a resource for retailers, job seekers, B2B companies and consumers alike. If you'd like your brand to be featured, fill out this form. WorldclassHeadquarters: Los Angeles, CAE-commerce: worldclassclothing.comSocial ...Continue reading",
    "author": "Fashionista",
    "published": "Mon, 02 Jun 2025 14:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjE1MjY5NTYzOTEzMjE3NTU1/worldclass.jpg",
    "source": "https://fashionista.com/.rss/excerpt/",
    "categories": [
      "Shopping",
      "Nonprofit",
      "charity",
      "Loungewear",
      "Brand Bio Fashion",
      "Brand Bio",
      "Network",
      "Brand Bio",
      "Worldclass",
      "Indie Fashion"
    ]
  },
  {
    "id": "b9accac3-8cb1-4dda-a760-2646fa754a8b",
    "title": "Shirley Manson, the Lead Singer of Garbage Becomes the Unexpected Godmother of Rock",
    "link": "https://www.nytimes.com/2025/06/02/style/shirley-manson-the-unexpected-godmother-of-rock.html",
    "description": "The singer of Garbage, which has a new album, has become rock ’n’ roll’s collective older sister, offering advice and wisdom to younger women coming up in the business.",
    "author": "Lizzy Goodman",
    "published": "Mon, 02 Jun 2025 18:29:55 +0000",
    "image": "https://static01.nyt.com/images/2025/05/30/multimedia/ST-SHIRLEY-MANSON-01-tqgf/ST-SHIRLEY-MANSON-01-tqgf-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/FashionandStyle.xml",
    "categories": [
      "Manson, Shirley",
      "Pop and Rock Music",
      "Women and Girls",
      "Garbage (Music Group)",
      "Interscope",
      "MTV Networks",
      "Nirvana (Music Group)",
      "Content Type: Personal Profile"
    ]
  },
  {
    "id": "5f437ef3-896c-4ca7-a57c-57341a9e3af7",
    "title": "Jonathan Anderson’s Hire Makes History at Dior",
    "link": "https://www.nytimes.com/2025/06/02/style/jonathan-anderson-dior.html",
    "description": "His appointment as creative director of both women’s and men’s wear may mark not just a changing of the guard, but a shift in the paradigm.",
    "author": "Vanessa Friedman",
    "published": "Mon, 02 Jun 2025 13:17:28 +0000",
    "image": "https://static01.nyt.com/images/2025/06/02/multimedia/02JONATHAN-DIOR-fplc/02JONATHAN-DIOR-fplc-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/FashionandStyle.xml",
    "categories": [
      "Luxury Goods and Services",
      "Fashion and Apparel",
      "Appointments and Executive Changes",
      "Christian Dior SA",
      "LVMH Moet Hennessy Louis Vuitton SA",
      "Anderson, Jonathan William (1984- )",
      "Arnault, Bernard",
      "your-feed-fashion"
    ]
  },
  {
    "id": "6a2cb97f-0341-4542-8fd7-29818d23544d",
    "title": "Refinery29 Loves: Everything To See \u0026 Shop In June",
    "link": "https://www.refinery29.com/en-us/fashion-beauty-news-june?utm_source=feed\u0026utm_medium=rss",
    "description": "Welcome to Refinery29 Loves, the monthly news bulletin where you’ll find our editor-approved lineup of the best to shop and see in fashion and beauty right now. When it comes to fashion and beauty, the end of May was defined by one thing and one thing only: The Cannes Film Festival. After a so-called “decency” rule that cracked down on nudity and long trains on the famed red carpet, some could assume that the looks would be more reserved and restrained. But thankfully, our favorite stars still brought the heat to the South of France, including Charli XCX wearing a lilac feathered YSL silk slip and Dakota Johnson partying in a sheer crystal-embellished Gucci gown. Even in the rain, Rihanna made the case for aquamarine being the color of the season, attending the Highest 2 Lowest premiere in a blue knotted Alaïa dress — complete with an umbrella. When it came to beauty, Julia Garner turned heads in a dark vampy lip and slick bleached hair, while Gabriette kept it all about the eyes with heavy black liner and a nude lip. But it was Bella Hadid that really got everybody talking — likely making tobacco blonde the salon request of the summer. As we look ahead to June, we’re turning our attention away from the red carpet and towards the store shelves, with a never-ending selection of beauty and fashion launches coming our way this month.To discover all our favorite products and collections dropping this June, click through the slideshow ahead.Levi’s x Sacai collection Levi’s might be an all-American classic, but it’s bringing something fresh to the table this summer thanks to a collaboration with Japanese luxury fashion brand Sacai. Known for its experimental, patchwork takes on formal wear, Sacai is now bringing its love of fusion to Levi’s denim, with a blazer-denim jacket hybrid and belted dark-wash jeans. However, it’s the full-length flared denim jumpsuit that has really caught our eye, modeled by Chase Sui Wonders in the latest campaign. Available to shop now at Levi’sEmbargo: Mango x Supriya LeleThose searching for their new resort wardrobe can stop right now. British Indian designer Supriya Lele has teamed up with Mango to create a hot-weather-ready collection, dubbed \"A Summer Reverie.\" Featuring 34 pieces, the selection includes a glittering gold two-piece, a sheer black maxi dress and an ’80s-inspired metallic blue swimsuit. But our favorite of the collection has to be the crochet-knit mini with feathered trim, based on one of Lele’s existing designs. The collection stands as the first Mango Collective drop, a platformaiming to celebrate niche designers.Available to shop June 5th at MangoConverse x Isabel Marant Converse and Isabel Marant are reuniting to bring back the wedge sneaker. The footwear brand's latest collab with the Parisian label reimagines two beloved Converse styles — the Chuck 70 (in both high- and low-top silhouettes) and Chuck Wedge — with artful bandana-scarf prints borrowed from the latter's spring/summer 2025 collection. “Good design will always be noticeable, and you’ll never get bored of something that is well achieved — much like the Chuck,\" Marant said in a press release. \"This collection speaks to a cool, easy, and playful attitude.\"  Find the new sneakers in brown and red colorways. Shop on June 3 at Isabel Marant and June 5 at Converse.Glossier Lip GlazeLip oils have become all the rage in the last few years. From Dior’s Lip Glow Oil to NYX’s Fat Oil Lip Drip, the glazed look isn’t going anywhere. Just in time for summer, the new Glossier Lip Glaze touts itself as the “next generation” of lip oil, with a melt-on-the-mouth sheer finish and cooling menthol effect. Infused with ingredients like liquid shea butter and jojoba oil, the lip gloss replacement promises to leave lips feeling hydrated and nourished. Available in six different tints (including a frosty lilac and rich russet red), it’s the non-sticky summer formula we’re ready for.Available to shop now at GlossierGlossier Lip Glaze, $, available at GlossierKylie Cosmetics Hybrid BlushCream blush has been on trend, but some find the staying power lacking. That’s why cream-to-powder products are on our radar this summer, including Kylie Cosmetics' latest Hybrid Blush. Combining the easy-to-blend nature of cream makeup and the smoothing effect of a powder, the new product brands itself as “mistake-proof.” Available in eight different shades, our favorite hues include Sienna (a terracotta orange) and Slow Jam (a punchy grape shade).Available to shop now at Kylie Cosmetics Kylie Cosmetics Hybrid Blush, $, available at Kylie CosmeticsPeachy Summer CollectionLondon label Peachy Den has made a major name for itself thanks to It-Girls like Raye, Lila Moss, and Dua Lipa sporting its looks around town. Now for summer, its latest collection is reinventing its bestselling Kylie dress, Deba top, and Cindy co-ord in all new colorways, as well as new pieces including a khaki frill mini dress, a sunset tank top, and white mini shorts. Available to shop now at Peachy Denpeachy den The Souvenir Top, $, available at peachy denpeachy den The Dylan Bustle Shorts, $, available at peachy denAnastasia Beverly Hills Smooth Blur Contour StickStick applicators have redefined contouring, making it easier than ever to accentuate cheekbones and add dimension to the face. Now, Anastasia Beverly Hills is joining the conversation with the launch of its Smooth Blur Contour Stick. The gel-like creamy formula is meant to sculpt while maintaining a dewy look and lightweight coverage. Available in four different cool-tone shades, the sticks promise a non-greasy, non-comedogenic formula, enriched with vitamin E for added moisture.Available to shop on June 23 at Anastasia Beverly HillsEmbargo: JVN Perféct The Essential Dry ShampooWhile many people see dry shampoo as a last resort product, plenty of hairdressers have long proclaimed the benefits of using it to enhance styling as well as an all-over refresh. JVN is launching its first formula, promising a product without residue, buildup or a white cast, while still providing oil reduction, volume and lift. With ingredients like micellar for cleansing, rosemary for scalp circulation and hemisqualane for hair health, the product is formulated to be kind to strands in between wash days. Plus, the fragrance combines warming amber, violet leaf and crisp apple, making it a treat for those around you, too.Available to shop on June 10th at JVN Converse 1908 Collection, Curated by Tyler, The CreatorTeaming up with long-time collaborator Tyler, The Creator, Converse is bringing the nostalgia this summer with a new vintage-inspired collection. Featuring two footwear styles, the 1908 drop reinvents the Naut-1 (a classic sailing style shoe) and the Coach Jogger (a slimline running trainer). For those interested in a ‘70s trackstar look, the forest green Le Fleur Coach Jogger with gum sole is the go-to, while the stone Naut-1’s with floral embroidery are perfect for those wanting something more preppy.Available to shop June 20th at ConverseConverse GOLF Le Fleur* Jogger, $, available at ConverseLike what you see? How about some more R29 goodness, right here?Refinery29 Loves: Everything To See \u0026 Shop In MayThis Weekend's Best Sales, According To UsWe Tested e.l.f.'s Suntouchable Invisi-Stick SPF",
    "author": "Alicia Lansom",
    "published": "Mon, 02 Jun 2025 15:44:31 +0000",
    "image": "https://www.refinery29.com/images/11897705.jpg?auto=webp\u0026width=2000\u0026height=2500\u0026quality=85\u0026crop=4:5",
    "source": "https://www.refinery29.com/fashion/rss.xml",
    "categories": null
  },
  {
    "id": "f241df86-6497-4ed9-ac7f-861556e7d668",
    "title": "The 23 Best Travel Pants That Aren’t Leggings",
    "link": "https://www.refinery29.com/en-us/best-travel-pants?utm_source=feed\u0026utm_medium=rss",
    "description": "Heading off on a trip and don’t know what to wear? Whether you’re venturing to the airport, the train station, or in the car, one thing’s for sure: Comfort is non-negotiable. Sure, trusty leggings and cozy sweats are MVPs, but sometimes, you want to look a little more “effortless jet-setter” and a little less “just rolled out of bed.” Enter: travel pants. When curating our list of the best travel pants, we held them to sky-high standards: They needed to be versatile enough to wear straight off the plane and into whatever adventure awaits, comfy enough for the bizarre yoga-esque positions you’ll find yourself in while attempting to sleep on a long-haul flight, and stylish enough to pair seamlessly with the rest of your wardrobe (and avoid the dreaded overpacking guilt). Bonus points to pants with practical perks like wrinkle-resistance, technical fabrics, and — the holy grail — pockets.Meet our 23 favorite travel pants below. Once you experience the magic of sweat-wicking, breezy, and polished bottoms that don’t scream “athleisure overload,” we promise you’ll never look back.All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.Daily Practice by Anthropologie Messa JumpsuitThe iconic swish of ’90s-inspired parachute pants is like an audible time machine, triggering nostalgic vibes we’re fully into for travel days. Daily Practice by Anthropologie Messa Jumpsuit, $, available at AnthropologieMango Stripe-print Straight PantsThese poplin pants in a bold blue-and-white stripe are a first-class choice for travel days.Mango Stripe-print Straight Pants, $, available at MangoWe The Free Park Ave PantsLaidback and utility-driven, these cargo pants are built for travel days. An elastic waist keeps things comfortable, while roomy pockets stash essentials within reach.We The Free Park Ave Pants, $, available at Free PeopleDonni The Rib Kick FlareLean into the butter yellow trend with these kick flares (that went viral for a reason) — perfect for a travel day en route to your sunny beach escape.Donni The Rib Kick Flare, $, available at DonniGap Stripe-print Straight PantsA jeans look with airy, pajama comfort. Gap Cotton Gauze Denim Easy Barrel Pants, $, available at GapJ.Crew New Soleil PantNothing says summer travel quite like these printed wide-legs. J.Crew New Soleil Pant, $, available at J.CrewQuince 100% Organic Cotton Gauze Straight Leg PantsWith a relaxed fit and an adjustable waist, these gauzy pants are equal parts comfort and cool for travel days and beyond.Quince 100% Organic Cotton Gauze Straight Leg Pants, $, available at QuinceLululemon Dance Studio Relaxed-Fit Mid-Rise Cargo Pant Pockets make the difference between good travel pants and great ones. This mid-rise cargo style from Lululemon ticks all the right boxes, blending travel-day function with comfy style. Lululemon Dance Studio Relaxed-Fit Mid-Rise Cargo Pant, $, available at LululemonBuck Mason Surplus Rib Weekender PantLightweight, ribbed, and featuring a wide waistband for a long travel day — we love to see it. Bonus: They are editor-approved.Buck Mason Surplus Rib Weekender Pant, $, available at Buck MasonReformation Ethan Linen PantThe type of summer vacation pants you can wear on the plane and feel perfectly put-together in at your destination.Reformation Ethan Linen Pant, $, available at ReformationDamson Madder Tatianna CulotteRoomy, crisp, and utility-coded, these high-waist culottes guarantee a comfy in-flight snooze while looking polished straight off the plane. Damson Madder Tatianna Culotte, $, available at Damson MadderAbercrombie Essential Wide Leg Sunday SweatpantSometimes, you just need to travel in sweats. These make the vibe a lot more put-together. Abercrombie Essential Wide Leg Sunday Sweatpant, $, available at AbercrombieMadewell Pull-On Barrel PantsA bright, linen barrel leg for summer travel? Please and thank you. Madewell Pull-On Barrel Pants, $, available at MadewellOFFLINE By Aerie Real Me Xtra TrouserMeet the Aerie Xtra Trouser: buttery-soft with a super-wide waistband that hugs comfortably and a wide leg to balance a fitted top. Pair it with an oversized shirt or classic sweater for a non-try-hard, polished vibe.OFFLINE by Aerie Real Me XTRA High Waisted Trouser, $, available at AerieOld Navy High-Waisted Playa Wide-Leg PantsWhen your travel day calls for comfort and personality, these drapey wide-leg pants deliver both.Old Navy High-Waisted Playa Wide-Leg Pants, $, available at Old NavyAnn Taylor The Tie Waist Wide-Leg PantAs smart as they are roomy, these pants ensure you’ll at least look the part of a business class upgrade.Ann Taylor The Tie Waist Wide-Leg Pant, $, available at Ann TaylorCaslon Wide Leg Linen PantsPajama-level swish meets go-anywhere polish. These linen-blend wide-legs are as easy as they are elevated.Caslon Wide Leg Linen Pants, $, available at nord, NordstomEverlane The Dream PantWrinkle-resistant and business-ready (thanks to the pintuck detailing), these cotton-blend pants rival the comfort of your favorite sweats.Everlane The Dream Pant, $, available at EverlaneUniversal Standard Iris Linen Blend Pull-On PantsLight, minimal, and made for breezing through travel (even when the journey gets stressful).Universal Standard Iris Linen Blend Pull-On Pants, $, available at NordstromThe Group Haven PantThese high-rise pull-on pants keep you cool and comfortable on the move. The sweat-wicking fabric feels sleek, while the relaxed, wide-leg fit makes long hours easier.The Group Haven Pant, $, available at AritziaDôen Hilaire PantThese vintage-inspired palazzo pants offer retro charm with ease. The horn button detail at the high waistband adds to their timeless character.Dôen Hilaire Pant, $, available at DôenCozy Earth Studio Cropped Wide Leg PantYour basic jogger is shaking. A bold drawstring and cropped, wide-leg fit just raised the bar.Cozy Earth Studio Cropped Wide Leg Pant, $, available at Cozy EarthSPANX AirEssentials Brushed Straight Leg PantComfort meets polish: These straight-leg pants have a silky-soft feel, four-way stretch, and pintuck details for a more refined travel look — perfect for long-haul flights, road trips, and beyond. SPANX AirEssentials Brushed Straight Leg Pant, $, available at SPANXLike what you see? How about some more R29 goodness, right here?The 26 Best Weekender Bags For Long-Weekend TravelThe Best Black Leggings The Internet Has To Offer32 Jet-Set Travel Accessories For Smooth Journeys",
    "author": "Laura Lajiness Kaupke",
    "published": "Fri, 30 May 2025 21:06:40 +0000",
    "image": "https://www.refinery29.com/images/11899620.png?auto=webp\u0026width=1450\u0026height=2175\u0026quality=85\u0026crop=2:3",
    "source": "https://www.refinery29.com/fashion/rss.xml",
    "categories": null
  },
  {
    "id": "c733d25f-cad8-457e-af05-e6d18af7b5f2",
    "title": "The Best Sneakers to Shop, Including Editor Picks as Low as $16",
    "link": "https://www.popsugar.com/fashion/Best-Women-Sneakers-44311634",
    "description": "Being comfortable in your own shoes never goes out of style, so investing in a top-tier sneaker collection is always a smart idea. When it comes to picking out the best sneakers, we look for a few key elements: good sneaker design, quality materials, and the perfect fit - because who wants to be uncomfortable? Our editors test out so many different types of shoes to provide you with the best product recommendations, and we boast a particular expertise on sneakers (call us sneakerheads, if you will). Love some casual, everyday sneakers? We've got you covered. Prefer sportier, performance sneakers for working out? We found those, too. And of course, if you're looking for cute sneakers that you can dress up for work, we've tried our fair share. To help you find the best women's sneakers to add to your wardrobe, we enlisted our expert editors, along with a handful of celebrities we've interviewed - like Kate Hudson, Ashley Graham, and Ayesha Curry - for their masterful recommendations of the best women's sneakers for 2025. These picks cover a range of styles, so you're bound to find your perfect shoe. What to Look For in the Best Women's Sneakers Whether you want something modern and playful or sleek and classic, we've uncovered the best of the best trending this year, and we'll tell you all the reasons we love these stylish sneakers. The styles fall into a number of different design categories, including: best trendy sneakers, best sustainable sneakers, best athletic sneakers, best high-top sneakers, best white sneakers, best classic sneakers, and best sneakers for walking. At the moment, fashion forecasters predict sporty dad sneakers will continue to be big throughout 2025 - particularly styles from brands like New Balance and Adidas. In an homage to the '90s and early aughts, chunky platform sneakers are also being embraced by stylists and celebrities alike - as showcased via New York Fashion Week street style. And the newly debuted Reebok Classic AZ Shoes are primed to be the hottest everyday sneaker this year, thanks to its neutral palette that's easy to style with a range of outfits. Our own sneaker recommendations tout brands like Nike, Converse, Puma, and more. Word of advice: your shoe closet is about to get a whole lot fuller, so make some extra room. Keep reading to shop our guide to the best sneakers for women.",
    "author": "Kyley Warren",
    "published": "Mon, 02 Jun 2025 10:00:11 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/ekAjhEeYVeZdL-eiSuEF3jOvroU/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2024/07/15/814/n/1922564/e206170366956b2cdc7058.76569337_.jpg",
    "source": "https://www.popsugar.com/fashion/feed",
    "categories": [
      "Fashion Shopping",
      "Editor's Pick",
      "Must Haves",
      "Sneakers",
      "Shopping",
      "Shoes"
    ]
  },
  {
    "id": "104e233d-2255-4269-92f1-e920a7f9d32d",
    "title": "The \"And Just Like That\" Outfits I Can't Stop Thinking About - Shop My Favorites",
    "link": "https://www.popsugar.com/fashion/and-just-like-that-outfits-fashion-49192011",
    "description": "Plenty of \"And Just Like That\" spoilers are lurking below, FYI. You can't tell the story of \"Sex and the City\" and its revival/sequel \"And Just Like That\" without spending an inordinate amount of time discussing the fashion. Over the course of the original show's six seasons, Carrie Bradshaw became a universal style icon. She inspired generations of women to waltz around New York City in tulle dresses, all while carefully dodging potholes in their Manolo Blahnik pumps. Styled by the inimitable Patricia Field, Bradshaw (played by Sarah Jessica Parker) delighted in getting dressed. Her style was quirky, vibrant, romantic: she'd stop by McDonald's in a pink Oscar de la Renta frock or go wedding-dress shopping with a belt tied around her bare stomach. Throughout the series, as well as in the three \"Sex and the City\" movies that followed, Field and Parker set trends, launched design careers into the stratosphere, and created an endless stream of iconic looks. Now, the \"And Just Like That\" outfits aim to carry on that legacy. Image Source: HBO [Carrie Bradshaw] inspired generations of women to waltz around New York City in tulle dresses, all while carefully dodging potholes in their Manolo Blahnik pumps. With costume designers Molly Rogers and Danny Santiago on board, Carrie still enjoys fashion on \"And Just Like That,\" but the writers also use it as a mechanism to communicate her state of mind. When she wore a tulle skirt and black headpiece to Big's funeral in season one, it was to make her late husband proud. Later, as she started to date and feel like herself again, she was back in a Norma Kamali ruched blue dress that fit impeccably well; it's so quintessentially her that fans dubbed it the \"Carrie dress.\" Likewise, in season three, she steps out in a quirky Strawberry Shortcake-style hat that has the internet divided, much like that time she almost got married with a bird on her head. The message? Bradshaw is officially back and in her element (we hope). Image Source: HBO Fashion is obviously sacred to Bradshaw, but other characters have memorable style moments as well. Miranda Hobbes's colorful halter dress and Seema Patel's leopard look from season one could've been right at home in the original series. In season two, the characters dressed up to attend the fictitious, \"Veiled Beauty\"-themed Met Gala: Lisa Todd Wexley in a breathtaking red Valentino gown and Charlotte York Goldenblatt in a bold corset top and skirt. At times, their looks carry a greater significance. Think of Rock Goldenblatt's unconventional styling of their Oscar de la Renta dress as they prepared to share their gender identity with their parents in season one. Or Miranda's uncharacteristically sexy halter jumpsuit as she stepped outside a stale marriage to flirt with Che Diaz at the bar. In season three, Patel's impossibly chic white fringe dress proved she had no business scouting movie locations all day while Todd Wexley's quirky, oversize ball necklace is a nod to her penchant for thinking outside-the-box, a trait that clashes with her unimaginative documentary producers. Ahead, check out the best \"And Just Like That\" outfits so far - and shop the best fashion from season three.",
    "author": "Jessica Andrews",
    "published": "Sun, 01 Jun 2025 10:05:00 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/q95nfI7sRXLETqOGQx8WuR1s6A4/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2025/06/01/625/n/1922564/c473e7c6163a9163_sarah-jessica-parker_3.jpg",
    "source": "https://www.popsugar.com/fashion/feed",
    "categories": [
      "Celebrity Style",
      "And Just Like That",
      "Screen Style"
    ]
  },
  {
    "id": "4f99237a-0fbe-4eea-a534-f3738d56f93c",
    "title": "Dress Code: Fieldstate",
    "link": "https://www.fashionbeans.com/article/fieldstate/",
    "description": "",
    "author": "FashionBeans Editors",
    "published": "Mon, 02 Jun 2025 16:51:21 +0000",
    "image": "",
    "source": "https://www.fashionbeans.com/rss-feed/?category=fashion",
    "categories": [
      "Dress Code"
    ]
  },
  {
    "id": "21faf201-e63c-4986-aeba-154e9645e06b",
    "title": "EVERYDAY CARRY: Accumulator",
    "link": "https://www.fashionbeans.com/article/accumulator/",
    "description": "",
    "author": "FashionBeans Editors",
    "published": "Mon, 02 Jun 2025 15:59:21 +0000",
    "image": "",
    "source": "https://www.fashionbeans.com/rss-feed/?category=fashion",
    "categories": [
      "Everyday Carry"
    ]
  }
]
