[
  {
    "id": "5dc87d5b-c98b-4c08-993a-5e055142ebd5",
    "title": "Bella Hadid Wore the Pants Trend L.A.’s Chicest Women Wear Instead of Skinny Jeans",
    "link": "https://www.whowhatwear.com/fashion/celebrity-style/bella-hadid-leather-pants-outfit",
    "description": "My other style muse just did, too.",
    "author": "",
    "published": "Thu, 12 Dec 2024 00:54:02 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/gDMuvwgBRdUELWNGjuqQU.jpg",
    "source": "https://www.whowhatwear.com/rss",
    "categories": [
      "Celebrity Style",
      "Fashion",
      "Celebrity"
    ]
  },
  {
    "id": "856ef9e6-595c-4e3f-8bb5-3ca4503bb253",
    "title": "Hillary Kerr Shares the Timeless Jewelry Collection at the Top of Her Holiday Wish List",
    "link": "https://www.whowhatwear.com/fashion/jewelry/hillary-kerr-holiday-jewelry",
    "description": "Celebrate love with HardWear by Tiffany.",
    "author": "",
    "published": "Thu, 12 Dec 2024 00:23:10 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/j8tX7GeQivREwW5B6Afd9N.jpg",
    "source": "https://www.whowhatwear.com/rss",
    "categories": [
      "Jewelry",
      "Fashion",
      "Shopping"
    ]
  },
  {
    "id": "31cb1c3e-d76f-4980-92fb-4df7f795b503",
    "title": "In His Decade at Maison Margiela, John Galliano Brought Back Old-School Runway Theatrics",
    "link": "https://www.elle.com/fashion/a63160935/john-galliano-maison-margiela-legacy-explained/",
    "description": "Fashion’s greatest showman.",
    "author": "",
    "published": "Wed, 11 Dec 2024 20:32:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/fashion.xml/",
    "categories": null
  },
  {
    "id": "d6404d8c-404e-4066-bdd3-1b31dfb09da5",
    "title": "10 Timeless New Year’s Styles You’ll Actually Wear Again",
    "link": "https://www.elle.com/fashion/g63092183/amazon-luxury-stores-new-years-outfits/",
    "description": "No cheesy glitz here.",
    "author": "",
    "published": "Wed, 11 Dec 2024 20:00:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/fashion.xml/",
    "categories": null
  },
  {
    "id": "eb7a1b32-ec3c-4a53-8265-b37856cac1ca",
    "title": "Paul Mescal sells clothes on Vinted to raise money for Irish charity",
    "link": "https://www.theguardian.com/culture/2024/dec/10/paul-mescal-sells-clothes-on-vinted-to-raise-money-for-irish-charity-pieta",
    "description": "Fans of Gladiator II star can choose from knitwear items, vintage T-shirt and Jimmy Choo bootsFirst the chain he wore in Normal People gained a cult following, then he went viral for the tiny shorts he’d been papped wearing while running through London and Dublin.Paul Mescal’s latest fashion fixation is the cardigan, and fans will no longer have to admire them from afar or flock to buy the same pieces before they sell out, as he has started selling off clothes to raise money for charity. Continue reading...",
    "author": "Mabel Banfield-Nwachi",
    "published": "Tue, 10 Dec 2024 20:23:19 GMT",
    "image": "",
    "source": "https://www.theguardian.com/fashion/rss",
    "categories": [
      "Paul Mescal",
      "Fashion",
      "UK news",
      "Ireland"
    ]
  },
  {
    "id": "007cf081-b0dd-4888-bab0-a02a622f8ea6",
    "title": "Party heels: 20 of the best – in pictures",
    "link": "https://www.theguardian.com/fashion/gallery/2024/dec/07/party-heels-20-of-the-best-in-pictures",
    "description": "Metallic and colourful party heels for dancing the night away Continue reading...",
    "author": "Jo Jones and Helen Seamons",
    "published": "Sat, 07 Dec 2024 23:50:38 GMT",
    "image": "",
    "source": "https://www.theguardian.com/fashion/rss",
    "categories": [
      "Fashion",
      "Life and style",
      "Women",
      "Women's shoes",
      "Accessories"
    ]
  },
  {
    "id": "b79ecc31-beda-44e7-b522-1e6725575430",
    "title": "It's Official: John Galliano Is Leaving Maison Margiela",
    "link": "https://fashionista.com/2024/12/john-galliano-leaves-maison-margiela",
    "description": "John Galliano is departing from Maison Margiela after 10 years as the brand's creative director. In late July, Astrid Wendlandt of Paris-based media company Miss Tweed first reported that Galliano chose not to renew his five-year contract with Maison Margiela (ending in October, per ...Continue reading",
    "author": "Fashionista",
    "published": "Wed, 11 Dec 2024 18:05:46 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjA4MDMxOTk4MDIxNzM5OTcz/john-galliano-maison-margiela.jpg",
    "source": "https://fashionista.com/.rss/excerpt/",
    "categories": [
      "Maison Margiela",
      "John Galliano",
      "Margiela",
      "News",
      "Maison Margiela",
      "John Galliano",
      "Designers",
      "Network",
      "OTB"
    ]
  },
  {
    "id": "28f34112-9334-41e6-bdb6-0bbe8eb1d5ea",
    "title": "Must Read: Adidas Confirms Customs Raid, Temu Seeks To Expand Premium Brand Offerings",
    "link": "https://fashionista.com/2024/12/adidas-confirms-customs-raid",
    "description": "These are the stories making headlines in fashion on Wednesday. Tax and customs officials raided the Adidas headquarters and other locations in Germany on Tuesday, confirmed the brand. The raid was a part of an ongoing investigation into the company's customs and tax regulation compliance ...Continue reading",
    "author": "Emma Greene",
    "published": "Wed, 11 Dec 2024 17:02:47 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjExMzI1NzY1NDkxMzY5MTE5/adidas-confirms-tax-raid.jpg",
    "source": "https://fashionista.com/.rss/excerpt/",
    "categories": [
      "Skims",
      "Network",
      "Skims",
      "Macy's",
      "Temu",
      "Adidas",
      "Adidas",
      "News"
    ]
  },
  {
    "id": "e35bfcdd-e2b0-40fe-a6a6-b80b1612b8b4",
    "title": "Can You Copyright a Vibe?",
    "link": "https://www.nytimes.com/2024/12/05/style/clean-girl-aesthetic-influencer-lawsuit.html",
    "description": "One influencer is suing another, accusing her of copying her minimalist aesthetic on social media. It turns out there is a lot of gray area in shades of beige.",
    "author": "",
    "published": "Sat, 07 Dec 2024 16:43:18 +0000",
    "image": "https://static01.nyt.com/images/2024/11/19/fashion/00AESTHETICS-TRIAL-top/00AESTHETICS-TRIAL-top-mediumSquareAt3X.png",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/FashionandStyle.xml",
    "categories": [
      "Intellectual Property",
      "Copyrights and Copyright Violations",
      "Social Media",
      "Law and Legislation",
      "Suits and Litigation (Civil)"
    ]
  },
  {
    "id": "645e5d84-729b-495e-8724-3694cfaafdcf",
    "title": "Female Designers Reinterpret Jordan’s Jewelry Heritage",
    "link": "https://www.nytimes.com/2024/11/28/fashion/jewelry-women-designers-jordan-heritage.html",
    "description": "In tandem with their careers as architects, artists and the like, women are creating special pieces in the country’s capital, Amman.",
    "author": "",
    "published": "Thu, 28 Nov 2024 10:00:22 +0000",
    "image": "https://static01.nyt.com/images/2024/11/29/multimedia/29sp-jewelry-amman-inyt-07-fhqc/29sp-jewelry-amman-inyt-07-fhqc-mediumSquareAt3X.jpg",
    "source": "https://rss.nytimes.com/services/xml/rss/nyt/FashionandStyle.xml",
    "categories": [
      "Jewels and Jewelry",
      "Bedouins",
      "Rania, Queen of Jordan",
      "Amman (Jordan)",
      "your-feed-fashion"
    ]
  },
  {
    "id": "fbc5777d-c409-409d-9ca4-b62b0c78305d",
    "title": "Keep The Cold At Bay With The Trendiest Winter Jackets \u0026 Coats For Women",
    "link": "https://www.refinery29.com/en-us/best-winter-jackets-for-women?utm_source=feed\u0026utm_medium=rss",
    "description": ".disclaimer{width:90%;margin-bottom:1rem}.disclaimer__lines{width:100%;margin:0 auto;border-bottom:1px solid #999;padding:0;max-width:150px}.disclaimer__copy{width:100%;max-width:355px;font-family:Brown Regular,sans-serif;font-size:.9rem;font-weight:300;line-height:1.3em;color:#333;padding:0 0 .4rem;margin:1rem auto;text-align:center} All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. Winter jackets are practical, but the best ones aren’t a supporting act — they’re the main character, serving as the outfit. That’s why we’re all about layering up in outerwear that delivers warmth and wow factor. Whether you’re leaning into the coziness of a sherpa coat or the sporty edge of a puffer, the right winter topper can transform even the simplest look into a moment. This season, the top coat is getting a modern twist with ladylike details and cape silhouettes, while classics like suede jackets and wool coats hold their ground (though not without fresh updates — we see you, scarf jackets). Trends like the utilitarian barn jacket and bombers are vying for the spotlight, too, feeling particularly on-point in less brutal climates. (Hello, LA winter.) As far as specific items go, fan favorites like the Aritzia slouch coat, the North Face puffer, and Lululemon puffer jacket prove that staying warm doesn’t mean compromising on style. For those craving luxe touches, a Zara fur coat, teddy-like UGG coat, and Barbour wax jacket offer elevated spins on seasonal staples. Whether you’re bundling up, keeping it tailored, or planning out party outfits, our picks ahead make braving the cold downright fun. DashDividers_1_500x100 Faux-Fur Coats Nothing says winter glamour like a faux-fur coat. From Zara’s cropped silhouette to Ganni’s playful leopard print, these jackets balance boldness with cozy comfort. They’re perfect for pairing with denim or a party dress. DashDividers_1_500x100 Puffer Jackets The puffer jacket is a winter essential that’s equal parts cozy and cool. From The North Face’s iconic 1996 Retro Nuptse to Lululemon’s sleek transformable design and Hollister’s faux-fur-lined option, these go with everything, from comfy travel pants to festive outfits (or sweats when you’re keeping it lounge-y). Fully lean into the vibe with coordinating puffer boots — bold, baby.  DashDividers_1_500x100 Sherpa Coats Sherpa coats bring a plush, textural twist to cold-weather layering. From statement designs like Oak + Fort’s checkered style to timeless teddy silhouettes like UGG’s Gertrude, they’re ideal for adding warmth and personality to your winter wardrobe. And if you’ve been eyeing the ever-popular Aritzia wool coats, a nubby sherpa version is the ultimate upgrade. DashDividers_1_500x100 Barn Jackets The barn jacket brings a workwear-inspired twist to winter wardrobes. From Barbour’s classic waxed version to Alex Mill’s modern red take, these balance pragmatism and style. We love them layered over chunky knits or paired with tailored separates for contrast. DashDividers_1_500x100 Ladylike Wool Coats Curved lines, sharp collars, and sleek details give classic wool coats a fresh spin this season. Look at Reformation’s bow-tied jacket or Madewell’s bold red design — they’re ladylike, minimal, and anything but boring (especially if you go bold by styling yours alongside the dress-over pants trend).  DashDividers_1_500x100 Leather Coats Leather coats are a closet mainstay for a reason: They do the most (in a good way). Plush-lined styles (like Abercrombie’s utility trucker) bring serious warmth for frigid days, while lightweight options (like Wray’s vegan leather blazer) are just the thing for milder temps. DashDividers_1_500x100 Cape Coats Cape coats are one of those runway trends that are actually wearable IRL. From Dôen’s plaid take to Banana Republic’s bright red number (hitting two trends at once), these styles deliver drama with a polished sensibility. DashDividers_1_500x100 Scarf Coats Scarf coats are multitaskers, keeping you warm without the fuss of extra layers. They’re a great outfit hack for dialing up any look — even jeans and sweatsuits. DashDividers_1_500x100 Suede Jackets Suede jackets are stepping it up with fun, vibrant shades this winter, like Urban Outfitters’ cobalt blue style. A classic refreshed for those who like their layers with a little more personality. DashDividers_1_500x100 Bomber Jackets Bomber jackets are getting a sport-luxe makeover with padded and quilted designs (perfect for brisk chills), slouchy faux leather (bonus points for trendy colors like burgundy), and even reversible options (who doesn’t love a two-fer?). Style them over clingy knits with jeans and a statement belt for an “I tried, but not too hard” nonchalance. Like what you see? How about some more R29 goodness, right here?The 30 Best Winter Dresses For Every OccasionBundle Up In These 18 Cozy Puffer Jackets28 Holiday Party Dresses For Winter Soirées",
    "author": "Jinnie Lee",
    "published": "Wed, 11 Dec 2024 18:50:52 +0000",
    "image": "https://www.refinery29.com/images/11827593.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/fashion/rss.xml",
    "categories": null
  },
  {
    "id": "d8dbd328-0295-45d4-972b-ced5e5485e91",
    "title": "28 Fashion Gifts For Every Budget: From Under $50 To $500",
    "link": "https://www.refinery29.com/en-us/best-fashion-gifts-every-budget?utm_source=feed\u0026utm_medium=rss",
    "description": ".disclaimer{width:90%;margin-bottom:1rem}.disclaimer__lines{width:100%;margin:0 auto;border-bottom:1px solid #999;padding:0;max-width:150px}.disclaimer__copy{width:100%;max-width:355px;font-family:Brown Regular,sans-serif;font-size:.9rem;font-weight:300;line-height:1.3em;color:#333;padding:0 0 .4rem;margin:1rem auto;text-align:center} All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. This holiday season, we’ve found the gifts that feel great to get and even better to give. Shop Well-Received, our collection of editor-approved holiday gift guides, here.Whether you’re buying fashion presents for your entire extended family or just your nearest and dearest, you likely have a holiday shopping budget. Keeping that in mind, we sourced style-minded gifts for every price range. From a $30 bag charm (a major trend this year!) to $350+ silk sleepwear, these gift ideas will delight any fashion-loving recipient, regardless of the number on the tag. We’ve included a range of coveted accessories (see: trendy sneakers and statement jewelry) and winter clothing (including oversized scarves and some of the season’s most exciting designer collaborations), plus, unexpected and super-aesthetic homeware (like coffee table books and quirky vases).So, whether you’re looking for under-$50 finds for friends and coworkers or are ready to splurge on a luxury gift for that special someone, tick people off your gifting list here.  DashDividers_1_500x100 Fashion Gifts Under $50 If you’ve been searching for luxe gifts that only look expensive, we’ve got you — from Western styles and leopard-printed earmuffs to jelly shoes that hit on 2024’s biggest trend list. Want to elevate your giftee’s everyday accessories and tech? Cart up a bag charm (maybe several for a stacked moment) or a phone case in a trending cow print.  DashDividers_1_500x100 Fashion Gifts Under $150 With a slightly roomier budget, you can snag a pair of ever-popular Adidas Sambas sneakers or a limited-edition Christopher John Rogers x J.Crew hat. You can also explore higher-quality jewelry and premium sweatshirts. For the fashion-obsessed, expand their “Little Book Of” series with a new addition. And, if you want something more tongue-in-cheek for the most in-the-know, consider an heirloom tomato-scented candle that nods to this year’s viral Loewe tomato moment. DashDividers_1_500x100 Fashion Gifts Under $350 An increased price range brings more options worthy of your dollars. Help your giftee explore the must-have barn jacket trend — or, rather than clutching their pearls from being on the receiving end of an underwhelming present, they’ll love a vase that’s cinched with pearls. We’ve also curated accessories like statement belts, leather watches, silk headbands, and furry scarves from fashion insider-approved brands. DashDividers_1_500x100 Fashion Gifts Under $500 For that special someone in your life, there are endless splurge-worthy luxury gift possibilities. Our top picks under $500 include celebrity-approved sunglasses and playful handbags. If a Gucci or Dior bag is out of budget, consider gifting them a perfume or glassware set from their favorite luxury brand instead. For out-of-range men’s watches, a sterling silver bangle is a trendy alternative. Like what you see? How about some more R29 goodness, right here?The Best Fashion Gifts for Every Stylish Friend26 Under-$50 Gifts To Impress Everyone28 Luxe Gifts For The Favorite People On Your List",
    "author": "Victoria Montalti",
    "published": "Wed, 11 Dec 2024 17:56:05 +0000",
    "image": "https://www.refinery29.com/images/11827829.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/fashion/rss.xml",
    "categories": null
  },
  {
    "id": "07203d3c-6085-47a6-ae6a-eb1d72a5dfa7",
    "title": "Those Two Lines on Your Denim Jacket: A Levi’s Denim Jacket History",
    "link": "https://www.fashionbeans.com/article/levis-denim-jacket-history/",
    "description": "The Mystery of the Two Lines: What Are These Even For? What’s up, nerds? It’s Michael! Welcome back to The Iron Snail. Let’s get into the mystery of the Levi’s lines. The only way to figure out why these Levi’s denim jacket lines exist is to purchase over $5,000 in vintage denim jackets. Then, of … Continue reading Those Two Lines on Your Denim Jacket: A Levi’s Denim Jacket History →",
    "author": "Michael Kristy from The Iron Snail",
    "published": "Wed, 11 Dec 2024 17:46:02 +0000",
    "image": "",
    "source": "https://www.fashionbeans.com/rss-feed/?category=fashion",
    "categories": [
      "Men's Fashion"
    ]
  },
  {
    "id": "b9e0d1b1-9584-4252-b030-37a9df7a26fd",
    "title": "How Jeans Should Fit: Why Everything You Know About Sizing Is Wrong",
    "link": "https://www.fashionbeans.com/article/how-jeans-should-fit/",
    "description": "Understanding Fit vs. Style: The Basics The most vital thing we must understand is that there is fit and there is style. These two terms are often conflated, but to understand style, you must first understand fit – the black-and-white, yes and no decision, the only real thing we can say objectively. Some pants are … Continue reading How Jeans Should Fit: Why Everything You Know About Sizing Is Wrong →",
    "author": "Michael Kristy from The Iron Snail",
    "published": "Wed, 11 Dec 2024 17:32:45 +0000",
    "image": "",
    "source": "https://www.fashionbeans.com/rss-feed/?category=fashion",
    "categories": [
      "Men's Fashion"
    ]
  },
  {
    "id": "76d9dd01-c87e-4dd7-b508-8942507bdd11",
    "title": "I Tried JNCO's Viral '90s Jeans - and They're as Heavy as They Look",
    "link": "https://www.popsugar.com/fashion/jnco-jeans-90s-review-49418354",
    "description": "I've always been a wide-leg denim person. Sunsetting skinny jeans from my wardrobe was honestly one of the smartest moves I've ever made. But JNCO (which stands for \"Judge None Choose One\") brings a whole new meaning to wide-leg jeans. Originally founded by Jacques Yaakov Revah and Haim Milo Revah in 1985, the label became a beloved '90s brand for skate, rave, and street cultures. The shape of these pants, with their oversize pockets and pooling material that grazed the floor, was inherently triangular. Many of them featured graffiti-like patches - with the signature logo following suit - colorful flaps, and contrast stitching to make a statement. Today, Milo and his daughter Camilla are successfully revitalizing JNCO, working alongside original designer Silvio Marceca to showcase the brand's roots while expanding into women's jeans. JNCO's also embracing sustainability and appealing to the eco-conscious customer by incorporating vintage pieces in the lineup. When I caught wind of JNCO's resurgence - celebrities including Billie Eilish, Justin Bieber, and Post Malone have been wearing them proudly, according to Camilla - I figured trying them would be my ultimate test: When it comes to jeans, just how wide am I willing to go? [I] felt like I was channeling a healthy mix of Avril Lavigne, Ginger Spice, and every boy band in the '90s. I settled on two of the brand's most popular styles: the Easy Wide Pipes ($160), which is a more classic iteration, and the Hypnotix ($280), which features red and white wave panels down the side, making it a descendent of the Solid State collection. While I had a pretty solid handle on styling the Pipes silhouette, since they didn't feel as baggy as I expected, the Hypnotix definitely turned heads. I wore them with a cropped Disney tee to achieve ultimate nostalgia and felt like I was channeling a healthy mix of Avril Lavigne, Ginger Spice, and every boy band in the '90s. A waiter at the restaurant I went to even complimented the pants excitedly, then proceeded to invite me out dancing. \"I'll look for the jeans,\" he promised me with a wink! Ahead, you can read more about the comeback of these viral JNCO jeans, see my outfits, and decide if tapping into the trend is right for you. What Made JNCO Jeans Popular in the '90s? \"JNCO jeans are a symbol of rebellion and individuality,\" Camilla says. \"More than just denim, JNCO represents freedom, creativity, and bold self-expression.\" The brand's popularity surged even further when school districts banned them back in the '90s, cementing their \"youthful defiant\" status. Their shape was significantly more exaggerated than what was conventional at the time, and their artistic, graffiti-inspired embroideries were a mode of self-expression. Why Are JNCO Jeans Coming Back? If you're into fashion, you likely know that the thirst for '90s nostalgia is real, especially among Gen-Z. From Eilish's quintessential grunge aesthetic to Bieber's all-oversize-everything approach to dressing, celebrities are at the heart of JNCO's comeback, influencing TikTokers to embrace the look - down to keychains tugging at the belt loops. \"Younger generations are rediscovering our iconic wide-leg styles, while longtime fans are thrilled to see the return of a brand that's always stood for individuality,\" Camilla says, continuing, \"What sets JNCO apart is our commitment to artistry and subculture. From skate to graffiti to music, JNCO has deep roots in creative communities. Our designs - like the Tribals with their incredible graphics or the Mammoths with their daring proportions - aren't just nostalgic; they're bold, unapologetic, and unique in a way that other brands can't quite replicate.\" Current JNCO bestsellers include the Mammoth, with 40-inch leg openings, the Twin Cannons, Pipes, and Low Downs, according to Camilla. \"Since the brand's inception, these styles have defined our legacy in the world of denim and streetwear,\" she says. Image Source: PS Photography / Sarah Wasilak What I Like About JNCO Jeans As a big fan of '90s fashion, JNCO jeans feel ridiculously cool to me simply because they're different. While you already know I prefer a wide-leg silhouette - and these pants lend me all that and then some - they're also conversation starters. The oversize patches and logos on these jeans aren't itchy or uncomfortable whatsoever, and I find that the giant pockets - especially the ones at the back - actually add to the roomy feel of the pant leg. While the denim is structured, there's enough stretch to easily pull them up or down and move freely. How to Style JNCO Jeans I was pleasantly surprised by how seamlessly my two pairs of JNCO jeans fit into my wardrobe. Of course, balancing proportions is key, so I opted for a fitted top to allow the jeans their full volume. Camilla also suggests implementing this modern twist, but maybe adding some silver chains to mimic the old-school style. If you're going to layer, she recommends tailored blazers or bomber jackets for structure. And choosing the right footwear is a must. \"Chunky sneakers, combat boots, or platform shoes work perfectly with the oversize legs,\" she says. I wore Western boots with the Pipes to give them more polish, since these weren't as exaggerated in form, and chunky sneakers with the Hypnotix to impart a sporty vibe and also keep my balance in check given the weight of the pant legs - more on that ahead. What to Consider Before Buying JNCO Jeans When you first remove your JNCO jeans from their packaging, know that they may feel a little stiff at first and require some breaking in. After wearing the jeans for about an hour, they loosen up and even sway a bit at the hem with every step you take. Of course, this is also dependent upon which style you choose, as some pants have a wider opening than others. Scan the product page carefully for this info (it's all there in the description) and choose the correct inseam by measuring your current favorite pair of jeans that fit you well from the crotch seam to the bottom interior of the leg. There's also a helpful size calculator on the site to use as a resource. Most importantly, know that these jeans are heavy - at least, in comparison to your standard denim. My Hypnotix pair weighs over two pounds, whereas my classic Levi's are just over a pound. You can definitely sense the difference in mass when you're holding up the jeans in front of you, but once they're on, you sort of just succumb to their weight. Just think of it as an exchange for how friggin' cool you look. Where Can You Buy JNCO Jeans? JNCO's current stock is available to shop at jnco.com. You can also thrift some authentic vintage pairs on eBay, including the Mammoth ($2,300), Skate Phat Kangaroo ($375), Jesters ($1,000), and more. Rating Sarah Wasilak (she/her) is the associate director of Shopping at PS. With plenty of experience in the commerce market, a keen interest in SEO, and 10 years as an editor at the brand, she enjoys writing across the lifestyle and health-and-fitness categories. She has bylines at PS, InStyle, Elle, Refinery29, Who What Wear, Elite Daily, Byrdie, and The Quality Edit and aims to amplify minority voices in all her work.",
    "author": "Sarah Wasilak",
    "published": "Wed, 11 Dec 2024 09:33:02 -0800",
    "image": "https://media1.popsugar-assets.com/files/thumbor/bSXKKQjvrzevcvJsSiDo8ELjeA0/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2024/12/10/036/n/1922564/495dc6c96758d423cec702.08985636_.jpg",
    "source": "https://www.popsugar.com/fashion/feed",
    "categories": [
      "Product Reviews",
      "Fashion Shopping",
      "The '90s",
      "Pants",
      "Denim"
    ]
  },
  {
    "id": "8b2e2b6d-c8d4-48bc-a2dd-324867a87e63",
    "title": "Shop Our Favorite Picks From Abercrombie \u0026 Fitch While They're 30% Off",
    "link": "https://www.popsugar.com/fashion/best-new-abercrombie-clothes-sales-49248822",
    "description": "Who would have thought that our closets would be filled with Abercrombie \u0026 Fitch again?! Abercrombie has long been famous for its expansive collection of flattering jeans, which are editor-loved. But recently, the retailer went through a little makeover of its own; long gone are the days of logo-filled graphic T-shirts and limited denim offerings, now the brand is a haven for all types of fashion-lovers - and sizes. It's the best place to shop for everything from stylish, elevated basics to vintage-inspired looks, seasonal trends, and even wedding guest dresses. The brand is clearly back and better than ever, and if TikTok hasn't already convinced you to shop at Abercrombie, let us do that for you. From trendy tops and elevated dresses to comfortable, tailored bottoms, Abercrombie has become synonymous with effortlessly chic clothing. The brand carries everything you need for a fashion-forward closet. From classic denim to its flattering silhouettes and expanded size range, Abercrombie has something for everyone. Plus, if something doesn't fit quite right, or the color you've been eyeing is finally back in stock, the brand makes it convenient to file a return or exchange. Abercrombie \u0026 Fitch's Return Policy Abercrombie and Fitch has a return policy of 30 days from the date of the last shipment, as long as you have your receipt, invoice, or order confirmation. Returns received after the 30-day mark will be refunded in an e-gift card for merchandise credit. If you love a style but just need a different size or color, you can exchange it in store or online through this return portal. Active Abercrombie \u0026 Fitch Promo Codes and Sales Right now, you can get 30 percent off select styles ahead of the holidays for a limited time. You can also get an extra 15 percent off all coats and jackets, which is automatically applied at checkout. Plus, you can get free shipping when you spend $99 or more. We love browsing the site for the brand's newest arrivals and even scoring a deal or two on a few pieces. So we decided to make your life easier and rounded up our current favorite wardrobe essentials and dresses from Abercrombie, both new and on sale, so you know what's worth buying - especially for the winter. Keep reading to shop our top picks from Abercrombie \u0026 Fitch, or jump ahead to the category you're looking for. Shop Editor-Favorite Picks From Abercrombie \u0026 Fitch Shop Abercrombie \u0026 Fitch Dresses Shop Abercrombie \u0026 Fitch New Clothing",
    "author": "Anvita Reddy",
    "published": "Tue, 10 Dec 2024 11:29:02 -0800",
    "image": "https://media1.popsugar-assets.com/files/thumbor/adlijJGF1T0blJxWFuDuhdIRW30/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2024/10/23/829/n/1922564/c7b6024a6719463c10c400.92729926_.png",
    "source": "https://www.popsugar.com/fashion/feed",
    "categories": [
      "Abercrombie \u0026 Fitch",
      "Sales",
      "Fashion Shopping"
    ]
  }
]
