[
  {
    "id": "9621745c-df82-4172-ac1d-a6b73dae511c",
    "title": "I've Followed This Fashion Insider for Over 10 Years—8 Perfect Outfits I'll Love Forever",
    "link": "https://www.whowhatwear.com/fashion/street-style/best-jen-ceballos-outfits",
    "description": "Endlessly loving her style.",
    "author": "",
    "published": "Sun, 26 Jan 2025 17:03:10 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/YrU4aYDzomXm33oSAt6txj.jpg",
    "source": "https://www.whowhatwear.com/rss",
    "categories": [
      "Street Style",
      "Fashion",
      "Outfit Ideas"
    ]
  },
  {
    "id": "57910ab4-5110-4bb9-82c1-9002940365a3",
    "title": "What to Wear to Afternoon Tea: 9 Outfits That Embody Elevated Elegance",
    "link": "https://www.whowhatwear.com/fashion/outfit-ideas/afternoon-tea-outfits",
    "description": "Cheers!",
    "author": "",
    "published": "Sun, 26 Jan 2025 08:03:10 +0000",
    "image": "https://cdn.mos.cms.futurecdn.net/RE2DaLJr2jduZh2WtguebK.jpg",
    "source": "https://www.whowhatwear.com/rss",
    "categories": [
      "Outfit Ideas",
      "Fashion"
    ]
  },
  {
    "id": "5be66557-cf07-4814-a841-a62f272a6cbb",
    "title": "26 Top Picks From Abercrombie, Including “The White Lotus” Collection",
    "link": "https://www.popsugar.com/fashion/best-new-abercrombie-clothes-sales-49248822",
    "description": "Who would have thought that our closets would be filled with Abercrombie \u0026 Fitch again?! Abercrombie has long been famous for its expansive collection of flattering jeans, which are editor-loved. But recently, the retailer went through a little makeover of its own; long gone are the days of logo-filled graphic T-shirts and limited denim offerings, now the brand is a haven for all types of fashion-lovers - and sizes. It's the best place to shop for everything from stylish, elevated basics to vintage-inspired looks, seasonal trends, and even wedding guest dresses. Into football? You can shop the Abercrombie's official NFL collection ahead of the Super Bowl and sport your favorite team. If you're a fan of HBO Max's \"The White Lotus,\" you can also shop the brand's limited edition collection inspired by the show. It's filled with vacation-ready breezy pieces, including textured button down sets and sweatshirts. They also have collaborations with several Formula 1 teams, if you're into fast cars. The brand is clearly back and better than ever, and if TikTok hasn't already convinced you to shop at Abercrombie, let us do that for you. From trendy tops and elevated dresses to comfortable, tailored bottoms, Abercrombie has become synonymous with effortlessly chic clothing. The brand carries everything you need for a fashion-forward closet. From classic denim to its flattering silhouettes and expanded size range, Abercrombie has something for everyone. Plus, if something doesn't fit quite right, or the color you've been eyeing is finally back in stock, the brand makes it convenient to file a return or exchange. Abercrombie \u0026 Fitch's Return Policy Abercrombie \u0026 Fitch has a return policy of 30 days from the date of the last shipment, as long as you have your receipt, invoice, or order confirmation. Returns received after the 30-day mark will be refunded in an e-gift card for merchandise credit. If you love a style but just need a different size or color, you can exchange it in store or online through this return portal. Active Abercrombie \u0026 Fitch Promo Codes and Sales Right now, you can get 25 percent off nearly sitewide for a limited time. You can also get up to 50 percent off clearance. Plus, you can get free shipping when you spend $99 or more. We love browsing the site for the brand's newest arrivals and even scoring a deal or two on a few pieces. So we decided to make your life easier and rounded up our current favorite wardrobe essentials and dresses from Abercrombie, both new and on sale, so you know what's worth buying - especially for the winter. Keep reading to shop our top picks from Abercrombie \u0026 Fitch, or jump ahead to the category you're looking for. Shop Abercrombie \u0026 Fitch's \"The White Lotus\" Collection Shop Editor-Favorite Picks From Abercrombie \u0026 Fitch Shop Abercrombie \u0026 Fitch Dresses Shop Abercrombie \u0026 Fitch New Clothing",
    "author": "Anvita Reddy",
    "published": "Fri, 24 Jan 2025 14:25:02 -0800",
    "image": "https://media1.popsugar-assets.com/files/thumbor/adlijJGF1T0blJxWFuDuhdIRW30/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2024/10/23/829/n/1922564/c7b6024a6719463c10c400.92729926_.png",
    "source": "https://www.popsugar.com/fashion/feed",
    "categories": [
      "Abercrombie \u0026 Fitch",
      "Sales",
      "Fashion Shopping"
    ]
  },
  {
    "id": "093156d9-3bef-4c19-9f28-440f4aad30f4",
    "title": "3 Editors Test Drive Quince's Affordable Leather Jackets",
    "link": "https://www.popsugar.com/fashion/quince-leather-jacket-review-49423116",
    "description": "When it comes to fashion, whether you're minimalist, maximalist, or something entirely in between, there's one staple item you need in your wardrobe: a leather jacket. It's truly the Swiss army knife of clothing. There are plenty of different styles to choose from, including oversize, cropped, and motorcycle - just to name a few. You can dress it up or down, and whether you're wearing it for a date or throwing it on for a quick grocery store run, there's nothing like a well-worn leather jacket that is perfectly you. However, finding a high-quality leather jacket at a price that won't break the bank is no easy feat. Luckily, we think we found a brand that checks all of our boxes and has something for everyone, no matter what style you're seeking. Allow us to introduce you to Quince. Quince is all about offering high-quality items made with premium materials at an affordable price. How do they do it? The direct-to-consumer brand uses a factory-direct model and keeps costs low by cutting out the supply-chain middlemen. They make home and travel products, but right now, our editors couldn't be more obsessed with their leather jackets. Ahead, three editors put three different styles of Quince's 100-percent leather jackets to the test. You can check us out modeling different options, read about how they worked for us, and then use our tips to help you make your own purchase - we promise you won't regret it. Keep scrolling to read our honest thoughts.",
    "author": "Renee Rodriguez",
    "published": "Thu, 16 Jan 2025 11:55:02 -0800",
    "image": "https://media1.popsugar-assets.com/files/thumbor/bAbzECw4bnzyR2qOT9T-uHZngf4/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2025/01/15/049/n/1922564/a753b85967884eaf1cf5b6.23128874_.jpg",
    "source": "https://www.popsugar.com/fashion/feed",
    "categories": [
      "Product Reviews",
      "Vetted",
      "Fashion Shopping",
      "Jackets",
      "Leather"
    ]
  },
  {
    "id": "f3138c94-7ba4-4020-b116-e59ff3f4304a",
    "title": "These Leather Clutches Will Make You Rethink Your Handbag Game",
    "link": "https://www.elle.com/fashion/shopping/g63459280/best-leather-clutch-for-women/",
    "description": "Let these replace your everyday carry.",
    "author": "",
    "published": "Fri, 24 Jan 2025 21:32:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/fashion.xml/",
    "categories": null
  },
  {
    "id": "89d03261-efa1-4b54-abbc-d0a3a54128d6",
    "title": "Every Closet Needs At Least One Pair of Sock Boots",
    "link": "https://www.elle.com/fashion/shopping/g63499442/best-sock-boots-for-women/",
    "description": "It’s the versatile silhouette that’ll dress up any ensemble.",
    "author": "",
    "published": "Fri, 24 Jan 2025 19:35:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/fashion.xml/",
    "categories": null
  },
  {
    "id": "b4cf8438-5f37-46b4-b20c-4b00c404c964",
    "title": "Designers ‘afraid’ of getting on Trump’s wrong side … and still put Melania in that hat",
    "link": "https://www.theguardian.com/us-news/2025/jan/26/designers-afraid-of-getting-on-trumps-wrong-side-and-still-put-melania-in-that-hat",
    "description": "Fashion industry cosying up to new president over fears his ire – and tariffs – could snip profits, critics claimDonald Trump’s second presidency has sent shockwaves across industries since Monday – and fashion is no different. If, on the surface at least, the culture around fashion tends to skew centre left, this is is also ultimately a business about making money, and that means keeping the powerful onside.Major players showed their true colours last week. Among the tech billionaires and surprise celebrities at Trump’s inauguration was Bernard Arnault, the CEO of fashion conglomerate LVMH, with two of his children, Delphine and Alexandre. Trump’s daughter Ivanka, meanwhile, wore LVMH brand Dior, while Usha Vance (wife of JD) went for Oscar de la Renta. Though new first lady Melania wore relatively unknown designer Adam Lippes, her stylist Hervé Pierre told Women’s Wear Daily that more brands are now keen to dress her for the publicity, compared with the last time she was in the White House. Continue reading...",
    "author": "Lauren Cochrane",
    "published": "Sun, 26 Jan 2025 07:00:44 GMT",
    "image": "",
    "source": "https://www.theguardian.com/fashion/rss",
    "categories": [
      "Fashion",
      "Donald Trump",
      "Melania Trump",
      "Prada",
      "Ivanka Trump",
      "Dior"
    ]
  },
  {
    "id": "e3ed974f-40a4-48d6-a6cc-7a156fc9d6e0",
    "title": "The edit: the best pyjamas – in pictures",
    "link": "https://www.theguardian.com/fashion/gallery/2025/jan/25/the-edit-the-best-pyjamas-in-pictures",
    "description": "Turn bedtime into a treat with a pair of gloom-busting PJs Continue reading...",
    "author": "Helen Seamons",
    "published": "Sat, 25 Jan 2025 23:50:33 GMT",
    "image": "",
    "source": "https://www.theguardian.com/fashion/rss",
    "categories": [
      "Fashion",
      "Life and style",
      "Women's tops",
      "Women's trousers"
    ]
  },
  {
    "id": "c3bdf78a-b299-4ad5-bf82-d67330cd5a41",
    "title": "ICYMI: Aupen's Handbags Are Everywhere, Pat McGrath Makes It Easy to Recreate Her Margiela Makeup \u0026 Meruert Tolegen on Her 'Edgy' Designs",
    "link": "https://fashionista.com/2025/01/fashion-news-you-need-to-know-january-25",
    "description": "In case you missed them, we've rounded up our most popular stories of the week to help you stay in the loop. No need to thank us — just toast a mug of Earl Grey tea in our honor when you're discussing who did what over your English muffins. Homepage photo: Getty Images, Parkwood ...Continue reading",
    "author": "Fashionista",
    "published": "Sat, 25 Jan 2025 13:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjEyMjgwNzA4MjUxNTI2Nzg0/aupen-nirvana-handbag.png",
    "source": "https://fashionista.com/.rss/excerpt/",
    "categories": [
      "News",
      "ICYMI",
      "Network"
    ]
  },
  {
    "id": "b05c6b8c-e553-4297-8dcd-2c9caf95cdbb",
    "title": "Michele Marie PR IS HIRING – BEAUTY EDITORIAL SENIOR ACCOUNT EXECUTIVE IN NEW YORK",
    "link": "https://fashionista.com/2025/01/michele-marie-pr-is-hiring-beauty-editorial-senior-account-executive-in-new-york",
    "description": "A full-service bi-coastal public relations agency, Michele Marie PR offers an innovative approach to editorial, celebrity/influencer and event PR across fashion, beauty, wellness, and lifestyle categories. Female Founded and entering our 18th year in business averaging double digit growth each ...Continue reading",
    "author": "Winnie Liu",
    "published": "Fri, 24 Jan 2025 17:17:44 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MTgxMjk5MTQ1ODA4NTUzMDYz/pexels-pixabay-woman-1281830_1920.jpg",
    "source": "https://fashionista.com/.rss/excerpt/",
    "categories": [
      "Careers",
      "jobs",
      "How To Make It",
      "Job Listings",
      "Network",
      "Sponsored Content",
      "NYC Job Listings",
      "Michele Marie PR"
    ]
  },
  {
    "id": "a71d2060-1497-4f04-b07f-d3662a715023",
    "title": "6 Alternatives To Everyday Men’s Style Classics",
    "link": "https://www.fashionbeans.com/article/alternative-mens-style-classics/",
    "description": "Variety is the spice of life, they say. And nobody wants an unseasoned casserole. Novelty, experimentation and the unfamiliar make things interesting. Even a diet of fillet steak and Lafite Rothschild gets dull without the odd hamburger and Pepsi chucked in for good measure. Similarly, your wardrobe should maintain a fine balancing act between the … Continue reading 6 Alternatives To Everyday Men’s Style Classics →",
    "author": "Joe Bullmore",
    "published": "Sat, 25 Jan 2025 10:21:04 +0000",
    "image": "",
    "source": "https://www.fashionbeans.com/rss-feed/?category=fashion",
    "categories": [
      "Men's Style"
    ]
  },
  {
    "id": "d1f6f010-a661-4428-a4e3-17dc499aa610",
    "title": "Oppenheimer’s Hat: From Stetson Joke to Atomic Icon",
    "link": "https://www.fashionbeans.com/article/oppenheimers-hat/",
    "description": "Nolan’s Obsession with Oppenheimer’s Hat Christopher Nolan took Oppenheimer’s hat way more seriously than you may expect. You’ll notice that almost nobody else in the film is wearing a hat, despite it being a time in society when everybody wore a hat. That is due to Nolan’s request. Due to its unique design, Ellen Mirojnick, … Continue reading Oppenheimer’s Hat: From Stetson Joke to Atomic Icon →",
    "author": "Michael Kristy from The Iron Snail",
    "published": "Fri, 24 Jan 2025 20:19:19 +0000",
    "image": "",
    "source": "https://www.fashionbeans.com/rss-feed/?category=fashion",
    "categories": [
      "Men's Fashion"
    ]
  },
  {
    "id": "d3b3680a-919d-43e1-a779-e12e6c8bdc50",
    "title": "Feel Like A White Lotus Guest In This Abercrombie \u0026 Fitch Collab",
    "link": "https://www.refinery29.com/en-us/the-white-lotus-abercrombie-fitch-capsule-collection?utm_source=feed\u0026utm_medium=rss",
    "description": ".disclaimer{width:90%;margin-bottom:1rem}.disclaimer__lines{width:100%;margin:0 auto;border-bottom:1px solid #999;padding:0;max-width:150px}.disclaimer__copy{width:100%;max-width:355px;font-family:Brown Regular,sans-serif;font-size:.9rem;font-weight:300;line-height:1.3em;color:#333;padding:0 0 .4rem;margin:1rem auto;text-align:center} All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. Get excited, because it’s nearly time to check into The White Lotus hotel… well, kind of. The much-anticipated third season of HBO’s The White Lotus — starring Parker Posey, Walton Goggins, and more — premieres on February 16. Ahead of the launch, several fashion brands are releasing collaborations inspired by the fictional resort which is set in Thailand this season. This week, Abercrombie \u0026 Fitch joined the list with a loungey, resort-inspired capsule.  The limited-edition unisex collection features graphic crewnecks, relaxed T-shirts, textured short-sleeve button-ups, and a baseball cap. While some styles feature a cheeky “do not disturb” plea, others nod to the show’s newest locale. “Our customers love to travel and live for the luxury of a long weekend,” Abercrombie chief marketing officer, Carey Collins Krug, said in a press statement. “We loved the idea of combining our customer’s favorite styles with graphics inspired by the iconic and beachside luxury of The White Lotus.”  Alongside the collaboration, Abercrombie also released its new linen-cotton blend Breezy Shirts and Baggy Breezy Pull-On Pants to pair with the limited-edition styles and to round out your vacationwear. Whether you’re actually traveling to a luxe seaside getaway, or are planning to lounge luxuriously on your couch while watching the series, these styles deserve a spot in your weekender bag (or dresser drawer). All you have to do is click “add to bag” and wait for your dose of dopamine to arrive in the mail. Shop full Abercrombie \u0026 Fitch x The White Lotus capsule collection Like what you see? How about some more R29 goodness, right here?Anthropologie New Brand Celandine Has Plus SizesOur Favorite Looks From Free People's Spring DropVacation-Ready Looks Inspired By The White Lotus",
    "author": "Victoria Montalti",
    "published": "Fri, 24 Jan 2025 18:35:04 +0000",
    "image": "https://www.refinery29.com/images/11846359.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/fashion/rss.xml",
    "categories": null
  },
  {
    "id": "7b1515ee-a038-4bf0-90a6-bd7ffb5aa96f",
    "title": "The Freshest Spring Trends You Can Shop At Free People",
    "link": "https://www.refinery29.com/en-us/free-people-spring-clothing-trends?utm_source=feed\u0026utm_medium=rss",
    "description": ".disclaimer{width:90%;margin-bottom:1rem}.disclaimer__lines{width:100%;margin:0 auto;border-bottom:1px solid #999;padding:0;max-width:150px}.disclaimer__copy{width:100%;max-width:355px;font-family:Brown Regular,sans-serif;font-size:.9rem;font-weight:300;line-height:1.3em;color:#333;padding:0 0 .4rem;margin:1rem auto;text-align:center} All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. Spring may be months away, but that doesn’t mean we can’t start curating our warm-weather wardrobe — especially now that Free People dropped its latest campaign, which is a feminine, boho daydream come to life. This new collection offers a fresh, modern take on the retailer’s signature look, featuring lace-trimmed and floral-print tees paired with utilitarian staples like barn jackets (still a thing!) and cargo-pocketed carpenter shorts. There’s also a prep-school charm woven in via cardigans and polos, styled with loafers and knee-high socks, as well as perfectly slouchy denim and ’90s-inspired baby tees. Then, of course, there are vacation-ready pieces with an artisanal feel for those spring break escapes to somewhere sun-soaked.With standout looks from in-house labels like We The Free and free-est, Free People’s spring collection nails every vibe worth pinning to your mood board. Take a closer look at the campaign and shop the six key trends for the season ahead. DashDividers_1_500x100 Casual Romance  Sweet but not overly saccharine, these romantic styles are all about balancing feminine details with everyday ease. The lace-trimmed tanks and embroidered tees in so-soft fabrics are essentials for laid-back spring days. Prep Classics Prep-school polish gets a Free People twist — think cardigans and polos with more exaggerated fits and distinctive details (hello, eyelet collar), styled back to loafers and knee-high socks. It’s a nod to timeless collegiate charm, only with a fresh edge. Big, Bold Denim  The whispers of a skinny jeans resurgence won’t have us parting with baggy jeans just yet. Slouchy, oversized silhouettes still have our hearts, whether paired with baby tees or bikini tops. Utility From cargo-pocketed vests to barn jackets that add structure to breezy spring ‘fits, these staples blend practicality with low-key cool — perfect for grounding those floral-print, lace-trimmed tops. Vacation Ready These pieces are made for your next passport stamp. Featuring global-inspired prints and embroideries with an artisanal feel, these will be your spring break go-tos. Just add sun, SPF, and a woven tote. ‘90s Minimalism  Channel your inner Gwyneth or Jen with ’90s-inspired staples like baby tees and lace-trimmed slip skirts. These pared-back pieces are the ultimate blank slate for creative spring styling. Like what you see? How about some more R29 goodness, right here?24 Free People Gifts That Are Utterly DashingWhy This Free People Dress Is A Compliment-Magnet10 NYFW Spring 2024 Trends To Shop Right Now",
    "author": "Karina Hoshikawa",
    "published": "Thu, 23 Jan 2025 20:08:05 +0000",
    "image": "https://www.refinery29.com/images/11845109.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/fashion/rss.xml",
    "categories": null
  }
]
