{
  "id": "034d8356-6177-4e04-b9e0-02940467d007",
  "title": "The Ominous Phrase Denzel Washington Wrote On His Training Day Script",
  "link": "https://www.slashfilm.com/1743226/denzel-washington-training-day-script-ominous-phrase/",
  "description": "Denzel Washington wrote an ominous phrase on his copy of the Training Day script - one that he felt unlocked the entire movie.",
  "author": "Joe Roberts",
  "published": "Tue, 24 Dec 2024 23:45:18 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Drama Movies",
    "Thriller Movies"
  ],
  "byline": "Joe Roberts",
  "length": 6067,
  "excerpt": "Denzel Washington wrote an ominous phrase on his copy of the Training Day script - one that he felt unlocked the entire movie.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slash-film-favicon-448x448.png",
  "text": "Warner Bros. By the end of the '90s, Denzel Washington had seemingly done it all. After his breakout role in arguably the best Civil War film ever made, 1989's \"Glory,\" earned him an Oscar for best Supporting Actor, he went on to earn yet another Academy Award nomination for his performance in \"Malcom X\" in 1992 and \"The Hurricane\" in 1999. Throughout that time, he'd proven he was also more than capable of bringing his effortless charismas to less cerebral fare such as action thriller \"Crimson Tide\" and crime drama \"The Bone Collector.\" But by the end of the millennium there was still one thing Denzel had never done: play a bad guy. The actor was so naturally magnetic that it seems Hollywood never thought to waste such appeal on a villain, and so Denzel remained a good guy right up until 2001. That year, however, he fronted the film that would not only bring him his second Oscar win, but would also mark his transition to playing bad guys — and what a debut it was. \"Training Day\" was written by David Ayer, who injected the script with his real-world experiences of growing up in disadvantaged Los Angeles neighborhoods. Director Antoine Fuqua took things a step further in that respect, using real gangs and acual South LA locations to shoot the movie about a corrupt LAPD narcotics officer who takes a rookie cop out for a day of evaluation. But while Ayer and Fuqua's contributions were integral to creating what remains one of the best crime thrillers of the era, it was Denzel's unbridled commitment to his role, and the ease with which he flipped his charisma to create one of the great on-screen villains, that really made \"Training Day\" both a modern classic and one of Denzel's most rewatchable films. How did the man make that transition so seamlessly? A lot surely went into it, but it seemed to begin with one single phrase which he wrote on his copy of the \"Training Day\" script. Denzel summed up his first on-screen villain with a single phrase Warner Bros. When Denzel Washington was cast in \"Training Day,\" it created no shortage of controversy. The concern among such groups as The National Association for the Advancement of Colored People (NAACP) was that after building more than a decade of good will playing relatable, morally upstanding characters, Denzel was about to waste it all playing a truly despicable individual in the form of LAPD detective Alonzo Harris. But they needn't have been worried, because as loathsome as Alonzo was in the hands of Denzel, he was also eminently watchable, to the extent that his charm often distracted from his corrupt dealings. In the film, Alonzo takes Ethan Hawke's Jake Hoyt out for the day as he conducts his narcotics work. As the movie goes on, Alonzo reveals the depths of his corruption, with Jake forced to confront the degradation at the core of the very force for which he works. It all ends with an all-time classic scene in which Denzel's cop is confronted by Jake and an entire neighborhood of gang members who demand answers for his dodgy dealings and their repercussions. By all accounts, Denzel had an absolute ball playing Alonzo, improvising throughout the shoot and bringing a magnetism only he could to the part. But it seems the actor never forgot how serious a story he was telling. Speaking to The Morning Call back in 2021, he recalled writing a single, decidedly grim phrase on his copy of the \"Training Day\" script that unlocked the whole film for him. As Washington explained to the outlet: \"The first thing that I wrote down on my script was, 'The wages of sin are death,' and that's the movie for me. Once I put that down on the page, I felt that I could be as wicked as I wanted to be because I knew what was coming. I knew what was in store for him. And he does get what he deserves.\" What does Denzel's Training Day phrase mean? Warner Bros. The phrase, \"For the wages of sin is death\" comes from the start of the biblical verse Romans 6:23, which in full reads \"For the wages of sin is death, but the gift of God is eternal life in Christ Jesus our Lord.\" It refers to the idea that wages are something provided to an individual who has worked for them, and in this case, sinning is said to result in an individual receiving death as their payment. Having read the \"Training Day\" script in full, Denzel Washington recognized that the movie was in no way trying to glorify Alonzo's actions. It was a tale about somebody who thought they had the system figured out enough to play it to their advantage, but who couldn't escape the cosmic justice coming their way as a result of all the nefarious deeds they'd committed. For an actor who had never played a villain before, you've got to marvel at Denzel's ability to get to the core of the character so succinctly before shooting even began. The phrase he wrote on his script isn't an indictment of Alonzo himself, but a recognition of how the character had gone too far and couldn't escape the cosmic repercussions. In Denzel's own words, \"He's confused, he's over the line, he's angry, but he's not entirely bad. I think in some ways he's done his job too well. He's learned how to manipulate, how to push the line further and further, and, in the process, he's become more hard-core than some of the guys he's chasing.\"",
  "image": "https://www.slashfilm.com/img/gallery/the-ominous-phrase-denzel-washington-wrote-on-his-training-day-script/l-intro-1734638994.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n    \n                \u003cdiv\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1743226/denzel-washington-training-day-script-ominous-phrase/\" data-post-title=\"The Ominous Phrase Denzel Washington Wrote On His Training Day Script\" data-slide-num=\"0\" data-post-id=\"1743226\"\u003e\n                                             \u003cpicture id=\"pb660700ba1cb38fdc8952e0a0c4e5298\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-ominous-phrase-denzel-washington-wrote-on-his-training-day-script/intro-1734638994.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-ominous-phrase-denzel-washington-wrote-on-his-training-day-script/intro-1734638994.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/the-ominous-phrase-denzel-washington-wrote-on-his-training-day-script/intro-1734638994.jpg\" data-slide-url=\"https://www.slashfilm.com/1743226/denzel-washington-training-day-script-ominous-phrase/\" data-post-id=\"1743226\" data-slide-num=\"0\" data-slide-title=\"The Ominous Phrase Denzel Washington Wrote On His Training Day Script: \" width=\"780\" height=\"438\" alt=\"Denzel Washington\u0026#39;s Alonzo Harris looks over his glasses in Training Day\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eWarner Bros.\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eBy the end of the \u0026#39;90s, Denzel Washington had seemingly done it all. After \u003ca href=\"https://www.slashfilm.com/571119/glory-revisited/\" target=\"_blank\"\u003ehis breakout role in arguably the best Civil War film ever made, 1989\u0026#39;s \u0026#34;Glory,\u0026#34;\u003c/a\u003e earned him an Oscar for best Supporting Actor, he went on to earn yet another Academy Award nomination for his performance in \u0026#34;Malcom X\u0026#34; in 1992 and \u0026#34;The Hurricane\u0026#34; in 1999. Throughout that time, he\u0026#39;d proven he was also more than capable of bringing his effortless charismas to less cerebral fare such as action thriller \u0026#34;Crimson Tide\u0026#34; and crime drama \u0026#34;The Bone Collector.\u0026#34;\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eBut by the end of the millennium there was still one thing Denzel had never done: play a bad guy. The actor was so naturally magnetic that it seems Hollywood never thought to waste such appeal on a villain, and so Denzel remained a good guy right up until 2001. That year, however, he fronted the film that would not only bring him his second Oscar win, but would also mark his transition to playing bad guys — and what a debut it was.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003e\u0026#34;Training Day\u0026#34; was written by David Ayer, who injected the script with his real-world experiences of growing up in disadvantaged Los Angeles neighborhoods. Director Antoine Fuqua took things a step further in that respect, using real gangs and acual South LA locations to shoot the movie about a corrupt LAPD narcotics officer who takes a rookie cop out for a day of evaluation. But while Ayer and Fuqua\u0026#39;s contributions were integral to creating what remains one of the best crime thrillers of the era, it was Denzel\u0026#39;s unbridled commitment to his role, and the ease with which he flipped his charisma to create one of the great on-screen villains, that really made \u0026#34;Training Day\u0026#34; both a modern classic and one of \u003ca href=\"https://www.slashfilm.com/1676374/denzel-washington-most-rewatchable-movies-ranked/\" target=\"_blank\"\u003eDenzel\u0026#39;s most rewatchable films\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eHow did the man make that transition so seamlessly? A lot surely went into it, but it seemed to begin with one single phrase which he wrote on his copy of the \u0026#34;Training Day\u0026#34; script.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eDenzel summed up his first on-screen villain with a single phrase\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1743226/denzel-washington-training-day-script-ominous-phrase/\" data-post-title=\"The Ominous Phrase Denzel Washington Wrote On His Training Day Script\" data-slide-num=\"1\" data-post-id=\"1743226\"\u003e\n                                             \u003cpicture id=\"p667b6969f4a5ad41b1e3c1a4316b79d7\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-ominous-phrase-denzel-washington-wrote-on-his-training-day-script/denzel-summed-up-his-first-on-screen-villain-with-a-single-phrase-1734638995.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-ominous-phrase-denzel-washington-wrote-on-his-training-day-script/denzel-summed-up-his-first-on-screen-villain-with-a-single-phrase-1734638995.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/the-ominous-phrase-denzel-washington-wrote-on-his-training-day-script/denzel-summed-up-his-first-on-screen-villain-with-a-single-phrase-1734638995.jpg\" data-slide-url=\"https://www.slashfilm.com/1743226/denzel-washington-training-day-script-ominous-phrase/\" data-post-id=\"1743226\" data-slide-num=\"1\" data-slide-title=\"The Ominous Phrase Denzel Washington Wrote On His Training Day Script: Denzel summed up his first on-screen villain with a single phrase\" width=\"780\" height=\"438\" alt=\"Denzel Washington\u0026#39;s Alonzo Harris looks across from the driver\u0026#39;s seat to Ethan Hawke\u0026#39;s Jake Hoyt in Training Day\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eWarner Bros.\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eWhen \u003ca href=\"https://www.slashfilm.com/807688/denzel-washingtons-training-day-role-sparked-a-surprising-amount-of-controversy/\" target=\"_blank\"\u003eDenzel Washington was cast in \u0026#34;Training Day,\u0026#34; it created no shortage of controversy\u003c/a\u003e. The concern among such groups as The National Association for the Advancement of Colored People (NAACP) was that after building more than a decade of good will playing relatable, morally upstanding characters, Denzel was about to waste it all playing a truly despicable individual in the form of LAPD detective Alonzo Harris. But they needn\u0026#39;t have been worried, because as loathsome as Alonzo was in the hands of Denzel, he was also eminently watchable, to the extent that his charm often distracted from his corrupt dealings.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eIn the film, Alonzo takes Ethan Hawke\u0026#39;s Jake Hoyt out for the day as he conducts his narcotics work. As the movie goes on, Alonzo reveals the depths of his corruption, with Jake forced to confront the degradation at the core of the very force for which he works. It all ends with an all-time classic scene in which Denzel\u0026#39;s cop is confronted by Jake and an entire neighborhood of gang members who demand answers for his dodgy dealings and their repercussions.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eBy all accounts, Denzel had an absolute ball playing Alonzo, improvising throughout the shoot and bringing a magnetism only he could to the part. But it seems the actor never forgot how serious a story he was telling. Speaking to \u003ca href=\"https://www.mcall.com/2001/09/29/denzel-delves-into-his-dark-side-with-training-day/\" target=\"_blank\"\u003eThe Morning Call\u003c/a\u003e back in 2021, he recalled writing a single, decidedly grim phrase on his copy of the \u0026#34;Training Day\u0026#34; script that unlocked the whole film for him. As Washington explained to the outlet:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\"\u003e\u0026#34;The first thing that I wrote down on my script was, \u0026#39;The wages of sin are death,\u0026#39; and that\u0026#39;s the movie for me. Once I put that down on the page, I felt that I could be as wicked as I wanted to be because I knew what was coming. I knew what was in store for him. And he does get what he deserves.\u0026#34;\u003c/p\u003e\n\u003c/blockquote\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eWhat does Denzel\u0026#39;s Training Day phrase mean?\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1743226/denzel-washington-training-day-script-ominous-phrase/\" data-post-title=\"The Ominous Phrase Denzel Washington Wrote On His Training Day Script\" data-slide-num=\"2\" data-post-id=\"1743226\"\u003e\n                                             \u003cpicture id=\"p020b22239b9358d532eafa1966469370\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-ominous-phrase-denzel-washington-wrote-on-his-training-day-script/what-does-denzels-training-day-phrase-mean-1734638995.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-ominous-phrase-denzel-washington-wrote-on-his-training-day-script/what-does-denzels-training-day-phrase-mean-1734638995.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/the-ominous-phrase-denzel-washington-wrote-on-his-training-day-script/what-does-denzels-training-day-phrase-mean-1734638995.jpg\" data-slide-url=\"https://www.slashfilm.com/1743226/denzel-washington-training-day-script-ominous-phrase/\" data-post-id=\"1743226\" data-slide-num=\"2\" data-slide-title=\"The Ominous Phrase Denzel Washington Wrote On His Training Day Script: What does Denzel\u0026#39;s Training Day phrase mean?\" width=\"780\" height=\"438\" alt=\"Denzel Washington\u0026#39;s Alonzo Harris looks scared as faces a gun held by someone behind the camera in Training Day\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eWarner Bros.\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eThe phrase, \u0026#34;For the wages of sin is death\u0026#34; comes from the start of the biblical verse Romans 6:23, which in full reads \u0026#34;For the wages of sin is death, but the gift of God is eternal life in Christ Jesus our Lord.\u0026#34; It refers to the idea that wages are something provided to an individual who has worked for them, and in this case, sinning is said to result in an individual receiving death as their payment.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eHaving read the \u0026#34;Training Day\u0026#34; script in full, Denzel Washington recognized that the movie was in no way trying to glorify Alonzo\u0026#39;s actions. It was a tale about somebody who thought they had the system figured out enough to play it to their advantage, but who couldn\u0026#39;t escape the cosmic justice coming their way as a result of all the nefarious deeds they\u0026#39;d committed.\u003c/p\u003e\n\u003cp\u003eFor an actor who had never played a villain before, you\u0026#39;ve got to marvel at Denzel\u0026#39;s ability to get to the core of the character so succinctly before shooting even began. The phrase he wrote on his script isn\u0026#39;t an indictment of Alonzo himself, but a recognition of how the character had gone too far and couldn\u0026#39;t escape the cosmic repercussions. In Denzel\u0026#39;s own \u003ca href=\"https://sbiff.org/training-day/\" target=\"_blank\"\u003ewords\u003c/a\u003e, \u0026#34;He\u0026#39;s confused, he\u0026#39;s over the line, he\u0026#39;s angry, but he\u0026#39;s not entirely bad. I think in some ways he\u0026#39;s done his job too well. He\u0026#39;s learned how to manipulate, how to push the line further and further, and, in the process, he\u0026#39;s become more hard-core than some of the guys he\u0026#39;s chasing.\u0026#34;\u003c/p\u003e\n\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-12-24T23:45:18Z",
  "modifiedTime": "2024-12-24T23:45:18Z"
}
