{
  "id": "07cb4f3e-826f-4f8c-b1ce-8613198de75c",
  "title": "Women Dominate Italy’s David di Donatello Awards: ‘Vermiglio’ Sweeps, ‘Art of Joy’ and ‘Gloria!’ Emerge as Big Winners",
  "link": "https://variety.com/2025/film/global/women-italys-david-di-donatello-awards-vermiglio-1236390069/",
  "description": "Women dominated Italy’s 70th David di Donatello Awards with Maura Delpero’s Venice Silver Lion winner “Vermiglio” taking top honors and Valeria Golino’s female empowerment drama “The Art of Joy” and Margherita Vicario’s directorial debut “Gloria!” also scoring multiple statuettes. “Vermiglio,” which is set at the end of World War II in an Alpine village where […]",
  "author": "Nvivarelli",
  "published": "Thu, 08 May 2025 00:36:38 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "Global",
    "News",
    "David Di Donatello Awards",
    "Vermiglio"
  ],
  "byline": "Nick Vivarelli",
  "length": 4354,
  "excerpt": "Women dominated Italy's David di Donatello awards as 'Vermiglio' dominated and 'Art of Joy,' and 'Gloria!' also emerged as big winners.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "Women dominated Italy’s 70th David di Donatello Awards with Maura Delpero’s Venice Silver Lion winner “Vermiglio” taking top honors and Valeria Golino’s female empowerment drama “The Art of Joy” and Margherita Vicario’s directorial debut “Gloria!” also scoring multiple statuettes. “Vermiglio,” which is set at the end of World War II in an Alpine village where the arrival of a soldier causes disruption in the dynamics between three sisters, was the night’s big winner taking best picture, best director, screenplay, producer, cinematography, sound and the David’s newly introduced casting category. Golino’s “Art of Joy,” which is based on an epic, and highly erotic, feminist novel by the late Italian author and actor Goliarda Sapienza, took Davids for best non-original screenplay, best actress for rising star Tecla Insolia – who plays a woman named modesta who is born into an impoverished family in early 1900 and driven by a strong belief that she’s destined for a better life – and the non-supporting actress prize for Valeria Bruni Tedeschi. Popular on Variety Italian singer-songwriter Margherita Vicario’s directorial debut “Gloria!,” a vibrant musical comedy set in a late 18th century Venetian female orphanage where a young rebel named Teresa leads a group of performers to challenge classical canons and invent a precursor to pop music, scooped the best debuting director award and several other prizes, including best song and score. Actor honors went to Elio Germano for his role in Andrea Segre’s “The Great Ambition” in which he plays late Italian politician Enrico Berlinguer, who led the Italian Communist Party (PCI) from 1972 until his death in 1984. Berlinguer nearly brought the PCI to power in the Italian parliamentary elections of 1976. The David for best foreign film went to “Anora” by Sean Baker, who paid tribute to Italian cinema “of all genres from comedies to neo-realism” and to Italian actress Ornella Muti, who was also honored with a career David. The Davids were held at Rome’s Cinecittà Studios, which are undergoing a radical renewal and have become a magnet for Hollywood productions such as  Mel Gibson’s “The Resurrection of the Christ,” which this summer will use its sprawling new Studio 22 facility as its main hub See the complete list of 2025 David Awards winners below. PICTURE “Vermiglio,” Maura Delpero DIRECTOR “Vermiglio,” Maura Delpero DEBUT DIRECTOR “Gloria,” Margherita Vicario PRODUCER Francesca Andreoli, Leonardo Guerra Seràgnoli, Santiago Fondevila Sancet, Maura Depero, “Vermiglio” ACTRESS Tecla Insolia, “Art of Joy” ACTOR Elio Germano, “The Great Ambition” SUPPORTING ACTRESS Valeria Bruni Tedeschi, “The Art of Joy” SUPPORTING ACTOR Francesco di Leva, “Familia” SCREENPLAY “Vermiglio,” Maura Delpero BEST ADAPTED SCREENPLAY “Art of Joy,” Valeria Golino, Francesca Marciano, Valia Santella, Luca Infascelli, Stefano Sardo CINEMATOGRAPHY Mikhail Krichman, “Vermiglio” EDITING Iacopo Quadri, “The Great Ambition” DOCUMENTARY “Lirica Ucraina,” Francesca Mannocchi SHORT “Domenica Sera,” Matteo Tortone CASTING Stefania Rodà, Maurilio Mangano, “Vermiglio” SCORE Margherita Vicario, Davide Pavanello, “Gloria!” ORIGINAL SONG “Aria!” from the film “Gloria!,” Margerita Vicario, Davide Pavanello, Edwyn Clark Roberts, Andrea Bonomo, Gianluigi Fazio PRODUCTION DESIGN Tonino Zera, Maria Grazia Schirripa, Carlotta Desman, “Le déluge” COSTUME DESIGN Massimo Cantini Parrini, “Le déluge” MAKEUP ARTIST Alessandra Vita, Valentina Visentin, “Le Déluge” HAIR ARTIST Aldo Signoretti, Domingo Santoro, “Le Déluge” SOUND Dana Farzanehpour, Hervé Guyader, Emmanuel De Boissieu, “Vermiglio” DIGITAL EFFECTS Victor Perez, “Napoli, New York” AUDIENCE AWARD “Diamonds,” Ferzan Ozpetek BEST SHORT BEST FOREIGN FILM “Anora,” Sean Baker YOUTH DAVID “Naples, New York,” Gabriele Salvatores CAREER DAVID Pupi Avati DAVID FOR CINEMATIC EXCELLENCE Timothée Chalamet SPECIAL DAVID Ornella Muti SPECIAL DAVID CINECITTÀ Giuseppe Tornatore",
  "image": "https://variety.com/wp-content/uploads/2024/12/Vermiglio.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tWomen dominated Italy’s 70th \u003ca href=\"https://variety.com/t/david-di-donatello-awards/\" id=\"auto-tag_david-di-donatello-awards\" data-tag=\"david-di-donatello-awards\"\u003eDavid di Donatello Awards\u003c/a\u003e with Maura Delpero’s Venice Silver Lion winner “\u003ca href=\"https://variety.com/t/vermiglio/\" id=\"auto-tag_vermiglio\" data-tag=\"vermiglio\"\u003eVermiglio\u003c/a\u003e” taking top honors and Valeria Golino’s female empowerment drama “The Art of Joy” and Margherita Vicario’s directorial debut “Gloria!” also scoring multiple statuettes.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Vermiglio,” which is set at the end of World War II in an Alpine village where the arrival of a soldier causes disruption in the dynamics between three sisters, was the night’s big winner taking best picture, best director, screenplay, producer, cinematography, sound and the David’s newly introduced casting category.\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tGolino’s “Art of Joy,” which is based on an epic, and highly erotic, feminist novel by the late Italian author and actor Goliarda Sapienza, took Davids for best non-original screenplay, best actress for rising star Tecla Insolia – who plays a woman named modesta who is  born into an impoverished family in early 1900 and driven by a strong belief that she’s destined for a better life – and the non-supporting actress prize for Valeria Bruni Tedeschi. \n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tItalian singer-songwriter Margherita Vicario’s directorial debut “Gloria!,” a vibrant musical comedy set in a late 18th century Venetian female orphanage where a young rebel named Teresa leads a group of performers to challenge classical canons and invent a precursor to pop music, scooped the best debuting director award and several other prizes, including best song and score.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tActor honors went to Elio Germano for his role in Andrea Segre’s “The Great Ambition” in which he plays late Italian politician Enrico Berlinguer, who led the Italian Communist Party (PCI) from 1972 until his death in 1984. Berlinguer nearly brought the PCI to power in the Italian parliamentary elections of 1976.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe David for best foreign film went to “Anora” by Sean Baker, who paid tribute to Italian cinema “of all genres from comedies to neo-realism” and to Italian actress Ornella Muti, who was also honored with a career David.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe Davids were held at Rome’s Cinecittà Studios, which are undergoing a radical renewal and have become a magnet for Hollywood productions such as  Mel Gibson’s “The Resurrection of the Christ,” which this summer will use its sprawling new Studio 22 facility as its main hub\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eSee the complete list of 2025 David Awards winners below.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePICTURE\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Vermiglio,” Maura Delpero\u003cbr/\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDIRECTOR\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Vermiglio,” Maura Delpero\u003cbr/\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEBUT DIRECTOR\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Gloria,” Margherita Vicario\u003cbr/\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePRODUCER\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tFrancesca Andreoli, Leonardo Guerra Seràgnoli, Santiago Fondevila Sancet, Maura Depero, “Vermiglio”\u003cbr/\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eACTRESS\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tTecla Insolia, “Art of Joy”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eACTOR\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tElio Germano, “The Great Ambition”\u003cbr/\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eSUPPORTING ACTRESS\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tValeria Bruni Tedeschi, “The Art of Joy”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eSUPPORTING ACTOR\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tFrancesco di Leva, “Familia”\u003cbr/\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eSCREENPLAY\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t “Vermiglio,” Maura Delpero\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eBEST ADAPTED SCREENPLAY\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Art of Joy,” Valeria Golino, Francesca Marciano, Valia Santella, Luca Infascelli, Stefano Sardo\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eCINEMATOGRAPHY\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tMikhail Krichman, “Vermiglio”\u003cbr/\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eEDITING\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIacopo Quadri, “The Great Ambition”\u003cbr/\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDOCUMENTARY\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Lirica Ucraina,” Francesca Mannocchi\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eSHORT\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Domenica Sera,” Matteo Tortone\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eCASTING\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tStefania Rodà, Maurilio Mangano, “Vermiglio” \u003cstrong\u003e\u003cbr/\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eSCORE\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tMargherita Vicario, Davide Pavanello, “Gloria!”\u003cbr/\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eORIGINAL SONG\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Aria!” from the film “Gloria!,” Margerita Vicario, Davide Pavanello, Edwyn Clark Roberts, Andrea Bonomo, Gianluigi Fazio\u003cbr/\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePRODUCTION DESIGN\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tTonino Zera, Maria Grazia Schirripa, Carlotta Desman, “Le déluge”\u003cbr/\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eCOSTUME DESIGN\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tMassimo Cantini Parrini, “Le déluge”\u003cbr/\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eMAKEUP ARTIST\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAlessandra Vita, Valentina Visentin, “Le Déluge”\u003cbr/\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eHAIR ARTIST\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAldo Signoretti, Domingo Santoro, “Le Déluge”\u003cbr/\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eSOUND\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tDana Farzanehpour, Hervé Guyader, Emmanuel De Boissieu, “Vermiglio”\u003cbr/\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDIGITAL EFFECTS\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tVictor Perez, “Napoli, New York” \u003cbr/\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eAUDIENCE AWARD\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Diamonds,” Ferzan Ozpetek\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eBEST SHORT\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eBEST FOREIGN FILM\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Anora,” Sean Baker\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eYOUTH DAVID\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Naples, New York,” Gabriele Salvatores\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eCAREER DAVID\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tPupi Avati\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDAVID FOR CINEMATIC EXCELLENCE\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tTimothée Chalamet\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eSPECIAL DAVID\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tOrnella Muti\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eSPECIAL DAVID CINECITTÀ\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tGiuseppe Tornatore\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-05-08T00:36:38Z",
  "modifiedTime": "2025-05-08T00:36:47Z"
}
