{
  "id": "1129110d-7207-4edb-a44a-8775d10f9a35",
  "title": "‘Once More, Like Rain Man’ Filmmakers Bella Zoe Martinez and Sue Ann Pien On Creating Nuanced Depictions Of Neurodivergence Onscreen",
  "link": "https://deadline.com/2024/10/once-more-like-rain-man-interview-bella-zoe-martinez-sue-ann-pien-1236112324/",
  "description": "In the decades following 1988’s disability drama Rain Man, Hollywood’s representation of people on the spectrum has somewhat moved the needle in the neurodivergent experience with popular shows such as The Good Doctor, Love on the Spectrum and Atypical. However, there is still much more nuanced ground to cover when depicting the neurodivergent experience onscreen. […]",
  "author": "Destiny Jackson",
  "published": "Fri, 11 Oct 2024 00:00:00 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "Festivals",
    "Bella Zoe Martinez",
    "LA Shorts Film Festival",
    "NoHo Cinefest",
    "Sue Ann Pien"
  ],
  "byline": "Destiny Jackson",
  "length": 10233,
  "excerpt": "Writer Bella Zoe Martinez and Director Sue Ann Pien talk about their short film Once More, Like Rain Man and autistic representation in Hollywood",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "In the decades following 1988’s disability drama Rain Man, Hollywood’s representation of people on the spectrum has somewhat moved the needle in the neurodivergent experience with popular shows such as The Good Doctor, Love on the Spectrum and Atypical. However, there is still much more nuanced ground to cover when depicting the neurodivergent experience onscreen. Once More, Like Rain Man, directed by Sue Ann Pien and written by Bella Zoe Martinez, follows a plucky young actress named Zoe (Martinez) who is on the spectrum as she travels throughout Los Angeles auditioning for the limited, stereotypical roles for neurodivergent creatives. The short film recently premiered at the Oscar-qualifying festivals LA Shorts International Film Festival and NoHo Cinefest, taking home both awards for Best Comedy Short.  Here, Pien and Martinez–who both identify as autistic–talk to Deadline about their short film and the importance of representation on screen and casting disabled filmmakers in Hollywood.  Watch on Deadline DEADLINE: What led you to create this short film? This is all based on your personal experience as an Autistic filmmaker and aspiring actor, I imagine.  BELLA ZOE MARTINEZ: Right. I’m the one that wrote the film with my parents. I wrote this film based on auditions that I had as an actress. I’d always try to audition for normal characters. When I auditioned for autistic characters, it felt like they were flatter than an actual character or an obstacle just thrown in there at the last minute, or there wasn’t much thought put into their characters, sadly. It felt like they weren’t an actual character. I was playing a disability, not a person. It was sad. For the character I play, Zoe, is based off of me, my brother and my sister. So, it’s not technically playing myself because that’s cheating. But I wanted to create this character because I’ve never seen anyone or any character like me in the media or in general. It’s kind of sad.  DEADLINE: Sue Ann, this is your directorial debut in the narrative space. How did you end up on this project?  Sue Ann Pien and Bella Zoe Martinez attend the NoHo Cinefest NoHo Cinefest SUE ANN PIEN: I was given the script through Elaine Hall, she’s an Emmy winner, and she cast Love on the Spectrum. She was also an autism advocate on As We See It, where I met her. She had sent me the script, and Bella asked if I would act in it. I took a look and saw it was a cute short film. I loved championing this idea that we were going to create something from her perspective. I responded, “I’ll act in it if you let me direct it.” Bella’s parents were also producers on this, and they went to producer Suzann Ellis, who they’ve worked with for many years, and let her know that I wanted to direct. So, two years later, here we are.  DEADLINE: Can you talk more about the people in front of and behind the camera? Were they also folks who are neurodivergent or on the spectrum?  MARTINEZ: Half the cast and crew were neurodivergent, and some were even disabled. [One person] had a walker, [another] had a service dog named Max, a big old German Shepherd. He was such a good boy on set. Tal [Anderson, visual effects designer] had a bit of autism as well. I know some had ADHD and other things. Danielle [Perez, actor] was in a wheelchair and was one of the casting directors in the short film.  DEADLINE: Bella, how did you find your way to screenwriting? Was this an interest you’ve had since you were younger?  MARTINEZ: I’ve always been interested in making stories. I often recorded stuff with my siblings when I was younger. I know my sister got into directing when she was young. I always liked making videos of myself alongside my toys or my dolls or with my friends. I also draw a lot.  DEADLINE: I’d like to talk about the line in the short film , “What’s your superpower?” A casting agent says this line to Zoe regarding the notion that autistic people have something they are naturally gifted at. Can you talk about the tropes attached to this stereotype and why it was important to include?  MARTINEZ: For some people that were neurotypical on set, they were representing someone who was also autistic, like a friend or family member. But when it comes to me with my experiences being autistic, I mask a lot more. When I was young, I got services before I was two because I was in a pilot program, and I observed my siblings. My parents said that I observed my siblings getting ABA [Applied Behavior Analysis] therapy and little me decided I wanted nothing to do with it. I just outsmarted the therapist. But masking is technically acting, so that’s kind of a lot. I knew what autism was when I was younger, but I don’t think I registered what it meant or that it was supposed to be different because it was my normal. But when people said, “You don’t look autistic, you don’t sound autistic.” I’m like, “There’s supposed to be a certain sound to that? Sorry. What?” I remember seeing my friends have other experiences because I’ve had friends who are also autistic and on the spectrum. My best friend, she’s a little older than me, but I remember she’d always loved to communicate with her artwork but was a little shy. She loved to draw a lot but didn’t know exactly how to talk to other people. She knew what other people were saying but didn’t know how to talk to them. For some people on the spectrum, we know what people are saying, we can understand y’all, but it doesn’t feel like they fully realize what they’re doing hurts. I know some people are misinformed and don’t mean to be hurtful, but it can be hurtful, especially when you’re talking around or at us but not to us because it feels like you’re pandering. It’s like when you’re talking to a little kid in that sing-song voice but not talking to them like everybody else. I remember in Girl Scouts because I used to do that, and there was one trip leader who would talk in that sing-song voice to the little girls, and then, there was my mom who would talk to them every other adult and they liked her a lot more. Even me and my sister, who are autistic, liked that a bit more because, well, that’s how everybody else talks. Why are you talking like that? It’s weird. DEADLINE: What tropes would you like to dispel, and what things would you like to bring attention to with this short film?  MARTINEZ: I’d say [to Hollywood]: branch out a little bit more when it comes to how you write an autistic character. Because I’ve only really seen one type of way that autism is written, but I’ve never seen it done in other ways because people forget autism is a spectrum. It’s not just characters who can be a bit nonverbal or have sensitivity to touch. Some people with autism can make eye contact with people easier or enjoy chatting with people and have their social battery drained, and when they don’t want to talk anymore, they just don’t talk anymore. Some are just more higher functioning. I’d never really seen a character where it’s not really about their autism, and it’s about something they’re more passionate about and not something where it feels [forced] but an actual [natural] interest. But also, we are silly little goblins who love our hyper-fixations.  PIEN: I love what Bella said because that’s so true. Especially to me as a higher masking human. I’m a film buff, so I know Alex Plank was a consulting producer for The Bridge series, where Diane Kruger plays a character on the spectrum as a detective. Also, there’s Lisbeth Salander. I even auditioned way back when for [David] Fincher’s Miriam Wu character, but I remember reading the book, and I’d never seen a character like that, it was really interesting. As We See It was incredible to be a part of because I’ve never seen Asian people on the spectrum, so that was groundbreaking. It was huge, especially in our community. In Chinese communities, there’s a lot of shame around any type of differences. That was unfortunate for me because I was born in a time when there were no services to accommodate my differences. Being on set, I was shocked at the level of support and family love there is versus, “You’re so wrong, do not be yourself, and we’re better off without you.” That was the trope: this message of autism is this awful, dark thing that afflicts the family and we don’t want what you got in this family.   MARTINEZ: It still makes me horrified when I come across some stuff that some of those quote-unquote organizations that help people with autism try to do and it makes me sick. I don’t look into it that often because I’d rather not vomit my lunch, thank you very much. DEADLINE: What does the title Once More, Like Rain Man mean?   MARTINEZ: I chose Once More, like Rain Man, because Rain Man was the first time people had seen that there could be more types of people with autism. It’s actually the reason why kids now are able to get help because before, most [people on the spectrum were considered] and pardon my English, “retarded” and “stupid.” That they couldn’t really think for themselves or do anything for themselves. That wasn’t true at all. We are smart, we are funny. It was just that a lot of those people didn’t really get a chance back then, and it’s sad to think about. It was the first step of helping kids on the spectrum today because, without that, I probably wouldn’t have gotten the services my siblings and I did when we were little. Joe Mantegna, Bella Zoe Martinez and Sue Ann Pien on set of Once More, Like Rain Man OMLR Movie I hope my short film might be the next step for people to see what I’ve made and what we’ve all made and just care about what they see because people sometimes forget that people who are autistic are people too. We’re just as human as you, we just see the world differently. Sure, you may not understand our point of view, but we don’t understand your point of view sometimes either. [This interview has been edited for length and clarity]",
  "image": "https://deadline.com/wp-content/uploads/2024/10/Project_20240725_0014.jpeg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\n\tIn the decades following 1988’s disability drama \u003cem\u003eRain Man\u003c/em\u003e, Hollywood’s representation of people on the spectrum has somewhat moved the needle in the neurodivergent experience with popular shows such as \u003cem\u003eThe Good Doctor\u003c/em\u003e, \u003cem\u003eLove on the Spectrum\u003c/em\u003e and \u003cem\u003eAtypical. However, there\u003c/em\u003e is still much more nuanced ground to cover when depicting the neurodivergent experience onscreen. \u003cem\u003eOnce More, Like Rain Man,\u003c/em\u003e directed by \u003ca href=\"https://deadline.com/tag/sue-ann-pien/\" id=\"auto-tag_sue-ann-pien\" data-tag=\"sue-ann-pien\"\u003eSue Ann Pien\u003c/a\u003e and written by \u003ca href=\"https://deadline.com/tag/bella-zoe-martinez/\" id=\"auto-tag_bella-zoe-martinez\" data-tag=\"bella-zoe-martinez\"\u003eBella Zoe Martinez\u003c/a\u003e, follows a plucky young actress named Zoe (Martinez) who is on the spectrum as she travels throughout Los Angeles auditioning for the limited, stereotypical roles for neurodivergent creatives. The short film recently premiered at the Oscar-qualifying festivals LA Shorts International Film Festival and \u003ca href=\"https://deadline.com/tag/noho-cinefest/\" id=\"auto-tag_noho-cinefest\" data-tag=\"noho-cinefest\"\u003eNoHo Cinefest\u003c/a\u003e, taking home both awards for Best Comedy Short. \n\n\t\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\n\tHere, Pien and Martinez–who both identify as autistic–talk to Deadline about their short film and the importance of representation on screen and casting disabled filmmakers in Hollywood. \n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1236099936\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE: What led you to create this short film? This is all based on your personal experience as an Autistic filmmaker and aspiring actor, I imagine. \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eBELLA ZOE MARTINEZ: \u003c/strong\u003eRight. I’m the one that wrote the film with my parents. I wrote this film based on auditions that I had as an actress. I’d always try to audition for normal characters. When I auditioned for autistic characters, it felt like they were flatter than an actual character or an obstacle just thrown in there at the last minute, or there wasn’t much thought put into their characters, sadly. It felt like they weren’t an actual character. I was playing a disability, not a person. It was sad. For the character I play, Zoe, is based off of me, my brother and my sister. So, it’s not technically playing myself because that’s cheating. But I wanted to create this character because I’ve never seen anyone or any character like me in the media or in general. It’s kind of sad. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE: Sue Ann, this is your directorial debut in the narrative space. How did you end up on this project? \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\t\n\n\u003cfigure\u003e\n\n\t\t\t\n\u003cdiv\u003e\n\t\n\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?w=200\" data-lazy-src=\"https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?w=200\" alt=\"Once More, Like Rain Man interview\" data-lazy-srcset=\"https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg 3867w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=100,150 100w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=200,300 200w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=683,1024 683w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=1024,1536 1024w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=1365,2048 1365w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=67,100 67w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=40,60 40w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=312,468 312w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=150,225 150w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=110,165 110w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=285,428 285w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=160,240 160w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=320,480 320w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=640,960 640w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=400,600 400w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=800,1200 800w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=512,768 512w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=1280,1920 1280w\" data-lazy-sizes=\"(min-width: 87.5rem) 1000px, (min-width: 78.75rem) 681px, (min-width: 48rem) 450px, (max-width: 48rem) 250px\" height=\"375\" width=\"300\" decoding=\"\" srcset=\"https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg 3867w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=100,150 100w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=200,300 200w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=683,1024 683w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=1024,1536 1024w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=1365,2048 1365w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=67,100 67w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=40,60 40w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=312,468 312w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=150,225 150w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=110,165 110w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=285,428 285w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=160,240 160w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=320,480 320w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=640,960 640w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=400,600 400w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=800,1200 800w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=512,768 512w, https://deadline.com/wp-content/uploads/2024/10/NoHoCineFest2024_00666.jpg?resize=1280,1920 1280w\"/\u003e\n\t\t\t\n\t\t\t\u003c/p\u003e\n\t\n\t\u003c/div\u003e\n\t\n\t\t\t\n\t\t\t\n\u003cfigcaption\u003e\n\t\n\t\t\t\t\t\u003cspan\u003eSue Ann Pien and Bella Zoe Martinez attend the NoHo Cinefest\u003c/span\u003e\n\t\t\n\t\t\t\t\t\t\t\t\t\u003ccite\u003eNoHo Cinefest\u003c/cite\u003e\n\t\t\t\t\t\n\t\u003c/figcaption\u003e\n\n\t\t\t\n\u003c/figure\u003e\n\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eSUE ANN PIEN: \u003c/strong\u003eI was given the script through Elaine Hall, she’s an Emmy winner, and she cast \u003cem\u003eLove on the Spectrum\u003c/em\u003e. She was also an autism advocate on \u003cem\u003eAs We See It,\u003c/em\u003e where I met her. She had sent me the script, and Bella asked if I would act in it. I took a look and saw it was a cute short film. I loved championing this idea that we were going to create something from her perspective. I responded, “I’ll act in it if you let me direct it.” Bella’s parents were also producers on this, and they went to producer Suzann Ellis, who they’ve worked with for many years, and let her know that I wanted to direct. So, two years later, here we are. \n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE: Can you talk more about the people in front of and behind the camera? Were they also folks who are neurodivergent or on the spectrum? \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eMARTINEZ: \u003c/strong\u003eHalf the cast and crew were neurodivergent, and some were even disabled. [One person] had a walker, [another] had a service dog named Max, a big old German Shepherd. He was such a good boy on set. Tal [Anderson, visual effects designer] had a bit of autism as well. I know some had ADHD and other things. Danielle [Perez, actor] was in a wheelchair and was one of the casting directors in the short film. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE: Bella, how did you find your way to screenwriting? Was this an interest you’ve had since you were younger? \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eMARTINEZ:\u003c/strong\u003e I’ve always been interested in making stories. I often recorded stuff with my siblings when I was younger. I know my sister got into directing when she was young. I always liked making videos of myself alongside my toys or my dolls or with my friends. I also draw a lot. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE: I’d like to talk about the line in the short film , “What’s your superpower?” A casting agent says this line to Zoe regarding the notion that autistic people have something they are naturally gifted at. Can you talk about the tropes attached to this stereotype and why it was important to include? \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eMARTINEZ:\u003c/strong\u003e For some people that were neurotypical on set, they were representing someone who was also autistic, like a friend or family member. But when it comes to me with my experiences being autistic, I mask a lot more. When I was young, I got services before I was two because I was in a pilot program, and I observed my siblings. My parents said that I observed my siblings getting ABA [Applied Behavior Analysis] therapy and little me decided I wanted nothing to do with it. I just outsmarted the therapist. But masking is technically acting, so that’s kind of a lot. I knew what autism was when I was younger, but I don’t think I registered what it meant or that it was supposed to be different because it was my normal.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tBut when people said, “You don’t look autistic, you don’t sound autistic.” I’m like, “There’s supposed to be a certain sound to that? Sorry. What?” I remember seeing my friends have other experiences because I’ve had friends who are also autistic and on the spectrum. My best friend, she’s a little older than me, but I remember she’d always loved to communicate with her artwork but was a little shy. She loved to draw a lot but didn’t know exactly how to talk to other people. She knew what other people were saying but didn’t know how to talk to them. For some people on the spectrum, we know what people are saying, we can understand y’all, but it doesn’t feel like they fully realize what they’re doing hurts. I know some people are misinformed and don’t mean to be hurtful, but it can be hurtful, especially when you’re talking around or at us but not to us because it feels like you’re pandering. It’s like when you’re talking to a little kid in that sing-song voice but not talking to them like everybody else.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tI remember in Girl Scouts because I used to do that, and there was one trip leader who would talk in that sing-song voice to the little girls, and then, there was my mom who would talk to them every other adult and they liked her a lot more. Even me and my sister, who are autistic, liked that a bit more because, well, that’s how everybody else talks. Why are you talking like that? It’s weird.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE: What tropes would you like to dispel, and what things would you like to bring attention to with this short film? \u003c/strong\u003e\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eMARTINEZ: \u003c/strong\u003eI’d say [to Hollywood]: branch out a little bit more when it comes to how you write an autistic character. Because I’ve only really seen one type of way that autism is written, but I’ve never seen it done in other ways because people forget autism is a spectrum. It’s not just characters who can be a bit nonverbal or have sensitivity to touch. Some people with autism can make eye contact with people easier or enjoy chatting with people and have their social battery drained, and when they don’t want to talk anymore, they just don’t talk anymore. Some are just more higher functioning. I’d never really seen a character where it’s not really about their autism, and it’s about something they’re more passionate about and not something where it feels [forced] but an actual [natural] interest. But also, we are silly little goblins who love our hyper-fixations. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePIEN: \u003c/strong\u003eI love what Bella said because that’s so true. Especially to me as a higher masking human. I’m a film buff, so I know Alex Plank was a consulting producer for \u003cem\u003eThe Bridge\u003c/em\u003e series, where Diane Kruger plays a character on the spectrum as a detective. Also, there’s Lisbeth Salander. I even auditioned way back when for [David] Fincher’s Miriam Wu character, but I remember reading the book, and I’d never seen a character like that, it was really interesting. \u003cem\u003eAs We See It \u003c/em\u003ewas incredible to be a part of because I’ve never seen Asian people on the spectrum, so that was groundbreaking. It was huge, especially in our community. In Chinese communities, there’s a lot of shame around any type of differences. That was unfortunate for me because I was born in a time when there were no services to accommodate my differences. Being on set, I was shocked at the level of support and family love there is versus, “You’re so wrong, do not be yourself, and we’re better off without you.” That was the trope: this message of autism is this awful, dark thing that afflicts the family and we don’t want what you got in this family.  \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eMARTINEZ: \u003c/strong\u003eIt still makes me horrified when I come across some stuff that some of those quote-unquote organizations that help people with autism try to do and it makes me sick. I don’t look into it that often because I’d rather not vomit my lunch, thank you very much.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE: What does the title \u003cem\u003eOnce More, Like Rain Man mean\u003c/em\u003e? \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t \u003cstrong\u003eMARTINEZ: \u003c/strong\u003eI chose \u003cem\u003eOnce More, like Rain Man,\u003c/em\u003e because \u003cem\u003eRain Man\u003c/em\u003e was the first time people had seen that there could be more types of people with autism. It’s actually the reason why kids now are able to get help because before, most [people on the spectrum were considered] and pardon my English, “retarded” and “stupid.” That they couldn’t really think for themselves or do anything for themselves. That wasn’t true at all. We are smart, we are funny. It was just that a lot of those people didn’t really get a chance back then, and it’s sad to think about. It was the first step of helping kids on the spectrum today because, without that, I probably wouldn’t have gotten the services my siblings and I did when we were little.\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\t\n\n\u003cfigure\u003e\n\n\t\t\t\n\u003cdiv\u003e\n\t\n\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?w=300\" data-lazy-src=\"https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?w=300\" alt=\"Once More, Like Rain Man interview\" data-lazy-srcset=\"https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg 8192w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=150,100 150w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=300,200 300w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=1024,683 1024w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=1536,1025 1536w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=2048,1366 2048w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=630,420 630w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=60,40 60w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=352,235 352w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=900,600 900w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=110,73 110w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=285,190 285w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=320,213 320w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=640,427 640w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=800,534 800w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=1280,854 1280w\" data-lazy-sizes=\"(min-width: 87.5rem) 1000px, (min-width: 78.75rem) 681px, (min-width: 48rem) 450px, (max-width: 48rem) 250px\" height=\"0\" width=\"488\" decoding=\"\" srcset=\"https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg 8192w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=150,100 150w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=300,200 300w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=1024,683 1024w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=1536,1025 1536w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=2048,1366 2048w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=630,420 630w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=60,40 60w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=352,235 352w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=900,600 900w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=110,73 110w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=285,190 285w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=320,213 320w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=640,427 640w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=800,534 800w, https://deadline.com/wp-content/uploads/2024/10/OMLR_1340-1-1.jpg?resize=1280,854 1280w\"/\u003e\n\t\t\t\n\t\t\t\u003c/p\u003e\n\t\n\t\u003c/div\u003e\n\t\n\t\t\t\n\t\t\t\n\u003cfigcaption\u003e\n\t\n\t\t\t\t\t\u003cspan\u003eJoe Mantegna, Bella Zoe Martinez and Sue Ann Pien on set of \u003cem\u003eOnce More, Like Rain Man\u003c/em\u003e\u003c/span\u003e\n\t\t\n\t\t\t\t\t\t\t\t\t\u003ccite\u003eOMLR Movie\u003c/cite\u003e\n\t\t\t\t\t\n\t\u003c/figcaption\u003e\n\n\t\t\t\n\u003c/figure\u003e\n\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\tI hope my short film might be the next step for people to see what I’ve made and what we’ve all made and just care about what they see because people sometimes forget that people who are autistic are people too. We’re just as human as you, we just see the world differently. Sure, you may not understand our point of view, but we don’t understand your point of view sometimes either.\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003cp\u003e\n\t\u003cem\u003e[This interview has been edited for length and clarity]\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2024-10-11T00:00:00Z",
  "modifiedTime": "2024-10-10T23:56:47Z"
}
