{
  "id": "1a91a6e0-c778-4ee5-8c52-37fc011afb02",
  "title": "‘Barbara Walters: Tell Me Everything’ Review: Riveting Doc Is Clear-Eyed About a Trailblazer Who Also Almost Married Roy Cohn",
  "link": "https://www.indiewire.com/criticism/movies/barbara-walters-documentary-review-1235131450/",
  "description": "Tribeca: \"She did not have the strongest moral compass,\" said the man who co-wrote Walters' biography with her in a truthful moment among many in Jackie Jesko's nuanced documentary.",
  "author": "Christian Blauvelt",
  "published": "Fri, 13 Jun 2025 01:00:00 +0000",
  "source": "https://www.indiewire.com/feed",
  "categories": [
    "Criticism",
    "Movies",
    "Barbara Walters",
    "Barbara Walters: Tell Me Everything",
    "Documentaries",
    "Film",
    "Reviews",
    "Tribeca"
  ],
  "byline": "Christian Blauvelt",
  "length": 7192,
  "excerpt": "Barbara Walters doc review: An icon and Roy Cohn's near-fiancée seen anew in Jackie Jesko's smart documentary for ABC News and Hulu.",
  "siteName": "IndieWire",
  "favicon": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=192",
  "text": "The temptation to deliver scrubbed-clean hagiography with “Barbara Walters: Tell Me Everything” had to have been there: The journalist, who died at 93 in 2022, was the very definition of trailblazer, a woman who worked harder than all the men around her in the extraordinarily testosterone-filled boys club that was midcentury broadcast news, and all but single-handedly paved the way for women to have prominent on-air roles ever since. And Walters achieved that, despite starting out having to do “Today” show segments in the early 1960s that saw her doing stunts like dressing up as a Playboy bunny. But Jackie Jesko’s documentary goes beyond the obvious, just as Walters’ own interviews so often did. It’s clear-eyed about Walters’ transactional approach to arranging interviews, and about the discomforting allure “money, fame, and power,” in the words of her biographer Peter Gethers, held for her. There’s even a clip of her all but saying “I love dictators” — of whom she interviewed so many, including Muammar Gaddafi, Fidel Castro, Vladimir Putin, and Saddam Hussein, throughout her career — but the sexism she faced from colleagues such as Frank McGee, Harry Reasoner, and Peter Jennings was so extreme, their behavior that obnoxious, that it’s easy to turn Walters almost by default into a hero. That Jesko then resists hero-worship of her, especially as the documentary is produced by Walters’ longtime home ABC News, where Jesko herself has worked, is all the more impressive. Walters always wanted to poke holes in her interview subjects’ carefully constructed armor. Not to take them down a peg necessarily, but to make them seem human. When she asked Gaddafi, “What did you want to be when you grew up when you were a child?,” her chauvinist colleagues saw that as the kind of touch-feely, estrogenic question they scoffed at. But, by any standard, isn’t that an interesting thing to ask a bloodthirsty terrorist ruler? What did you want to be before you became a bloodthirsty terrorist ruler? In a moment like that, she’s literally practicing a more complete, holistic kind of journalism than her male colleagues. Jesko takes a non-linear approach to considering Walters’ life and calls upon one of the more spectacular “who’s who” rosters of talking heads in recent memory: Oprah, Bette Midler, Connie Chung, Katie Couric, Cindy Adams, and Bob Iger, among many others. What comes through is not just a portrait of Walters’ life, but of an entire media ecosystem that is no more. One in which major stars, and yes, dictators, would choose to “tell their story” to Walters; one in which she was who they went to first to craft their image in a particular moment. In the age of Instagram, that’s hardly needed and, as Couric notes, trailblazer though she was for women in broadcast journalism, there will also never be another Barbara Walters. The film does an incredible job of setting the stage for what one of those primetime interviews would be like: The army of producers and production assistants gadding around Walters, the carefully crafted lighting, the strategic application of makeup, Walters holding notecards containing upwards of 200 questions. She made the TV interview an event, an art, a primetime spectacle. The ecosystem of magazine news shows from her own “20/20” to same-network rival “Primetime Live” to “Dateline” to “48 Hours” would not have existed without her — she understood that viewers would be as interested, maybe more so, in the Menendez brothers as Israel-Palestine peace talks. As gauzily crafted as these interviews were, Walters didn’t consider these to be “safe spaces” necessarily. Getting her interview subjects to cry was her specialty. She stared into the uncomfortable. In that regard, her journalism was well removed from the kind of journalism-as-PR that exists so much today — even with all the fruit baskets her assistants would send the assistants of potential interviewees to cajole them into setting up a sit-down. Jesko stares into the more uncomfortable aspects of Walters’ life herself. There’s her fraught relationship with her adopted daughter, Jackie, who Walters seemed to cajole into doing a primetime interview (not with Walters, but with ABC colleague Cynthia McFadden), and when Walters finally joins her daughter, there’s an unmistakable Daniel and H.W. Plainview vibe to their relationship. There’s her extremely close relationship with Roy Cohn as well, the legendary persecutor of the Rosenbergs and Donald Trump mentor, really just because Cohn helped get the tax evasion charges against her father dropped. Despite Cohn being gay, Walters and Cohn were so close that they even considered getting married. “Roy Cohn was famous, so he was worthwhile to Barbara,” Adams says at one moment in the documentary. “She did not have the strongest moral compass,” her own biographer Gethers notes. “A lot of the relationships she developed were career moves. And she was a pretty transactional person. She did not see things in that moral light.” Which perhaps explains why, when she was willing to “go there” and push back with so many of her interviewees, she also dealt with Donald Trump with kid gloves. Especially when Trump started relentlessly attacking Walters’ own hire, her co-host on “The View,” Rosie O’Donnell. To most viewers of that public spat, Walters seemed all but to side with Trump, and the incident is a notable exemption from Jesko’s film. O’Donnell is not there to add her two cents (whether she was asked to participate or not is unknown). Also telling is that her daughter Jackie does not weigh in for the documentary either. It also ignores some of the most cringe moments from Walters’ career, such as her uncomfortably sexual questions directed at an underage Brooke Shields, a moment this writer asked Walters’ ABC News colleague George Stephanopoulos about in 2023. “Barbara Walters: Tell Me Everything” is then both an unvarnished portrait and a slightly incomplete one. Very subtly it does show how, as a woman operating in very much a man’s world, she opened the doors for others while not necessarily doing a whole lot to change the system and its paradigms and its power structures, full-stop. She operated within the power structures that were until they accepted her and welcomed her, and knew when not to push back against the Trumps of this world. Is it fair of us now to ask her to do have done more to initiate real change? Probably not. That’s easy enough for us to say with the hindsight of 2025. “Tell Me Everything” is sharp enough not to ask that of her either, while being slightly wistful that things could have been a little different. Grade: B+ “Barbara Walters: Tell Me Everything” premiered at the 2025 Tribeca Film Festival. It will start streaming on Hulu on Monday, June 23. Want to stay up to date on IndieWire’s film reviews and critical thoughts? Subscribe here to our newly launched newsletter, In Review by David Ehrlich, in which our Chief Film Critic and Head Reviews Editor rounds up the best new reviews and streaming picks along with some exclusive musings — all only available to subscribers.",
  "image": "https://www.indiewire.com/wp-content/uploads/2025/06/BARBARA_WALTERS_-_Still_3___Gaddafi_Courtesy_ABC_News_Studios.jpg?w=650",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-alias=\"gutenberg-content__content\"\u003e\u003cp\u003eThe temptation to deliver scrubbed-clean hagiography with “\u003ca href=\"https://www.indiewire.com/t/barbara-walters/\" id=\"auto-tag_barbara-walters\" data-tag=\"barbara-walters\"\u003eBarbara Walters\u003c/a\u003e: Tell Me Everything” had to have been there: The \u003ca href=\"https://www.indiewire.com/features/general/barbara-walters-dead-1234795362/\"\u003ejournalist, who died at 93 in 2022\u003c/a\u003e, was the very definition of trailblazer, a woman who worked harder than all the men around her in the extraordinarily testosterone-filled boys club that was midcentury broadcast news, and all but single-handedly paved the way for women to have prominent on-air roles ever since. And Walters achieved that, despite starting out having to do “Today” show segments in the early 1960s that saw her doing stunts like dressing up as a Playboy bunny.\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eBut Jackie Jesko’s documentary goes beyond the obvious, just as Walters’ own interviews so often did. It’s clear-eyed about Walters’ transactional approach to arranging interviews, and about the discomforting allure “money, fame, and power,” in the words of her biographer Peter Gethers, held for her. \n\n\u003c/p\u003e\u003cdiv data-alias=\"cards__inner\" data-component=\"cards-related-content\" data-collapse-to-xs=\"false\" data-layout=\"inline\" data-size=\"md\" data-spacing=\"s-3\" data-cards-spacing=\"s0\"\u003e \u003cdiv data-alias=\"card__inner\" data-post-id=\"1235132153\" data-component=\"card\" data-has-background=\"false\" data-has-overlay=\"false\" data-layout-size=\"xs\" data-layout=\"sidebar\" data-main-alignment=\"s0\" data-main-spacing=\"s0\" data-media-position=\"\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"sixteenByNine\" data-round=\"false\"\u003e\u003ca href=\"https://www.indiewire.com/news/general-news/patricia-arquette-medium-david-lynch-daughter-1235132153/\" title=\"\" target=\"_self\" rel=\"\" data-card-index=\"0\" data-post-id=\"1235132153\"\u003e\u003cp\u003e\u003cimg src=\"https://www.indiewire.com/wp-content/uploads/2025/06/P115V8LW.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\" alt=\"Patricia Arquette at The Art of Elysium\u0026#39;s 2024 Heaven Gala.\" height=\"168\" width=\"300\" srcset=\"https://www.indiewire.com/wp-content/uploads/2025/06/P115V8LW.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=600%2C337 600w, https://www.indiewire.com/wp-content/uploads/2025/06/P115V8LW.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=125%2C70 125w, https://www.indiewire.com/wp-content/uploads/2025/06/P115V8LW.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=660%2C370 660w, https://www.indiewire.com/wp-content/uploads/2025/06/P115V8LW.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=50%2C28 50w, https://www.indiewire.com/wp-content/uploads/2025/06/P115V8LW.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=300%2C168 300w, https://www.indiewire.com/wp-content/uploads/2025/06/P115V8LW.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=1200%2C675 1200w\" sizes=\"auto, (max-width: 300px) 100vw, 300px\" loading=\"lazy\" decoding=\"async\" fetchpriority=\"auto\" data-attachment-id=\"1235132156\" data-wp-size=\"nova_size__sixteenbynine_small_cropped\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e  \u003cdiv data-alias=\"card__inner\" data-post-id=\"1235131868\" data-component=\"card\" data-has-background=\"false\" data-has-overlay=\"false\" data-layout-size=\"xs\" data-layout=\"sidebar\" data-main-alignment=\"s0\" data-main-spacing=\"s0\" data-media-position=\"\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"sixteenByNine\" data-round=\"false\"\u003e\u003ca href=\"https://www.indiewire.com/criticism/shows/gilded-age-season-3-review-finally-good-1235131868/\" title=\"\" target=\"_self\" rel=\"\" data-card-index=\"1\" data-post-id=\"1235131868\"\u003e\u003cp\u003e\u003cimg src=\"https://www.indiewire.com/wp-content/uploads/2025/06/The-Gilded-Age-Season-3-Carrie-Coon-Morgan-Spector.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\" alt=\"\u0026#39;The Gilded Age\u0026#39; Season 3 stars Merritt Wever, Morgan Spector, Carrie Coon, and Harry Richardson, shown here standing at the front of a crowd in church, looking concerned\" height=\"168\" width=\"300\" srcset=\"https://www.indiewire.com/wp-content/uploads/2025/06/The-Gilded-Age-Season-3-Carrie-Coon-Morgan-Spector.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=600%2C337 600w, https://www.indiewire.com/wp-content/uploads/2025/06/The-Gilded-Age-Season-3-Carrie-Coon-Morgan-Spector.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=125%2C70 125w, https://www.indiewire.com/wp-content/uploads/2025/06/The-Gilded-Age-Season-3-Carrie-Coon-Morgan-Spector.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=660%2C370 660w, https://www.indiewire.com/wp-content/uploads/2025/06/The-Gilded-Age-Season-3-Carrie-Coon-Morgan-Spector.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=50%2C28 50w, https://www.indiewire.com/wp-content/uploads/2025/06/The-Gilded-Age-Season-3-Carrie-Coon-Morgan-Spector.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=300%2C168 300w, https://www.indiewire.com/wp-content/uploads/2025/06/The-Gilded-Age-Season-3-Carrie-Coon-Morgan-Spector.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=1200%2C675 1200w\" sizes=\"auto, (max-width: 300px) 100vw, 300px\" loading=\"lazy\" decoding=\"async\" fetchpriority=\"auto\" data-attachment-id=\"1235131882\" data-wp-size=\"nova_size__sixteenbynine_small_cropped\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e \u003c/div\u003e\n\n\n\n\u003cp\u003eThere’s even a clip of her all but saying “I love dictators” — of whom she interviewed so many, including Muammar Gaddafi, Fidel Castro, Vladimir Putin, and Saddam Hussein, throughout her career — but the sexism she faced from colleagues such as Frank McGee, Harry Reasoner, and Peter Jennings was so extreme, their behavior \u003cem\u003ethat \u003c/em\u003eobnoxious, that it’s easy to turn Walters almost by default into a hero. That Jesko then resists hero-worship of her, especially as the documentary is produced by Walters’ longtime home ABC News, where Jesko herself has worked, is all the more impressive.\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eWalters always wanted to poke holes in her interview subjects’ carefully constructed armor. Not to take them down a peg necessarily, but to make them seem human. When she asked Gaddafi, “What did you want to be when you grew up when you were a child?,” her chauvinist colleagues saw that as the kind of touch-feely, estrogenic question they scoffed at. But, by any standard, isn’t that an interesting thing to ask a bloodthirsty terrorist ruler? What did you want to be \u003cem\u003ebefore\u003c/em\u003e you became a bloodthirsty terrorist ruler? In a moment like that, she’s literally practicing a more complete, holistic kind of journalism than her male colleagues.\u003c/p\u003e\n\n\n\n\u003cp\u003eJesko takes a non-linear approach to considering Walters’ life and calls upon one of the more spectacular “who’s who” rosters of talking heads in recent memory: Oprah, Bette Midler, Connie Chung, Katie Couric, Cindy Adams, and Bob Iger, among many others. What comes through is not just a portrait of Walters’ life, but of an entire media ecosystem that is no more. One in which major stars, and yes, dictators, would choose to “tell their story” to Walters; one in which she was who they went to first to craft their image in a particular moment. In the age of Instagram, that’s hardly needed and, as Couric notes, trailblazer though she was for women in broadcast journalism, there will also never be another Barbara Walters.\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eThe \u003ca href=\"https://www.indiewire.com/t/film/\" id=\"auto-tag_film\" data-tag=\"film\"\u003efilm\u003c/a\u003e does an incredible job of setting the stage for what one of those primetime interviews would be like: The army of producers and production assistants gadding around Walters, the carefully crafted lighting, the strategic application of makeup, Walters holding notecards containing upwards of 200 questions. She made the TV interview an event, an art, a primetime spectacle. The ecosystem of magazine news shows from her own “20/20” to same-network rival “Primetime Live” to “Dateline” to “48 Hours” would not have existed without her — she understood that viewers would be as interested, maybe more so, in the Menendez brothers as Israel-Palestine peace talks.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs gauzily crafted as these interviews were, Walters didn’t consider these to be “safe spaces” necessarily. Getting her interview subjects to cry was her specialty. She stared into the uncomfortable. In that regard, her journalism was well removed from the kind of journalism-as-PR that exists so much today — even with all the fruit baskets her assistants would send the assistants of potential interviewees to cajole them into setting up a sit-down.\u003c/p\u003e\n\n\n\n\u003cp\u003eJesko stares into the more uncomfortable aspects of Walters’ life herself. There’s her fraught relationship with her adopted daughter, Jackie, who Walters seemed to cajole into doing a primetime interview (not with Walters, but with ABC colleague Cynthia McFadden), and when Walters finally joins her daughter, there’s an unmistakable Daniel and H.W. Plainview vibe to their relationship. There’s her extremely close relationship with Roy Cohn as well, the legendary persecutor of the Rosenbergs and Donald Trump mentor, really just because Cohn helped get the tax evasion charges against her father dropped. Despite Cohn being gay, Walters and Cohn were so close that they even considered getting married. “Roy Cohn was famous, so he was worthwhile to Barbara,” Adams says at one moment in the documentary.\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003e“She did not have the strongest moral compass,” her own biographer Gethers notes. “A lot of the relationships she developed were career moves. And she was a pretty transactional person. She did not see things in that moral light.” Which perhaps explains why, when she was willing to “go there” and push back with so many of her interviewees, she also dealt with Donald Trump with kid gloves. Especially when Trump started relentlessly attacking Walters’ own hire, her co-host on “The View,” Rosie O’Donnell.\u003c/p\u003e\n\n\n\n\u003cp\u003eTo most viewers of that public spat, Walters seemed all but to side with Trump, and the incident is a notable exemption from Jesko’s film. O’Donnell is not there to add her two cents (whether she was asked to participate or not is unknown). Also telling is that her daughter Jackie does not weigh in for the documentary either. It also ignores some of the most cringe moments from Walters’ career, \u003ca href=\"https://www.indiewire.com/video/george-stephanopoulos-barbara-walters-brooke-shields-1234803440/\"\u003esuch as her uncomfortably sexual questions directed at an underage Brooke Shields\u003c/a\u003e, a moment this writer asked Walters’ ABC News colleague George Stephanopoulos about in 2023.\u003c/p\u003e\n\n\n\n\u003cp\u003e“\u003ca href=\"https://www.indiewire.com/t/barbara-walters-tell-me-everything/\" id=\"auto-tag_barbara-walters-tell-me-everything\" data-tag=\"barbara-walters-tell-me-everything\"\u003eBarbara Walters: Tell Me Everything\u003c/a\u003e” is then both an unvarnished portrait and a slightly incomplete one. Very subtly it does show how, as a woman operating in very much a man’s world, she opened the doors for others while not necessarily doing a whole lot to change the system and its paradigms and its power structures, full-stop. She operated \u003cem\u003ewithin\u003c/em\u003e the power structures that were until they accepted her and welcomed her, and knew when not to push back against the Trumps of this world. \n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eIs it fair of us now to ask her to do have done more to initiate real change? Probably not. That’s easy enough for us to say with the hindsight of 2025. “Tell Me Everything” is sharp enough not to ask that of her either, while being slightly wistful that things could have been a little different.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"grade-b\"\u003eGrade: B+\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e“Barbara Walters: Tell Me Everything” premiered at the 2025 \u003ca href=\"https://www.indiewire.com/t/tribeca/\"\u003eTribeca\u003c/a\u003e Film Festival. It will start streaming on Hulu on Monday, June 23.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eWant to stay up to date on IndieWire’s film \u003c/em\u003e\u003ca rel=\"noreferrer noopener nofollow\" target=\"_blank\" href=\"https://nam02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.indiewire.com%2Ft%2Freviews%2F\u0026amp;data=05%7C02%7Cczilko%40indiewire.com%7C4266c42bd05a4df0730008dd357e21e9%7Ce950f25546e44144a778a6ff4f557492%7C0%7C0%7C638725538026361085%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C\u0026amp;sdata=XjIvPqAbkAZs0xiw7ewb%2F4m5IUoAeVy6CsVN5mpzzi0%3D\u0026amp;reserved=0\"\u003e\u003c/a\u003e\u003cstrong\u003e\u003cem\u003e\u003ca href=\"https://www.indiewire.com/t/reviews/\"\u003ereviews\u003c/a\u003e\u003c/em\u003e\u003c/strong\u003e\u003cem\u003e and critical thoughts? \u003c/em\u003e\u003ca rel=\"noreferrer noopener nofollow\" target=\"_blank\" href=\"https://nam02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fcloud.email.indiewire.com%2Fnewsletters\u0026amp;data=05%7C02%7Cczilko%40indiewire.com%7C4266c42bd05a4df0730008dd357e21e9%7Ce950f25546e44144a778a6ff4f557492%7C0%7C0%7C638725538026381765%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C\u0026amp;sdata=IqTnBDZHYmXpoy12uMJuU8pc2gOhk3yYEwjux30Dq%2BI%3D\u0026amp;reserved=0\"\u003e\u003cstrong\u003e\u003cem\u003eSubscribe here\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003cem\u003e to our newly launched newsletter, In Review by David Ehrlich, in which our Chief Film Critic and Head Reviews Editor rounds up the best new reviews and streaming picks along with some exclusive musings — all only available to subscribers. \u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-06-13T01:00:00Z",
  "modifiedTime": "2025-06-13T01:00:00Z"
}
