{
  "id": "1c3ccb7b-af55-4a93-bfbc-9d2ac9eb4ed5",
  "title": "The Twilight Zone Character You Likely Forgot Cheers Star George Wendt Played",
  "link": "https://www.slashfilm.com/1865392/cheers-star-george-wendt-the-twilight-zone-character/",
  "description": "Cheers made George Wendt a comedy icon, but he flexed his thriller muscles in an oft-forgotten episode of The Twilight Zone.",
  "author": "Ryan Scott",
  "published": "Tue, 20 May 2025 22:45:00 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Horror Shows",
    "Thriller Shows",
    "Science Fiction Shows"
  ],
  "byline": "Ryan Scott",
  "length": 4093,
  "excerpt": "Cheers made George Wendt a comedy icon, but he flexed his thriller muscles in an oft-forgotten episode of The Twilight Zone.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slashfilm-favicon.png",
  "text": "CBS We may receive a commission on purchases made from links. George Wendt was a truly beloved actor known best to the world as Norm from \"Cheers.\" Wendt tragically passed away on May 20, 2025, but he leaves behind an immense body of work. Not only does he have a whopping 269 episodes of \"Cheers\" (and one memorable cameo on \"The Simpsons\"), but the man had more than 170 acting credits to his name spanning nearly five decades. In that time, Wendt had the opportunity to put his small stamp on another classic TV series. Advertisement The show in question is none other than \"The Twilight Zone.\" Created by Rod Serling, the sci-fi anthology series, which originally aired in the '60s on CBS, is still widely regarded today as one of the best shows in the history of television. That's why CBS has revived it several times over the years, including the most recent, short-lived \"Twilight Zone\" reboot from horror master Jordan Peele. One of the lesser-discussed eras for the show came in the '80s when CBS revived the series for a new generation. It's during this era that Wendt appeared in an oft-forgotten episode. As part of the fourth episode of the revival's second season, Wendt appeared in a segment entitled \"The World Next Door.\" It was paired with two other segments, \"The After Hours\" and \"Lost and Found.\" One would be forgiven for not remembering this episode, but for those who are curious, the synopsis for the episode (via TV Tropes) reads as follows: Advertisement Barney Schlessinger (George Wendt) is a part-time inventor whose gadgets, often highly impractical, are rebuked by his wife Katy (Bernadette Birkett). Barney has also been having frequent dreams where he lives a second life in an alternate world stuck in the early 20th century, where he is a noted business tycoon and the talk of his town. When he is able to enter this world via a strange door in his basement, Barney learns that his counterpart has dreams identical in motivation to his, wanting to escape to a world where he is freed from the trappings of fame, while the regular Barney seeks to gain said fame for himself. The World Next Door was not part of a well regarded Twilight Zone episode CBS This very much sounds like a classic premise befitting the show. It's got a big sci-fi component. It's got that classic \"be careful what you wish for\" lesson at its center. It's easy to see why it got made. That said, while the '80s \"Twilight Zone\" revival had its moments, such as some segments from Wes Craven, it's not nearly as highly regarded as the original series. Moreover, the episode in which Wendt appeared isn't exactly held up as a classic. As such, it's very likely that even hardcore fans of the show haven't seen it. Advertisement To make matters even more complicated, even those who were curious to check it out now would have a difficult time doing so. The 1985 era of the series isn't currently streaming on Paramount+ alongside the original series. It's a little tough to track down by modern TV standards. Plus, these episodes were never in quite as heavy rotation on cable, meaning it's far less likely that viewers would have stumbled upon it. That's a bit of a shame, in retrospect. George Wendt made himself a TV legend thanks to \"Cheers.\" Undoubtedly, more people would probably like to check out his episode of \"The Twilight Zone\" once they find out it even exists, even if it's out of sheer curiosity. It is nothing if not interesting to consider that Wendt did make his mark on this franchise, even if it was a relatively small one. Advertisement You can grab \"The Twilight Zone: The Complete 80s Series\" on DVD from Amazon.",
  "image": "https://www.slashfilm.com/img/gallery/the-twilight-zone-character-you-likely-forgot-cheers-star-george-wendt-played/l-intro-1747778893.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                                \n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1865392/cheers-star-george-wendt-the-twilight-zone-character/\" data-post-title=\"The Twilight Zone Character You Likely Forgot Cheers Star George Wendt Played\" data-slide-num=\"0\" data-post-id=\"1865392\"\u003e\n                                             \u003cpicture id=\"p32e6802fda48588466c428171479146d\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-twilight-zone-character-you-likely-forgot-cheers-star-george-wendt-played/intro-1747778893.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-twilight-zone-character-you-likely-forgot-cheers-star-george-wendt-played/intro-1747778893.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/the-twilight-zone-character-you-likely-forgot-cheers-star-george-wendt-played/intro-1747778893.jpg\" data-slide-url=\"https://www.slashfilm.com/1865392/cheers-star-george-wendt-the-twilight-zone-character/\" data-post-id=\"1865392\" data-slide-num=\"0\" data-slide-title=\"The Twilight Zone Character You Likely Forgot Cheers Star George Wendt Played: \" width=\"780\" height=\"438\" alt=\"George Wendt as Barney Schlesinger with his mustache in The Twilight Zone episode The World Next Door\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eCBS\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \u003cp\u003e\u003cem\u003e\u003csmall\u003eWe may receive a commission on purchases made from links.\u003c/small\u003e\u003c/em\u003e\u003c/p\u003e\n                \n                \n\u003cp dir=\"ltr\"\u003eGeorge Wendt was a truly beloved actor known best to the world as Norm from \u0026#34;Cheers.\u0026#34; Wendt tragically passed away on May 20, 2025, but he leaves behind an immense body of work. Not only does he have a whopping 269 episodes of \u003ca href=\"https://www.slashfilm.com/1767580/the-simpsons-episode-fear-of-flying-cheers-cast-cameo/\" target=\"_blank\"\u003e\u0026#34;Cheers\u0026#34; (and one memorable cameo on \u0026#34;The Simpsons\u0026#34;)\u003c/a\u003e, but the man had more than 170 acting credits to his name spanning nearly five decades. In that time, Wendt had the opportunity to put his small stamp on another classic TV series.\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eThe show in question is none other than \u0026#34;The Twilight Zone.\u0026#34; Created by Rod Serling, the sci-fi anthology series, which originally aired in the \u0026#39;60s on CBS, is still widely regarded today as one of the best shows in the history of television. That\u0026#39;s why CBS has revived it several times over the years, including the most recent, \u003ca href=\"https://www.slashfilm.com/579612/the-twilight-zone-reboot-canceled/\" target=\"_blank\"\u003eshort-lived \u0026#34;Twilight Zone\u0026#34; reboot from horror master Jordan Peele\u003c/a\u003e. One of the lesser-discussed eras for the show came in the \u0026#39;80s when CBS revived the series for a new generation. It\u0026#39;s during this era that Wendt appeared in an oft-forgotten episode.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eAs part of the fourth episode of the revival\u0026#39;s second season, Wendt appeared in a segment entitled \u0026#34;The World Next Door.\u0026#34; It was paired with two other segments, \u0026#34;The After Hours\u0026#34; and \u0026#34;Lost and Found.\u0026#34; One would be forgiven for not remembering this episode, but for those who are curious, the synopsis for the episode (via \u003ca href=\"https://tvtropes.org/pmwiki/pmwiki.php/Recap/TheTwilightZone1985S2E4\" target=\"_blank\"\u003eTV Tropes\u003c/a\u003e) reads as follows:\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\"\u003eBarney Schlessinger (George Wendt) is a part-time inventor whose gadgets, often highly impractical, are rebuked by his wife Katy (Bernadette Birkett). Barney has also been having frequent dreams where he lives a second life in an alternate world stuck in the early 20th century, where he is a noted business tycoon and the talk of his town. When he is able to enter this world via a strange door in his basement, Barney learns that his counterpart has dreams identical in motivation to his, wanting to escape to a world where he is freed from the trappings of fame, while the regular Barney seeks to gain said fame for himself.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eThe World Next Door was not part of a well regarded Twilight Zone episode\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1865392/cheers-star-george-wendt-the-twilight-zone-character/\" data-post-title=\"The Twilight Zone Character You Likely Forgot Cheers Star George Wendt Played\" data-slide-num=\"1\" data-post-id=\"1865392\"\u003e\n                                             \u003cpicture id=\"pa5f380f3f58b47f28947302c26d062e1\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-twilight-zone-character-you-likely-forgot-cheers-star-george-wendt-played/the-world-next-door-was-not-part-of-a-well-regarded-twilight-zone-episode-1747778894.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-twilight-zone-character-you-likely-forgot-cheers-star-george-wendt-played/the-world-next-door-was-not-part-of-a-well-regarded-twilight-zone-episode-1747778894.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/the-twilight-zone-character-you-likely-forgot-cheers-star-george-wendt-played/the-world-next-door-was-not-part-of-a-well-regarded-twilight-zone-episode-1747778894.jpg\" data-slide-url=\"https://www.slashfilm.com/1865392/cheers-star-george-wendt-the-twilight-zone-character/\" data-post-id=\"1865392\" data-slide-num=\"1\" data-slide-title=\"The Twilight Zone Character You Likely Forgot Cheers Star George Wendt Played: The World Next Door was not part of a well regarded Twilight Zone episode\" width=\"780\" height=\"438\" alt=\"Rod Serling setting up The Twilight Zone episode Five Characters in Search of an Exit\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eCBS\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eThis very much sounds like a classic premise befitting the show. It\u0026#39;s got a big sci-fi component. It\u0026#39;s got that classic \u0026#34;be careful what you wish for\u0026#34; lesson at its center. It\u0026#39;s easy to see why it got made. That said, while the \u0026#39;80s \u003ca href=\"https://www.slashfilm.com/1801533/the-twilight-zone-segments-directed-by-horror-master-wes-craven/\" target=\"_blank\"\u003e\u0026#34;Twilight Zone\u0026#34; revival had its moments, such as some segments from Wes Craven\u003c/a\u003e, it\u0026#39;s not nearly as highly regarded as the original series. Moreover, the episode in which Wendt appeared isn\u0026#39;t exactly held up as a classic. As such, it\u0026#39;s very likely that even hardcore fans of the show haven\u0026#39;t seen it.\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eTo make matters even more complicated, even those who were curious to check it out now would have a difficult time doing so. The 1985 era of the series isn\u0026#39;t currently streaming on Paramount+ alongside the original series. It\u0026#39;s a little tough to track down by modern TV standards. Plus, these episodes were never in quite as heavy rotation on cable, meaning it\u0026#39;s far less likely that viewers would have stumbled upon it.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eThat\u0026#39;s a bit of a shame, in retrospect. \u003ca href=\"https://www.slashfilm.com/1458183/cheers-writers-hated-norm-entrance-lines/\" target=\"_blank\"\u003eGeorge Wendt made himself a TV legend thanks to \u0026#34;Cheers.\u0026#34;\u003c/a\u003e Undoubtedly, more people would probably like to check out his episode of \u0026#34;The Twilight Zone\u0026#34; once they find out it even exists, even if it\u0026#39;s out of sheer curiosity. It is nothing if not interesting to consider that Wendt did make his mark on this franchise, even if it was a relatively small one.\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://www.amazon.com/Twilight-Zone-Complete-80s/dp/B08GRH4QGT/ref=sr_1_1?crid=23CCLHJIRFRC5\u0026amp;dib=eyJ2IjoiMSJ9.iFhG0_m65iP45B3t4jdX9lAOQ7fmuhEmw3zHLJKNJDvhljIOnzKLIQ7-HkrRbe5hqXBftL6QzoN_7F91oc7W6oz3SXoP4kMYeUgRI6Jw9WtPqZaW_4ByvpSHrwomOYN5z7_nodgThI2_LSFlMbmPVN3-kvfoJWJpEsZu_4PRGZbn0DaldgF6IrkKRDe7ftq2qGnUk_BnrHv3hHhDQwN2Ly9j5htroPhvwOcQ4plbCQg.6UaFE5Gxs_ZjkBJNWZjOC-18qgglFuBQOu5ttBjTN-c\u0026amp;dib_tag=se\u0026amp;keywords=the%20twilight%20zone%201980s\u0026amp;qid=1747773868\u0026amp;sprefix=the%20twilight%20zone%201980s,aps,234\u0026amp;sr=8-1\u0026amp;tag=staticmedia-slashfilm-20\" target=\"_blank\" rel=\"sponsored nofollow\"\u003eYou can grab \u0026#34;The Twilight Zone: The Complete 80s Series\u0026#34; on DVD from Amazon\u003c/a\u003e.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-05-20T22:45:00Z",
  "modifiedTime": "2025-05-20T22:45:00Z"
}
