{
  "id": "1e208607-e3cc-423b-af0a-7baf648d507d",
  "title": "Kathleen Kennedy Speaks On Her Lucasfilm Plans — She Is Not Soon Retiring — \u0026 The Films That Will Keep Her In ‘Star Wars’ Orbit For Years To Come",
  "link": "https://deadline.com/2025/02/kathleen-kennedy-clarifies-lucasfilm-exit-star-wars-future-1236304421/",
  "description": "EXCLUSIVE: I thought I’d seen it all in trade journalism, but the piranha-like frenzy on Kathleen Kennedy and the successor speculation that followed Matt Belloni’s Puck report that Disney was putting her out to pasture, is a new one on me. Belloni has for years been beating on Kennedy like she owes him money, and […]",
  "author": "Mike Fleming",
  "published": "Fri, 28 Feb 2025 00:36:14 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "News",
    "Kathleen Kennedy",
    "Kathleen Kennedy Interview",
    "Lucasfilm",
    "Retirement rumors",
    "Star Wars"
  ],
  "byline": "Mike Fleming Jr",
  "length": 17889,
  "excerpt": "Kathleen Kennedy Speaks On Her Lucasfilm Future -- She Is Not soon Retiring -- \u0026 The Films That Will Keep Her In 'Star Wars' Mode For Years To Come",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "EXCLUSIVE: I thought I’d seen it all in trade journalism, but the piranha-like frenzy on Kathleen Kennedy and the successor speculation that followed Matt Belloni’s Puck report that Disney was putting her out to pasture, is a new one on me. Belloni has for years been beating on Kennedy like she owes him money, and he this week reported Kennedy was retiring. I recall he essentially did the same thing more than a year ago, and yet here she still is, producing The Mandalorian movie and prepping the Shawn Levy-directed Star Wars film which Ryan Gosling is circling, as well as numerous other film and streaming projects with A-list participants. Still, the trades followed with gusto, dishing speculative reporting on who might succeed Kennedy. The takeaway was chaos and that Kennedy was being pushed. The reality is different and far more orderly. According to insiders, Kennedy has been working on a succession plan for a couple years, eyeing candidates from within in process with Bob Iger and Alan Bergman (that puts someone like Dave Feloni who knows the universe inside out in a strong position). I admire Belloni’s hustle and ability to turn over hard ground, but his penchant for defining industry people like Kennedy in disparaging ways, well, I just don’t understand that. I didn’t appreciate it when Deadline founder Nikki Finke did it here and it feels like the appetite for schadenfreude is nowhere near as high now, given how this business is still trying to regain footing after the global pandemic, the year long labor strikes, and most recently, the devastating wildfires that ravaged Southern California. Kennedy would seem an unlikely target for ire in good times or bad: 13 years into her run steering Lucasfilm, she has done much with the challenge of trying to broaden George Lucas’ Star Wars vision after Disney bought it from him for $4 billion in cash and stock. It’s a challenge Amazon will now try with James Bond after purchasing creative control from 007 gatekeepers for $1 billion beyond the $8 billion they paid for MGM. Watch on Deadline Kennedy is arguably the most successful female producer/executive in Hollywood history. She has produced over 70 films that have collected 120 Oscar noms and 25 wins, and she herself was awarded the honorary Oscar with the Irving G. Thalberg Memorial Award, with eight other Oscar noms. Her resume is dotted with classics like Jurassic Park, The Sixth Sense, the Indiana Jones franchise, E.T., Munich, Lincoln, The Color Purple, War of the Worlds, Poltergeist, Schindler’s List, the Back to the Future franchise and so many others. While it has always been a challenge to please the Star Wars faithful and there have been some misfires, the five Star Wars films she has produced have grossed nearly $6 billion, with streaming series successes topped by The Mandalorian and Andor. Sorry Matt, the woman is a first ballot Hall of Famer, not someone who deserves to be batted around like a piñata. She also deserves to own her own narrative and demystify this pseudo-drama. Deadline gave her that opportunity, catching her just before she headed off to be honored tonight with husband Frank Marshall at the Oscar Wilde Awards. DEADLINE: We’ve read all these speculative reports that you are out, that there’s a frenzy for the next person who’s going to take over Lucasfilm. What is the truth? KATHLEEN KENNEDY: The truth is, and I want to just say loud and clear, I am not retiring. I will never retire from movies. I will die making movies. That is the first thing that’s important to say. I am not retiring. What’s happening at Lucasfilm is I have been talking for quite some time with both Bob and Alan about what eventual succession might look like. We have an amazing bench of people here, and we have every intention of making an announcement months or a year down the road. We are in lockstep as to what that’s going to be, and I am continuing. I’m producing Mandalorian the movie right now, and I’m also producing Sean Levy’s movie, which is after that. So I’m continuing to stay at Lucasfilm and looking very thoughtfully with Bob and Alan as to who’s stepping in. So that is all underway, and we have every right to make that announcement when we want to make it. DEADLINE: That you are looking within seems to give credence to what we’ve heard, that an exec like chief creative officer Dave Filoni is in a good position, as he works on a Star Wars to write and direct. KENNEDY: I can’t say who it is, because there’s just an internal process that goes on inside a large corporation and a publicly held company, as to how we go about making deals, finalizing decisions, and making announcements. There’s nothing unusual about that, and we’re in that process. DEADLINE: This flurry of press coverage, it sounds like chaos. What’s the reality? KENNEDY: Chaos? There has never been any chaos because we know exactly what the plan is. And we’ve been talking about it, as I said, nonstop for the last couple of years because for obvious reasons, I’m not going to be here forever. George asked me 13 years ago to step in, and now I’m looking at who’s going to replace me. And as I said, we have a bench of people internally to handle the business, the creative side. The job has grown also since I stepped in. There was no streaming, there weren’t a lot of the things that we’re involved in right now going on. So it has grown. DEADLINE: How far down the road do you expect before a change gets made and then you go off and produce these two big Star Wars things? KENNEDY: We’ll probably make an announcement months or a year out, and I have every intention of sticking around to help that person be successful. I’m already producing the Mandalorian movie, and Shawn Levy’s is after that. DEADLINE: I recall these same retirement predictions were rendered awhile ago, and you reupped and here you are. What do you make of this fixation on your job status? KENNEDY: I truly don’t know. And any discussion previously about me retiring or quitting or any of those things, that’s complete rumor mill because through all these reports, I have just continued doing my job, and continuing my contract. Nothing unusual. It all has just been manufactured. DEADLINE: The connotation is you’re being pushed aside, in need of being replaced, though that’s not what I’ve heard. KENNEDY: Is absolutely not the case. It could not be further from the truth. And everything that we do inside of Lucasfilm is in lockstep and in communication with Disney. We all know what’s going on. The communication has been completely collaborative as you would expect. This is a big piece of business for them, and they want to empower me to help them make that decision and that choice. I’m doing that. DEADLINE: Well, you know what? I’m placing some blame on Marvel’s Kevin Feige, because he had that magnificent streak of superhero hits and set an impossible high bar. But now he’s starting to take shrapnel. How daunting is it to run a company based on beloved and iconic IP? What has been the most challenging thing about running Lucasfilm when fans of the original trilogy fixate measure everything against it, and don’t see the business need of broadening the franchise when Disney paid so much for it? It’s what will now go through with James Bond. KENNEDY: It is something I think about all the time. It’s fascinating to think about how you sustain a brand, especially Star Wars, which is just about to celebrate its 50th anniversary. And so to analyze and understand what was inspiring George when he created Star Wars, when he was still looking at Saturday matinees and Buck Rogers and Flash Gordon, and those are things of the past and politically what he was reflecting in his stories. Because Star Wars has always had a kind of world building, and it reflects a certain amount of our society. The world, needless to say, is changing by the second, and consequently, the audience has changed dramatically. How they consume things. We’re seeing this reflected in the health of the movie business, and what it really means for streaming and what are all these other platforms that may be on the horizon. You’re trying to look forward. And at the same time, you’re trying to create stories that feel familiar. So you’re moving into the future, but you’re maintaining a sense of familiarity. I think that’s the hardest balance. Then when you have a brand that’s this expansive, you’re also…and this is something we work very hard at, you try to find different entry points for different generations because that’s what Star Wars has always been. It’s a very generational brand, and we want to sustain that, and we work hard to sustain that. So George gave us the gift of storytelling being across lots of different genres, and that gives us a lot of opportunity to try things. What we’ve really enjoyed about the streaming space is we’ve been able to experiment. It’s harder to do that in the movie space. And now I think that that’s why it feels so good to be able to move into a Mandalorian movie as we’re coming off of three seasons of a very successful show. We’ve actually built an audience for that, and we gave the young audience an opportunity to enter Star Wars at a different place and not feel like you have to have seen everything. It can become their Star Wars. And that, I think is, is the fun storytelling challenge. DEADLINE: You’ve got a long resume of big movies. Compared to that, how much tougher is the challenge of so much public scrutiny and second guessing by the rabid fan base? It’s not uncommon to develop a project with big names, who fall out when visions don’t align, but they get reported as a big implosion. KENNEDY: What you just said though is so interesting to me, Mike, because that is the development. It doesn’t matter if you’re doing Star Wars, or anything else. What’s troubling and frustrating is that our development gets scrutinized, and I don’t know any other production company where their development gets scrutinized like that. It’s very hard for anything to happen within Star Wars without some aspect of it becoming public before you even want it to become public. So I guess managing the message in some way is also quite a challenge because of course, not every single thing we put in development are we going to make. That’s not unusual. We want to make those things that we feel are the best. We want to make those things that, as time passes, feel relevant to what the audience is responding to. So there’s constant discussion around that. So yeah, that’s a tricky one because a lot of the scrutiny around Star Wars and the negativity has been about development. Of course, we’re going to develop lots of different things with an understanding that not everything gets made. DEADLINE: I broke a piece last fall about Simon Kinberg making a deal to write and produce a Star Wars trilogy. How’s that going? KENNEDY: We’re absolutely rolling fast and furiously. That has gone exceptionally well, and he’s literally going to script as we speak. We’ll see something probably around June. Simon, if you remember, he did some work with us years ago with the animated show, which was a really wonderful collaborative experience. And he then got very, very busy with X-Men and then recently became available again, and he segued into this space beautifully. We’re really excited about where that’s headed. DEADLINE: There are spinoffs and then there is the core Star Wars story broken into trilogies. Is this a continuation of that? KENNEDY: This is the next iteration, the new saga that moves us into the future. DEADLINE: And the one by Deadpool \u0026 Wolverine director Shawn Levy? KENNEDY: That’s also in the future. It’s all post [the first] nine. Shawn’s is a standalone Star Wars story that’ll take place post 9, maybe five or six years out. And Mandalorian really stands on its own because there, we’re dealing with a whole other era in the New Republic. We have other development going on in that space as well. So that’s the space that we’re pretty much focused on right at the moment, because obviously with Mandalorian we have a pretty good sense of where that’s going. And with this, it’s all pretty much new characters. We may bring some of the characters back from the sequel saga, but pretty much new characters. DEADLINE: How many development type projects do you have percolating that you feel confident will turn into something down the line? KENNEDY: To play it safe, I’d say three or four right at the moment. And a large part of it, Mike, is who is the talent we’re attaching? And that’s a challenge in and of itself these days because people get really busy. So you find yourself having to wait with a lot of the top talent doing streaming and movies now. They’re juggling schedules. And when you do Star Wars, you pretty much have to step into it and not have any other competing work going on. It’s a good two to three years minimum commitment, and that’s tough to get top talent to be able to carve out that kind of time. So that’s part of the challenge as well. DEADLINE: You’ve still got that prequel with James Mangold, who’s Oscar nominated for the Bob Dylan movie A Compete Unknown? KENNEDY: Yep. He’s working on this script right now. Simon’s working on scripts right now. Shawn, we had been working with him already for about a year and a half. These guys are available now. Jim, he got delayed a bit because of the Dylan movie and the awards season. You have to accommodate top talent to a certain extent. And quality is so important with what it is we’re trying to do. I like to wait for people that I think are passionate and really good to step into Star Wars. DEADLINE: Any others that I’ve forgotten? KENNEDY: Well, I keep waiting for Taika and he is working with another writer now. He’s so busy. I love him, I think if we ever do get a script from Taika, it’s going to be fantastic. I already saw a first act that I loved, but tying him down it’s tricky. DEADLINE: I still remember seeing his Thor Ragnarock, entering with low expectations, watching his exuberant vision and thinking, this is what you want when you go to a movie theater on a Saturday night. KENNEDY: It’s so true. And that’s exactly the tone we’re always looking for with filmmakers who can pull that off. It’s not like they’re a dime a dozen. You’re really trying to find the diamond in the rough and he’s one of them. DEADLINE: So even when you hand the reins to a Lucasfilm protege, it sure sounds like you’re going to be in that world for eight or ten years. Fair? KENNEDY: I don’t know if I’m going to say that, but yeah, it’s possible. DEADLINE: Might you also go back to working with your husband, Frank Marshall, who’s doing a documentary on Barbra Streisand, another on Fleetwood Mac… KENNEDY: He is truly something. I cannot keep pace most of the time with what he’s doing. And then he just opened a play on Broadway and he’s finishing Jurassic. It makes me feel like I’m standing still. DEADLINE: Do you look forward to a point where the two of you can kind of focus on collaborating on these projects that you’ve always cooked up together, whether it was at Amblin or elsewhere? KENNEDY: Oh, sure. If something came along that the two of us…we loved coming back together and being able to work with Mangold on the Indy movie [Indiana Jones and the Dial of Destiny], that was a real treat. And to be working with Steven [Spielberg] and as they say, getting the band back together, that was really fun. We had a blast. DEADLINE: Any regrets? KENNEDY: No, I mean far from regrets. I’ve loved the challenge of stepping into this space, and literally space and being with Star Wars over these years. Taking on the challenges of expanding on Star Wars. I’ve loved working with Disney and the company has been fantastic in its support of the IP. They’ve expanded things in ways I don’t think George could have even imagined. And it’s been such a learning experience. I’ve never been an executive before. I’m a filmmaker through and through. I even approached the executive role as a filmmaker. I love working with filmmakers. That is my lifeblood. It’s what I enjoy more than anything. And being able to do that inside of Star Wars has been really fun because we have people who step into Star Wars who are diehard fans, and we have people who step into Star Wars who never really knew the IP that well. And you look at someone like Tony Gilroy. He has done transformative, exceptional work. I’ve been working with Tony for more than a decade. I don’t think Tony would’ve ever imagined he would’ve done that. That creative experience on Andor has been fantastic. And second season is coming out next month. That’s where the satisfaction comes from for me, and I just hope that continues. DEADLINE: Will you arm twist Tony into doing one of these Star Wars movies after he was the uncredited backstop on Rogue One? KENNEDY: I don’t know if I can. I don’t think he ever believed he’d be decade inside Star Wars. He’s writing some things on his own, and I think he’d like to get back into the director’s chair. So we’ll see what he does. But he’s such a talent, just fantastic. DEADLINE: He also provided the creative spine for The Bourne Identity… KENNEDY: That’s how we all met. DEADLINE: Two final questions. Will you step out as Lucasfilm boss this year? KENNEDY: We really don’t know at this stage. There’s so much going on, Mike. I don’t know. DEADLINE: When it happens, who’ll make the decision? KENNEDY: Me. It’s my decision. This is 100 percent my decision.",
  "image": "https://deadline.com/wp-content/uploads/2025/02/GettyImages-1502553828-e1740464706693.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\t\u003cstrong\u003eEXCLUSIVE\u003c/strong\u003e: I thought I’d seen it all in trade journalism, but the piranha-like frenzy on \u003ca href=\"https://deadline.com/tag/kathleen-kennedy/\" id=\"auto-tag_kathleen-kennedy\" data-tag=\"kathleen-kennedy\"\u003eKathleen Kennedy\u003c/a\u003e and the successor speculation that followed Matt Belloni’s Puck report that Disney was putting her out to pasture, is a new one on me. Belloni has for years been beating on Kennedy like she owes him money, and he this week reported Kennedy was retiring. I recall he essentially did the same thing more than a year ago, and yet here she still is, producing \u003cem\u003eThe Mandalorian\u003c/em\u003e movie and prepping the Shawn Levy-directed \u003cem\u003e\u003ca href=\"https://deadline.com/tag/star-wars/\" id=\"auto-tag_star-wars\" data-tag=\"star-wars\"\u003eStar Wars\u003c/a\u003e\u003c/em\u003e film which Ryan Gosling is circling, as well as numerous other film and streaming projects with A-list participants.\n\n\t\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\n\tStill, the trades followed with gusto, dishing speculative reporting on who might succeed Kennedy. The takeaway was chaos and that Kennedy was being pushed. The reality is different and far more orderly. According to insiders, Kennedy has been working on a succession plan for a couple years, eyeing candidates from within in process with Bob Iger and Alan Bergman (that puts someone like Dave Feloni who knows the universe inside out in a strong position). I admire Belloni’s hustle and ability to turn over hard ground, but his penchant for defining industry people like Kennedy in disparaging ways, well, I just don’t understand that. I didn’t appreciate it when Deadline founder Nikki Finke did it here and it feels like the appetite for schadenfreude is nowhere near as high now, given how this business is still trying to regain footing after the global pandemic, the year long labor strikes, and most recently, the devastating wildfires that ravaged Southern California. Kennedy would seem an unlikely target for ire in good times or bad: 13 years into her run steering \u003ca href=\"https://deadline.com/tag/lucasfilm/\" id=\"auto-tag_lucasfilm\" data-tag=\"lucasfilm\"\u003eLucasfilm\u003c/a\u003e, she has done much with the challenge of trying to broaden George Lucas’ \u003cem\u003eStar Wars\u003c/em\u003e vision after Disney bought it from him for $4 billion in cash and stock. It’s a challenge Amazon will now try with James Bond after purchasing creative control from 007 gatekeepers for $1 billion beyond the $8 billion they paid for MGM. \n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234771711\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tKennedy is arguably the most successful female producer/executive in Hollywood history. She has produced over 70 films that have collected 120 Oscar noms and 25 wins, and she herself was awarded the honorary Oscar with the Irving G. Thalberg Memorial Award, with eight other Oscar noms. Her resume is dotted with classics like \u003cem\u003eJurassic Park, The Sixth Sense\u003c/em\u003e, the \u003cem\u003eIndiana Jones\u003c/em\u003e franchise, \u003cem\u003eE.T.,  Munich, Lincoln, The Color Purple, War of the Worlds, Poltergeist\u003c/em\u003e, \u003cem\u003eSchindler’s List\u003c/em\u003e, the \u003cem\u003eBack to the Future\u003c/em\u003e franchise and so many others. While it has always been a challenge to please the \u003cem\u003eStar Wars\u003c/em\u003e faithful and there have been some misfires, the five \u003cem\u003eStar Wars \u003c/em\u003efilms she has produced have grossed nearly $6 billion, with streaming series successes topped by \u003cem\u003eThe Mandalorian \u003c/em\u003eand \u003cem\u003eAndor. \u003c/em\u003e Sorry Matt, the woman is a first ballot Hall of Famer, not someone who deserves to be batted around like a piñata. She also deserves to own her own narrative and demystify this pseudo-drama. Deadline gave her that opportunity, catching her just before she headed off to be honored tonight with husband Frank Marshall at the Oscar Wilde Awards.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: We’ve read all these speculative reports that you are out, that there’s a frenzy for the next person who’s going to take over Lucasfilm. What is the truth?\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKATHLEEN KENNEDY\u003c/strong\u003e: The truth is, and I want to just say loud and clear, I am not retiring. I will never retire from movies. I will die making movies. That is the first thing that’s important to say. I am not retiring. What’s happening at Lucasfilm is I have been talking for quite some time with both Bob and Alan about what eventual succession might look like. We have an amazing bench of people here, and we have every intention of making an announcement months or a year down the road. We are in lockstep as to what that’s going to be, and I am continuing. I’m producing \u003cem\u003eMandalorian\u003c/em\u003e the movie right now, and I’m also producing Sean Levy’s movie, which is after that. So I’m continuing to stay at Lucasfilm and looking very thoughtfully with Bob and Alan as to who’s stepping in. So that is all underway, and we have every right to make that announcement when we want to make it. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: That you are looking within seems to give credence to what we’ve heard, that an exec like chief creative officer Dave Filoni is in a good position, as he works on a Star Wars to write and direct.\u003c/em\u003e\u003c/strong\u003e \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKENNEDY\u003c/strong\u003e: I can’t say who it is, because there’s just an internal process that goes on inside a large corporation and a publicly held company, as to how we go about making deals, finalizing decisions, and making announcements. There’s nothing unusual about that, and we’re in that process.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: This flurry of press coverage, it sounds like chaos. What’s the reality?\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKENNEDY\u003c/strong\u003e:  Chaos? There has never been any chaos because we know exactly what the plan is. And we’ve been talking about it, as I said, nonstop for the last couple of years because for obvious reasons, I’m not going to be here forever. George asked me 13 years ago to step in, and now I’m looking at who’s going to replace me. And as I said, we have a bench of people internally to handle the business, the creative side. The job has grown also since I stepped in. There was no streaming, there weren’t a lot of the things that we’re involved in right now going on. So it has grown.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: How far down the road do you expect before a change gets made and then you go off and produce these two big Star Wars things? \u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKENNEDY\u003c/strong\u003e: We’ll probably make an announcement months or a year out, and I have every intention of sticking around to help that person be successful. I’m already producing the Mandalorian movie, and Shawn Levy’s is after that. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: I recall these same retirement predictions were rendered awhile ago, and you reupped and here you are. What do you make of this fixation on your job status?\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKENNEDY\u003c/strong\u003e: I truly don’t know. And any discussion previously about me retiring or quitting or any of those things, that’s complete rumor mill because through all these reports, I have just continued doing my job, and continuing my contract. Nothing unusual. It all has just been manufactured. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: The connotation is you’re being pushed aside, in need of being replaced, though that’s not what I’ve heard. \u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKENNEDY\u003c/strong\u003e: Is absolutely not the case. It could not be further from the truth. And everything that we do inside of Lucasfilm is in lockstep and in communication with Disney. We all know what’s going on. The communication has been completely collaborative as you would expect. This is a big piece of business for them, and they want to empower me to help them make that decision and that choice. I’m doing that.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: Well, you know what? I’m placing some blame on Marvel’s Kevin Feige, because he had that magnificent streak of superhero hits and set an impossible high bar. But now he’s starting to take shrapnel. How daunting is it to run a company based on beloved and iconic IP? What has been the most challenging thing about running Lucasfilm when fans of the original trilogy fixate measure everything against it, and don’t see the business need of broadening the franchise when Disney paid so much for it? It’s what will now go through with James Bond\u003c/em\u003e\u003c/strong\u003e. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKENNEDY\u003c/strong\u003e: It is something I think about all the time. It’s fascinating to think about how you sustain a brand, especially \u003cem\u003eStar Wars\u003c/em\u003e, which is just about to celebrate its 50th anniversary. And so to analyze and understand what was inspiring George when he created \u003cem\u003eStar Wars\u003c/em\u003e, when he was still looking at Saturday matinees and \u003cem\u003eBuck Rogers \u003c/em\u003eand \u003cem\u003eFlash Gordon\u003c/em\u003e, and those are things of the past and politically what he was reflecting in his stories. Because \u003cem\u003eStar Wars\u003c/em\u003e has always had a kind of world building, and it reflects a certain amount of our society. The world, needless to say, is changing by the second, and consequently, the audience has changed dramatically. How they consume things. We’re seeing this reflected in the health of the movie business, and what it really means for streaming and what are all these other platforms that may be on the horizon. You’re trying to look forward. And at the same time, you’re trying to create stories that feel familiar. So you’re moving into the future, but you’re maintaining a sense of familiarity. I think that’s the hardest balance.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThen when you have a brand that’s this expansive, you’re also…and this is something we work very hard at, you try to find different entry points for different generations because that’s what \u003cem\u003eStar Wars \u003c/em\u003ehas always been. It’s a very generational brand, and we want to sustain that, and we work hard to sustain that. So George gave us the gift of storytelling being across lots of different genres, and that gives us a lot of opportunity to try things. What we’ve really enjoyed about the streaming space is we’ve been able to experiment. It’s harder to do that in the movie space. And now I think that that’s why it feels so good to be able to move into a \u003cem\u003eMandalorian \u003c/em\u003emovie as we’re coming off of three seasons of a very successful show. We’ve actually built an audience for that, and we gave the young audience an opportunity to enter\u003cem\u003e Star Wars \u003c/em\u003eat a different place and not feel like you have to have seen everything. It can become their \u003cem\u003eStar Wars\u003c/em\u003e. And that, I think is, is the fun storytelling challenge. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: You’ve got a long resume of big movies. Compared to that, how much tougher is the challenge of so much public scrutiny and second guessing by the rabid fan base? It’s not uncommon to develop a project with big names, who fall out when visions don’t align, but they get reported as a big implosion\u003c/em\u003e\u003c/strong\u003e. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKENNEDY\u003c/strong\u003e: What you just said though is so interesting to me, Mike, because that is the development. It doesn’t matter if you’re doing \u003cem\u003eStar Wars\u003c/em\u003e, or anything else. What’s troubling and frustrating is that our development gets scrutinized, and I don’t know any other production company where their development gets scrutinized like that. It’s very hard for anything to happen within \u003cem\u003eStar Wars \u003c/em\u003ewithout some aspect of it becoming public before you even want it to become public. So I guess managing the message in some way is also quite a challenge because of course, not every single thing we put in development are we going to make. That’s not unusual. We want to make those things that we feel are the best. We want to make those things that, as time passes, feel relevant to what the audience is responding to. So there’s constant discussion around that. So yeah, that’s a tricky one because a lot of the scrutiny around \u003cem\u003eStar Wars \u003c/em\u003eand the negativity has been about development. Of course, we’re going to develop lots of different things with an understanding that not everything gets made.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: I broke a piece last fall about Simon Kinberg making a deal to write and produce a Star Wars trilogy. How’s that going?\u003c/em\u003e\u003c/strong\u003e \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKENNEDY\u003c/strong\u003e: We’re absolutely rolling fast and furiously. That has gone exceptionally well, and he’s literally going to script as we speak. We’ll see something probably around June. Simon, if you remember, he did some work with us years ago with the animated show, which was a really wonderful collaborative experience. And he then got very, very busy with \u003cem\u003eX-Men\u003c/em\u003e and then recently became available again, and he segued into this space beautifully. We’re really excited about where that’s headed.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: There are spinoffs and then there is the core Star Wars story broken into trilogies. Is this a continuation of that? \u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKENNEDY\u003c/strong\u003e: This is the next iteration, the new saga that moves us into the future.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: And the one by Deadpool \u0026amp; Wolverine director Shawn Levy?\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKENNEDY\u003c/strong\u003e: That’s also in the future. It’s all post [the first] nine. Shawn’s is a standalone \u003cem\u003eStar Wars\u003c/em\u003e story that’ll take place post 9, maybe five or six years out. And Mandalorian really stands on its own because there, we’re dealing with a whole other era in the New Republic. We have other development going on in that space as well. So that’s the space that we’re pretty much focused on right at the moment, because obviously with \u003cem\u003eMandalorian\u003c/em\u003e we have a pretty good sense of where that’s going. And with this, it’s all pretty much new characters. We may bring some of the characters back from the sequel saga, but pretty much new characters.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: How many development type projects do you have percolating that you feel confident will turn into something down the line?\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKENNEDY\u003c/strong\u003e: To play it safe, I’d say three or four right at the moment. And a large part of it, Mike, is who is the talent we’re attaching? And that’s a challenge in and of itself these days because people get really busy. So you find yourself having to wait with a lot of the top talent doing streaming and movies now. They’re juggling schedules. And when you do \u003cem\u003eStar Wars,\u003c/em\u003e you pretty much have to step into it and not have any other competing work going on. It’s a good two to three years minimum commitment, and that’s tough to get top talent to be able to carve out that kind of time. So that’s part of the challenge as well.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: You’ve still got that prequel with James Mangold, who’s Oscar nominated for the Bob Dylan movie A Compete Unknown? \u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tKENNEDY: Yep. He’s working on this script right now. Simon’s working on scripts right now. Shawn, we  had been working with him already for about a year and a half. These guys are available now. Jim, he got delayed a bit because of the Dylan movie and the awards season. You have to accommodate top talent to a certain extent. And quality is so important with what it is we’re trying to do. I like to wait for people that I think are passionate and really good to step into \u003cem\u003eStar Wars\u003c/em\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: Any others that I’ve forgotten? \u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKENNEDY\u003c/strong\u003e: Well, I keep waiting for Taika and he is working with another writer now. He’s so busy. I love him, I think if we ever do get a script from Taika, it’s going to be fantastic. I already saw a first act that I loved, but tying him down it’s tricky.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: I still remember seeing his Thor Ragnarock, entering with low expectations, watching his exuberant vision and thinking, this is what you want when you go to a movie theater on a Saturday night.\u003c/em\u003e\u003c/strong\u003e \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKENNEDY\u003c/strong\u003e: It’s so true. And that’s exactly the tone we’re always looking for with filmmakers who can pull that off. It’s not like they’re a dime a dozen. You’re really trying to find the diamond in the rough and he’s one of them.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: So even when you hand the reins to a Lucasfilm protege, it sure sounds like you’re going to be in that world for eight or ten years. Fair? \u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKENNEDY\u003c/strong\u003e: I don’t know if I’m going to say that, but yeah, it’s possible. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: Might you also go back to working with your husband, Frank Marshall, who’s doing a documentary on Barbra Streisand, another on Fleetwood Mac…\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKENNEDY\u003c/strong\u003e: He is truly something. I cannot keep pace most of the time with what he’s doing. And then he just opened a play on Broadway and he’s finishing \u003cem\u003eJurassic\u003c/em\u003e. It makes me feel like I’m standing still.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: Do you look forward to a point where the two of you can kind of focus on collaborating on these projects that you’ve always cooked up together, whether it was at Amblin or elsewhere?\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKENNEDY\u003c/strong\u003e: Oh, sure. If something came along that the two of us…we loved coming back together and being able to work with Mangold on the Indy movie [Indiana Jones and the Dial of Destiny], that was a real treat. And to be working with Steven [Spielberg] and as they say, getting the band back together, that was really fun. We had a blast.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: Any regrets? \u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKENNEDY\u003c/strong\u003e: No, I mean far from regrets. I’ve loved the challenge of stepping into this space, and literally space and being with \u003cem\u003eStar Wars \u003c/em\u003eover these years. Taking on the challenges of expanding on \u003cem\u003eStar Wars\u003c/em\u003e. I’ve loved working with Disney and the company has been fantastic in its support of the IP. They’ve expanded things in ways I don’t think George could have even imagined. And it’s been such a learning experience.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t I’ve never been an executive before. I’m a filmmaker through and through. I even approached the executive role as a filmmaker. I love working with filmmakers. That is my lifeblood. It’s what I enjoy more than anything. And being able to do that inside of \u003cem\u003eStar Wars \u003c/em\u003ehas been really fun because we have people who step into\u003cem\u003e Star Wars \u003c/em\u003ewho are diehard fans, and we have people who step into \u003cem\u003eStar Wars\u003c/em\u003e who never really knew the IP that well. And you look at someone like Tony Gilroy. He has done transformative, exceptional work. I’ve been working with Tony for more than a decade. I don’t think Tony would’ve ever imagined he would’ve done that. That creative experience on \u003cem\u003eAndor \u003c/em\u003ehas been fantastic. And second season is coming out next month. That’s where the satisfaction comes from for me, and I just hope that continues.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE\u003c/strong\u003e: Will you arm twist Tony into doing one of these \u003cem\u003eStar Wars \u003c/em\u003emovies after he was the uncredited backstop on \u003cem\u003eRogue One\u003c/em\u003e? \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKENNEDY\u003c/strong\u003e: I don’t know if I can. I don’t think he ever believed he’d be decade inside \u003cem\u003eStar Wars\u003c/em\u003e. He’s writing some things on his own, and I think he’d like to get back into the director’s chair. So we’ll see what he does. But he’s such a talent, just fantastic.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: He also provided the creative spine for The Bourne Identity…\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKENNEDY\u003c/strong\u003e: That’s how we all met. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: Two final questions. Will you step out as Lucasfilm boss this year?\u003c/em\u003e\u003c/strong\u003e \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKENNEDY\u003c/strong\u003e: We really don’t know at this stage. There’s so much going on, Mike. I don’t know.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eDEADLINE: When it happens, who’ll make the decision? \u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKENNEDY\u003c/strong\u003e: Me. It’s my decision. This is 100 percent my decision.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "19 min read",
  "publishedTime": "2025-02-28T00:36:14Z",
  "modifiedTime": "2025-02-28T00:51:19Z"
}
