{
  "id": "2734a7ba-1fb8-4997-a371-662b3a3352c4",
  "title": "‘Married To Real Estate’ Canceled After Four Seasons On HGTV, Say Hosts Egypt Sherrod \u0026 Mike Jackson",
  "link": "https://deadline.com/2025/06/married-to-real-estate-canceled-hgtv-egypt-sherrod-mike-jackson-1236441870/",
  "description": "Mike Jackson and Egypt Sherrod have announced that HGTV has canceled Married to Real Estate after four seasons. The duo took to social media to share the “unexpected news” they received from the cable network following a trip. “Mike and I just landed back in the States after an unforgettable family trip through the Mediterranean, […]",
  "author": "Armando Tinoco",
  "published": "Wed, 25 Jun 2025 00:38:26 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "News",
    "HGTV"
  ],
  "byline": "Armando Tinoco",
  "length": 1601,
  "excerpt": "Mike Jackson and Egypt Sherrod have announced that HGTV has canceled Married to Real Estate after four seasons.",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "Mike Jackson and Egypt Sherrod have announced that HGTV has canceled Married to Real Estate after four seasons. The duo took to social media to share the “unexpected news” they received from the cable network following a trip. “Mike and I just landed back in the States after an unforgettable family trip through the Mediterranean, and we’re met with unexpected news: HGTV has decided not to move forward with Married to Real Estate,” read the statement on Instagram. The statement continued, “While the chain of events leading up to this is disheartening, we are deeply grateful. Grateful for four incredible seasons. Grateful for our amazing crew and supportive fans. Grateful that our businesses continue to thrive. And most of all–grateful that we are still very much married to real estate (and to each other).” Watch on Deadline Married to Real Estate revolved around Sherrod, a real estate broker and designer, and her husband, Jackson, an expert builder, as they helped Atlanta families buy homes with the potential to transform them into their dream homes. Sherrod had previously starred on HGTV in series like Property Virgins and Flipping Virgins. In her statement online, Sherrod also said, “There’s more to say, and we’ll share soon. But for now, know this: not all setbacks are what they seem. Some blessings show up in disguise. We’ve been here before. We’ll keep counting those blessings–and keep it moving. Stay tuned.” Deadline reached out to HGTV and Warner Bros. Discovery for comment and will update the post when we hear back.",
  "image": "https://deadline.com/wp-content/uploads/2025/06/married-to-real-estate-egypt-sherrod-mike-jackson-hgtv.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tMike Jackson and Egypt Sherrod have announced that \u003ca href=\"https://deadline.com/tag/hgtv/\" id=\"auto-tag_hgtv\" data-tag=\"hgtv\"\u003eHGTV\u003c/a\u003e has canceled \u003cem\u003eMarried to Real Estate\u003c/em\u003e after four seasons.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe duo took to social media to share the “unexpected news” they received from the cable network following a trip.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Mike and I just landed back in the States after an unforgettable family trip through the Mediterranean, and we’re met with unexpected news: HGTV has decided not to move forward with \u003cem\u003eMarried to Real Estate\u003c/em\u003e,” read the statement on \u003ca href=\"https://www.instagram.com/p/DLTMAc2P3bn/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"\u003eInstagram\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe statement continued, “While the chain of events leading up to this is disheartening, we are deeply grateful. Grateful for four incredible seasons. Grateful for our amazing crew and supportive fans. Grateful that our businesses continue to thrive. And most of all–grateful that we are still very much married to real estate (and to each other).”\n\n\t\u003c/p\u003e\n\n\u003cdiv data-pmc-adm-ad-id=\"1234771711\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\n\u003cp\u003e\n\t\u003cem\u003eMarried to Real Estate\u003c/em\u003e revolved around Sherrod, a real estate broker and designer, and her husband, Jackson, an expert builder, as they helped Atlanta families buy homes with the potential to transform them into their dream homes. Sherrod had previously starred on HGTV in series like \u003cem\u003eProperty Virgins\u003c/em\u003e and \u003cem\u003eFlipping Virgins\u003c/em\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn her statement online, Sherrod also said, “There’s more to say, and we’ll share soon. But for now, know this: not all setbacks are what they seem. Some blessings show up in disguise. We’ve been here before. We’ll keep counting those blessings–and keep it moving. Stay tuned.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cem\u003eDeadline\u003c/em\u003e reached out to HGTV and Warner Bros. Discovery for comment and will update the post when we hear back.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cdiv\u003e\n\u003cblockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/p/DLTMAc2P3bn/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e\u003c/blockquote\u003e\n\u003c/div\u003e\u003c/figure\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-06-25T00:38:26Z",
  "modifiedTime": "2025-06-25T00:38:27Z"
}
