{
  "id": "2a742378-7c98-4bbc-86fa-1647f1572706",
  "title": "A Mission: Impossible Star Rejected The Role Of Star Trek's Spock",
  "link": "https://www.slashfilm.com/1765250/mission-impossible-star-martin-landau-rejected-star-trek-spock/",
  "description": "One of the stars of the Mission: Impossible TV series passed on playing Spock in Star Trek, noting newscasters are 'more emotional' than the Vulcan.",
  "author": "Jeremy Smith",
  "published": "Mon, 20 Jan 2025 22:00:37 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Drama Shows",
    "Science Fiction Shows",
    "Action \u0026 Adventure Shows"
  ],
  "byline": "Jeremy Smith",
  "length": 3989,
  "excerpt": "One of the stars of the Mission: Impossible TV series passed on playing Spock in Star Trek, noting newscasters are 'more emotional' than the Vulcan.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slash-film-favicon-448x448.png",
  "text": "Paramount Ask any actor to name a performance that made them want to become an actor, and you'll get people citing the monumental likes of Marlon Brando in \"A Streetcar Named Desire,\" Meryl Streep in \"Sophie's Choice\" or Denzel Washington in \"Malcolm X\" — big, deep-tissue dives that require thespians to use just about every part of their instrument. They want to leave audiences weeping and cheering as they capture the full range of the human experience. They do not want to play, say, a monotone android whose sole function in the plot is to provide the occasional information dump. This would leave them with nothing of interest to do, and, most likely, little to add to their reel. So, when Gene Roddenberry began casting the pilot for \"Star Trek\" in 1964, he probably didn't have actors knocking down his door to play the Vulcan First Officer Spock, whose adherence to logic and paucity of emotion seemed like a dull assignment next to the impulsive Captain James T. Kirk and the crabby medical officer Leonard \"Bones\" McCoy. Obviously, no one knew at the time how the character would be developed, nor could they have predicted the show's profound pop cultural impact, so this isn't a case of nearly every Hollywood leading man turning down John McClane in \"Die Hard\" before 20th Century Fox threw an unprecedented $5 million at television star Bruce Willis. They really only had the pilot script to go on. And this is why one up-and-coming actor turned down the iconic role to co-star in \"Mission: Impossible.\" Martin Landau thought newscasters are more emotional than Spock CBS Martin Landau had already made his mark as James Mason's murderous henchman in the 1959 Alfred Hitchcock classic \"North by Northwest\" when Roddenberry and NBC offered him the role of Spock in the \"Star Trek\" pilot titled \"The Cage.\" Landau turned them down flat because, as he told Starlog in 1986, he \"can't play wooden.\" Instead, he took on the part of master-of-disguise Rollin Hand in the first three seasons of \"Mission: Impossible.\" Again, to be fair, Landau couldn't have possibly known that the series would turn into a cultural phenomenon that's still spawning new shows and movies 59 years after its network premiere. But even if he had known this, Landau says he still would've declined the offer. As he told Starlog: \"I would make the same decision today. But I knew if the show hit, Spock would be very effective. You have to think of the turmoil of the '60s. A superintelligent creature with pointy ears who thought logically was exactly right — except I didn't want to act it. I did not want to be saddled with the role of a character without feeling. I would have become a newscaster. Actually, newscasters are more emotional than Spock.\" If you think such disrespect to Spock would've ticked off Leonard Nimoy, think again. Landau and Nimoy were very close friends. When the latter passed away in 2015, Landau wrote a touching remembrance of his pal for Time, calling him a mensch. \"Even though [our] first meeting was cordial, both of us realized that we could play the same roles, and we would clearly be competitors for those roles,\" he wrote, adding, \"That did happen. As the years passed and as our careers took different turns, we remained friends and always delighted in our individual success. Our respect for each other grew. [...]\" As for Landau's post-\"Mission: Impossible\" career, he went on to win a Best Supporting Actor Oscar for playing Bela Lugosi in Tim Burton's superb \"Ed Wood,\" so not playing Spock worked out pretty well for him.",
  "image": "https://www.slashfilm.com/img/gallery/a-mission-impossible-star-rejected-the-role-of-star-treks-spock/l-intro-1737145527.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n    \n                \u003cdiv\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1765250/mission-impossible-star-martin-landau-rejected-star-trek-spock/\" data-post-title=\"A Mission: Impossible Star Rejected The Role Of Star Trek\u0026#39;s Spock\" data-slide-num=\"0\" data-post-id=\"1765250\"\u003e\n                                             \u003cpicture id=\"p4648fecb9ae0973685166e1cb55d7a65\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/a-mission-impossible-star-rejected-the-role-of-star-treks-spock/intro-1737145527.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/a-mission-impossible-star-rejected-the-role-of-star-treks-spock/intro-1737145527.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/a-mission-impossible-star-rejected-the-role-of-star-treks-spock/intro-1737145527.jpg\" data-slide-url=\"https://www.slashfilm.com/1765250/mission-impossible-star-martin-landau-rejected-star-trek-spock/\" data-post-id=\"1765250\" data-slide-num=\"0\" data-slide-title=\"A Mission: Impossible Star Rejected The Role Of Star Trek\u0026#39;s Spock: \" width=\"780\" height=\"438\" alt=\"Leonard Nimoy cocks an eyebrow as Spock in Star Trek\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eParamount\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eAsk any actor to name a performance that made them want to become an actor, and you\u0026#39;ll get people citing the monumental likes of Marlon Brando in \u0026#34;A Streetcar Named Desire,\u0026#34; \u003ca href=\"https://www.slashfilm.com/1172970/meryl-streep-is-the-best-actor-ever/\" target=\"_blank\"\u003eMeryl Streep in \u0026#34;Sophie\u0026#39;s Choice\u0026#34;\u003c/a\u003e or Denzel Washington in \u0026#34;Malcolm X\u0026#34; — big, deep-tissue dives that require thespians to use just about every part of their instrument. They want to leave audiences weeping and cheering as they capture the full range of the human experience. They do not want to play, say, a monotone android whose sole function in the plot is to provide the occasional information dump. This would leave them with nothing of interest to do, and, most likely, little to add to their reel.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eSo, when Gene Roddenberry began casting \u003ca href=\"https://www.slashfilm.com/1748337/star-trek-pilot-episodes-ranked/\" target=\"_blank\"\u003ethe pilot for \u0026#34;Star Trek\u0026#34;\u003c/a\u003e in 1964, he probably didn\u0026#39;t have actors knocking down his door to play the Vulcan First Officer Spock, whose adherence to logic and paucity of emotion seemed like a dull assignment next to the impulsive Captain James T. Kirk and the crabby medical officer Leonard \u0026#34;Bones\u0026#34; McCoy. Obviously, no one knew at the time how the character would be developed, nor could they have predicted the show\u0026#39;s profound pop cultural impact, so this isn\u0026#39;t a case of nearly every Hollywood leading man turning down John McClane in \u0026#34;Die Hard\u0026#34; before 20th Century Fox threw an unprecedented $5 million at television star Bruce Willis. They really only had the pilot script to go on.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eAnd this is why one up-and-coming actor turned down the iconic role to co-star in \u0026#34;Mission: Impossible.\u0026#34;\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eMartin Landau thought newscasters are more emotional than Spock\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1765250/mission-impossible-star-martin-landau-rejected-star-trek-spock/\" data-post-title=\"A Mission: Impossible Star Rejected The Role Of Star Trek\u0026#39;s Spock\" data-slide-num=\"1\" data-post-id=\"1765250\"\u003e\n                                             \u003cpicture id=\"p822b4a2ca404dbe534a68f9c55bbbe2e\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/a-mission-impossible-star-rejected-the-role-of-star-treks-spock/martin-landau-thought-newscasters-are-more-emotional-than-spock-1737145528.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/a-mission-impossible-star-rejected-the-role-of-star-treks-spock/martin-landau-thought-newscasters-are-more-emotional-than-spock-1737145528.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/a-mission-impossible-star-rejected-the-role-of-star-treks-spock/martin-landau-thought-newscasters-are-more-emotional-than-spock-1737145528.jpg\" data-slide-url=\"https://www.slashfilm.com/1765250/mission-impossible-star-martin-landau-rejected-star-trek-spock/\" data-post-id=\"1765250\" data-slide-num=\"1\" data-slide-title=\"A Mission: Impossible Star Rejected The Role Of Star Trek\u0026#39;s Spock: Martin Landau thought newscasters are more emotional than Spock\" width=\"780\" height=\"438\" alt=\"Martin Landau means business as Rollin Hand in Mission: Impossible\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eCBS\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eMartin Landau had already made his mark as James Mason\u0026#39;s murderous henchman in the 1959 \u003ca href=\"https://www.slashfilm.com/747149/north-by-northwest-ending-explained-the-ultimate-hitchcock-picture/\" target=\"_blank\"\u003eAlfred Hitchcock classic \u0026#34;North by Northwest\u0026#34;\u003c/a\u003e when Roddenberry and NBC offered him the role of Spock in the \u0026#34;Star Trek\u0026#34; pilot titled \u0026#34;The Cage.\u0026#34; Landau turned them down flat because, as he told \u003ca href=\"https://catacombs.space1999.net/press/wrefplandau.html\" target=\"_blank\"\u003eStarlog\u003c/a\u003e in 1986, he \u0026#34;can\u0026#39;t play wooden.\u0026#34; Instead, he took on the part of master-of-disguise Rollin Hand in the first three seasons of \u0026#34;Mission: Impossible.\u0026#34;\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eAgain, to be fair, Landau couldn\u0026#39;t have possibly known that the series would turn into a cultural phenomenon that\u0026#39;s still spawning new shows and movies 59 years after its network premiere. But even if he \u003cem\u003ehad\u003c/em\u003e known this, Landau says he still would\u0026#39;ve declined the offer. As he told Starlog:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\"\u003e\u0026#34;I would make the same decision today. But I knew if the show hit, Spock would be very effective. You have to think of the turmoil of the \u0026#39;60s. A superintelligent creature with pointy ears who thought logically was exactly right — except I didn\u0026#39;t want to act it. I did not want to be saddled with the role of a character without feeling. I would have become a newscaster. Actually, newscasters are more emotional than Spock.\u0026#34;\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp dir=\"ltr\"\u003eIf you think such disrespect to Spock would\u0026#39;ve ticked off Leonard Nimoy, think again. Landau and Nimoy were very close friends. When the latter passed away in 2015, Landau wrote a touching remembrance of his pal \u003ca href=\"https://time.com/3727329/leonard-nimoy-mission-impossible-martin-landau/\" target=\"_blank\"\u003efor Time\u003c/a\u003e, calling him a mensch. \u0026#34;Even though [our] first meeting was cordial, both of us realized that we could play the same roles, and we would clearly be competitors for those roles,\u0026#34; he wrote, adding, \u0026#34;That did happen. As the years passed and as our careers took different turns, we remained friends and always delighted in our individual success. Our respect for each other grew. [...]\u0026#34;\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eAs for Landau\u0026#39;s post-\u0026#34;Mission: Impossible\u0026#34; career, he went on to win a Best Supporting Actor Oscar for playing Bela Lugosi in Tim Burton\u0026#39;s superb \u0026#34;Ed Wood,\u0026#34; so not playing Spock worked out pretty well for him.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-20T22:00:37Z",
  "modifiedTime": "2025-01-20T22:00:37Z"
}
