{
  "id": "2c48d62d-94fe-4ab7-aea2-483752719d3e",
  "title": "Alien: Romulus Xenomorph Hot Toys Figure Unveiled, Available for Preorder Now",
  "link": "https://www.comingsoon.net/toys/news/1885482-alien-romulus-hot-toys-figure-preorder",
  "description": "Hot Toys is celebrating the release of the recent Alien: Romulus with a new sixth scale figure, which is available to preorder now on Sideshow Collectibles’ site. The newest figure comes modeled after the iconic Xenomorph as it appears in the 2024 film. The “Scorched Xenomorph” stands at about 44cm (17.3″) tall and is painted […] The post Alien: Romulus Xenomorph Hot Toys Figure Unveiled, Available for Preorder Now appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
  "author": "Anthony Nash",
  "published": "Wed, 27 Nov 2024 22:57:37 +0000",
  "source": "https://www.comingsoon.net/feed",
  "categories": [
    "Toys",
    "Alien: Romulus",
    "Hot Toys",
    "Sideshow Collectibles",
    "Toy News"
  ],
  "byline": "Anthony Nash",
  "length": 1427,
  "excerpt": "Hot Toys is celebrating the release of the recent Alien: Romulus with a new sixth scale figure, which is available to preorder now.",
  "siteName": "ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More",
  "favicon": "https://www.comingsoon.net/wp-content/uploads/sites/3/2022/12/cs_ico_144x144.png?w=144",
  "text": "Hot Toys is celebrating the release of the recent Alien: Romulus with a new sixth scale figure, which is available to preorder now on Sideshow Collectibles’ site. The newest figure comes modeled after the iconic Xenomorph as it appears in the 2024 film. The “Scorched Xenomorph” stands at about 44cm (17.3″) tall and is painted black and dark gray with a glossy finish to match the way the creature is presented in the movie. The figure also features an all-new joint design, and a bendable tail to allow for different posing styles. How to get the Alien: Romulus Hot Toys figure? The figure is available to preorder now on Sideshow Collectibles’ website, and retails for $305. The figure is expected to release sometime between October 2025-March 2026, so fans will have to wait a little bit before getting their hands on one. For those interested in purchasing, Sideshow does also offer payment plan options if the initial price is a bit too much. Disney+ Has the Best Bundle in the Business Sign-up today for access to Disney+, Hulu, and ESPN+ As is customary with Hot Toys figures, the figure also comes with two interchangeable carapaces, one of which features a translucent look at the Xenomorph’s skull. The figure also comes with a handful of different hands to swap in and out, an extendable inner jaw, an articulated facehugger accessory, and a diorama base with LED light-up functionality.",
  "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2024/11/alien-romulus-hot-toys-figure-1.jpg?resize=1200,630",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eHot Toys is celebrating the release of the recent \u003ca href=\"https://www.comingsoon.net/tag/alien-romulus\"\u003e\u003cstrong\u003eAlien: Romulus\u003c/strong\u003e\u003c/a\u003e with a new sixth scale figure, which is available to preorder now on Sideshow Collectibles’ site. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe newest figure comes modeled after the iconic Xenomorph as it appears in the 2024 film. The “Scorched Xenomorph” stands at about 44cm (17.3″) tall and is painted black and dark gray with a glossy finish to match the way the creature is presented in the movie. The figure also features an all-new joint design, and a bendable tail to allow for different posing styles.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-how-to-get-the-alien-romulus-hot-toys-figure\"\u003eHow to get the Alien: Romulus Hot Toys figure? \u003c/h2\u003e\n\n\n\n\u003cp\u003eThe figure is available to preorder now on \u003ca href=\"https://www.sideshow.com/collectibles/alien-scorched-xenomorph-hot-toys-913989\"\u003eSideshow Collectibles’ website\u003c/a\u003e, and retails for $305. The figure is expected to release sometime between October 2025-March 2026, so fans will have to wait a little bit before getting their hands on one. \u003c/p\u003e\n\n\n\n\u003cp\u003eFor those interested in purchasing, Sideshow does also offer payment plan options if the initial price is a bit too much. \u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\u003ch5 id=\"h-disney-has-the-best-bundle-in-the-business\"\u003e\u003cstrong\u003eDisney+ Has the Best Bundle in the Business\u003c/strong\u003e\u003c/h5\u003e\n\n\n\n\u003cp\u003eSign-up today for access to Disney+, Hulu, and ESPN+\u003c/p\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003eAs is customary with Hot Toys figures, the figure also comes with two interchangeable carapaces, one of which features a translucent look at the Xenomorph’s skull. The figure also comes with a handful of different hands to swap in and out, an extendable inner jaw, an articulated facehugger accessory, and a diorama base with LED light-up functionality. \u003c/p\u003e\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-11-27T22:57:37Z",
  "modifiedTime": "2024-11-27T22:57:54Z"
}
