{
  "id": "2e6bccd8-481b-4730-bfd1-f562fc91b439",
  "title": "Bob Denver \u0026 Dawn Wells Reprised Their Gilligan's Island Roles On Baywatch",
  "link": "https://www.slashfilm.com/1763600/bob-denver-dawn-wells-gilligans-island-baywatch-crossover/",
  "description": "Did you know Baywatch had an episode where Bob Denver and Dawn Wells appeared as their Gilligan's Island characters? It was quite a silly episode!",
  "author": "Witney Seibold",
  "published": "Sat, 25 Jan 2025 22:00:04 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Comedy Shows",
    "Action \u0026 Adventure Shows"
  ],
  "byline": "Witney Seibold",
  "length": 4434,
  "excerpt": "Did you know Baywatch had an episode where Bob Denver and Dawn Wells appeared as their Gilligan's Island characters? It was quite a silly episode!",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slash-film-favicon-448x448.png",
  "text": "NBCUniversal Television Distribution In the \"Baywatch\" episode \"Now Sit Right Back and You'll Hear a Tale\" (February 24, 1992), Eddie (Billy Warlock) and Shauni (Erika Eleniak) are out in the ocean trying to rescue a beleaguered jet skier, when they discover an island that they hadn't ever noticed before. Going ashore, they find that two people have been living on this island, stranded far from shore, for decades. They are Mary Ann (Dawn Wells) and Gilligan (Bob Denver), the same characters seen on the 1964 sitcom \"Gilligan's Island.\"  Wait, what? Aren't those fictional characters? Gilligan and Mary Ann explain that their experiences being stranded on the uncharted desert isle are very much real. Shauni marvels, \"I thought you were just a TV show!\" But everyone sort of lets the unreality of the situation slip past. No further questions are asked about how Gilligan and Mary Ann were filmed or how their footage was converted into a 1964 CBS comedy series.  There is a practical reason, however, for how Gilligan and Mary Ann are on this Californian island, instead of the original island where their show took place. It seems that the pair arrived on the secondary island after the Professor was able to construct a two-person vessel, allowing them to flee their original tropical home. They complain that people came to their island all the time (a regular occurrence on \"Gilligan's Island\"), but they never found a way to escape. With the arrival of Eddie and Shauni, though, it seems their prayers have finally been answered.  Once Gilligan and Mary Ann return to the mainland, however, they meet the enthused Captain Thorpe (Monte Markham) who is a huge \"Gilligan's Island\" fan, and he just happens to have won the lottery. With his newfound wealth, he wants to produce his own version of \"Gilligan's Island,\" with Gilligan and Mary Ann playing themselves. It's all very meta, as was trendy in the 1990s. The Gilligan's Island episode of Baywatch was meta and daffy. NBCUniversal Television Distribution On Thorpe's version of \"Gilligan's Island,\" Thorpe, now a millionaire, would stand in for Mr. Howell. Shauni would play Ginger, Garner (Gregory Allen Williams) would play the Skipper, and Harvey (Tom McTigue) would play the Professor. There didn't seem to be a Mrs. Howell in his version of the show. Eddie would also tag along, but he would play a secondary Gilligan. Naturally, one of Thorpe's ideas would involve shooting on a real boat, and you might be able to predict what happened next. It seems that the boat hit rough weather, and the seven characters were blown off-course to a real deserted island. It was \"Gilligan's Island\" all over again, just with \"Baywatch\" characters. (It should be noted that \"Now Sit Right Back\" takes place in a world where the 1970s and 1980s \"Gilligan's Island\" TV movie follow-ups never happened. In those TV movies, the castaways did escape from the island, returned, escaped again, and opened a resort. None of those events seem to be referenced on \"Baywatch.\") Of course, there's an explanation for all these odd shenanigans. It seems that Eddie merely slipped on his lifeguard ramp at the beginning of the episode and was knocked out. It was all a dream. He wasn't really interacting with Gilligan and Mary Ann but merely imagining what they would look like in the year 1992. Thorpe announces that he did indeed win the lottery, but the prize was only $58. \"Now Sit Right Back\" was written by Lloyd J. Schwartz, the son of \"Gilligan's Island\" creator Sherwood Schwartz. Lloyd's TV career involved working alongside his father, and the pair worked on many \"Brady Bunch\" projects together as producers, including stage musicals. Lloyd also wrote episodes of \"Alice\" and \"The A-Team\" in addition to his \"Baywatch\" episode.  Like \"Gilligan's Island\" itself, \"Now Sit Right Back\" was made in good fun, reminding audiences that \"Baywatch\" is a straight-up goofy show. And Denver and Wells were very sporting. They were just as committed as ever.",
  "image": "https://www.slashfilm.com/img/gallery/bob-denver-dawn-wells-reprised-their-gilligans-island-roles-on-baywatch/l-intro-1737044410.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n    \n                \u003cdiv\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1763600/bob-denver-dawn-wells-gilligans-island-baywatch-crossover/\" data-post-title=\"Bob Denver \u0026amp; Dawn Wells Reprised Their Gilligan\u0026#39;s Island Roles On Baywatch\" data-slide-num=\"0\" data-post-id=\"1763600\"\u003e\n                                             \u003cpicture id=\"pe1426f1ef3323662131a814f9922f4f1\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/bob-denver-dawn-wells-reprised-their-gilligans-island-roles-on-baywatch/intro-1737044410.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/bob-denver-dawn-wells-reprised-their-gilligans-island-roles-on-baywatch/intro-1737044410.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/bob-denver-dawn-wells-reprised-their-gilligans-island-roles-on-baywatch/intro-1737044410.jpg\" data-slide-url=\"https://www.slashfilm.com/1763600/bob-denver-dawn-wells-gilligans-island-baywatch-crossover/\" data-post-id=\"1763600\" data-slide-num=\"0\" data-slide-title=\"Bob Denver \u0026amp; Dawn Wells Reprised Their Gilligan\u0026#39;s Island Roles On Baywatch: \" width=\"780\" height=\"438\" alt=\"Mary Ann and Gilligan, still in distress after many years.\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eNBCUniversal Television Distribution\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eIn the \u0026#34;Baywatch\u0026#34; episode \u0026#34;Now Sit Right Back and You\u0026#39;ll Hear a Tale\u0026#34; (February 24, 1992), Eddie (Billy Warlock) and Shauni (Erika Eleniak) are out in the ocean trying to rescue a beleaguered jet skier, when they discover an island that they hadn\u0026#39;t ever noticed before. Going ashore, they find that two people have been living on this island, stranded far from shore, for decades. They are \u003ca href=\"https://www.slashfilm.com/1642149/dawn-wells-gilligans-island-co-star-russell-johnson-crush/\" target=\"_blank\"\u003eMary Ann (Dawn Wells)\u003c/a\u003e and Gilligan (Bob Denver), the same characters seen on the 1964 sitcom \u0026#34;Gilligan\u0026#39;s Island.\u0026#34; \u003c/p\u003e\n\n\u003cp\u003eWait, what? Aren\u0026#39;t those fictional characters? Gilligan and Mary Ann explain that their experiences being stranded on the uncharted desert isle are very much real. Shauni marvels, \u0026#34;I thought you were just a TV show!\u0026#34; But everyone sort of lets the unreality of the situation slip past. No further questions are asked about how Gilligan and Mary Ann were filmed or how their footage was converted into a 1964 CBS comedy series. \u003c/p\u003e\n\u003cp\u003eThere is a practical reason, however, for how Gilligan and Mary Ann are on this Californian island, instead of the original island where their show took place. It seems that the pair arrived on the secondary island after the Professor was able to construct a two-person vessel, allowing them to flee their original tropical home. They complain that people came to their island all the time (a regular occurrence on \u0026#34;Gilligan\u0026#39;s Island\u0026#34;), but they never found a way to escape. With the arrival of Eddie and Shauni, though, it seems their prayers have finally been answered. \u003c/p\u003e\n\n\u003cp\u003eOnce Gilligan and Mary Ann return to the mainland, however, they meet the enthused Captain Thorpe (Monte Markham) who is a huge \u0026#34;Gilligan\u0026#39;s Island\u0026#34; fan, and he just happens to have won the lottery. With his newfound wealth, he wants to produce his own version of \u0026#34;Gilligan\u0026#39;s Island,\u0026#34; with Gilligan and Mary Ann playing themselves. It\u0026#39;s all very meta, as was trendy in the 1990s.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eThe Gilligan\u0026#39;s Island episode of Baywatch was meta and daffy.\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1763600/bob-denver-dawn-wells-gilligans-island-baywatch-crossover/\" data-post-title=\"Bob Denver \u0026amp; Dawn Wells Reprised Their Gilligan\u0026#39;s Island Roles On Baywatch\" data-slide-num=\"1\" data-post-id=\"1763600\"\u003e\n                                             \u003cpicture id=\"pe87b217faaea365280d5128115d35000\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/bob-denver-dawn-wells-reprised-their-gilligans-island-roles-on-baywatch/the-gilligans-island-episode-of-baywatch-was-meta-and-daffy-1737044410.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/bob-denver-dawn-wells-reprised-their-gilligans-island-roles-on-baywatch/the-gilligans-island-episode-of-baywatch-was-meta-and-daffy-1737044410.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/bob-denver-dawn-wells-reprised-their-gilligans-island-roles-on-baywatch/the-gilligans-island-episode-of-baywatch-was-meta-and-daffy-1737044410.jpg\" data-slide-url=\"https://www.slashfilm.com/1763600/bob-denver-dawn-wells-gilligans-island-baywatch-crossover/\" data-post-id=\"1763600\" data-slide-num=\"1\" data-slide-title=\"Bob Denver \u0026amp; Dawn Wells Reprised Their Gilligan\u0026#39;s Island Roles On Baywatch: The Gilligan\u0026#39;s Island episode of Baywatch was meta and daffy.\" width=\"780\" height=\"438\" alt=\"Gilligan meets the Baywatch crew in the break room\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eNBCUniversal Television Distribution\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eOn Thorpe\u0026#39;s version of \u0026#34;Gilligan\u0026#39;s Island,\u0026#34; Thorpe, now a millionaire, would stand in for Mr. Howell. Shauni would play Ginger, Garner (Gregory Allen Williams) would play the Skipper, and Harvey (Tom McTigue) would play the Professor. There didn\u0026#39;t seem to be a Mrs. Howell in his version of the show. Eddie would also tag along, but he would play a secondary Gilligan. Naturally, one of Thorpe\u0026#39;s ideas would involve shooting on a real boat, and you might be able to predict what happened next. It seems that the boat hit rough weather, and the seven characters were blown off-course to a real deserted island. It was \u0026#34;Gilligan\u0026#39;s Island\u0026#34; all over again, just with \u0026#34;Baywatch\u0026#34; characters.\u003c/p\u003e\n\n\u003cp\u003e(It should be noted that \u0026#34;Now Sit Right Back\u0026#34; takes place in a world where the 1970s and 1980s \u0026#34;Gilligan\u0026#39;s Island\u0026#34; TV movie follow-ups never happened. In those TV movies, the castaways did escape from the island, returned, escaped again, and opened a resort. None of those events seem to be referenced on \u0026#34;Baywatch.\u0026#34;)\u003c/p\u003e\n\u003cp\u003eOf course, there\u0026#39;s an explanation for all these odd shenanigans. It seems that Eddie merely slipped on his lifeguard ramp at the beginning of the episode and was knocked out. It was all a dream. He wasn\u0026#39;t really interacting with Gilligan and Mary Ann but merely imagining what they would look like in the year 1992. Thorpe announces that he did indeed win the lottery, but the prize was only $58.\u003c/p\u003e\n\n\u003cp\u003e\u0026#34;Now Sit Right Back\u0026#34; was written by Lloyd J. Schwartz, the son of \u0026#34;Gilligan\u0026#39;s Island\u0026#34; creator Sherwood Schwartz. Lloyd\u0026#39;s TV career involved working alongside his father, and the pair worked on \u003ca href=\"https://www.slashfilm.com/1411084/only-major-actors-still-alive-the-brady-bunch/\" target=\"_blank\"\u003emany \u0026#34;Brady Bunch\u0026#34; projects\u003c/a\u003e together as producers, including stage musicals. Lloyd also wrote episodes of \u0026#34;Alice\u0026#34; and \u0026#34;The A-Team\u0026#34; in addition to his \u0026#34;Baywatch\u0026#34; episode. \u003c/p\u003e\n\u003cp\u003eLike \u0026#34;Gilligan\u0026#39;s Island\u0026#34; itself, \u0026#34;Now Sit Right Back\u0026#34; was made in good fun, reminding audiences that \u0026#34;Baywatch\u0026#34; is a straight-up goofy show. And Denver and Wells were very sporting. They were just as committed as ever.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-01-25T22:00:04Z",
  "modifiedTime": "2025-01-25T22:00:04Z"
}
