{
  "id": "38453773-2467-45c3-b39e-6ddb34dac690",
  "title": "'Bring Them Down' Teaser with Barry Keoghan \u0026 Christopher Abbott",
  "link": "https://www.firstshowing.net/2024/bring-them-down-teaser-with-barry-keoghan-christopher-abbott/",
  "description": "\"Look what you've done Michael!\" Mubi has unveiled a quick teaser for Bring Them Down, a new Irish thriller about families from filmmaker Chris Andrews. This recently premiered at TIFF and Fantastic Fest this fall, plus Beyond Fest and London and a few others. An Irish shepherding family thrust into battle on several fronts: internal strife, hostility within the family, rivalry with another farmer. Paternalism, heritage, and the generational trauma cycle through the cultural prism of Ireland. TIFF adds: \"Bring Them Down bristles with twists and tension, its gorgeous pastoral landscapes turning into sites of escalating violence. Yet the film never settles for simplistic hero/villain binaries. Instead, brilliantly shifts perspective, revealing the fears and aspirations driving all its characters — a strategy that succeeds in no small part due to Abbott and Keoghan, who share an incredible ability to reveal for the camera what their characters are hell-bent on hiding.\" Starring Barry Keoghan and Christopher Abbott, with Colm Meaney, Nora-Jane Noone, Paul Ready, Aaron Heffernan, and Susan Lynch. So far looks good, keep an eye out for this one soon. Here's the quick teaser trailer (+ poster) for Chris Andrews' film Bring Them Down, from YouTube: Michael (Christopher Abbott), the […]",
  "author": "Alex Billington",
  "published": "Wed, 20 Nov 2024 23:35:56 +0000",
  "source": "https://www.firstshowing.net/feed/",
  "categories": [
    "Indies",
    "To Watch",
    "Trailer"
  ],
  "byline": "Alex Billington",
  "length": 2450,
  "excerpt": "\"Look what you've done Michael!\" Mubi has unveiled a quick teaser for Bring Them Down, a new Irish thriller about families from filmmaker Chris Andrews. This recently premiered at TIFF and Fantastic Fest this fall, plus Beyond Fest and London and a few others. An Irish shepherding family thrust into battle on several fronts: internal",
  "siteName": "FirstShowing.net",
  "favicon": "https://www.firstshowing.net/favicon-32x32.png",
  "text": "TRAILERS by November 20, 2024Source: YouTube \"Look what you've done Michael!\" Mubi has unveiled a quick teaser for Bring Them Down, a new Irish thriller about families from filmmaker Chris Andrews. This recently premiered at TIFF and Fantastic Fest this fall, plus Beyond Fest and London and a few others. An Irish shepherding family thrust into battle on several fronts: internal strife, hostility within the family, rivalry with another farmer. Paternalism, heritage, and the generational trauma cycle through the cultural prism of Ireland. TIFF adds: \"Bring Them Down bristles with twists and tension, its gorgeous pastoral landscapes turning into sites of escalating violence. Yet the film never settles for simplistic hero/villain binaries. Instead, brilliantly shifts perspective, revealing the fears and aspirations driving all its characters — a strategy that succeeds in no small part due to Abbott and Keoghan, who share an incredible ability to reveal for the camera what their characters are hell-bent on hiding.\" Starring Barry Keoghan and Christopher Abbott, with Colm Meaney, Nora-Jane Noone, Paul Ready, Aaron Heffernan, and Susan Lynch. So far looks good, keep an eye out for this one soon. Here's the quick teaser trailer (+ poster) for Chris Andrews' film Bring Them Down, from YouTube: Michael (Christopher Abbott), the last son of a shepherding family, lives with his ailing father, Ray (Colm Meaney). Burdened by a terrible secret, Michael has isolated himself from the world. When a conflict with his rival farmer Gary (Paul Ready) and also his son Jack (Barry Keoghan) escalates, Michael is drawn into a devastating chain of events, forcing him to confront the horrors of his past and leaving both families permanently altered. Bring Them Down is directed by UK filmmaker Chris Andrews, making his feature directorial debut for a few other short films previously. The screenplay is also from Andrews, based on a story by Jonathan Hourigan and Chris Andrews. Produced by Julianne Forde, Jacob Swan Hyam, Ivana MacKinnon, Jean-Yves Roubin, Ruth Treacy, and Cassandre Warnauts. This initially premiered at the 2024 Toronto Film Festival a few months ago and also played at Fantastic Fest. Mubi will release Andrews' film Bring Them Down film in select US theaters starting February 7th, 2025 early next year. Look any good? Find more posts: Indies, To Watch, Trailer prev next",
  "image": "https://media2.firstshowing.net/firstshowing/img16/BringthemdownRlsbigmainTW01.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\t\t\u003ch2 id=\"pagetitle\"\u003e\u003ca href=\"https://www.firstshowing.net/category/trailers/\" title=\"Click for more trailers\"\u003eTRAILERS\u003c/a\u003e\n\t\t\u003c/h2\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\n\t\t\t\u003cp\u003eby \t\t\u003cbr/\u003eNovember 20, 2024\u003cbr/\u003e\u003cem\u003eSource:\u003c/em\u003e \u003ca href=\"https://www.youtube.com/watch?v=nIJx-KPmYNw\" rel=\"noopener nofollow\" target=\"_blank\"\u003eYouTube\u003c/a\u003e\u003cbr/\u003e\u003c/p\u003e\n\t\t\u003cp\u003e\u003ca href=\"https://www.firstshowing.net/2024/bring-them-down-teaser-with-barry-keoghan-christopher-abbott/\"\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/BringthemdownRlsbigmainTsr02.jpg\" alt=\"Bring Them Down Trailer\" width=\"350\" height=\"168\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u0026#34;Look what you\u0026#39;ve done Michael!\u0026#34;\u003c/em\u003e Mubi has unveiled a quick teaser for \u003cstrong\u003e\u003cem\u003eBring Them Down\u003c/em\u003e\u003c/strong\u003e, a new Irish thriller about families from filmmaker Chris Andrews. This recently premiered at TIFF and Fantastic Fest this fall, plus Beyond Fest and London and a few others. An Irish shepherding family thrust into battle on several fronts: internal strife, hostility within the family, rivalry with another farmer. Paternalism, heritage, and the generational trauma cycle through the cultural prism of Ireland. TIFF adds: \u0026#34;\u003cem\u003eBring Them Down\u003c/em\u003e bristles with twists and tension, its gorgeous pastoral landscapes turning into sites of escalating violence. Yet the film never settles for simplistic hero/villain binaries. Instead, brilliantly shifts perspective, revealing the fears and aspirations driving all its characters — a strategy that succeeds in no small part due to Abbott and Keoghan, who share an incredible ability to reveal for the camera what their characters are hell-bent on hiding.\u0026#34; Starring \u003cstrong\u003eBarry Keoghan\u003c/strong\u003e and \u003cstrong\u003eChristopher Abbott\u003c/strong\u003e, with \u003cstrong\u003eColm Meaney\u003c/strong\u003e, \u003cstrong\u003eNora-Jane Noone\u003c/strong\u003e, \u003cstrong\u003ePaul Ready\u003c/strong\u003e, \u003cstrong\u003eAaron Heffernan\u003c/strong\u003e, and \u003cstrong\u003eSusan Lynch\u003c/strong\u003e. So far looks good, keep an eye out for this one soon.\u003cspan id=\"more-719161\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eHere\u0026#39;s the quick teaser trailer (+ poster) for Chris Andrews\u0026#39; film \u003cstrong\u003e\u003cem\u003eBring Them Down\u003c/em\u003e\u003c/strong\u003e, from \u003ca href=\"https://www.youtube.com/watch?v=nIJx-KPmYNw\" rel=\"noopener\" target=\"_blank\"\u003eYouTube\u003c/a\u003e:\u003c/p\u003e\n\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/BringthemdownRlsbigmain5991.jpg?width=599\" alt=\"Bring Them Down Poster\" width=\"599\" height=\"899\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eMichael (Christopher Abbott), the last son of a shepherding family, lives with his ailing father, Ray (Colm Meaney). Burdened by a terrible secret, Michael has isolated himself from the world. When a conflict with his rival farmer Gary (Paul Ready) and also his son Jack (Barry Keoghan) escalates, Michael is drawn into a devastating chain of events, forcing him to confront the horrors of his past and leaving both families permanently altered.\u003c/em\u003e \u003cem\u003eBring Them Down\u003c/em\u003e is directed by UK filmmaker \u003ca href=\"https://www.imdb.com/name/nm1643216/\" rel=\"noopener\" target=\"_blank\"\u003e\u003cstrong\u003eChris Andrews\u003c/strong\u003e\u003c/a\u003e, making his feature directorial debut for a few other short films previously. The screenplay is also from Andrews, based on a story by Jonathan Hourigan and Chris Andrews. Produced by Julianne Forde, Jacob Swan Hyam, Ivana MacKinnon, Jean-Yves Roubin, Ruth Treacy, and Cassandre Warnauts. This initially premiered at the 2024 Toronto Film Festival a few months ago and also played at Fantastic Fest. Mubi will release Andrews\u0026#39; film \u003cem\u003eBring Them Down\u003c/em\u003e film in select US theaters starting \u003ca href=\"https://www.firstshowing.net/schedule2025/#feb\"\u003e\u003cstrong\u003eFebruary 7th, 2025\u003c/strong\u003e\u003c/a\u003e early next year. \u003cem\u003eLook any good?\u003c/em\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eFind more posts:\u003c/strong\u003e \u003ca href=\"https://www.firstshowing.net/category/indies/\" rel=\"category tag\"\u003eIndies\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/worthwatching/\" rel=\"category tag\"\u003eTo Watch\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/trailers/\" rel=\"category tag\"\u003eTrailer\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\u003c/div\u003e\n\t\u003cdiv id=\"rightbar\"\u003e\n\t\t\u003cul id=\"slnav\"\u003e\n\t\t\t\u003cli id=\"prev\"\u003e\u003ca href=\"#\"\u003eprev\u003c/a\u003e\u003c/li\u003e\n\t\t    \u003cli id=\"next\"\u003e\u003ca href=\"#\"\u003enext\u003c/a\u003e\u003c/li\u003e\n\t\t\u003c/ul\u003e\n\t\t\u003cul id=\"slides\"\u003e\n\n\t\t\u003c/ul\u003e\n\t\t\u003c/div\u003e      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-20T18:35:56-05:00",
  "modifiedTime": null
}
