{
  "id": "39391c54-2c3b-43a5-ac6c-bc0ad7e6114a",
  "title": "Who Is Willie Geist’s Wife? Christina’s Job \u0026 Relationship History",
  "link": "https://www.comingsoon.net/guides/news/1929250-willie-geist-wife-christina-job-relationship-history",
  "description": "Explore the enduring journey of Willie and Christina Geist's marriage and careers. Discover their story and achievements now! The post Who Is Willie Geist’s Wife? Christina’s Job \u0026 Relationship History appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
  "author": "Vritti Johar",
  "published": "Thu, 27 Feb 2025 23:48:35 +0000",
  "source": "https://www.comingsoon.net/feed",
  "categories": [
    "Guides",
    "Pop Culture",
    "Pop Culture FAQ",
    "Willie Geist"
  ],
  "byline": "Vritti Johar",
  "length": 2113,
  "excerpt": "Discover details about Willie Geist's wife, Christina Geist, and their life together since their marriage in 2003.",
  "siteName": "ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More",
  "favicon": "https://www.comingsoon.net/wp-content/uploads/sites/3/2022/12/cs_ico_144x144.png?w=144",
  "text": "Curious about Willie Geist’s relationship history with his wife? The Sunday Today and Morning Joe anchor has been with her since they were teenagers, building a life together over the years. While he continues to thrive in his broadcasting career, she has remained a constant presence in his life, supporting him along the way. Let’s take a closer look at Willie Geist’s marriage, his long-standing relationship with his wife, and how they have supported each other through the years. Who is Willie Geist married to? Willie Geist is married to Christina Geist. The couple married on May 24, 2003, in Puerto Rico. They adjusted their wedding plans after their original venue went bankrupt, but they held the ceremony at a Spanish church and the reception at Palmas del Mar Country Club. They live in New York City with their two children, Lucie and George. What is Christina Geist’s job? According to her official website, Christina Geist is a New York Times-bestselling children’s book author, entrepreneur, and brand strategist. She has written several children’s books, including Buddy’s Bedtime Battery, Sorry Grown-Ups, You Can’t Go to School!, and Buddy’s New Buddy. Beyond writing, Christina has experience in branding and marketing. She co-founded True Geist, a brand strategy and design firm, and launched Boombox, a memory box company. She previously worked for major corporations like Johnson \u0026 Johnson before taking a break to raise her children and later returning to her career. Willie and Christina Geist’s relationship history Willie and Christina Geist met in middle school and remained friends before beginning a relationship in high school. They dated through college, attending Vanderbilt University together, but briefly separated to date other people. They reunited after graduation in 2000. In 2002, Willie proposed to Christina in their middle school homeroom. They married the following year and have since built their careers while raising their family. In 2023, they celebrated their 20th wedding anniversary, reflecting on their decades-long relationship.",
  "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/02/MixCollage-28-Feb-2025-10-46-AM-7866.jpg?resize=1200,630",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eCurious about \u003cstrong\u003eWillie Geist’s\u003c/strong\u003e relationship history with his \u003cstrong\u003ewife\u003c/strong\u003e? The Sunday Today and Morning Joe anchor has been with her since they were teenagers, building a life together over the years. While he continues to thrive in his broadcasting career, she has remained a constant presence in his life, supporting him along the way.\u003c/p\u003e\n\n\n\n\u003cp\u003eLet’s take a closer look at Willie Geist’s marriage, his long-standing relationship with his wife, and how they have supported each other through the years.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-who-is-willie-geist-married-to\"\u003eWho is Willie Geist married to?\u003c/h2\u003e\n\n\n\n\u003cp\u003eWillie Geist is married to Christina Geist. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe couple married on May 24, 2003, in Puerto Rico. They adjusted their wedding plans after their original venue went bankrupt, but they held the ceremony at a Spanish church and the reception at Palmas del Mar Country Club. They live in New York City with their two children, Lucie and George.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-what-is-christina-geist-s-job\"\u003eWhat is Christina Geist’s job?\u003c/h2\u003e\n\n\n\n\u003cp\u003eAccording to her official \u003ca href=\"https://www.christinageist.com\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ewebsite\u003c/a\u003e, Christina Geist is a New York Times-bestselling children’s book author, entrepreneur, and brand strategist. She has written several children’s books, including Buddy’s Bedtime Battery, Sorry Grown-Ups, You Can’t Go to School!, and Buddy’s New Buddy.\u003c/p\u003e\n\n\n\n\u003cp\u003eBeyond writing, Christina has experience in branding and marketing. She co-founded True Geist, a brand strategy and design firm, and launched Boombox, a memory box company. She previously worked for major corporations like Johnson \u0026amp; Johnson before taking a break to raise her children and later returning to her career.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-willie-and-christina-geist-s-relationship-history\"\u003eWillie and Christina Geist’s relationship history\u003c/h2\u003e\n\n\n\n\u003cp\u003eWillie and Christina Geist met in middle school and remained friends before beginning a relationship in high school. They dated through college, attending Vanderbilt University together, but briefly separated to date other people. They reunited after graduation in 2000.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn 2002, Willie proposed to Christina in their middle school homeroom. They married the following year and have since built their careers while raising their family. In 2023, they celebrated their 20th wedding anniversary, reflecting on their decades-long relationship.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-27T23:48:35Z",
  "modifiedTime": "2025-02-27T23:48:50Z"
}
