{
  "id": "4a9a66d8-2265-4fed-b955-e3a0ce7582a8",
  "title": "On ‘The Real Housewives of Atlanta,’ the Reason for Kenya Moore’s Ouster Is Shown in Episode 5",
  "link": "https://variety.com/2025/tv/news/real-housewives-of-atlanta-kenya-moore-explicit-brit-eady-photos-1236360353/",
  "description": "SPOILER ALERT: This post contains spoilers from “About Last Night,” Episode 5, Season 16 of “The Real Housewives of Atlanta,” streaming on Peacock as of April 7. On Sunday night’s “The Real Housewives of Atlanta,” viewers finally saw an event that had been foretold by the blogs well before March 9, when Season 16 of […]",
  "author": "Kate Aurthur",
  "published": "Mon, 07 Apr 2025 01:11:44 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Bravo",
    "Kenya Moore",
    "The Real Housewives of Atlanta"
  ],
  "byline": "Kate Aurthur",
  "length": 6556,
  "excerpt": "In Episode 5 of Season 16 of 'RHOA,' Kenya Moore displayed explicit photos of Brit Eady out of revenge, which led to her suspension and departure.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "SPOILER ALERT: This post contains spoilers from “About Last Night,” Episode 5, Season 16 of “The Real Housewives of Atlanta,” streaming on Peacock as of April 7. On Sunday night’s “The Real Housewives of Atlanta,” viewers finally saw an event that had been foretold by the blogs well before March 9, when Season 16 of the Bravo show premiered. In this incident, longtime “Atlanta” star Kenya Moore got herself into the kind of trouble — ostentatiously and maliciously displaying explicit images of castmate Brit Eady on poster boards on camera — that may spell doom for her ever appearing on the show again. It certainly ended her season early. During the episode, titled “About Last Night,” Moore — who joined the show in its fifth season  — threw a grand opening party at Kenya Moore Hair Spa, her new store. Rookie cast member Eady, who had started a feud with Moore earlier in the season, arrived with a peace offering, a bouquet of flowers with a card. In the lead up to the party, Eady had expressed contrition to other cast members about her previous actions toward Moore. When Moore rejected Eady’s apology, Eady left, after which Moore took the floor to blast Eady for trying to use her for a “moment,” saying, “I’m gonna pay you dust.” Popular on Variety Then, Moore unveiled a poster board — courtesy of an investigator, she said — with “Who Is This Ho?” written at the top, underneath which were blurred images of Eady. She then held up another poster board, which was — from what the women said, an image of Eady performing oral sex. The other women reacted with horror, saying Moore had gone “too far,” which Moore disputed. Outside the spa, Porsha Williams, who has known Moore for years, said to producers: “I want to just take my mic off. You can just act like I was never at this event.” At the end of the episode, a chryon read: “Based on Kenya’s behavior, the decision was made to cease filming with her this season.” In practical terms, Bravo cutting ties with Moore meant that her presence in Season 16 has been drastically scaled back. There were no solo scenes with her in the five episodes in which she appeared, cameras did not go to her house and she didn’t do any confessional interviews, since those are filmed later in the season and after it’s completed. Nor were there portraits of Moore from Season 16 on the Bravo press site. Moore’s actions in “About Last Night” have cost her her job, at least for now. She was taking revenge on Eady, who — seemingly out of the blue — had picked a fight with Moore upon joining the show. After the squabble escalated, at the end of the March 30 episode, Eady appeared to threaten Moore after a group dinner, saying, among other things, “I don’t play them games, I got whips, pistols, everything” — utterances the microphone caught. As Moore left the event with castmate Williams, viewers heard her say in the car: “She talking about guns, she was talking about, ‘I still got my pistol on me’ — this girl is a problem. She gotta go, she gotta go for real, for real. Please let her do something to me, so she can go!” Bravo viewers who follow “Real Housewives” news have known for months what led to Moore’s ouster. In June of last year, when reports began to leak about what happened at Moore’s hair spa — characterized as a “revenge porn” incident that led to her being suspended — Moore defended herself on Twitter, writing on June 8, 2024: “I would never engage in revenge porn, I have never distributed private images or footage of anyone, nor solicited images owned by others to use to threaten or blackmail.” Sources close to Moore told People magazine that “she was concerned for her safety.” By the end of the month, Moore left the show, which TMZ reported was through a mutual agreement with Bravo. Then in November, on the “Tamron Hall” show, Moore sought to explain what happened, saying that she “didn’t feel protected” by producers, and that she felt like they treated her fears as if she were “a Black Karen.” Moore said she began doing “research” on Eady, and found explicit material of Eady performing a sexual act. “I said, ‘OK, if no one else is going to step up for me and protect me, I’m going to protect myself, and I’m gonna tell everyone what I found out about — it’s a receipt.’” She said she knew that Bravo would blur out the nudity, since “it was explicit.”  When Hall told Moore that she was surprised by “the level of aggression” of the act, Moore said: “Hindsight is always 50/50. If I could do it all over again, I believe the photos were very distasteful, and I elevated the situation.” She then apologized, sort of, but didn’t mention Eady. “I am sorry for what I’ve done — I didn’t have to take it that far,” she said. “But when I felt threatened, I’ve never had a child and be in a situation like this before.” (Moore became choked up as she mentioned of her 6-year-old daughter, Brooklyn.) “So that’s why I escalated it to the point where I was protecting not only myself, but my child.” “The Real Housewives of Atlanta” did a half-reboot after its lackluster 15th season in 2023. Eventually, after considering its options, Bravo announced the return of fan-favorite Williams, who was then joined by past cast members Moore, Drew Sidora and Shamea Morton (who was promoted from “friend” and “guest” status). Added to the cast were newcomers Eady, Angela Oakley and Kelli Ferrell.  Moore, a former winner of Miss USA, joined “The Real Housewives” in 2012. During her years on the show, she became known as a shade queen who liked to twirl (her signature move and catchphrase). Yet Moore was also willing to excavate her pain on camera, whether that was during her attempts to forge a relationship with the mother who had rejected her as a child or during her tumultuous, brief marriage to (and endless divorce from) Marc Daly, with whom she had Brooklyn. She’s proved to be a compelling — if divisive — figure, and will certainly continue to have her champions. After Moore left Season 16, Phaedra Parks — who was on “The Real Housewives of Atlanta” for Seasons 3-9 — was brought back to the show. Parks had been fired after Season 9 because she spread a rumor, then repeated on camera by Williams, that their fellow castmate Kandi Burruss and her husband Todd Tucker had planned to drug and sexually assault Williams. If redemption and future employment is possible after that, then perhaps there is a road back to “Real Housewives” for Moore after all.",
  "image": "https://variety.com/wp-content/uploads/2025/04/KenyaMoore.1.jpg?w=730\u0026h=463\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\t\u003cstrong\u003eSPOILER ALERT:\u003c/strong\u003e\u003cem\u003e\u003cstrong\u003e \u003c/strong\u003eThis post contains spoilers from “About Last Night,” Episode 5, Season 16 of  “\u003ca href=\"https://variety.com/t/the-real-housewives-of-atlanta/\" id=\"auto-tag_the-real-housewives-of-atlanta\" data-tag=\"the-real-housewives-of-atlanta\"\u003eThe Real Housewives of Atlanta\u003c/a\u003e,” streaming on Peacock as of April 7.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tOn Sunday night’s “The Real Housewives of Atlanta,” viewers finally saw an event that had been foretold by the blogs well before March 9, when Season 16 of the \u003ca href=\"https://variety.com/t/bravo/\" id=\"auto-tag_bravo\" data-tag=\"bravo\"\u003eBravo\u003c/a\u003e show premiered. In this incident, longtime “Atlanta” star \u003ca href=\"https://variety.com/t/kenya-moore/\" id=\"auto-tag_kenya-moore\" data-tag=\"kenya-moore\"\u003eKenya Moore\u003c/a\u003e got herself into the kind of trouble — ostentatiously and maliciously displaying explicit images of castmate Brit Eady on poster boards on camera — that may spell doom for her ever appearing on the show again. It certainly ended her season early.\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tDuring the episode, titled “About Last Night,” Moore — who joined the show in its fifth season  — threw a grand opening party at Kenya Moore Hair Spa, her new store. Rookie cast member Eady, who had started a feud with Moore earlier in the season, arrived with a peace offering, a bouquet of flowers with a card. In the lead up to the party, Eady had expressed contrition to other cast members about her previous actions toward Moore. When Moore rejected Eady’s apology, Eady left, after which Moore took the floor to blast Eady for trying to use her for a “moment,” saying, “I’m gonna pay you dust.” \n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tThen, Moore unveiled a poster board — courtesy of an investigator, she said — with “Who Is This Ho?” written at the top, underneath which were blurred images of Eady. She then held up another poster board, which was — from what the women said, an image of Eady performing oral sex. The other women reacted with horror, saying Moore had gone “too far,” which Moore disputed. Outside the spa, Porsha Williams, who has known Moore for years, said to producers: “I want to just take my mic off. You can just act like I was never at this event.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAt the end of the episode, a chryon read: “Based on Kenya’s behavior, the decision was made to cease filming with her this season.” \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn practical terms, Bravo cutting ties with Moore meant that her presence in Season 16 has been drastically scaled back. There were no solo scenes with her in the five episodes in which she appeared, cameras did not go to her house and she didn’t do any confessional interviews, since those are filmed later in the season and after it’s completed. Nor were there portraits of Moore from Season 16 on the Bravo press site.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tMoore’s actions in “About Last Night” have cost her her job, at least for now. She was taking revenge on Eady, who — seemingly out of the blue — had picked a fight with Moore upon joining the show. After the squabble escalated, at the end of the March 30 episode, Eady appeared to threaten Moore after a group dinner, saying, among other things, “I don’t play them games, I got whips, pistols, everything” — utterances the microphone caught. As Moore left the event with castmate Williams, viewers heard her say in the car: “She talking about guns, she was talking about, ‘I still got my pistol on me’ — this girl is a problem. She gotta go, she gotta go for real, for real. Please let her do something to me, so she can go!”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tBravo viewers who follow  “Real Housewives” news have known for months what led to Moore’s ouster. In June of last year, when reports began to leak about what happened at Moore’s hair spa — characterized as a “revenge porn” incident that led to her being suspended — Moore \u003ca rel=\"nofollow\" href=\"https://x.com/KenyaMoore/status/179948615106714843\" target=\"_blank\"\u003edefended herself on Twitter\u003c/a\u003e, writing on June 8, 2024: “I would never engage in revenge porn, I have never distributed private images or footage of anyone, nor solicited images owned by others to use to threaten or blackmail.” Sources close to Moore told \u003ca rel=\"nofollow\" href=\"https://people.com/kenya-moore-exits-real-housewives-of-atlanta-after-suspension-for-explicit-photos-scandal-8669281\" target=\"_blank\"\u003ePeople magazine \u003c/a\u003ethat “she was concerned for her safety.” By the end of the month, Moore left the show, which \u003ca rel=\"nofollow\" href=\"https://www.tmz.com/2024/06/25/kenya-moore-not-returning-rhoa-real-housewives-after-suspension/\" target=\"_blank\"\u003eTMZ reported \u003c/a\u003ewas through a mutual agreement with Bravo.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThen in November, on the “Tamron Hall” show, Moore \u003ca rel=\"nofollow\" href=\"https://www.youtube.com/watch?v=MS9shglxJkg\" target=\"_blank\"\u003esought to explain what happened\u003c/a\u003e, saying that she “didn’t feel protected” by producers, and that she felt like they treated her fears as if she were “a Black Karen.” Moore said she began doing “research” on Eady, and found explicit material of Eady performing a sexual act. “I said, ‘OK, if no one else is going to step up for me and protect me, I’m going to protect myself, and I’m gonna tell everyone what I found out about — it’s a receipt.’” She said she knew that Bravo would blur out the nudity, since “it was explicit.” \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWhen Hall told Moore that she was surprised by “the level of aggression” of the act, Moore said: “Hindsight is always 50/50. If I could do it all over again, I believe the photos were very distasteful, and I elevated the situation.” She then apologized, sort of, but didn’t mention Eady. “I am sorry for what I’ve done — I didn’t have to take it that far,” she said. “But when I felt threatened, I’ve never had a child and be in a situation like this before.” (Moore became choked up as she mentioned of her 6-year-old daughter, Brooklyn.) “So that’s why I escalated it to the point where I was protecting not only myself, but my child.”\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t“The Real Housewives of Atlanta” did a half-reboot after its lackluster 15th season in 2023. Eventually, after considering its options, Bravo announced the return of fan-favorite Williams, who was then joined by past cast members Moore, Drew Sidora and Shamea Morton (who was promoted from “friend” and “guest” status). Added to the cast were newcomers Eady, Angela Oakley and Kelli Ferrell. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tMoore, a former winner of Miss USA, joined “The Real Housewives” in 2012. During her years on the show, she became known as a shade queen who liked to twirl (her \u003ca href=\"https://www.youtube.com/watch?v=_jvX9w_VAdI\" rel=\"nofollow\" target=\"_blank\"\u003esignature move and catchphrase\u003c/a\u003e). Yet Moore was also willing to excavate her pain on camera, whether that was during her attempts to forge a relationship with the mother who had rejected her as a child or during her tumultuous, brief marriage to (and endless divorce from) Marc Daly, with whom she had Brooklyn. She’s proved to be a compelling — if divisive — figure, and will certainly continue to have her champions.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAfter Moore left Season 16, Phaedra Parks — who was on “The Real Housewives of Atlanta” for Seasons 3-9 — was brought back to the show. Parks had been fired after Season 9 because she spread a rumor, then repeated on camera by Williams, that their fellow castmate Kandi Burruss and her husband Todd Tucker had planned to drug and sexually assault Williams. If redemption and future employment is possible after that, then perhaps there is a road back to “Real Housewives” for Moore after all.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-04-07T01:11:44Z",
  "modifiedTime": "2025-04-07T01:11:57Z"
}
