{
  "id": "4d12c921-3c26-4e04-8f22-8b517c7175b5",
  "title": "‘Squid Game’: Park Sung-hoon Breaks Down Hyun-ju’s [SPOILER] and Why Her Motivation Shifts in Season 3: ‘I Feel Very Emotional Right Now’",
  "link": "https://variety.com/2025/tv/news/hyun-ju-dies-squid-game-3-park-sung-hoon-1236440271/",
  "description": "SPOILER ALERT: This article contains major spoilers from “Squid Game” Season 3, Episode 2, now streaming on Netflix. When Park Sung-hoon filmed Cho Hyun-ju’s death scene during “Squid Game” Season 3’s memorable game of hide-and-seek, he managed to surprise himself by nailing it right away. “Director Hwang [Dong-hyuk] gave me a direction saying, ‘When Hyun-ju […]",
  "author": "Kate Aurthur",
  "published": "Fri, 27 Jun 2025 23:30:00 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Park Sung-hoon",
    "Squid Game"
  ],
  "byline": "Matt Minton",
  "length": 8390,
  "excerpt": "'Squid Game' star Park Sung-hoon on Hyun-ju's Season 3 journey.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "SPOILER ALERT: This article contains major spoilers from “Squid Game” Season 3, Episode 2, now streaming on Netflix. When Park Sung-hoon filmed Cho Hyun-ju’s death scene during “Squid Game” Season 3’s memorable game of hide-and-seek, he managed to surprise himself by nailing it right away. “Director Hwang [Dong-hyuk] gave me a direction saying, ‘When Hyun-ju slips away from the camera, could you have one tear roll down your face?’ And I thought it would be hard, but I actually did it in one take,” Park tells Variety. “So when I finished it, the staff all clapped and cheered for me.” But that doesn’t mean saying goodbye came easy, especially because Hyun-ju’s death happens so unexpectedly early in the season. “Recently, I’ve played a lot of villain characters, so I was so lucky to be able to play Hyun-ju, who is such a cool character,” Park says. “It was very hard for me to say goodbye to her, because I thought she would last longer. I think she died earlier than she should have, so it’s a shame.” Popular on Variety Hyun-ju was introduced in Season 2 as one of the main players in the new game, with the goal of using the cash prize to help fund her gender-affirming surgery after getting discharged from the military. Relying on her training, she ends up teaming up with Seong Gi-hun (Lee Jung-jae), becoming an instrumental leader in the rebellion. Variety previously spoke with Park about the preparation that went into playing a trans character as a cis actor. Courtesy of No Ju-han/Netflix After Gi-hun’s rebellion fails at the end of Season 2, Episode 2 of this final season kicks off with half the players being forced to kill another player, while the hiders try to find the exit. Hyun-ju immediately sticks with the older woman, Jang Geum-ja (Kang Ae-sim), and the pregnant Kim Jun-hee (Jo Yu-ri), who are all on the same team. Along the way, Hyun-ju is forced to kill off players from the opposing team, showing off her military training. Upon stumbling on the exit, she goes back to save Geum-ja and Jun-hee’s newborn baby before being stabbed in the back by Lee Myungi-gi (Yim Si-wan). Below, Park breaks down Hyun-ju’s decision to sacrifice herself, what it meant for a trans character to witness the baby’s birth, and how the actor continues to reflect on the LGBTQ+ community’s warm response to the character. Can you talk about the big emotional scene when Hyun-ju finds the exit, opens the door and decides to go back, ultimately sacrificing herself to save the other two women? What’s going through her head in that moment? When she finds the exit, it was just an automatic response for her to take a step. But I think her motivation shifted from Seasons 2 to 3. In Season 2, her main motivation was to get the money so that she could get her gender affirmation surgery, go to Thailand and start over. But in Season 3, her big motivation became protecting the weaker woman here, Geum-ja, and Jun-hee’s newborn baby as well. So when she took a step outside, I think there was a wake up call inside her head telling her to go back: “You have to protect these people.” So I think the only thought that was left in her head at the moment was to go and save them. I remember limping and being very bloody, walking back to the room, and I feel very emotional right now, actually, thinking back to that scene, because it was such a sad and heartbreaking moment. What was the experience like filming that death scene? Was it the last scene you shot? The final scene I filmed was when I’m being photographed by the Squid Game organizers. The scene when Jun-hee gives birth was so special to Hyun-ju because the birth of a life is such a holy and sacred thing. Especially as a trans woman, I think Hyun-ju would have lots of emotions swirling inside of her watching that happen. When Myung-gi stabs me in the back and kills me, there’s a line in the script that says, “Hyun-ju’s soul leaves her eyes.” So I tried to stay true to the script. Before Hyun-ju’s death, we also see her in action, killing two other players in self-defense. What preparation went into the choreography for those violent scenes? Before we got into shooting the scene, we went to action school to start off with the basic training, and then we learned the choreo for that scene. We did a little bit of adjustments on set, but we basically followed the choreo that was given to us. And one of the two actors who I fought with in that scene actually spent seven years in a Chinese temple called Shaolin Temple, which is known for martial arts. So that guy was so skilled, he knew how to act and react. Together with him, I knew I could create a really cool scene. The important thing when I was filming that scene was that Hyun-ju really wanted to protect Geum-ja and the newborn baby, and in order to do that, she had to kill these people. But she is actually a very warm-hearted person, and has a very good moral compass, so I thought that she would hate to kill these people, even if she has to. So I thought of looking away when stabbing because she didn’t want to see that she was actually killing someone. So every time she’s stabbing someone, she’s looking away. Courtesy of Noh Ju-han / Netflix That’s a really interesting choice. I also liked the moment where, after you kill the last player, you trace the blood on your face. Another player on the red team thinks of trying to kill you, but decides to keep going down the hallway because they’re too sacred. Director Hwang was actually very keen on that scene, because he told me that when Hyun-ju is wiping off the sweat and there’s blood stained all over her face, she got to look badass. We went for like 10 or more takes to make her look really cool in that scene. And as you said, there’s the other player who just passes by and decides not to fight me. I think that was very funny — it’s a scene that shows Hyun-ju’s charisma and aura. So that’s also a moment I hold dear to my heart. The whole set for the hide and seek game is incredible, and feels so overwhelming. Can you talk about how expansive it was? It all looks very practical. The set for hide and seek was actually just one floor. It looks like it’s got multiple floors when you watch the show, but that’s all done with CGI. The overarching concept for the hide and seek set was the ocean. And you know how the ocean is the route to all life, it gives birth to all life, and Jun-hee gave birth in that setting of an ocean. So I thought that was meaningful. I know you said that Hyun-ju died earlier than she should’ve. Now that the series is wrapped, how do you feel about where you got to leave off the character? Do you feel like you got to do her justice? It’s always hard to say goodbye to your characters, but it’s especially hard if it’s Hyun-ju, who is such a cool character and such a nice person. It was very hard for me to say goodbye to her, especially because I received so much love and support from fans all across the world. And I think me being a cisgender actor playing a transgender character, it also has its meaning, to some extent, because we’re all people, we deserve the same amount of love and respect. Even though I’m a cisgender actor playing a transgender character, the LGBTQ+ community saw Hyun-ju under a very positive light. They loved, respected and supported her, and I’m just so eternally grateful for what they’ve done for her. It feels significant that Hyun-ju died alongside the first person who accepted her as trans, as well as Geum-ja, who took much longer to accept her. There’s two different perspectives that still come together for her in the end. The goal for the three women was the same: Protect the newborn baby. It was like women solidarity together. And as you said, Geum-ja took a little more time to warm up to Hyun-ju and accept and embrace her as her friend and family. She goes through that transformation, and I think that’s what’s really important. If there are people out there that still have prejudices and biases against the LGBTQ+ community, I hope they would warm up to it just like Geum-ja did. This interview has been edited and condensed.",
  "image": "https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon-MAIN.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\t\u003cstrong\u003eSPOILER ALERT: \u003c/strong\u003e\u003cem\u003eThis article contains major spoilers from “\u003ca href=\"https://variety.com/t/squid-game/\" id=\"auto-tag_squid-game\" data-tag=\"squid-game\"\u003eSquid Game\u003c/a\u003e” Season 3, Episode 2, now streaming on Netflix.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWhen \u003ca href=\"https://variety.com/t/park-sung-hoon/\" id=\"auto-tag_park-sung-hoon\" data-tag=\"park-sung-hoon\"\u003ePark Sung-hoon\u003c/a\u003e filmed Cho Hyun-ju’s death scene during “Squid Game” Season 3’s memorable game of hide-and-seek, he managed to surprise himself by nailing it right away.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Director Hwang [Dong-hyuk] gave me a direction saying, ‘When Hyun-ju slips away from the camera, could you have one tear roll down your face?’ And I thought it would be hard, but I actually did it in one take,” Park tells \u003cem\u003eVariety\u003c/em\u003e. “So when I finished it, the staff all clapped and cheered for me.”\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tBut that doesn’t mean saying goodbye came easy, especially because Hyun-ju’s death happens so unexpectedly early in the season. “Recently, I’ve played a lot of villain characters, so I was so lucky to be able to play Hyun-ju, who is such a cool character,” Park says. “It was very hard for me to say goodbye to her, because I thought she would last longer. I think she died earlier than she should have, so it’s a shame.”\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tHyun-ju was introduced in Season 2 as one of the main players in the new game, with the goal of using the cash prize to help fund her gender-affirming surgery after getting discharged from the military. Relying on her training, she ends up teaming up with Seong Gi-hun (Lee Jung-jae), becoming an instrumental leader in the rebellion. \u003cem\u003eVariety\u003c/em\u003e \u003ca href=\"https://variety.com/2025/tv/news/squid-game-park-sung-hoon-concerns-playing-trans-woman-1236287437/\"\u003epreviously spoke with Park\u003c/a\u003e about the preparation that went into playing a trans character as a cis actor.\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\t\n\u003cfigure\u003e\n\n\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.1.jpg?w=1024\" data-lazy-src=\"https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.1.jpg?w=1024\" alt=\"\" data-lazy-srcset=\"https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.1.jpg 1200w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.1.jpg?resize=150,100 150w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.1.jpg?resize=300,200 300w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.1.jpg?resize=1000,667 1000w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.1.jpg?resize=910,607 910w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.1.jpg?resize=681,454 681w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.1.jpg?resize=450,300 450w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.1.jpg?resize=250,167 250w\" data-lazy-sizes=\"(min-width: 87.5rem) 1000px, (min-width: 78.75rem) 681px, (min-width: 48rem) 450px, (max-width: 48rem) 250px\" height=\"683\" width=\"1024\" srcset=\"https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.1.jpg 1200w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.1.jpg?resize=150,100 150w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.1.jpg?resize=300,200 300w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.1.jpg?resize=1000,667 1000w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.1.jpg?resize=910,607 910w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.1.jpg?resize=681,454 681w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.1.jpg?resize=450,300 450w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.1.jpg?resize=250,167 250w\"/\u003e\n\t\n\t\n\t\u003c/p\u003e\n\t\n\t\t\t\n\t\t\t\u003cfigcaption\u003e\n\t\n\t\t\t\t\t\t\t\u003ccite\u003eCourtesy of No Ju-han/Netflix\u003c/cite\u003e\n\t\t\n\t\u003c/figcaption\u003e\n\n\t\t\t\n\u003c/figure\u003e\n\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\tAfter Gi-hun’s rebellion fails at the \u003ca href=\"https://variety.com/2024/tv/news/squid-game-season-2-lee-jung-jae-lee-byung-hun-spoiler-breakdown-1236258362/\"\u003eend of Season 2\u003c/a\u003e, Episode 2 of this final season kicks off with half the players being forced to kill another player, while the hiders try to find the exit. Hyun-ju immediately sticks with the older woman, Jang Geum-ja (Kang Ae-sim), and the pregnant Kim Jun-hee (Jo Yu-ri), who are all on the same team. Along the way, Hyun-ju is forced to kill off players from the opposing team, showing off her military training. Upon stumbling on the exit, she goes back to save Geum-ja and Jun-hee’s newborn baby before being stabbed in the back by Lee Myungi-gi (Yim Si-wan).\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tBelow, Park breaks down Hyun-ju’s decision to sacrifice herself, what it meant for a trans character to witness the baby’s birth, and how the actor continues to reflect on the LGBTQ+ community’s warm response to the character.\u003c/p\u003e\n\n\n\n\t\u003ch5\u003e\n\t\tCan you talk about the big emotional scene when Hyun-ju finds the exit, opens the door and decides to go back, ultimately sacrificing herself to save the other two women? What’s going through her head in that moment?\t\u003c/h5\u003e\n\n\n\n\u003cp\u003e\n\tWhen she finds the exit, it was just an automatic response for her to take a step. But I think her motivation shifted from Seasons 2 to 3. In Season 2, her main motivation was to get the money so that she could get her gender affirmation surgery, go to Thailand and start over. But in Season 3, her big motivation became protecting the weaker woman here, Geum-ja, and Jun-hee’s newborn baby as well. So when she took a step outside, I think there was a wake up call inside her head telling her to go back: “You have to protect these people.” So I think the only thought that was left in her head at the moment was to go and save them. I remember limping and being very bloody, walking back to the room, and I feel very emotional right now, actually, thinking back to that scene, because it was such a sad and heartbreaking moment.\u003c/p\u003e\n\n\n\n\t\u003ch5\u003e\n\t\tWhat was the experience like filming that death scene? Was it the last scene you shot?\t\u003c/h5\u003e\n\n\n\n\u003cp\u003e\n\tThe final scene I filmed was when I’m being photographed by the Squid Game organizers. The scene when Jun-hee gives birth was so special to Hyun-ju because the birth of a life is such a holy and sacred thing. Especially as a trans woman, I think Hyun-ju would have lots of emotions swirling inside of her watching that happen. When Myung-gi stabs me in the back and kills me, there’s a line in the script that says, “Hyun-ju’s soul leaves her eyes.” So I tried to stay true to the script.\u003c/p\u003e\n\n\n\n\t\u003ch5\u003e\n\t\tBefore Hyun-ju’s death, we also see her in action, killing two other players in self-defense. What preparation went into the choreography for those violent scenes?\t\u003c/h5\u003e\n\n\n\n\u003cp\u003e\n\tBefore we got into shooting the scene, we went to action school to start off with the basic training, and then we learned the choreo for that scene. We did a little bit of adjustments on set, but we basically followed the choreo that was given to us. And one of the two actors who I fought with in that scene actually spent seven years in a Chinese temple called Shaolin Temple, which is known for martial arts. So that guy was so skilled, he knew how to act and react. Together with him, I knew I could create a really cool scene. The important thing when I was filming that scene was that Hyun-ju really wanted to protect Geum-ja and the newborn baby, and in order to do that, she had to kill these people. But she is actually a very warm-hearted person, and has a very good moral compass, so I thought that she would hate to kill these people, even if she has to. So I thought of looking away when stabbing because she didn’t want to see that she was actually killing someone. So every time she’s stabbing someone, she’s looking away.\n\n\t\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\t\n\u003cfigure\u003e\n\n\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.2.jpg?w=1024\" data-lazy-src=\"https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.2.jpg?w=1024\" alt=\"\" data-lazy-srcset=\"https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.2.jpg 1200w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.2.jpg?resize=150,100 150w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.2.jpg?resize=300,200 300w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.2.jpg?resize=1000,667 1000w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.2.jpg?resize=910,607 910w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.2.jpg?resize=681,454 681w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.2.jpg?resize=450,300 450w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.2.jpg?resize=250,167 250w\" data-lazy-sizes=\"(min-width: 87.5rem) 1000px, (min-width: 78.75rem) 681px, (min-width: 48rem) 450px, (max-width: 48rem) 250px\" height=\"683\" width=\"1024\" srcset=\"https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.2.jpg 1200w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.2.jpg?resize=150,100 150w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.2.jpg?resize=300,200 300w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.2.jpg?resize=1000,667 1000w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.2.jpg?resize=910,607 910w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.2.jpg?resize=681,454 681w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.2.jpg?resize=450,300 450w, https://variety.com/wp-content/uploads/2025/06/SquidGame-Season3-Park-Sung-hoon.2.jpg?resize=250,167 250w\"/\u003e\n\t\n\t\n\t\u003c/p\u003e\n\t\n\t\t\t\n\t\t\t\u003cfigcaption\u003e\n\t\n\t\t\t\t\t\t\t\u003ccite\u003eCourtesy of Noh Ju-han / Netflix\u003c/cite\u003e\n\t\t\n\t\u003c/figcaption\u003e\n\n\t\t\t\n\u003c/figure\u003e\n\n\u003c/div\u003e\n\n\n\n\t\u003ch5\u003e\n\t\tThat’s a really interesting choice. I also liked the moment where, after you kill the last player, you trace the blood on your face. Another player on the red team thinks of trying to kill you, but decides to keep going down the hallway because they’re too sacred.\t\u003c/h5\u003e\n\n\n\n\u003cp\u003e\n\tDirector Hwang was actually very keen on that scene, because he told me that when Hyun-ju is wiping off the sweat and there’s blood stained all over her face, she got to look badass. We went for like 10 or more takes to make her look really cool in that scene. And as you said, there’s the other player who just passes by and decides not to fight me. I think that was very funny — it’s a scene that shows Hyun-ju’s charisma and aura. So that’s also a moment I hold dear to my heart.\u003c/p\u003e\n\n\n\n\t\u003ch5\u003e\n\t\tThe whole set for the hide and seek game is incredible, and feels so overwhelming. Can you talk about how expansive it was? It all looks very practical.\t\u003c/h5\u003e\n\n\n\n\u003cp\u003e\n\tThe set for hide and seek was actually just one floor. It looks like it’s got multiple floors when you watch the show, but that’s all done with CGI. The overarching concept for the hide and seek set was the ocean. And you know how the ocean is the route to all life, it gives birth to all life, and Jun-hee gave birth in that setting of an ocean. So I thought that was meaningful.\u003c/p\u003e\n\n\n\n\t\u003ch5\u003e\n\t\tI know you said that Hyun-ju died earlier than she should’ve. Now that the series is wrapped, how do you feel about where you got to leave off the character? Do you feel like you got to do her justice?\t\u003c/h5\u003e\n\n\n\n\u003cp\u003e\n\tIt’s always hard to say goodbye to your characters, but it’s especially hard if it’s Hyun-ju, who is such a cool character and such a nice person. It was very hard for me to say goodbye to her, especially because I received so much love and support from fans all across the world. And I think me being a cisgender actor playing a transgender character, it also has its meaning, to some extent, because we’re all people, we deserve the same amount of love and respect. Even though I’m a cisgender actor playing a transgender character, the LGBTQ+ community saw Hyun-ju under a very positive light. They loved, respected and supported her, and I’m just so eternally grateful for what they’ve done for her.\u003c/p\u003e\n\n\n\n\t\u003ch5\u003e\n\t\tIt feels significant that Hyun-ju died alongside the first person who accepted her as trans, as well as Geum-ja, who took much longer to accept her. There’s two different perspectives that still come together for her in the end.\t\u003c/h5\u003e\n\n\n\n\u003cp\u003e\n\tThe goal for the three women was the same: Protect the newborn baby. It was like women solidarity together. And as you said, Geum-ja took a little more time to warm up to Hyun-ju and accept and embrace her as her friend and family. She goes through that transformation, and I think that’s what’s really important. If there are people out there that still have prejudices and biases against the LGBTQ+ community, I hope they would warm up to it just like Geum-ja did.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cem\u003eThis interview has been edited and condensed.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-06-27T23:30:00Z",
  "modifiedTime": "2025-06-27T23:30:00Z"
}
