{
  "id": "55005ae6-530f-4009-b92e-a064a19cda9d",
  "title": "Kate Beckinsale Sues Over Knee Injury on Croatian Set of ‘Canary Black’",
  "link": "https://variety.com/2025/film/news/kate-beckinsale-canary-black-knee-injury-1236428816/",
  "description": "Kate Beckinsale has sued the producers of “Canary Black,” alleging that she suffered a significant knee injury during filming on an unsafe set in Croatia. Beckinsale alleges that she was injured while filming an action scene with minimal padding. She argues that the scene should have been done by a stunt performer, but that her […]",
  "author": "Gmaddaus",
  "published": "Thu, 12 Jun 2025 00:25:25 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Canary Black",
    "Kate Beckinsale"
  ],
  "byline": "William Earl",
  "length": 2083,
  "excerpt": "Kate Beckinsale sued the producers of 'Canary Black' over a knee injury suffered on set.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "Kate Beckinsale has sued the producers of “Canary Black,” alleging that she suffered a significant knee injury during filming on an unsafe set in Croatia. Beckinsale alleges that she was injured while filming an action scene with minimal padding. She argues that the scene should have been done by a stunt performer, but that her stunt double had previously broken her ankle. The lawsuit alleges that filming days would go as long as 15 hours, despite a 12-hour limit in Beckinsale’s contract, exposing her to hazards arising from fatigue. During filming in December 2022, Beckinsale was to perform in a scene in which another actor threw her against a wall. Popular on Variety “Ms. Beckinsale complained that the scene did not seem safe, and that the throwing of her into the wall was too hard and too dangerous,” the lawsuit alleges. “Notwithstanding the complaints by Ms. Beckinsale, there were numerous takes of this dangerous scene.” According to the complaint, Beckinsale suffered a complex tear of her left meniscus. Beckinsale sought medical care and was out of commission for a couple of months, returning to set in February to finish the film. She alleges that even then, the producers ignored the limitations imposed by her doctors and again coerced her into performing unsafe action scenes. The complaint was first reported by Puck. Beckinsale’s attorneys filed a cursory version the lawsuit in December, listing Beckinsale as “Jane Doe.” They did not serve Anton Entertainment, the defendants, until after amending the complaint with more detailed allegations, and with Beckinsale’s name, in May. The defendants have yet to respond in court. The film debuted last year on Amazon Prime. Beckinsale has had several health issues in recent years. In 2024, she disclosed that she had been hospitalized for six weeks for an esophageal tear, which she attributed to a grief response to her stepfather’s death. She also said a severe flare of her mast cell disease had contributed to her illness.",
  "image": "https://variety.com/wp-content/uploads/2024/12/GettyImages-1838005964.jpg?crop=0px%2C146px%2C3934px%2C2213px\u0026resize=1000%2C563",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\t\u003ca href=\"https://variety.com/t/kate-beckinsale/\" id=\"auto-tag_kate-beckinsale\" data-tag=\"kate-beckinsale\"\u003eKate Beckinsale\u003c/a\u003e has sued the producers of “\u003ca href=\"https://variety.com/t/canary-black/\" id=\"auto-tag_canary-black\" data-tag=\"canary-black\"\u003eCanary Black\u003c/a\u003e,” alleging that she suffered a significant knee injury during filming on an unsafe set in Croatia.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tBeckinsale alleges that she was injured while filming an action scene with minimal padding. She argues that the scene should have been done by a stunt performer, but that her stunt double had previously broken her ankle.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe lawsuit alleges that filming days would go as long as 15 hours, despite a 12-hour limit in Beckinsale’s contract, exposing her to hazards arising from fatigue.\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tDuring filming in December 2022, Beckinsale was to perform in a scene in which another actor threw her against a wall.\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\t“Ms. Beckinsale complained that the scene did not seem safe, and that the throwing of her into the wall was too hard and too dangerous,” the lawsuit alleges. “Notwithstanding the complaints by Ms. Beckinsale, there were numerous takes of this dangerous scene.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAccording to the complaint, Beckinsale suffered a complex tear of her left meniscus. Beckinsale sought medical care and was out of commission for a couple of months, returning to set in February to finish the film.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tShe alleges that even then, the producers ignored the limitations imposed by her doctors and again coerced her into performing unsafe action scenes. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe complaint was first reported by Puck.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tBeckinsale’s attorneys filed a cursory version the lawsuit in December, listing Beckinsale as “Jane Doe.” They did not serve Anton Entertainment, the defendants, until after amending the complaint with more detailed allegations, and with Beckinsale’s name, in May. The defendants have yet to respond in court.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tThe film \u003ca href=\"https://www.youtube.com/watch?v=tSaw2HTVSsA\u0026amp;ab_channel=PrimeVideo\" rel=\"nofollow\" target=\"_blank\"\u003edebuted\u003c/a\u003e last year on Amazon Prime.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tBeckinsale has had several health issues in recent years. In 2024, she disclosed that she had been hospitalized for six weeks for an esophageal tear, which she attributed to a grief response to her stepfather’s death. She also said \u003ca href=\"https://www.latimes.com/entertainment-arts/movies/story/2024-07-10/kate-beckinsale-hospital-stress-grief\" rel=\"nofollow\" target=\"_blank\"\u003ea severe flare\u003c/a\u003e of her mast cell disease had contributed to her illness.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-06-12T00:25:25Z",
  "modifiedTime": "2025-06-12T00:25:33Z"
}
