{
  "id": "5516bd0a-e6d1-4559-850e-5583c70c780c",
  "title": "Samsung Launches AI Capabilities Across Products at CES",
  "link": "https://variety.com/2025/biz/news/samsung-ces-2025-ai-capabilities-1236267351/",
  "description": "Samsung kicked off its CES plans by highlighting its strategy to expand AI across its tech, in a way that is connected and personal, as well as showcasing its latest devices, including the new flagship Neo QLED 8K QN990F TV. Asserting that “AI is here,” Yongsu Kim, Samsung’s executive vice president of visual display and […]",
  "author": "Carolyn Giardina",
  "published": "Tue, 07 Jan 2025 00:57:37 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "CES",
    "Samsung"
  ],
  "byline": "Carolyn Giardina",
  "length": 2923,
  "excerpt": "New AI-driven features for Samsung TV Plus include expanded translation services.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "Samsung kicked off its CES plans by highlighting its strategy to expand AI across its tech, in a way that is connected and personal, as well as showcasing its latest devices, including the new flagship Neo QLED 8K QN990F TV. Asserting that “AI is here,” Yongsu Kim, Samsung’s executive vice president of visual display and global head of TV services, described new AI-driven features for Samsung TV Plus, which consumers will be able to access on the company’s 2025 TV models. For instance, “if there’s a scene [in a movie or TV series] and you’re curious about something, you’ll be able to press the AI button and get insights on what’s on the screen,” he relates, noting that that includes identifying the actors with an image recognition tool. “You’ll be able to access a little bit of bio on the actors in the screen, and then also get recommendations on their movies.” Underscoring Samsung’s interest in globalizing content, the tech giant is also developing real-time AI translation capabilities for a growing number of languages. The aim, he explains, is “if you’re seeing a movie and it doesn’t happen to have translation of the closed captioning in your language, [this would have] AI capabilities that will take the closed captioning in one language and translate into your language of choice.” Samsung’s intent to globalize content already includes Korean content. “We are working with the major Korean content providers such as CJ ENM to make sure that we’re able to become the distribution platform for premium K-content on Samsung TV Plus,” Kim said, adding that Samsung TV Plus currently offers more than 4,000 hours of K-content to users in the U.S. and select international markets. “We’re increasing the number of shows, movies,” he continued. “We’re also doing partnerships with major K-content related events.” That included a recent partnership with the MAMA K-Pop Awards to do live broadcasts of its events. “So we’re looking at ways we can bring local content to a global audience,” he said, noting that additional live events, including sports, and music channels are also in the plans. At CES, Samsung is also announcing a partnership with Microsoft to make the Copilot AI assistant available on Samsung TVs and monitors. This year, Samsung will additionally offer a growing amount of artwork such as renderings of museum paintings for its displays. “We’re also looking to expand into other areas and Hollywood movie posters is something we’d absolutely be interested in doing,” Kim said. “We’ll always take the approach of working with the content owners and making sure that we’re licensing them to make it available to our users. Then we’ll also have commercial arrangements with the content owners to make sure it’s a win-win partnership that gives broader distribution of their content, but also gets them the ability to monetize the content as well.”",
  "image": "https://variety.com/wp-content/uploads/2025/01/QN95D_Q990D_A_.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\t\u003ca href=\"https://variety.com/t/samsung/\" id=\"auto-tag_samsung\" data-tag=\"samsung\"\u003eSamsung\u003c/a\u003e kicked off its \u003ca href=\"https://variety.com/t/ces/\" id=\"auto-tag_ces\" data-tag=\"ces\"\u003eCES\u003c/a\u003e plans by highlighting its strategy to expand AI across its tech, in a way that is connected and personal, as well as showcasing its latest devices, including the new flagship Neo QLED 8K QN990F TV.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAsserting that “AI is here,” Yongsu Kim, Samsung’s executive vice president of visual display and global head of TV services, described new AI-driven features for Samsung TV Plus, which consumers will be able to access on the company’s 2025 TV models.  For instance, “if there’s a scene [in a movie or TV series] and you’re curious about something, you’ll be able to press the AI button and get insights on what’s on the screen,” he relates, noting that that includes identifying the actors with an image recognition tool. “You’ll be able to access a little bit of bio on the actors in the screen, and then also get recommendations on their movies.”\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tUnderscoring Samsung’s interest in globalizing content, the tech giant is also developing real-time AI translation capabilities for a growing number of languages. The aim, he explains, is “if you’re seeing a movie and it doesn’t happen to have translation of the closed captioning in your language, [this would have] AI capabilities that will take the closed captioning in one language and translate into your language of choice.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSamsung’s intent to globalize content already includes Korean content. “We are working with the major Korean content providers such as CJ ENM to make sure that we’re able to become the distribution platform for premium K-content on Samsung TV Plus,” Kim said, adding that Samsung TV Plus currently offers more than 4,000 hours of K-content to users in the U.S. and select international markets. “We’re increasing the number of shows, movies,” he continued. “We’re also doing partnerships with major K-content related events.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThat included a recent partnership with the MAMA K-Pop Awards to do live broadcasts of its events. “So we’re looking at ways we can bring local content to a global audience,” he said, noting that additional live events, including sports, and music channels are also in the plans.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAt CES, Samsung is also announcing a partnership with Microsoft to make the Copilot AI assistant available on Samsung TVs and monitors. This year, Samsung will additionally offer a growing amount of artwork such as renderings of museum paintings for its displays. \n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t“We’re also looking to expand into other areas and Hollywood movie posters is something we’d absolutely be interested in doing,” Kim said. “We’ll always take the approach of working with the content owners and making sure that we’re licensing them to make it available to our users. Then we’ll also have commercial arrangements with the content owners to make sure it’s a win-win partnership that gives broader distribution of their content, but also gets them the ability to monetize the content as well.”\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-01-07T00:57:37Z",
  "modifiedTime": "2025-01-07T00:57:48Z"
}
