{
  "id": "5d374bd3-f48b-4d22-b1fc-bfee77b6c50d",
  "title": "Superman: Shuster Estate's Lawsuit Against WBD, DC Comics Dismissed",
  "link": "https://bleedingcool.com/tv/superman-shuster-estates-lawsuit-against-wbd-dc-comics-dismissed/",
  "description": "A federal judge has dismissed a lawsuit rom Joe Shuster's estate against Warner Bros. Discovery's Superman over foreign rights issues.",
  "author": "Ray Flook",
  "published": "Fri, 25 Apr 2025 14:07:07 -0500",
  "source": "https://www.bleedingcool.com/movies/feed/",
  "categories": [
    "Comics",
    "HBO",
    "Movies",
    "TV",
    "superman"
  ],
  "byline": "Ray Flook",
  "length": 4100,
  "excerpt": "Back in January of this year, the estate of Superman co-creator Joseph Shuster filed a lawsuit against Warner Bros. Discovery (WBD) and DC Comics, claiming the multimedia company didn't have the legal right to release writer/director James Gunn's David Corenswet, Rachel Brosnahan, and Nicholas Hoult-starring Superman feature film in Canada, the United Kingdom, Ireland, and Australia. […]",
  "siteName": "Bleeding Cool News",
  "favicon": "",
  "text": "Posted in: Comics, HBO, Movies, TV | Tagged: supermanA federal judge has dismissed a lawsuit rom Joe Shuster's estate against Warner Bros. Discovery's Superman over foreign rights issues.Back in January of this year, the estate of Superman co-creator Joseph Shuster filed a lawsuit against Warner Bros. Discovery (WBD) and DC Comics, claiming the multimedia company didn't have the legal right to release writer/director James Gunn's David Corenswet, Rachel Brosnahan, and Nicholas Hoult-starring Superman feature film in Canada, the United Kingdom, Ireland, and Australia. Filed by Shuster Estate Executor Mark Warren Peary in the Southern District of New York, the lawsuit sought \"damages and injunctive relief for Defendants' ongoing infringement\" in the key territories listed above. In addition, the lawsuit sought a \"declaratory relief establishing the Shuster Estate's ownership rights across relevant jurisdictions\" (more background on the lawsuit below). On Thursday, U.S. District Judge Jesse Furman dismissed the lawsuit, allowing the feature film to continue with its global release plan this summer. Judge Furman determined that the court did not have an official legal say over the cast since the estate's copyright infringement claims were brought before the laws of foreign countries. The Shuster estate's \"infringement claims are brought explicitly under the laws of foreign countries, not the laws of the United States,\" Judge Furman wrote in his decision. Earlier today, the lawsuit was refiled in New York state court. WBD released the following statement after the decision to dismiss the lawsuit was released: \"As we have consistently maintained, DC controls all rights to Superman\" (you can check out Judge Furman's decision here). Image: DC Studios Screencap Superman Lawsuit: Shuster Estate Sues WBD, DC Over Foreign Rights What Was The Issue? It came down to foreign copyrights to the original character. In 1938, Superman co-creators Shuster and Jerome Siegel signed the global rights to Superman to Detective Comics, Inc. (DC Comics' predecessor) – but the matter of copyright laws and how they function in other countries was brought into the spotlight. The lawsuit claimed that \"the copyright laws of countries with the British legal tradition—including Canada, the United Kingdom, Ireland, and Australia—contain provisions automatically terminating such assignments 25 years after an author's death, vesting in the Shuster Estate the co-author's undivided copyright interest in such countries.\" In other words, according to the argument being made, Shuster's passing in 1992 should have started the clock on that 25-year time limit regarding rights in those territories. \"By operation of law, Shuster's foreign copyrights automatically reverted to his estate in 2017 in most of these territories (and in 2021 in Canada),\" the lawsuit continued. \"Yet Defendants continue to exploit Superman across these jurisdictions without the Shuster Estate's authorization—including in motion pictures, television series, and merchandise—in direct contravention of these countries' copyright laws, which require the consent of all joint copyright owners to do so.\" One of the main arguments made in the lawsuit was that the claims fall under the Berne Convention, an international treaty put into place in 1886 that established minimum standards for copyright protection. In the case of Superman, the Shuster estate argued that the court needed to apply the laws established in those countries where the estate's rights are being impacted. Judge Furman ruled that the treaty wasn't \"self-executing,\" meaning the laws of other countries (regarding copyright infringement) aren't automatically enforced by the U.S. courts. Enjoyed this? Please share on social media! Stay up-to-date and support the site by following Bleeding Cool on Google News today! About Ray FlookServing as Television Editor since 2018, Ray began five years earlier as a contributing writer/photographer before being brought onto the core BC team in 2017.",
  "image": "https://bleedingcool.com/wp-content/uploads/2025/04/MixCollage-25-Apr-2025-02-47-PM-2863-2000x1125.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"wrapper\"\u003e\u003carticle id=\"article\" data-post-id=\"2209695\" itemscope=\"\" itemtype=\"http://schema.org/Article\"\u003e\u003cp\u003ePosted in: \u003ca href=\"https://bleedingcool.com/comics/\" rel=\"category\"\u003eComics\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tv/hbo/\" rel=\"category\"\u003eHBO\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/movies/\" rel=\"category\"\u003eMovies\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tv/\" rel=\"category\"\u003eTV\u003c/a\u003e | Tagged: \u003ca href=\"https://bleedingcool.com/tag/superman/\" rel=\"tag\"\u003esuperman\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\u003cp\u003eA federal judge has dismissed a lawsuit rom Joe Shuster\u0026#39;s estate against Warner Bros. Discovery\u0026#39;s Superman over foreign rights issues.\u003c/p\u003e\u003chr/\u003e\u003cp\u003eBack in January of this year, the estate of Superman co-creator \u003cstrong\u003eJoseph Shuster\u003c/strong\u003e filed a lawsuit against Warner Bros. Discovery (WBD) and DC Comics, claiming the multimedia company didn\u0026#39;t have the legal right to release writer/director \u003cstrong\u003eJames Gunn\u003c/strong\u003e\u0026#39;s \u003cstrong\u003eDavid Corenswet, \u003c/strong\u003e\u003cstrong\u003eRachel Brosnahan\u003c/strong\u003e, and \u003cstrong\u003eNicholas Hoult\u003c/strong\u003e-starring \u003cem\u003eSuperman \u003c/em\u003efeature film in Canada, the United Kingdom, Ireland, and Australia. Filed by Shuster Estate Executor \u003cstrong\u003eMark Warren Peary \u003c/strong\u003ein the Southern District of New York, the lawsuit sought \u0026#34;damages and injunctive relief for Defendants\u0026#39; ongoing infringement\u0026#34; in the key territories listed above. In addition, \u003ca href=\"https://deadline.com/wp-content/uploads/2025/01/1-Peary-v.-DC-Complaint.pdf\"\u003ethe lawsuit sought\u003c/a\u003e a \u0026#34;declaratory relief establishing the Shuster Estate\u0026#39;s ownership rights across relevant jurisdictions\u0026#34; (more background on the lawsuit below).\u003c/p\u003e\n\u003cp\u003eOn Thursday, U.S. District Judge \u003cstrong\u003eJesse Furman\u003c/strong\u003e dismissed the lawsuit, allowing the feature film to continue with its global release plan this summer. Judge Furman determined that the court did not have an official legal say over the cast since the estate\u0026#39;s copyright infringement claims were brought before the laws of foreign countries. The Shuster estate\u0026#39;s \u0026#34;infringement claims are brought explicitly under the laws of foreign countries, not the laws of the United States,\u0026#34; Judge Furman wrote in his decision. Earlier today, the lawsuit was refiled in New York state court. WBD released the following statement after the decision to dismiss the lawsuit was released: \u0026#34;As we have consistently maintained, DC controls all rights to Superman\u0026#34; (\u003ca href=\"https://deadline.com/wp-content/uploads/2025/04/superman-rights-april-24.pdf\"\u003eyou can check out Judge Furman\u0026#39;s decision here\u003c/a\u003e).\u003c/p\u003e\n\u003cfigure id=\"attachment_2209714\" aria-describedby=\"caption-attachment-2209714\"\u003e\u003ca href=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://bleedingcool.com/wp-content/uploads/2025/04/MixCollage-25-Apr-2025-02-47-PM-2863.jpg\"\u003e\u003cimg src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:338/q:75/https://bleedingcool.com/wp-content/uploads/2025/04/MixCollage-25-Apr-2025-02-47-PM-2863.jpg\" alt=\"Superman\" width=\"600\" height=\"338\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:338/q:75/https://bleedingcool.com/wp-content/uploads/2025/04/MixCollage-25-Apr-2025-02-47-PM-2863.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20600%20338%22%20width%3D%22600%22%20height%3D%22338%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2209714\"\u003eImage: DC Studios Screencap\u003c/figcaption\u003e\u003c/figure\u003e\n\u003ch2\u003eSuperman Lawsuit: Shuster Estate Sues WBD, DC Over Foreign Rights\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eWhat Was The Issue?\u003c/strong\u003e It came down to foreign copyrights to the original character. In 1938, Superman co-creators Shuster and Jerome Siegel signed the global rights to Superman to Detective Comics, Inc. (DC Comics\u0026#39; predecessor) – but the matter of copyright laws and how they function in other countries was brought into the spotlight. The lawsuit claimed that \u0026#34;the copyright laws of countries with the British legal tradition—including Canada, the United Kingdom, Ireland, and Australia—contain provisions automatically terminating such assignments 25 years after an author\u0026#39;s death, vesting in the Shuster Estate the co-author\u0026#39;s undivided copyright interest in such countries.\u0026#34;\u003c/p\u003e\n\u003cp\u003eIn other words, according to the argument being made, Shuster\u0026#39;s passing in 1992 should have started the clock on that 25-year time limit regarding rights in those territories. \u0026#34;By operation of law, Shuster\u0026#39;s foreign copyrights automatically reverted to his estate in 2017 in most of these territories (and in 2021 in Canada),\u0026#34; the lawsuit continued. \u0026#34;Yet Defendants continue to exploit Superman across these jurisdictions without the Shuster Estate\u0026#39;s authorization—including in motion pictures, television series, and merchandise—in direct contravention of these countries\u0026#39; copyright laws, which require the consent of all joint copyright owners to do so.\u0026#34;\u003c/p\u003e\n\u003cp\u003eOne of the main arguments made in the lawsuit was that the claims fall under the Berne Convention, an international treaty put into place in 1886 that established minimum standards for copyright protection. In the case of Superman, the Shuster estate argued that the court needed to apply the laws established in those countries where the estate\u0026#39;s rights are being impacted. Judge Furman ruled that the treaty wasn\u0026#39;t \u0026#34;self-executing,\u0026#34; meaning the laws of other countries (regarding copyright infringement) aren\u0026#39;t automatically enforced by the \u003ca href=\"https://www.hollywoodreporter.com/business/business-news/warner-bros-discovery-beats-lawsuit-superman-rights-1236200839\"\u003eU.S. courts\u003c/a\u003e.\u003c/p\u003e\n\u003chr/\u003e\u003cdiv id=\"bc_sharing_is_caring\"\u003e\u003ccenter\u003e\u003cp\u003e\u003cstrong\u003eEnjoyed this? Please share on social media!\u003c/strong\u003e\u003c/p\u003e\u003ca href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fbleedingcool.com%2Ftv%2Fsuperman-shuster-estates-lawsuit-against-wbd-dc-comics-dismissed%2F\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://twitter.com/share?url=https%3A%2F%2Fbleedingcool.com%2Ftv%2Fsuperman-shuster-estates-lawsuit-against-wbd-dc-comics-dismissed%2F\u0026amp;text=Superman%3A+Shuster+Estate%27s+Lawsuit+Against+WBD%2C+DC+Comics+Dismissed\u0026amp;via=bleedingcool\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"http://pinterest.com/pin/create/button/?url=https%3A%2F%2Fbleedingcool.com%2Ftv%2Fsuperman-shuster-estates-lawsuit-against-wbd-dc-comics-dismissed%2F\u0026amp;description=Superman%3A+Shuster+Estate%27s+Lawsuit+Against+WBD%2C+DC+Comics+Dismissed\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://reddit.com/submit?url=https%3A%2F%2Fbleedingcool.com%2Ftv%2Fsuperman-shuster-estates-lawsuit-against-wbd-dc-comics-dismissed%2F\u0026amp;title=Superman%3A+Shuster+Estate%27s+Lawsuit+Against+WBD%2C+DC+Comics+Dismissed\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003c/center\u003e\u003c/div\u003e\n    \u003ca id=\"google_follow\" href=\"https://news.google.com/publications/CAAqBwgKMPHflgsw1IauAw?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n        \u003cp\u003e\u003cimg width=\"100\" height=\"81\u0026#34;\" src=\"https://bleedingcool.com/Google_News_icon.png\"/\u003e\n        \u003c/p\u003e\n        \u003cp\u003e\n            Stay up-to-date and support the site by following Bleeding Cool on Google News today!\n        \u003c/p\u003e\n    \u003c/a\u003e\u003c/article\u003e\u003csection\u003e\u003ch2\u003e\u003cimg data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:150/h:150/q:75/https://www.gravatar.com/avatar/a3529c51bc537c86cabf26ebb7f93e82?s=150\" src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20150%20150%22%20width%3D%22150%22%20height%3D%22150%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\" width=\"150px\" height=\"150px\" alt=\"Ray Flook\"/\u003eAbout \u003ca href=\"https://bleedingcool.com/author/rflook/\"\u003eRay Flook\u003c/a\u003e\u003c/h2\u003eServing as Television Editor since 2018, Ray began five years earlier as a contributing writer/photographer before being brought onto the core BC team in 2017.\u003c/section\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-25T14:07:07-05:00",
  "modifiedTime": "2025-04-25T14:07:07-05:00"
}
