{
  "id": "5f8f0872-3e32-46f6-9089-781adee8e819",
  "title": "Steven Soderbergh Says It’s “Frustrating” When Mid-Budget Films Like ‘Black Bag’ Underperform At Box Office: “Not A Good Thing For Movies”",
  "link": "https://deadline.com/2025/04/steven-soderbergh-black-bag-mid-budget-movies-frustrating-1236372474/",
  "description": "Academy Award-winning Steven Soderbergh recently reflected on his latest project, the buzzy and well-reviewed espionage thriller Black Bag, lamenting the dissonance between its critical success versus its lackluster draw at the box office. The prolific filmmaker sat down with The Independent to discuss his disappointment and disillusionment with the waning attendance at theaters, seeing it […]",
  "author": "Natalie Oganesyan",
  "published": "Sat, 19 Apr 2025 23:01:51 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "News",
    "Black Bag",
    "Steven Soderbergh"
  ],
  "byline": "Natalie Oganesyan",
  "length": 2323,
  "excerpt": "Steven Soderbergh recently reflected on 'Black Bag,' lamenting the dissonance between its critical success vs. its lackluster draw at the box office.",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "Academy Award-winning Steven Soderbergh recently reflected on his latest project, the buzzy and well-reviewed espionage thriller Black Bag, lamenting the dissonance between its critical success versus its lackluster draw at the box office. The prolific filmmaker sat down with The Independent to discuss his disappointment and disillusionment with the waning attendance at theaters, seeing it as a negative harbinger for the entertainment industry. “This is the kind of film I made my career on,” he began. “And if a mid-level budget, star-driven movie can’t seem to get people over the age of 25 years old to come out to theaters — if that’s truly a dead zone — then that’s not a good thing for movies. What’s gonna happen to the person behind me who wants to make this kind of film?” Watch on Deadline Starring Cate Blanchett and Michael Fassbender as two married intelligence agents who must reckon with both interpersonal and international stakes, the Focus Features two-hander will seemingly just break even at the box office. “I know for a fact, having talked to somebody who works at another studio, that the Monday after Black Bag opened, the conversation in the morning meeting was: ‘What does this mean when you can’t get a movie like this to perform?’ And that’s frustrating,” the Kimi helmer explained. While he added that Black Bag, as he’s been told by Focus, “will be fine and will turn a profit,” the director maintained that “the bottom line is that we need to figure out a way to cultivate this audience for movies that are in this mid-range, that aren’t fantasy spectacles or low-budget horror movies. They’re movies for grown-ups, and those can’t just go away.” The filmmaker went as far to say that some of his best-known pics would likely not exist in the current moviemaking climate: “Erin Brockovich wouldn’t get made today; Traffic wouldn’t get made. Unless you get Timothée Chalamet who, god bless him, seems to be interested in doing different kinds of movies. But that window is getting smaller and smaller for filmmakers to climb through.” In addition to Black Bag and Presence, both released earlier this year, Soderbergh will soon debut The Christophers, a black comedy he’s currently editing starring Ian McKellen and Michaela Coel.",
  "image": "https://deadline.com/wp-content/uploads/2025/04/steven.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tAcademy Award-winning \u003ca href=\"https://deadline.com/tag/steven-soderbergh/\" id=\"auto-tag_steven-soderbergh\" data-tag=\"steven-soderbergh\"\u003eSteven Soderbergh\u003c/a\u003e recently reflected on his latest project, the buzzy and well-reviewed espionage thriller \u003cem\u003e\u003ca href=\"https://deadline.com/tag/black-bag/\" id=\"auto-tag_black-bag\" data-tag=\"black-bag\"\u003eBlack Bag\u003c/a\u003e\u003c/em\u003e, lamenting the dissonance between its critical success versus its lackluster draw at the box office.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe prolific filmmaker sat down with \u003ca rel=\"nofollow\" href=\"https://www.the-independent.com/arts-entertainment/films/features/steven-soderbergh-black-bag-interview-b2732930.html\" target=\"_blank\"\u003eThe Independent\u003c/a\u003e to discuss his disappointment and disillusionment with the waning attendance at theaters, seeing it as a negative harbinger for the entertainment industry.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“This is the kind of film I made my career on,” he began. “And if a mid-level budget, star-driven movie can’t seem to get people over the age of 25 years old to come out to theaters — if that’s truly a dead zone — then that’s not a good thing for movies. What’s gonna happen to the person behind me who wants to make this kind of film?” \n\n\t\u003c/p\u003e\n\n\u003cdiv data-pmc-adm-ad-id=\"1234771711\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\n\u003cp\u003e\n\tStarring Cate Blanchett and Michael Fassbender as two married intelligence agents who must reckon with both interpersonal and international stakes, the Focus Features two-hander will seemingly just \u003ca href=\"https://deadline.com/2025/03/box-office-novocaine-1236326472/\"\u003ebreak even at the box office\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“I know for a fact, having talked to somebody who works at another studio, that the Monday after \u003cem\u003eBlack Bag\u003c/em\u003e opened, the conversation in the morning meeting was: ‘What does this mean when you can’t get a movie like this to perform?’ And that’s frustrating,” the \u003cem\u003eKimi \u003c/em\u003ehelmer explained.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWhile he added that \u003cem\u003eBlack Bag\u003c/em\u003e, as he’s been told by Focus, “will be fine and will turn a profit,” the director maintained that “the bottom line is that we need to figure out a way to cultivate this audience for movies that are in this mid-range, that aren’t fantasy spectacles or low-budget horror movies. They’re movies for grown-ups, and those can’t just go away.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe filmmaker went as far to say that some of his best-known pics would likely not exist in the current moviemaking climate: “\u003cem\u003eErin Brockovich\u003c/em\u003e wouldn’t get made today; \u003cem\u003eTraffic\u003c/em\u003e wouldn’t get made. Unless you get Timothée Chalamet who, god bless him, seems to be interested in doing different kinds of movies. But that window is getting smaller and smaller for filmmakers to climb through.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn addition to \u003cem\u003eBlack Bag\u003c/em\u003e and \u003cem\u003ePresence\u003c/em\u003e, both released earlier this year, Soderbergh will soon debut \u003ca href=\"https://deadline.com/2024/12/steven-soderbergh-casts-the-christophers-michaela-coel-james-corden-1236199786/\"\u003e\u003cem\u003eThe Christophers\u003c/em\u003e, a black comedy\u003c/a\u003e he’s currently editing starring Ian McKellen and Michaela Coel.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-19T23:01:51Z",
  "modifiedTime": "2025-04-19T23:01:52Z"
}
