{
  "id": "5fd280c7-a824-47a4-a013-5f9a4afc3da4",
  "title": "The Columbo Episode You Likely Didn't Know Was Directed By Steven Spielberg",
  "link": "https://www.slashfilm.com/1785832/steven-spielberg-directed-columbo-episode/",
  "description": "Before he directed hits like Jaws and E.T., Steven Spielberg cut his teeth directing the first regular episode of Columbo.",
  "author": "Josh Spiegel",
  "published": "Mon, 10 Mar 2025 22:45:39 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Drama Shows"
  ],
  "byline": "Josh Spiegel",
  "length": 8740,
  "excerpt": "Before he directed hits like Jaws and E.T., Steven Spielberg cut his teeth directing the first regular episode of Columbo.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slash-film-favicon-448x448.png",
  "text": "Universal Studios Everyone has to start somewhere when they're breaking into Hollywood. These days, \"starting somewhere\" can mean making videos on YouTube, or serving as a production assistant on a reality TV show, or anything else. The divide between television and film is now so blurred that to work in one medium is not seen as a black mark on a person's career when they want to move to a different medium. But there was a time when those who wanted to make movies would be strongly encouraged to steer clear of TV, because those who worked primarily on the small screen would have an awfully hard time making the jump to the big screen.  But there are always exceptions to these rules, even before the idea of new media came along to shake up the notion of transitioning from TV to film. The biggest possible exception to any such rule is Steven Spielberg. He's as much of a household name as any movie star, yet we know there was a time when he was still just an up-and-comer. Like most hustling young directors, Spielberg didn't get his first big break via his first major film success. Before the mammoth hit \"Jaws,\" there was the 1974 crime drama \"The Sugarland Express.\" But before that smaller film, Spielberg was directing for the small screen. His well-liked and tense thriller \"Duel\" from 1971 was a TV-movie before it was gussied up for a theatrical release. Yet for anyone who rediscovered the crime drama \"Columbo\" during the COVID-19 pandemic, or who finds oddly cozy shows like this so comforting as to send you to sleep after some insomnia, you might be stunned to see that one of the series' earliest and most important episodes was directed by ... yes, really, Steven Spielberg. Oh, and the episode is amazing. Spielberg directed the first episode of Columbo, 'Murder by the Book' The basic idea of \"Columbo\" is deceptively simple: there has been a murder and the dogged and friendly Lt. Columbo of the Los Angeles Police Department is on the case, always solving the case right at the end of the episode. The twist is how almost every episode unfolds, because the audience finds out who the killer is before Columbo has even shown up. Most episodes of \"Columbo\" are about 75 minutes long, and the first 15 or so of those minutes are dedicated to us learning the situation and understanding why someone would commit murder before they do the dirty deed. In essence, the suspense of each episode is in wondering how Columbo will capture his quarry, which is why the show belongs not to the \"whodunit\" sub-genre of mysteries but the 'howcatchem\" instead.  Another quirk of the history of \"Columbo\" is that the first two episodes are considered separate one-off TV-movies, basically two separate pilot episodes, one of which aired in 1968 and the other aired in the spring of 1971. But when Steven Spielberg stepped behind the camera at the grand old age of 24, he was directing what would serve as the first regular episode of \"Columbo,\" entitled \"Murder By the Book.\" Though the show was created by Richard Levinson and William Link, \"Murder by the Book\" was written by Steven Bochco. If that name rings a bell, it should; Bochco would go on to write for or create shows like \"L.A. Law,\" \"NYPD Blue\" and \"Hill Street Blues.\" So, in essence, \"Murder by the Book\" was capturing lightning in a bottle without even realizing it. While no one would say (without being a loud contrarian) that \"Murder by the Book\" goes down as the greatest thing either of these Stevens made, it's very easy to watch the episode and see the seeds of greatness, especially in Spielberg's directing. The plot of \"Murder by the Book\" revolves around a pair of authors, Ken Franklin and Jim Ferris (portrayed by Jack Cassidy and Martin Milner, respectively). They've been successfully co-writing a series of Miss Marple-esque detective novels for years, but Jim is ready to work on his own projects without Ken. Ken is dismayed by this primarily because he's enjoyed a certain kind of lifestyle afforded by the success of the books ... which he really hasn't written much of for a very long time. So, to walk away with a handsome insurance policy, he lures Jim out to a quiet cabin of his where he kills his partner and tries to frame it on some unseen gangsters, implying that Jim was doing research for a book that the criminals wanted unpublished. Of course, things like this aren't easy. Ken soon has to kill a local store owner who a) has a big crush on him and b) realizes that Ken killed his co-writer and wants to blackmail him for the privilege of being his lover. The basic elements of almost every episode of \"Columbo\" is present in \"Murder by the Book,\" and the way it's presented visually feels both Spielbergian and an effective template for how the show would look in future episodes and seasons. One of the critical but often unsung aspects of \"Columbo\" is that pretty much every episode serves as a commentary on class in the 1970s. Columbo himself, played so masterfully by Peter Falk, is the living embodiment of the word \"rumpled,\" with a raincoat that looks as if it's been run over a few times, a ruffled haircut, and a seeming inability to remember what he placed in which pocket of his. (Falk's amazing performance is all the more remarkable when you realize he wasn't even the first choice to play the character.) Conversely, his suspects are among the toniest members of Los Angeles society. Here, it's an upscale author, but future episodes would feature Columbo facing off against an NFL-style general manager, a world-renowned orchestral conductor (played by Falk's longtime friend John Cassavetes), and the deputy chief of police, among others. Along with that, the look and feel of the episodes, the building tension between suspect and captor, and the epic, grand scale of how Columbo is presented against the backdrop of Los Angeles, all stems from how Spielberg so confidently utilizes these pieces in this first episode. The long-term success of Columbo can be traced back to Spielberg Universal Studios \"Columbo\" didn't just luck into having one of the greatest directors of all time helm an early episode. The combination of talent both in front of and behind the camera on \"Columbo\" is pretty impressive more than fifty years after the fact. Some of the show's other guests (and this is limited to when the show aired on NBC in the 1970s) include Dick Van Dyke, Vera Miles, Martin Landau, Leonard Nimoy, William Shatner, Johnny Cash, and Janet Leigh. Among the other directors, you'll find Ben Gazzara, Falk himself, Nicholas Colasanto (best known as Coach on \"Cheers\"), and a young Jonathan Demme. And that combination of talent all rolls back up to \"Murder by the Book.\" Yes, it's true that \"Columbo\" had pulled off two very impressive pilot-esque TV movies before it became a regular fixture in American households. But this first regular episode, as the show aired as one of a few NBC Mystery Movies that would rotate through the fall and spring, proved that the show had legs. And it's not as if the folks working on \"Columbo\" didn't realize what they had on their hands with Spielberg behind the camera. It's worth noting that Bochco would write a handful more episodes of the show in its first few seasons, but Spielberg did not direct another installment. Perhaps, though, it's no coincidence that one of the other episodes Bochco is credited with is \"Mind Over Mayhem.\" It's arguably not one of the show's finest episodes, as it involves Columbo investigating a murder involving scientists and a talking robot (yes, really). But in one crucial moment, Columbo has to ask some questions of a purported boy genius named \"Steve Spelberg.\" This episode aired before \"Jaws\" was even in production, so it may well have been more of a playful tease than anything else. In hindsight, though, depicting a wunderkind a la Spielberg feels like an extremely fitting tribute to the man who helped make Lt. Columbo an icon.",
  "image": "https://www.slashfilm.com/img/gallery/the-columbo-episode-you-likely-didnt-know-was-directed-by-steven-spielberg/l-intro-1739236597.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n    \n                \u003cdiv\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1785832/steven-spielberg-directed-columbo-episode/\" data-post-title=\"The Columbo Episode You Likely Didn\u0026#39;t Know Was Directed By Steven Spielberg\" data-slide-num=\"0\" data-post-id=\"1785832\"\u003e\n                                             \u003cpicture id=\"pe8040665f898d4ee32a049c4ee92e903\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-columbo-episode-you-likely-didnt-know-was-directed-by-steven-spielberg/intro-1739236597.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-columbo-episode-you-likely-didnt-know-was-directed-by-steven-spielberg/intro-1739236597.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/the-columbo-episode-you-likely-didnt-know-was-directed-by-steven-spielberg/intro-1739236597.jpg\" data-slide-url=\"https://www.slashfilm.com/1785832/steven-spielberg-directed-columbo-episode/\" data-post-id=\"1785832\" data-slide-num=\"0\" data-slide-title=\"The Columbo Episode You Likely Didn\u0026#39;t Know Was Directed By Steven Spielberg: \" width=\"780\" height=\"438\" alt=\"Artistic poster for Columbo: Murder by the Book, featuring Lt. Columbo (Peter Falk) holding a pile of books\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eUniversal Studios\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eEveryone has to start somewhere when they\u0026#39;re breaking into Hollywood. These days, \u0026#34;starting somewhere\u0026#34; can mean making videos on YouTube, or serving as a production assistant on a reality TV show, or anything else. The divide between television and film is now so blurred that to work in one medium is not seen as a black mark on a person\u0026#39;s career when they want to move to a different medium. But there was a time when those who wanted to make movies would be strongly encouraged to steer clear of TV, because those who worked primarily on the small screen would have an awfully hard time making the jump to the big screen. \u003c/p\u003e\n\n\u003cp\u003eBut there are always exceptions to these rules, even before the idea of new media came along to shake up the notion of transitioning from TV to film. The biggest possible exception to any such rule is Steven Spielberg. He\u0026#39;s as much of a household name as any movie star, yet we know there was a time when he was still just an up-and-comer.\u003c/p\u003e\n\u003cp\u003eLike most hustling young directors, Spielberg didn\u0026#39;t get his first big break via his first major film success. Before the mammoth hit \u0026#34;Jaws,\u0026#34; there was the 1974 crime drama \u0026#34;The Sugarland Express.\u0026#34; But before that smaller film, Spielberg was directing for the small screen. His well-liked and tense thriller \u0026#34;Duel\u0026#34; from 1971 was a TV-movie before it was gussied up for a theatrical release. Yet for anyone who \u003ca href=\"https://www.slashfilm.com/1670039/columbo-best-episodes-ranked/\" target=\"_blank\"\u003erediscovered the crime drama \u0026#34;Columbo\u0026#34;\u003c/a\u003e during the COVID-19 pandemic, or who finds \u003ca href=\"https://www.slashfilm.com/1220360/how-poker-face-and-cozy-murder-mysteries-helped-me-beat-insomnia/\" target=\"_blank\"\u003eoddly cozy shows\u003c/a\u003e like this so comforting as to send you to sleep after some insomnia, you might be stunned to see that one of the series\u0026#39; earliest and most important episodes was directed by ... yes, really, Steven Spielberg. Oh, and the episode is \u003cem\u003eamazing\u003c/em\u003e.\u003c/p\u003e\n\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eSpielberg directed the first episode of Columbo, \u0026#39;Murder by the Book\u0026#39;\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1785832/steven-spielberg-directed-columbo-episode/\" data-post-title=\"The Columbo Episode You Likely Didn\u0026#39;t Know Was Directed By Steven Spielberg\" data-slide-num=\"1\" data-post-id=\"1785832\"\u003e\n                                             \u003cpicture id=\"p62b2468a5f918261e833cb287e311267\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-columbo-episode-you-likely-didnt-know-was-directed-by-steven-spielberg/spielberg-directed-the-first-episode-of-columbo-murder-by-the-book-1739236598.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-columbo-episode-you-likely-didnt-know-was-directed-by-steven-spielberg/spielberg-directed-the-first-episode-of-columbo-murder-by-the-book-1739236598.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/the-columbo-episode-you-likely-didnt-know-was-directed-by-steven-spielberg/spielberg-directed-the-first-episode-of-columbo-murder-by-the-book-1739236598.jpg\" data-slide-url=\"https://www.slashfilm.com/1785832/steven-spielberg-directed-columbo-episode/\" data-post-id=\"1785832\" data-slide-num=\"1\" data-slide-title=\"The Columbo Episode You Likely Didn\u0026#39;t Know Was Directed By Steven Spielberg: Spielberg directed the first episode of Columbo, \u0026#39;Murder by the Book\u0026#39;\" width=\"780\" height=\"438\" alt=\"Peter Falk (as Lt. Columbo) holds a large pile of books from an author played by Jack Cassidy\"/\u003e\n                    \u003c/picture\u003e\n                    \n                    \u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eThe basic idea of \u0026#34;Columbo\u0026#34; is deceptively simple: there has been a murder and the dogged and friendly Lt. Columbo of the Los Angeles Police Department is on the case, always solving the case right at the end of the episode. The twist is how almost every episode unfolds, because the audience finds out who the killer is before Columbo has even shown up. Most episodes of \u0026#34;Columbo\u0026#34; are about 75 minutes long, and the first 15 or so of those minutes are dedicated to us learning the situation and understanding why someone would commit murder before they do the dirty deed. In essence, the suspense of each episode is in wondering how Columbo will capture his quarry, which is why the show belongs not to the \u0026#34;whodunit\u0026#34; sub-genre of mysteries but the \u0026#39;howcatchem\u0026#34; instead. \u003c/p\u003e\n\n\u003cp\u003eAnother quirk of the history of \u0026#34;Columbo\u0026#34; is that the first two episodes are considered separate one-off TV-movies, basically two separate pilot episodes, one of which aired in 1968 and the other aired in the spring of 1971. But when Steven Spielberg stepped behind the camera at the grand old age of 24, he was directing what would serve as the first regular episode of \u0026#34;Columbo,\u0026#34; entitled \u0026#34;Murder By the Book.\u0026#34; Though the show was created by Richard Levinson and William Link, \u0026#34;Murder by the Book\u0026#34; was written by Steven Bochco. If that name rings a bell, it should; Bochco would go on to write for or create shows like \u0026#34;L.A. Law,\u0026#34; \u0026#34;NYPD Blue\u0026#34; and \u0026#34;Hill Street Blues.\u0026#34; So, in essence, \u0026#34;Murder by the Book\u0026#34; was capturing lightning in a bottle without even realizing it. While no one would say (without being a loud contrarian) that \u0026#34;Murder by the Book\u0026#34; goes down as the greatest thing either of these Stevens made, it\u0026#39;s very easy to watch the episode and see the seeds of greatness, especially in Spielberg\u0026#39;s directing.\u003c/p\u003e\n\n\u003cp\u003eThe plot of \u0026#34;Murder by the Book\u0026#34; revolves around a pair of authors, Ken Franklin and Jim Ferris (portrayed by Jack Cassidy and Martin Milner, respectively). They\u0026#39;ve been successfully co-writing a series of Miss Marple-esque detective novels for years, but Jim is ready to work on his own projects without Ken. Ken is dismayed by this primarily because he\u0026#39;s enjoyed a certain kind of lifestyle afforded by the success of the books ... which he really hasn\u0026#39;t written much of for a very long time. So, to walk away with a handsome insurance policy, he lures Jim out to a quiet cabin of his where he kills his partner and tries to frame it on some unseen gangsters, implying that Jim was doing research for a book that the criminals wanted unpublished. Of course, things like this aren\u0026#39;t easy. Ken soon has to kill a local store owner who a) has a big crush on him and b) realizes that Ken killed his co-writer and wants to blackmail him for the privilege of being his lover.\u003c/p\u003e\n\u003cp\u003eThe basic elements of almost every episode of \u0026#34;Columbo\u0026#34; is present in \u0026#34;Murder by the Book,\u0026#34; and the way it\u0026#39;s presented visually feels both Spielbergian and an effective template for how the show would look in future episodes and seasons. One of the critical but often unsung aspects of \u0026#34;Columbo\u0026#34; is that pretty much every episode serves as a commentary on class in the 1970s. Columbo himself, played so masterfully by Peter Falk, is the living embodiment of the word \u0026#34;rumpled,\u0026#34; with a raincoat that looks as if it\u0026#39;s been run over a few times, a ruffled haircut, and a seeming inability to remember what he placed in which pocket of his. (Falk\u0026#39;s amazing performance is all the more remarkable when you realize \u003ca href=\"https://www.slashfilm.com/1661792/peter-falk-wasnt-first-choice-lieutenant-columbo/\" target=\"_blank\"\u003ehe wasn\u0026#39;t even the first choice\u003c/a\u003e to play the character.) Conversely, his suspects are among the toniest members of Los Angeles society. Here, it\u0026#39;s an upscale author, but future episodes would feature Columbo facing off against an NFL-style general manager, a world-renowned orchestral conductor (played by Falk\u0026#39;s longtime friend John Cassavetes), and the deputy chief of police, among others. Along with that, the look and feel of the episodes, the building tension between suspect and captor, and the epic, grand scale of how Columbo is presented against the backdrop of Los Angeles, all stems from how Spielberg so confidently utilizes these pieces in this first episode.\u003c/p\u003e\n\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eThe long-term success of Columbo can be traced back to Spielberg\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1785832/steven-spielberg-directed-columbo-episode/\" data-post-title=\"The Columbo Episode You Likely Didn\u0026#39;t Know Was Directed By Steven Spielberg\" data-slide-num=\"2\" data-post-id=\"1785832\"\u003e\n                                             \u003cpicture id=\"p8fcd35348ec40071994f6aeeb3139b9e\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-columbo-episode-you-likely-didnt-know-was-directed-by-steven-spielberg/the-long-term-success-of-columbo-can-be-traced-back-to-spielberg-1739236599.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-columbo-episode-you-likely-didnt-know-was-directed-by-steven-spielberg/the-long-term-success-of-columbo-can-be-traced-back-to-spielberg-1739236599.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/the-columbo-episode-you-likely-didnt-know-was-directed-by-steven-spielberg/the-long-term-success-of-columbo-can-be-traced-back-to-spielberg-1739236599.jpg\" data-slide-url=\"https://www.slashfilm.com/1785832/steven-spielberg-directed-columbo-episode/\" data-post-id=\"1785832\" data-slide-num=\"2\" data-slide-title=\"The Columbo Episode You Likely Didn\u0026#39;t Know Was Directed By Steven Spielberg: The long-term success of Columbo can be traced back to Spielberg\" width=\"780\" height=\"438\" alt=\"Jack Cassidy smiling and sitting in a chair, as Peter Falk gives him a deadpan look\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eUniversal Studios\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003e\u0026#34;Columbo\u0026#34; didn\u0026#39;t just luck into having one of the greatest directors of all time helm an early episode. The combination of talent both in front of and behind the camera on \u0026#34;Columbo\u0026#34; is pretty impressive more than fifty years after the fact. Some of the show\u0026#39;s other guests (and this is limited to when the show aired on NBC in the 1970s) include Dick Van Dyke, Vera Miles, Martin Landau, Leonard Nimoy, William Shatner, Johnny Cash, and Janet Leigh. Among the other directors, you\u0026#39;ll find Ben Gazzara, Falk himself, Nicholas Colasanto (best known as Coach on \u0026#34;Cheers\u0026#34;), and a young Jonathan Demme. And that combination of talent all rolls back up to \u0026#34;Murder by the Book.\u0026#34; Yes, it\u0026#39;s true that \u0026#34;Columbo\u0026#34; had pulled off two very impressive pilot-esque TV movies before it became a regular fixture in American households. But this first regular episode, as the show aired as one of a few NBC Mystery Movies that would rotate through the fall and spring, proved that the show had legs.\u003c/p\u003e\n\n\u003cp\u003eAnd it\u0026#39;s not as if the folks working on \u0026#34;Columbo\u0026#34; didn\u0026#39;t realize what they had on their hands with Spielberg behind the camera. It\u0026#39;s worth noting that Bochco would write a handful more episodes of the show in its first few seasons, but Spielberg did not direct another installment. Perhaps, though, it\u0026#39;s no coincidence that one of the other episodes Bochco is credited with is \u0026#34;Mind Over Mayhem.\u0026#34; It\u0026#39;s arguably not one of the show\u0026#39;s finest episodes, as it involves Columbo investigating a murder involving scientists and a talking robot (yes, really). But in one crucial moment, Columbo has to ask some questions of a purported boy genius named \u0026#34;Steve Spelberg.\u0026#34; This episode aired before \u0026#34;Jaws\u0026#34; was even in production, so it may well have been more of a playful tease than anything else. In hindsight, though, depicting a wunderkind a la Spielberg feels like an extremely fitting tribute to the man who helped make Lt. Columbo an icon.\u003c/p\u003e\n\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-03-10T22:45:39Z",
  "modifiedTime": "2025-03-10T22:45:39Z"
}
