{
  "id": "60ffec1f-2dce-4955-8ae2-6d9c16d0cb4a",
  "title": "‘Mission: Impossible — The Final Reckoning’ Review: Hollywood’s Greatest Action Franchise Saves the Worst for Last",
  "link": "https://www.indiewire.com/criticism/movies/mission-impossible-the-final-reckoning-review-1235122988/",
  "description": "Tom Cruise is still in a league of his own as an action star, but the last movie in his signature franchise makes for a dull and disjointed anticlimax.",
  "author": "David Ehrlich",
  "published": "Wed, 14 May 2025 20:00:00 +0000",
  "source": "https://www.indiewire.com/feed",
  "categories": [
    "Criticism",
    "Movies",
    "Film",
    "Mission: Impossible — The Final Reckoning",
    "Reviews",
    "Tom Cruise"
  ],
  "byline": "David Ehrlich",
  "length": 12603,
  "excerpt": "Hollywood's greatest action franchise saves the worst for last.",
  "siteName": "IndieWire",
  "favicon": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=192",
  "text": "Whether or not “Mission: Impossible — The Final Reckoning” actually ends up being Tom Cruise’s last time racing to save the world as a renegade member of the IMF, there is no mistaking the fact that Christopher McQuarrie’s heartbreakingly flat and disjointed epic was intended as a last hurrah for America’s best action series.  That has almost nothing to do with how the movie ends, and just about everything to do with how it comports itself for the 160 minutes before that. Case in point: The festivities kick off with a bonafide supercut of Ethan Hunt’s greatest hits from the saga’s previous seven installments, neatly divided into subcategories like “love interest” and “villain.” And it would be a massive understatement to say that “The Final Reckoning” only leans harder into its everything has led to this ethos after that.  To a certain extent, that’s to be expected from the culmination of a franchise that’s grown more self-referential towards its own past at roughly the same rate as it’s become more freighted with the responsibility of fighting against Hollywood’s future. 2018’s miraculous “Fallout” supercharged its third act by looping back to a plot thread that seemed to have already been sewn up, while 2023’s madcap “Dead Reckoning” — a direct prequel to the ponderous new “Mission,” despite being tonally unrecognizable from it — dusted off a spiteful bureaucrat from the very first “Mission: Impossible” movie just to emphasize how much Ethan Hunt can’t trust his own government.  “The Final Reckoning” one-ups that trick with the kind of spectacularly goofy aplomb that will convince hardcore fans they’ve died and gone to heaven, but that’s the least of the movie’s efforts to make its bizarrely joyless story feel like the living manifestation of destiny. Everything that happens in “The Final Reckoning” is framed as a consequence of the choices that Ethan has made in the past, and while that approach results in two of the cleverest ret-cons in blockbuster history (both of which do a silly but satisfying job of tying the whole franchise together), it has the unfortunate side effect of forcing the film to haltingly dramatize — and thereby diminish — the same tensions that Tom Cruise has latently seeded into every stunt, sprint, and hard stare over the course of the previous seven movies.  The singular pleasure of the “Mission: Impossible” franchise — especially since its purpose was streamlined by “Mission: Impossible — III” — has always been rooted in Cruise’s supernatural ability to balance reality with disbelief, fatalism with free will, and the snuff-like daredevilry of the silent era with the larger-than-life spectacle of the blockbuster age. The struggle to reconcile those things is of paramount importance to a franchise about a man who adamantly refuses to compromise between them; Ethan Hunt is constantly risking millions of human lives in a desperate bid to save his loved ones, just as Tom Cruise is constantly risking his own life in a desperate bid to entertain millions of strangers. In other words, “The Final Reckoning” isn’t the first time those balancing acts have been suffused into the plot of these movies. But previous “Mission” adventures — especially the ones helmed by returning director Christopher McQuarrie, all of which moved with the confidence of a prophecy being fulfilled even though they were built on the fly and held together with sticky tack — understood that action is the best argument against predestination. That’s especially true of “Dead Reckoning,” which saw Cruise fight back against the brain rot of A.I. by driving a motorcycle off a cliff for our enjoyment; “There’s always a choice,” Ethan is fond of saying, and the man playing him tends to prove that by making choices that no one on Earth has ever made before.  That same A.I., better known by its stage name “The Entity,” is back with a vengeance in “The Final Reckoning,” and it’s determined to goad humanity towards nuclear annihilation. But this time, Cruise and McQuarrie choose to illustrate the crisis of algorithmic thinking across a ploddingly scripted boardroom drama that cleaves a lot closer to the Cold War brinksmanship of “13 Days” than it does to the Buster Keaton-esque brilliance of their previous “Missions.”  The change of pace feels deliberate, but why ditch the franchise’s signature elegance in favor of the same kind of blockbuster tedium that “Mission: Impossible” has always defined itself against? The choice — and there’s always a choice — might stem from a strained production that was nearly torpedoed by strikes, but it’s also possible that McQuarrie and co-writer Erik Jendresen were handcuffed by the apocalyptic stakes the Entity demanded of them. Maybe they wanted to background Ethan Hunt in order to seed his ethos to the future his franchise is leaving behind, or maybe McQuarrie and Cruise just saw this story as the next step in their war against technological enshittification. If Tom Cruise can get people back to the movies, who’s to say he can’t get them to stop relying on ChatGPT?  Whatever the case, I can’t overstate how frustrating and redundant it feels to watch some random people we don’t care about — namely, President Angela Bassett and her beefy cabinet of flop-sweating character actors — equivocate over (and over) the lesser of two evils at the tail end of a franchise whose hero continues to disproves that logic with every mind-boggling setpiece. And the setpieces are still mind-boggling, even if this movie desperately needed more of them. The climactic biplane chase is somewhat diminished by the sheer worthlessness of the film’s villain (a new low in a franchise that has frequently struggled on that front), but the wordless 10-minute sequence where Cruise is tossed around the hull of a sunken nuclear submarine as it rolls towards the edge of a cliff reaches levels of “how the hell did they do that?” that have previously been reserved for certain Renaissance sculptures and early Björk albums.  “Mission: Impossible — The Final Reckoning” Alas, that’s all there is to see on that front — the longest “Mission: Impossible” movie ever has, by far, the least action to offer in return. That wouldn’t seem like such a raw deal if not for the fact that “The Final Reckoning” doesn’t feel much like a “Mission” at all whenever Ethan isn’t fighting for his life, which is mighty ironic in light of the film’s self-referential streak.  All of your favorite characters are back, of course (minus the late, great Ilsa Faust, the most favorite of them all), but they’re forced to scramble into different factions after the Entity spurns Gabriel (Esai Morales), the mysterious killer who was harnessing its power. No spoilers, but it turns out that the Entity is kind of a dick. I mean, in the last movie I thought it might’ve just been misunderstood (it threw itself a lavish Venetian gala because it wanted its enemies to look chic as hell when they stabbed each other, and I respect that), but this time around the rogue A.I. is less “Eyes Wide Shut” and more “Dr. Strangelove.”  Its plan is to infect the nuclear systems of the world’s nine most powerful countries and then coerce them towards mutually assured destruction so that it can play God over the ruins, and Ethan’s team only has four days to stop it, which would be a lot easier if the CIA, Clandestine Services, and the Russian Army weren’t all trying to get in their way. And if that weren’t enough, the Entity has also leveraged social media disinformation to create its very own doomsday cult, which might be the movie’s first clue that things are about to get a whole lot heavier than usual. And they do get heavy — heavy in a way that feels totally alien to a franchise that has always been light on its feet, even at times of loss and/or lingering sorrow. These films have done a terrific job of selling Ethan’s personal sacrifice whenever one of his precious brunettes has been in harm’s way, but even their most emotional moments have been softened with a little face-switching magic. There’s a cheeky mask reveal towards the start of “The Final Reckoning,” but it plays like a brief moment of fan service at the beginning of a movie that has a very uncertain relationship with fun.  Things get dark in a hurry, and the lack of setpieces makes it easy to lose sight of Ethan’s friends in a franchise that has always expressed character through action. Luther (Ving Rhames) is sullen where he used to be sly, Benji (Simon Pegg) is shrill where he used to be frazzled, and Grace (Hayley Atwell) is a superhuman thief where she used to just be a skilled pickpocket; her powers are exaggerated to the point that it can feel like McQuarrie has forgotten what’s great about his own “Missions,” which derive so much of their power from restoring our faith in the reality of what we’re seeing.  “Mission: Impossible — The Final Reckoning” But that suspension of disbelief is much wobblier this time, especially in the scenes without any spectacle to distract us. For all of its focus on tying its franchise together, “The Final Reckoning” — irrevocably knocked off its axis by the act one decision to separate Ethan from the rest of his team — struggles to strike the right balance between context and conflict. It’s no secret that Rolf Saxon’s William Donloe — who Ethan goofed real good in the first “Mission: Impossible” — is back for more, and McQuarrie makes fantastic use of the character as a moral backstop for all of Ethan’s best intentions. But Donloe’s wife (the charming Lucy Tulugarjuk) epitomizes this herky-jerky film’s overreliance on new faces, all of whom would have been a lot more enjoyable if they didn’t take so much time away from the impossible mission part of this “Mission: Impossible” movie.  Likewise, the decision to have Donloe and his civilian wife factor into the distressingly generic third act mishegoss would’ve been cute in a “Fast \u0026 Furious” sequel, but it’s far beneath what fans have come to expect from a franchise of this caliber. Hannah Waddingham, Nick Offerman, and Holt McCallany are in much the same boat, in that their delightful performances didn’t stop me from wanting to shoo them off screen. Only “Severance” star Tramell Tillman, outrageously good as a proud submarine captain who takes on a new passenger, manages to add value to the movie as a whole.  It’s strange enough that a franchise-capper so determined to bring everything full circle would spend so much time introducing us to people we’ve never met before, and stranger still that it would spend so little time — exactly zero seconds, to be precise — fleshing out Ethan’s relationship with Gabriel, the man who was supposedly instrumental to his decision to join the IMF. Gabriel’s one-dimensional villainy was easy to excuse in “Dead Reckoning,” as the flashbacks in that film suggested that the next movie, then slated to be “Dead Reckoning: Part II” — would fill in the gaps. No such luck. Instead, “The Final Reckoning” sees Gabriel wilt into a maniacal cartoon, thereby wasting the film’s best target for all of the pathos it’s worked so hard to accrue.  Of course, Ethan has more in common with the Entity than he ever could with a flesh-and-blood antagonist like Gabriel. As I noted in my review of “Dead Reckoning,” the “Mission: Impossible” series has forged a cohesive identity through its obsession with balancing the human element against bottom-line calculations, and so “The Final Reckoning” naturally pits a man who refuses to compromise against a code that seeks to eliminate free will altogether. They are worthy adversaries, and this saga could only come to an end — whether or not that is what this film ultimately represents — once audiences got to see who triumphs in the ultimate battle between a rock and a hard place.  “We make our own destiny,” someone intones during the film’s closing voiceover, and by the end of Ethan Hunt’s story, it’s hard not to take those words to heart. I only wish that Cruise and McQuarrie had managed to make a better one. Grade: C Paramount Pictures will release “Mission: Impossible — The Final Reckoning” in theaters on Friday, May 23. Want to stay up to date on IndieWire’s film reviews and critical thoughts? Subscribe here to our newly launched newsletter, In Review by David Ehrlich, in which our Chief Film Critic and Head Reviews Editor rounds up the best new reviews and streaming picks along with some exclusive musings — all only available to subscribers.",
  "image": "https://www.indiewire.com/wp-content/uploads/2025/05/Tom-Cruise-dans-Mission-Impossible-The-Final-Reckoning-2030621.jpg?w=650",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-alias=\"gutenberg-content__content\"\u003e\u003cp\u003eWhether or not “\u003ca href=\"https://www.indiewire.com/news/general-news/tom-cruise-actor-advice-technical-elements-filmmaking-1235122768/\" data-type=\"link\" data-id=\"https://www.indiewire.com/news/general-news/tom-cruise-actor-advice-technical-elements-filmmaking-1235122768/\"\u003eMission: Impossible — The Final Reckoning\u003c/a\u003e” \u003cem\u003eactually\u003c/em\u003e ends up being \u003ca href=\"https://www.indiewire.com/t/tom-cruise/\" id=\"auto-tag_tom-cruise\" data-tag=\"tom-cruise\"\u003eTom Cruise\u003c/a\u003e’s last time racing to save the world as a renegade member of the IMF, there is no mistaking the fact that Christopher McQuarrie’s heartbreakingly flat and disjointed epic was intended as a last hurrah for America’s best action series. \u003c/p\u003e\n\n\n\n\u003cp\u003eThat has almost nothing to do with how the movie ends, and just about everything to do with how it comports itself for the 160 minutes before that. Case in point: The festivities kick off with a bonafide supercut of Ethan Hunt’s greatest hits from the saga’s previous seven installments, neatly divided into subcategories like “love interest” and “villain.” And it would be a massive understatement to say that “The Final Reckoning” only leans harder into its \u003cem\u003eeverything has led to this \u003c/em\u003eethos after that. \n\n\u003c/p\u003e\u003cdiv data-alias=\"cards__inner\" data-component=\"cards-related-content\" data-collapse-to-xs=\"false\" data-layout=\"inline\" data-size=\"md\" data-spacing=\"s-3\" data-cards-spacing=\"s0\"\u003e \u003cdiv data-alias=\"card__inner\" data-post-id=\"1235123242\" data-component=\"card\" data-has-background=\"false\" data-has-overlay=\"false\" data-layout-size=\"xs\" data-layout=\"sidebar\" data-main-alignment=\"s0\" data-main-spacing=\"s0\" data-media-position=\"\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"sixteenByNine\" data-round=\"false\"\u003e\u003ca href=\"https://www.indiewire.com/news/breaking-news/denzel-washington-robert-pattinson-daisy-edgar-jones-film-1235123242/\" title=\"\" target=\"_self\" rel=\"\" data-card-index=\"0\" data-post-id=\"1235123242\"\u003e\u003cp\u003e\u003cimg src=\"https://www.indiewire.com/wp-content/uploads/2025/05/Screen-Shot-2025-05-14-at-11.24.52-AM.png?w=300\u0026amp;h=168\u0026amp;crop=1\" alt=\"Denzel Washington, Robert Pattinson, Daisy Edgar-Jones\" height=\"168\" width=\"300\" srcset=\"https://www.indiewire.com/wp-content/uploads/2025/05/Screen-Shot-2025-05-14-at-11.24.52-AM.png?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=600%2C337 600w, https://www.indiewire.com/wp-content/uploads/2025/05/Screen-Shot-2025-05-14-at-11.24.52-AM.png?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=125%2C70 125w, https://www.indiewire.com/wp-content/uploads/2025/05/Screen-Shot-2025-05-14-at-11.24.52-AM.png?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=660%2C370 660w, https://www.indiewire.com/wp-content/uploads/2025/05/Screen-Shot-2025-05-14-at-11.24.52-AM.png?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=50%2C28 50w, https://www.indiewire.com/wp-content/uploads/2025/05/Screen-Shot-2025-05-14-at-11.24.52-AM.png?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=300%2C168 300w, https://www.indiewire.com/wp-content/uploads/2025/05/Screen-Shot-2025-05-14-at-11.24.52-AM.png?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=1200%2C675 1200w\" sizes=\"auto, (max-width: 300px) 100vw, 300px\" loading=\"lazy\" decoding=\"async\" fetchpriority=\"auto\" data-attachment-id=\"1235123243\" data-wp-size=\"nova_size__sixteenbynine_small_cropped\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e  \u003cdiv data-alias=\"card__inner\" data-post-id=\"1235123204\" data-component=\"card\" data-has-background=\"false\" data-has-overlay=\"false\" data-layout-size=\"xs\" data-layout=\"sidebar\" data-main-alignment=\"s0\" data-main-spacing=\"s0\" data-media-position=\"\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"sixteenByNine\" data-round=\"false\"\u003e\u003ca href=\"https://www.indiewire.com/news/business/neon-first-look-deal-osgood-perkins-1235123204/\" title=\"\" target=\"_self\" rel=\"\" data-card-index=\"1\" data-post-id=\"1235123204\"\u003e\u003cp\u003e\u003cimg src=\"https://www.indiewire.com/wp-content/uploads/2025/05/GettyImages-2199520479.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\" alt=\"LOS ANGELES, CALIFORNIA - FEBRUARY 13: Writer/director Osgood Perkins at the Los Angeles Premiere of Neon\u0026#39;s \u0026#34;The Monkey\u0026#34; at Immanuel Presbyterian Church on February 13, 2025 in Los Angeles, California. (Photo by Stewart Cook/Neon via Getty Images)\" height=\"168\" width=\"300\" srcset=\"https://www.indiewire.com/wp-content/uploads/2025/05/GettyImages-2199520479.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=600%2C337 600w, https://www.indiewire.com/wp-content/uploads/2025/05/GettyImages-2199520479.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=125%2C70 125w, https://www.indiewire.com/wp-content/uploads/2025/05/GettyImages-2199520479.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=660%2C370 660w, https://www.indiewire.com/wp-content/uploads/2025/05/GettyImages-2199520479.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=50%2C28 50w, https://www.indiewire.com/wp-content/uploads/2025/05/GettyImages-2199520479.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=300%2C168 300w, https://www.indiewire.com/wp-content/uploads/2025/05/GettyImages-2199520479.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=1200%2C675 1200w\" sizes=\"auto, (max-width: 300px) 100vw, 300px\" loading=\"lazy\" decoding=\"async\" fetchpriority=\"auto\" data-attachment-id=\"1235123208\" data-wp-size=\"nova_size__sixteenbynine_small_cropped\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e \u003c/div\u003e\n\n\n\n\u003cp\u003eTo a certain extent, that’s to be expected from the culmination of a franchise that’s grown more self-referential towards its own past at roughly the same rate as it’s become more freighted with the responsibility of fighting against Hollywood’s future. 2018’s miraculous “Fallout” supercharged its third act by looping back to a plot thread that\u003cstrong\u003e \u003c/strong\u003eseemed to have already been sewn up, while 2023’s madcap “\u003ca href=\"https://www.indiewire.com/criticism/movies/mission-impossible-dead-reckoning-part-one-review-1234881243/\" data-type=\"link\" data-id=\"https://www.indiewire.com/criticism/movies/mission-impossible-dead-reckoning-part-one-review-1234881243/\"\u003eDead Reckoning\u003c/a\u003e” — a direct prequel to the ponderous new “Mission,” despite being tonally unrecognizable from it — dusted off a spiteful bureaucrat from the very first “Mission: Impossible” movie just to emphasize how much Ethan Hunt can’t trust his own government. \u003c/p\u003e\n\n\n\n\u003cp\u003e“The Final Reckoning” one-ups that trick with the kind of spectacularly goofy aplomb that will convince hardcore fans they’ve died and gone to heaven, but that’s the least of the movie’s efforts to make its bizarrely joyless story feel like the living manifestation of destiny. Everything that happens in “The Final Reckoning” is framed as a consequence of the choices that Ethan has made in the past, and while that approach results in two of the cleverest ret-cons in blockbuster history (both of which do a silly but satisfying job of tying the whole franchise together), it has the unfortunate side effect of forcing the \u003ca href=\"https://www.indiewire.com/t/film/\" id=\"auto-tag_film\" data-tag=\"film\"\u003efilm\u003c/a\u003e to haltingly dramatize — and thereby diminish — the same tensions that \u003ca href=\"https://www.indiewire.com/news/general-news/tom-cruise-nicole-kidman-eyes-wide-shut-1235122254/\" data-type=\"link\" data-id=\"https://www.indiewire.com/news/general-news/tom-cruise-nicole-kidman-eyes-wide-shut-1235122254/\"\u003eTom Cruise\u003c/a\u003e has latently seeded into every stunt, sprint, and hard stare over the course of the previous seven movies. \n\n\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Mission: Impossible – The Final Reckoning | Official Trailer (2025 Movie) - Tom Cruise\" width=\"650\" height=\"366\" src=\"https://www.youtube.com/embed/fsQgc9pCyDU?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThe singular pleasure of the “Mission: Impossible” franchise — especially since its purpose was streamlined by “Mission: Impossible — III” — has always been rooted in Cruise’s supernatural ability to balance reality with disbelief, fatalism with free will, and the snuff-like daredevilry of the silent era with the larger-than-life spectacle of the blockbuster age. The struggle to reconcile those things is of paramount importance to a franchise about a man who adamantly refuses to compromise between them; Ethan Hunt is constantly risking millions of human lives in a desperate bid to save his loved ones, just as Tom Cruise is constantly risking his own life in a desperate bid to entertain millions of strangers.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn other words, “The Final Reckoning” isn’t the first time those balancing acts have been suffused into the plot of these movies. But previous “Mission” adventures —\u003cem\u003e especially\u003c/em\u003e the ones helmed by returning director Christopher McQuarrie, all of which moved with the confidence of a prophecy being fulfilled even though they were built on the fly and held together with sticky tack — understood that action is the best argument against predestination. That’s especially true of “Dead Reckoning,” which saw Cruise fight back against the brain rot of A.I. by driving a motorcycle off a cliff for our enjoyment; “There’s always a choice,” Ethan is fond of saying, and the man playing him tends to prove that by making choices that no one on Earth has ever made before. \n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eThat same A.I., better known by its stage name “The Entity,” is back with a vengeance in “The Final Reckoning,” and it’s determined to goad humanity towards nuclear annihilation. But this time, Cruise and McQuarrie choose to illustrate the crisis of algorithmic thinking across a ploddingly scripted boardroom drama that cleaves a lot closer to the Cold War brinksmanship of “13 Days” than it does to the Buster Keaton-esque brilliance of their previous “Missions.” \u003c/p\u003e\n\n\n\n\u003cp\u003eThe change of pace feels deliberate, but why ditch the franchise’s signature elegance in favor of the same kind of blockbuster tedium that “Mission: Impossible” has always defined itself against? The choice — and there’s \u003cem\u003ealways\u003c/em\u003e a choice — might stem from a strained production that was nearly torpedoed by strikes, but it’s also possible that McQuarrie and co-writer Erik Jendresen were handcuffed by the apocalyptic stakes the Entity demanded of them. Maybe they wanted to background Ethan Hunt in order to seed his ethos to the future his franchise is leaving behind, or maybe McQuarrie and Cruise just saw this story as the next step in their war against technological enshittification. If Tom Cruise can get people back to the movies, who’s to say he can’t get them to stop relying on ChatGPT? \n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eWhatever the case, I can’t overstate how frustrating and redundant it feels to watch some random people we don’t care about — namely, President Angela Bassett and her beefy cabinet of flop-sweating character actors — equivocate over (and over) the lesser of two evils at the tail end of a franchise whose hero continues to disproves that logic with every mind-boggling setpiece. And the setpieces \u003cem\u003eare \u003c/em\u003estill mind-boggling, even if this movie desperately needed more of them. The climactic biplane chase is somewhat diminished by the sheer worthlessness of the film’s villain (a new low in a franchise that has frequently struggled on that front), but the wordless 10-minute sequence where Cruise is tossed around the hull of a sunken nuclear submarine as it rolls towards the edge of a cliff reaches levels of “how the hell did they do that?” that have previously been reserved for certain Renaissance sculptures and early Björk albums. \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"780\" height=\"438\" src=\"https://www.indiewire.com/wp-content/uploads/2025/05/the-final-reckoning-seems-like-a-mixed-bag-of-high-highs-and-low-lows-1747145658.jpg\" alt=\"\" srcset=\"https://www.indiewire.com/wp-content/uploads/2025/05/the-final-reckoning-seems-like-a-mixed-bag-of-high-highs-and-low-lows-1747145658.jpg 780w, https://www.indiewire.com/wp-content/uploads/2025/05/the-final-reckoning-seems-like-a-mixed-bag-of-high-highs-and-low-lows-1747145658.jpg?resize=300,168 300w, https://www.indiewire.com/wp-content/uploads/2025/05/the-final-reckoning-seems-like-a-mixed-bag-of-high-highs-and-low-lows-1747145658.jpg?resize=178,100 178w, https://www.indiewire.com/wp-content/uploads/2025/05/the-final-reckoning-seems-like-a-mixed-bag-of-high-highs-and-low-lows-1747145658.jpg?resize=600,337 600w, https://www.indiewire.com/wp-content/uploads/2025/05/the-final-reckoning-seems-like-a-mixed-bag-of-high-highs-and-low-lows-1747145658.jpg?resize=125,70 125w, https://www.indiewire.com/wp-content/uploads/2025/05/the-final-reckoning-seems-like-a-mixed-bag-of-high-highs-and-low-lows-1747145658.jpg?resize=660,370 660w, https://www.indiewire.com/wp-content/uploads/2025/05/the-final-reckoning-seems-like-a-mixed-bag-of-high-highs-and-low-lows-1747145658.jpg?resize=244,137 244w, https://www.indiewire.com/wp-content/uploads/2025/05/the-final-reckoning-seems-like-a-mixed-bag-of-high-highs-and-low-lows-1747145658.jpg?resize=169,95 169w, https://www.indiewire.com/wp-content/uploads/2025/05/the-final-reckoning-seems-like-a-mixed-bag-of-high-highs-and-low-lows-1747145658.jpg?resize=71,40 71w, https://www.indiewire.com/wp-content/uploads/2025/05/the-final-reckoning-seems-like-a-mixed-bag-of-high-highs-and-low-lows-1747145658.jpg?resize=50,28 50w, https://www.indiewire.com/wp-content/uploads/2025/05/the-final-reckoning-seems-like-a-mixed-bag-of-high-highs-and-low-lows-1747145658.jpg?resize=45,25 45w, https://www.indiewire.com/wp-content/uploads/2025/05/the-final-reckoning-seems-like-a-mixed-bag-of-high-highs-and-low-lows-1747145658.jpg?resize=267,150 267w, https://www.indiewire.com/wp-content/uploads/2025/05/the-final-reckoning-seems-like-a-mixed-bag-of-high-highs-and-low-lows-1747145658.jpg?resize=534,300 534w, https://www.indiewire.com/wp-content/uploads/2025/05/the-final-reckoning-seems-like-a-mixed-bag-of-high-highs-and-low-lows-1747145658.jpg?resize=150,84 150w, https://www.indiewire.com/wp-content/uploads/2025/05/the-final-reckoning-seems-like-a-mixed-bag-of-high-highs-and-low-lows-1747145658.jpg?resize=110,62 110w, https://www.indiewire.com/wp-content/uploads/2025/05/the-final-reckoning-seems-like-a-mixed-bag-of-high-highs-and-low-lows-1747145658.jpg?resize=285,160 285w, https://www.indiewire.com/wp-content/uploads/2025/05/the-final-reckoning-seems-like-a-mixed-bag-of-high-highs-and-low-lows-1747145658.jpg?resize=320,180 320w, https://www.indiewire.com/wp-content/uploads/2025/05/the-final-reckoning-seems-like-a-mixed-bag-of-high-highs-and-low-lows-1747145658.jpg?resize=640,359 640w\" sizes=\"auto, (max-width: 780px) 100vw, 780px\"/\u003e\u003cfigcaption\u003e“Mission: Impossible — The Final Reckoning”\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eAlas, that’s all there is to see on that front — the longest “Mission: Impossible” movie ever has, by far, the least action to offer in return. That wouldn’t seem like such a raw deal if not for the fact that “The Final Reckoning” doesn’t feel much like a “Mission” at all whenever Ethan isn’t fighting for his life, which is mighty ironic in light of the film’s self-referential streak. \n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eAll of your favorite characters are back, of course (minus the late, great Ilsa Faust, the most favorite of them all), but they’re forced to scramble into different factions after the Entity spurns Gabriel (Esai Morales), the mysterious killer who was harnessing its power. No spoilers, but it turns out that the Entity is kind of a dick. I mean, in the last movie I thought it might’ve just been \u003cem\u003emisunderstood\u003c/em\u003e (it threw itself a lavish Venetian gala because it wanted its enemies to look chic as hell when they stabbed each other, and I respect that), but this time around the rogue A.I. is less “Eyes Wide Shut” and more “Dr. Strangelove.” \u003c/p\u003e\n\n\n\n\u003cp\u003eIts plan is to infect the nuclear systems of the world’s nine most powerful countries and then coerce them towards mutually assured destruction so that it can play God over the ruins, and Ethan’s team only has four days to stop it, which would be a lot easier if the CIA, Clandestine Services, and the Russian Army weren’t all trying to get in their way. And if that weren’t enough, the Entity has also leveraged social media disinformation to create its very own doomsday cult, which might be the movie’s first clue that things are about to get a whole lot heavier than usual.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd they do get heavy — heavy in a way that feels totally alien to a franchise that has always been light on its feet, even at times of loss and/or lingering sorrow. These films have done a terrific job of selling Ethan’s personal sacrifice whenever one of his precious brunettes has been in harm’s way, but even their most emotional moments have been softened with a little face-switching magic. There’s a cheeky mask reveal towards the start of “The Final Reckoning,” but it plays like a brief moment of fan service at the beginning of a movie that has a very uncertain relationship with fun. \n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eThings get dark in a hurry, and the lack of setpieces makes it easy to lose sight of Ethan’s friends in a franchise that has always expressed character through action. Luther (Ving Rhames) is sullen where he used to be sly, Benji (Simon Pegg) is shrill where he used to be frazzled, and Grace (Hayley Atwell) is a superhuman thief where she used to just be a skilled pickpocket; her powers are exaggerated to the point that it can feel like McQuarrie has forgotten what’s great about his own “Missions,” which derive so much of their power from restoring our faith in the reality of what we’re seeing. \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1000\" height=\"666\" src=\"https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg\" alt=\"\" srcset=\"https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg 1000w, https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg?resize=300,200 300w, https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg?resize=150,100 150w, https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg?resize=600,400 600w, https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg?resize=281,187 281w, https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg?resize=244,163 244w, https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg?resize=900,600 900w, https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg?resize=143,95 143w, https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg?resize=60,40 60w, https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg?resize=50,33 50w, https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg?resize=42,28 42w, https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg?resize=252,168 252w, https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg?resize=506,337 506w, https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg?resize=38,25 38w, https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg?resize=225,150 225w, https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg?resize=450,300 450w, https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg?resize=901,600 901w, https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg?resize=110,73 110w, https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg?resize=285,190 285w, https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg?resize=320,213 320w, https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg?resize=640,426 640w, https://www.indiewire.com/wp-content/uploads/2025/05/MCDMIIM_PA103.jpeg?resize=800,533 800w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"/\u003e\u003cfigcaption\u003e“Mission: Impossible — The Final Reckoning”\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eBut that suspension of disbelief is much wobblier this time, especially in the scenes without any spectacle to distract us. For all of its focus on tying its franchise together, “The Final Reckoning” — irrevocably knocked off its axis by the act one decision to separate Ethan from the rest of his team — struggles to strike the right balance between context and conflict.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s no secret that Rolf Saxon’s William Donloe — who Ethan goofed real good in the first “Mission: Impossible” — is back for more, and McQuarrie makes fantastic use of the character as a moral backstop for all of Ethan’s best intentions. But Donloe’s wife (the charming Lucy Tulugarjuk) epitomizes this herky-jerky film’s overreliance on new faces, all of whom would have been a lot more enjoyable if they didn’t take so much time away from the impossible mission part of this “Mission: Impossible” movie. \n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eLikewise, the decision to have Donloe and his civilian wife factor into the distressingly generic third act mishegoss would’ve been cute in a “Fast \u0026amp; Furious” sequel, but it’s far beneath what fans have come to expect from a franchise of this caliber. Hannah Waddingham, Nick Offerman, and Holt McCallany are in much the same boat, in that their delightful performances didn’t stop me from wanting to shoo them off screen. Only “Severance” star Tramell Tillman, outrageously good as a proud submarine captain who takes on a new passenger, manages to add value to the movie as a whole. \u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s strange enough that a franchise-capper so determined to bring everything full circle would spend so much time introducing us to people we’ve never met before, and stranger still that it would spend so \u003cem\u003elittle \u003c/em\u003etime — exactly zero seconds, to be precise — fleshing out Ethan’s relationship with Gabriel, the man who was supposedly instrumental to his decision to join the IMF. Gabriel’s one-dimensional villainy was easy to excuse in “Dead Reckoning,” as the flashbacks in that film suggested that the next movie, then slated to be “Dead Reckoning: Part II” — would fill in the gaps. No such luck. Instead, “The Final Reckoning” sees Gabriel wilt into a maniacal cartoon, thereby wasting the film’s best target for all of the pathos it’s worked so hard to accrue. \n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eOf course, Ethan has more in common with the Entity than he ever could with a flesh-and-blood antagonist like Gabriel. As I noted in my review of “Dead Reckoning,” the “Mission: Impossible” series has forged a cohesive identity through its obsession with balancing the human element against bottom-line calculations, and so “The Final Reckoning” naturally pits a man who refuses to compromise against a code that seeks to eliminate free will altogether. They are worthy adversaries, and this saga could only come to an end — whether or not that is what this film ultimately represents — once audiences got to see who triumphs in the ultimate battle between a rock and a hard place. \u003c/p\u003e\n\n\n\n\u003cp\u003e“We make our own destiny,” someone intones during the film’s closing voiceover, and by the end of Ethan Hunt’s story, it’s hard not to take those words to heart. I only wish that Cruise and McQuarrie had managed to make a better one.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"grade-c\"\u003eGrade: C\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eParamount Pictures will release “\u003ca href=\"https://www.indiewire.com/t/mission-impossible-the-final-reckoning/\" id=\"auto-tag_mission-impossible-the-final-reckoning\" data-tag=\"mission-impossible-the-final-reckoning\"\u003eMission: Impossible — The Final Reckoning\u003c/a\u003e” in theaters on Friday, May 23.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eWant to stay up to date on IndieWire’s film \u003c/em\u003e\u003ca href=\"https://www.indiewire.com/t/reviews/\"\u003e\u003cstrong\u003e\u003cem\u003ereviews\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003cem\u003e and critical thoughts? \u003c/em\u003e\u003ca href=\"https://cloud.email.indiewire.com/newsletters\"\u003e\u003cstrong\u003e\u003cem\u003eSubscribe here\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003cem\u003e to our newly launched newsletter, In Review by David Ehrlich, in which our Chief Film Critic and Head Reviews Editor rounds up the best new reviews and streaming picks along with some exclusive musings — all only available to subscribers.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "14 min read",
  "publishedTime": "2025-05-14T20:00:00Z",
  "modifiedTime": "2025-05-13T21:49:59Z"
}
