{
  "id": "63427769-74b0-4f33-9bdc-7761da2d28e1",
  "title": "Who Is Nick Kyrgios’ Girlfriend? Costeen Hatzi’s Job \u0026 Relationship History",
  "link": "https://www.comingsoon.net/guides/news/1885260-nick-kyrgios-girlfriend-costeen-hatzi-job-relationship-history",
  "description": "Netizens are curious to find out all about Nick Kyrgios‘ girlfriend, and their relationship history. The Australian tennis star is no stranger to the spotlight, thanks to his illustrious career of over a decade. While his professional life is explored in Netflix’s docuseries, Break Point, fans have always wanted to get a glimpse into his […] The post Who Is Nick Kyrgios’ Girlfriend? Costeen Hatzi’s Job \u0026 Relationship History appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
  "author": "Namrata Ghosh",
  "published": "Wed, 27 Nov 2024 23:03:16 +0000",
  "source": "https://www.comingsoon.net/feed",
  "categories": [
    "Guides",
    "Nick Kyrgios",
    "Pop Culture"
  ],
  "byline": "Namrata Ghosh",
  "length": 2900,
  "excerpt": "Here's everything we know about Australian tennis star Nick Kyrgios' girlfriend, how they met, their relationship history, and more.",
  "siteName": "ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More",
  "favicon": "https://www.comingsoon.net/wp-content/uploads/sites/3/2022/12/cs_ico_144x144.png?w=144",
  "text": "Netizens are curious to find out all about Nick Kyrgios‘ girlfriend, and their relationship history. The Australian tennis star is no stranger to the spotlight, thanks to his illustrious career of over a decade. While his professional life is explored in Netflix’s docuseries, Break Point, fans have always wanted to get a glimpse into his personal life as well. Without further ado, here’s everything we know about who Nick Kyrgios’ girlfriend is, how they met, and more. Who is Nick Kyrgios dating? Nick Kyrgios is dating Costeen Hatzi. Hatzi is from Australia and she currently lives in Sydney with her boyfriend. As per her LinkedIn profile, she graduated in May 2021 from Australian Catholic University, where she earned her Bachelor’s degree in psychological sciences. What is Costeen Hatzi’s job? Nick Kyrgios’ girlfriend is a social media influencer, model, and entrepreneur. Costeen Hatzi boasts an impressive Instagram profile with over 175k followers as of writing. Besides her social media presence, she also runs her own business. Hatzi launched her brand, Style Studio Dress Hire, in 2023. The company offers luxury dresses and clothing items for hire and rent. Speaking on Sunrise’s The Morning Show, Hatzi explained her inspiration to create the brand and why renting expensive clothing works better. “Girls nowadays only wear a dress once, especially if you’re going to an event. It’s good. It works for everyone,” she stated. Nick Kyrgios and Costeen Hatzi’s relationship history Nick Kyrgios first met his girlfriend Costeen Hatzi in late 2021. As per his 2023 ESPN profile, the tennis icon discovered her profile online when he was looking to buy a mirror, and he spotted the perfect one being sold by Hatzi. The two then met up to complete the purchase and sparks flew instantly. Kyrgios and Hatzi soon began dating and the outlet even noted that it was love at first sight for her. After a few months of dating, she publicly announced their relationship via an Instagram post made in January 2022. The pair have been inseparable ever since and Hatzi has been a constant pillar of strength for Kyrgios, both personally and personally. Costeen Hatzi is often spotted cheering Nick Kyrgios at his games and often posts on social media in support of him. Since they began dating, the pair has sparked engagement rumors more than once. (via New York Post) While neither have confirmed these speculations, they have often expressed their desire for a future together. “I don’t know if marriage and kids are on the cards right now – I think maybe somewhere in the future it will happen, but right now I’m still really young and he’s got tennis to focus on. But it’s definitely something that we want in the future,” Hatzi recently told Daily Mail Australia. The loving couple are about to complete three years of togetherness in December.",
  "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2024/11/MixCollage-28-Nov-2024-04-29-AM-3901.jpg?resize=1200,630",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eNetizens are curious to find out all about \u003ca href=\"http://comingsoon.net/tag/nick-kyrgios\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cstrong\u003eNick Kyrgios\u003c/strong\u003e\u003c/a\u003e‘ \u003cstrong\u003egirlfriend\u003c/strong\u003e, and their relationship history. The Australian tennis star is no stranger to the spotlight, thanks to his illustrious career of over a decade. While his professional life is explored in Netflix’s docuseries, \u003ca href=\"https://www.comingsoon.net/tag/break-point\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBreak Point\u003c/a\u003e, fans have always wanted to get a glimpse into his personal life as well.\u003c/p\u003e\n\n\n\n\u003cp\u003eWithout further ado, here’s everything we know about who Nick Kyrgios’ girlfriend is, how they met, and more.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-who-is-nick-kyrgios-dating\"\u003eWho is Nick Kyrgios dating?\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eNick Kyrgios is dating Costeen Hatzi.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eHatzi is from Australia and she currently lives in Sydney with her boyfriend. As per her \u003ca href=\"https://www.linkedin.com/in/costeen-hatzi-738388318/?originalSubdomain=au\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eLinkedIn profile\u003c/a\u003e, she graduated in May 2021 from Australian Catholic University, where she earned her Bachelor’s degree in psychological sciences.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-what-is-costeen-hatzi-s-job\"\u003eWhat is Costeen Hatzi’s job?\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eNick Kyrgios’ girlfriend is a social media influencer, model, and entrepreneur.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eCosteen Hatzi boasts an impressive \u003ca href=\"https://www.instagram.com/costeenhatzi/?hl=en\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eInstagram profile\u003c/a\u003e with over 175k followers as of writing. Besides her social media presence, she also runs her own business. Hatzi launched her brand, Style Studio Dress Hire, in 2023. The company offers luxury dresses and clothing items for hire and rent. \u003c/p\u003e\n\n\n\n\u003cp\u003eSpeaking on \u003ca href=\"https://www.youtube.com/watch?v=gKhOco8vr54\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eSunrise’s The Morning Show\u003c/a\u003e, Hatzi explained her inspiration to create the brand and why renting expensive clothing works better. “Girls nowadays only wear a dress once, especially if you’re going to an event. It’s good. It works for everyone,” she stated.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-nick-kyrgios-and-costeen-hatzi-s-relationship-history\"\u003eNick Kyrgios and Costeen Hatzi’s relationship history\u003c/h2\u003e\n\n\n\n\u003cp\u003eNick Kyrgios first met his girlfriend Costeen Hatzi in late 2021. \u003c/p\u003e\n\n\n\n\u003cp\u003eAs per his \u003ca href=\"https://www.espn.in/tennis/story/_/id/35411984/nick-kyrgios-tennis-brilliance-belligerence-australian-open-2023\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e2023 ESPN profile\u003c/a\u003e, the tennis icon discovered her profile online when he was looking to buy a mirror, and he spotted the perfect one being sold by Hatzi. The two then met up to complete the purchase and sparks flew instantly. \u003c/p\u003e\n\n\n\n\u003cp\u003eKyrgios and Hatzi soon began dating and the outlet even noted that it was love at first sight for her. After a few months of dating, she publicly announced their relationship via an \u003ca href=\"https://www.instagram.com/p/CYOD59PrWJX/?utm_source=ig_web_copy_link\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eInstagram post\u003c/a\u003e made in January 2022. The pair have been inseparable ever since and Hatzi has been a constant pillar of strength for Kyrgios, both personally and personally. \u003c/p\u003e\n\n\n\n\u003cp\u003eCosteen Hatzi is often spotted cheering Nick Kyrgios at his games and often posts on social media in support of him. Since they began dating, the pair has sparked engagement rumors more than once. (via \u003ca href=\"https://nypost.com/2022/04/28/nick-kyrgios-fuels-costeen-hatzi-engagement-buzz-with-ring-post/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eNew York Post\u003c/a\u003e) While neither have confirmed these speculations, they have often expressed their desire for a future together. \u003c/p\u003e\n\n\n\n\u003cp\u003e“I don’t know if marriage and kids are on the cards right now – I think maybe somewhere in the future it will happen, but right now I’m still really young and he’s got tennis to focus on. But it’s definitely something that we want in the future,” Hatzi recently told \u003ca href=\"https://www.dailymail.co.uk/sport/tennis/article-14074843/Nick-Kyrgios-girlfriend-Costeen-Hatzi-WAG-interview.html\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eDaily Mail Australia\u003c/a\u003e. The loving couple are about to complete three years of togetherness in December.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-27T23:03:16Z",
  "modifiedTime": "2024-11-27T23:03:32Z"
}
