{
  "id": "6523b848-c41a-4714-bc0b-b8cfe253c70b",
  "title": "Giveaway: Win a Blu-Ray Copy Of The Thriller Film Sleep",
  "link": "https://bleedingcool.com/movies/giveaway-win-a-blu-ray-copy-of-the-thriller-film-sleep/",
  "description": "Would you like to win a Blu-ray copy of the film Sleep? We're giving away two copies of the movie, you just need to do a few things",
  "author": "Gavin Sheehan",
  "published": "Tue, 17 Dec 2024 18:15:56 -0600",
  "source": "https://www.bleedingcool.com/movies/feed/",
  "categories": [
    "Contest/Giveaway",
    "Movies",
    "Magnolia Home Entertainment",
    "sleep"
  ],
  "byline": "Gavin Sheehan",
  "length": 3031,
  "excerpt": "Would you like to win a Blu-ray copy of the psychological thriller Sleep? All you need is a BlueSky account to take part in this giveaway. Magnolia Home Entertainment has given us a couple of copies of the film, which arrives on Blu-ray, DVD, and On Demand today, December 17. So this is your chance […]",
  "siteName": "Bleeding Cool News",
  "favicon": "",
  "text": "Posted in: Contest/Giveaway, Movies | Tagged: Magnolia Home Entertainment, sleepWould you like to win a Blu-ray copy of the film Sleep? We're giving away two copies of the movie, you just need to do a few thingsArticle Summary Enter to win a Blu-ray of the thriller \"Sleep\" by following us and reposting our BlueSky contest post. Don't miss out! The deadline to participate is Sunday, December 22, at 11am PT. Ensure you're eligible by having a BlueSky account and following our guidelines. Open to U.S. residents only. Winners picked randomly from eligible entries. Would you like to win a Blu-ray copy of the psychological thriller Sleep? All you need is a BlueSky account to take part in this giveaway. Magnolia Home Entertainment has given us a couple of copies of the film, which arrives on Blu-ray, DVD, and On Demand today, December 17. So this is your chance to win a copy for free. What do you need to do to win this? In order for a chance to win it, all you're required to do is two things on BlueSky. All you have to do is follow our BlueSky account and also repost the social media post tied to this contest. You can't miss it, as it will have the same image as the one here, along with the hashtag #BCSleep. You have until Sunday, December 22, at 11am PT to do so. Credit: Magnolia Home Entertainment That's all! Literally, we're only asking you to do two things that cost you zero money and little time on your part, and you could win a copy of the psychological thriller Sleep. Now, as usual, before the complaints start coming into our comments section from people who don't have a BlueSky account… it's 2024; BlueSky is free to use. If you're reading this post, you have the capability of making a BlueSky account. Emailing us or complaining in the comments that the contest is \"selective\" or \"unfair\" will not make you a winner. When we choose winners, we will be checking that you have both retweeted our post and that you're following Bleeding Cool's official BlueSky account. Those who have not done so are not eligible to win; we do check the accounts AND content of those picked at random. Best of luck to those of you who enter! This contest is limited to players in the United States. Winners will be chosen at random. Entry into the contest does not automatically guarantee you are a winner. Enjoyed this? Please share on social media! Stay up-to-date and support the site by following Bleeding Cool on Google News today! About Gavin SheehanGavin is the current Games Editor for Bleeding Cool. He has been a lifelong geek who can chat with you about comics, television, video games, and even pro wrestling. He can also teach you how to play Star Trek chess, be your Mercy on Overwatch, recommend random cool music, and goes rogue in D\u0026D. He also enjoys hundreds of other geeky things that can't be covered in a single paragraph. Follow @TheGavinSheehan on Facebook, Twitter/X, Instagram, Bluesky, Threads, and Hive, for random pictures and musings.",
  "image": "https://bleedingcool.com/wp-content/uploads/2024/12/Magnolia-Home-Entertainment-Sleep-Art-2000x1125.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"wrapper\"\u003e\u003carticle id=\"article\" data-post-id=\"2135866\" itemscope=\"\" itemtype=\"http://schema.org/Article\"\u003e\u003cp\u003ePosted in: \u003ca href=\"https://bleedingcool.com/bc-network/contest-giveaway/\" rel=\"category\"\u003eContest/Giveaway\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/movies/\" rel=\"category\"\u003eMovies\u003c/a\u003e | Tagged: \u003ca href=\"https://bleedingcool.com/tag/magnolia-home-entertainment/\" rel=\"tag\"\u003eMagnolia Home Entertainment\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/sleep/\" rel=\"tag\"\u003esleep\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\u003cp\u003eWould you like to win a Blu-ray copy of the film Sleep? We\u0026#39;re giving away two copies of the movie, you just need to do a few things\u003c/p\u003e\u003chr/\u003e\u003chr/\u003e\u003cdiv id=\"post_summary\"\u003e\u003ch2\u003eArticle Summary\u003c/h2\u003e\u003cul\u003e\n\u003cli\u003eEnter to win a Blu-ray of the thriller \u0026#34;Sleep\u0026#34; by following us and reposting our BlueSky contest post.\u003c/li\u003e\n\u003cli\u003eDon\u0026#39;t miss out! The deadline to participate is Sunday, December 22, at 11am PT.\u003c/li\u003e\n\u003cli\u003eEnsure you\u0026#39;re eligible by having a BlueSky account and following our guidelines.\u003c/li\u003e\n\u003cli\u003eOpen to U.S. residents only. Winners picked randomly from eligible entries.\u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003chr/\u003e\u003cp\u003eWould you like to win a Blu-ray copy of the psychological thriller \u003cem\u003eSleep\u003c/em\u003e? All you need is a BlueSky account to take part in this giveaway. Magnolia Home Entertainment has given us a couple of copies of the film, which arrives on Blu-ray, DVD, and On Demand today, December 17. So this is your chance to win a copy for free. What do you need to do to win this? In order for a chance to win it, all you\u0026#39;re required to do is two things on BlueSky. All you have to do is \u003cstrong\u003efollow \u003ca href=\"https://bsky.app/profile/bleedingcool.bsky.social\"\u003eour BlueSky account\u003c/a\u003e\u003c/strong\u003e and also repost the social media post tied to this contest. You can\u0026#39;t miss it, as it will have the same image as the one here, along with the hashtag \u003cstrong\u003e#BCSleep\u003c/strong\u003e. You have until Sunday, December 22, at 11am PT to do so.\u003c/p\u003e\n\u003cfigure id=\"attachment_2135895\" aria-describedby=\"caption-attachment-2135895\"\u003e\u003ca href=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://bleedingcool.com/wp-content/uploads/2024/12/Magnolia-Home-Entertainment-Sleep-Art.jpg\"\u003e\u003cimg src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:800/q:75/https://bleedingcool.com/wp-content/uploads/2024/12/Magnolia-Home-Entertainment-Sleep-Art.jpg\" alt=\"Summoners War: Sky Arena Releases 2024 Holiday Update\" width=\"600\" height=\"800\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:800/q:75/https://bleedingcool.com/wp-content/uploads/2024/12/Magnolia-Home-Entertainment-Sleep-Art.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20600%20800%22%20width%3D%22600%22%20height%3D%22800%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2135895\"\u003eCredit: Magnolia Home Entertainment\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eThat\u0026#39;s all! Literally, we\u0026#39;re only asking you to do two things that cost you zero money and little time on your part, and you could win a copy of the psychological thriller \u003cem\u003eSleep\u003c/em\u003e. Now, as usual, before the complaints start coming into our comments section from people who don\u0026#39;t have a BlueSky account… it\u0026#39;s 2024; BlueSky is free to use. If you\u0026#39;re reading this post, you have the capability of making a BlueSky account. Emailing us or complaining in the comments that the contest is \u0026#34;selective\u0026#34; or \u0026#34;unfair\u0026#34; will not make you a winner. When we choose winners, we will be checking that you have both retweeted our post and that you\u0026#39;re following \u003cem\u003eBleeding Cool\u003c/em\u003e\u0026#39;s official BlueSky account. Those who have not done so are not eligible to win; we do check the accounts AND content of those picked at random. Best of luck to those of you who enter!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThis contest is limited to players in the United States. Winners will be chosen at random. Entry into the contest does not automatically guarantee you are a winner.\u003c/strong\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cdiv id=\"bc_sharing_is_caring\"\u003e\u003ccenter\u003e\u003cp\u003e\u003cstrong\u003eEnjoyed this? Please share on social media!\u003c/strong\u003e\u003c/p\u003e\u003ca href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fgiveaway-win-a-blu-ray-copy-of-the-thriller-film-sleep%2F\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://twitter.com/share?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fgiveaway-win-a-blu-ray-copy-of-the-thriller-film-sleep%2F\u0026amp;text=Giveaway%3A+Win+a+Blu-Ray+Copy+Of+The+Thriller+Film+Sleep\u0026amp;via=bleedingcool\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"http://pinterest.com/pin/create/button/?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fgiveaway-win-a-blu-ray-copy-of-the-thriller-film-sleep%2F\u0026amp;description=Giveaway%3A+Win+a+Blu-Ray+Copy+Of+The+Thriller+Film+Sleep\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://reddit.com/submit?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fgiveaway-win-a-blu-ray-copy-of-the-thriller-film-sleep%2F\u0026amp;title=Giveaway%3A+Win+a+Blu-Ray+Copy+Of+The+Thriller+Film+Sleep\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003c/center\u003e\u003c/div\u003e\n    \u003ca id=\"google_follow\" href=\"https://news.google.com/publications/CAAqBwgKMPHflgsw1IauAw?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n        \u003cp\u003e\u003cimg width=\"100\" height=\"81\u0026#34;\" src=\"https://bleedingcool.com/Google_News_icon.png\"/\u003e\n        \u003c/p\u003e\n        \u003cp\u003e\n            Stay up-to-date and support the site by following Bleeding Cool on Google News today!\n        \u003c/p\u003e\n    \u003c/a\u003e\u003c/article\u003e\u003csection\u003e\u003ch2\u003e\u003cimg data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:150/h:150/q:75/https://www.gravatar.com/avatar/bd7d435592313d122f95dc8ced46d517?s=150\" src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20150%20150%22%20width%3D%22150%22%20height%3D%22150%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\" width=\"150px\" height=\"150px\" alt=\"Gavin Sheehan\"/\u003eAbout \u003ca href=\"https://bleedingcool.com/author/gsheehan/\"\u003eGavin Sheehan\u003c/a\u003e\u003c/h2\u003eGavin is the current Games Editor for Bleeding Cool. He has been a lifelong geek who can chat with you about comics, television, video games, and even pro wrestling. He can also teach you how to play Star Trek chess, be your Mercy on Overwatch, recommend random cool music, and goes rogue in D\u0026amp;D. He also enjoys hundreds of other geeky things that can\u0026#39;t be covered in a single paragraph. Follow @TheGavinSheehan on Facebook, Twitter/X, Instagram, Bluesky, Threads, and Hive, for random pictures and musings.\u003c/section\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-17T18:15:56-06:00",
  "modifiedTime": "2024-12-17T18:15:56-06:00"
}
