{
  "id": "662c9292-6dfc-4dda-a3a2-b341e9e2148a",
  "title": "Where is Taylor Swift Today, November 2? When is Her Next Show?",
  "link": "https://www.comingsoon.net/guides/news/1872041-where-is-taylor-swift-today-november-2-concert-playing",
  "description": "After electrifying audiences in Miami and New Orleans, Taylor Swift is set to capture the spotlight once again with her next anticipated Eras Tour performance. The pop sensation’s return to the stage continues to build excitement and keep everyone wondering about the next stop in her record-breaking tour. Curious about Taylor Swift’s whereabouts today, November […] The post Where is Taylor Swift Today, November 2? When is Her Next Show? appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
  "author": "Disheeta Maheshwari",
  "published": "Sat, 02 Nov 2024 07:01:00 +0000",
  "source": "https://www.comingsoon.net/feed",
  "categories": [
    "Guides",
    "Pop Culture",
    "Taylor Swift"
  ],
  "byline": "Disheeta Maheshwari",
  "length": 2009,
  "excerpt": "Curious about where Taylor Swift is today, November 2, and when her next show is? Here are all the details.",
  "siteName": "ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More",
  "favicon": "https://www.comingsoon.net/wp-content/uploads/sites/3/2022/12/cs_ico_144x144.png?w=144",
  "text": "After electrifying audiences in Miami and New Orleans, Taylor Swift is set to capture the spotlight once again with her next anticipated Eras Tour performance. The pop sensation’s return to the stage continues to build excitement and keep everyone wondering about the next stop in her record-breaking tour. Curious about Taylor Swift’s whereabouts today, November 2, and where she’ll perform next? Here’s a look at her upcoming tour schedule Where is Taylor Swift today, November 2? On November 2, Taylor Swift will perform at Lucas Oil Stadium in Indianapolis, with Gracie Abrams as the opening act. Lucas Oil Stadium previously welcomed her during the Reputation tour in 2018. For fans attending the concerts, parking and transportation will be important considerations. Several parking garages around the stadium can be booked in advance through mobile apps. For public transport, IndyGo will maintain its regular bus schedules over the concert weekend, making it easy to get to the venue. In addition to the concerts, Indianapolis has planned a variety of events leading up to the shows. This includes themed parties and gatherings for Taylor Swift fans. With more than 20 activities lined up, the city is ready to celebrate the Eras Tour. Concert attendees can also expect surprise songs and special acoustic performances each night, adding to the excitement of the shows. When is Taylor Swift’s next show? Taylor Swift is scheduled to take the stage for her next concert on November 3, 2024, at Lucas Oil Stadium in Indianapolis. It will feature Gracie Abrams in the opening act. Following her last performance in Indianapolis, Taylor Swift is set for a brief break from touring. She’ll soon kick off the Canadian leg of her U.S. tour. This starts with an extended series of shows at Toronto’s Rogers Centre from November 14 to 23, 2024. The tour will then culminate in Vancouver, where Swift will take the stage for her final performances at BC Place from December 6 to 8, 2024.",
  "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2024/10/Where-is-Taylor-Swift-Today-November-2-When-is-Her-Next-Show.jpg?resize=1200,630",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eAfter electrifying audiences in Miami and New Orleans, \u003ca href=\"https://www.comingsoon.net/tag/Taylor-Swift\"\u003e\u003cstrong\u003eTaylor Swift\u003c/strong\u003e\u003c/a\u003e is set to capture the spotlight once again with her next anticipated Eras Tour performance. The pop sensation’s return to the stage continues to build excitement and keep everyone wondering about the next stop in her record-breaking tour.\u003c/p\u003e\n\n\n\n\u003cp\u003eCurious about Taylor Swift’s whereabouts today, November 2, and where she’ll perform next? Here’s a look at her upcoming tour schedule\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-where-is-taylor-swift-today-november-2\"\u003eWhere is Taylor Swift today, November 2?\u003c/h2\u003e\n\n\n\n\u003cp\u003eOn November 2, Taylor Swift will perform at Lucas Oil Stadium in Indianapolis, with Gracie Abrams as the opening act.\u003c/p\u003e\n\n\n\n\u003cp\u003eLucas Oil Stadium previously welcomed her during the Reputation tour in 2018. For fans attending the concerts, parking and transportation will be important considerations. Several parking garages around the stadium can be booked in advance through mobile apps. For public transport, IndyGo will maintain its regular bus schedules over the concert weekend, making it easy to get to the venue.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn addition to the concerts, Indianapolis has planned a variety of events leading up to the shows. This includes themed parties and gatherings for Taylor Swift fans. With more than 20 activities lined up, the city is ready to celebrate the Eras Tour. Concert attendees can also expect surprise songs and special acoustic performances each night, adding to the excitement of the shows.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-when-is-taylor-swift-s-next-show\"\u003eWhen is Taylor Swift’s next show?\u003c/h2\u003e\n\n\n\n\u003cp\u003eTaylor Swift is scheduled to take the stage for her next concert on November 3, 2024, at Lucas Oil Stadium in Indianapolis. It will feature Gracie Abrams in the opening act.\u003c/p\u003e\n\n\n\n\u003cp\u003eFollowing her last performance in Indianapolis, Taylor Swift is set for a brief break from touring. She’ll soon kick off the Canadian leg of her U.S. tour. This starts with an extended series of shows at Toronto’s Rogers Centre from November 14 to 23, 2024. The tour will then culminate in Vancouver, where Swift will take the stage for her final performances at BC Place from December 6 to 8, 2024.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-02T07:01:00Z",
  "modifiedTime": "2024-10-30T14:17:03Z"
}
