{
  "id": "69cb0cf4-4cc1-4625-a66f-d2ef56d7dc2c",
  "title": "World Series Game 5 Scores 18.6 Million Viewers For Fox Sports as Dodgers Clinch the Title",
  "link": "https://variety.com/2024/tv/news/world-series-game-5-ratings-dodgers-win-fox-sports-1236196818/",
  "description": "Fox is celebrating like they’re Freddie Freeman, posting strong numbers on Wednesday night as the Los Angeles Dodgers clinched the World Series in Game 5. According to Nielsen data via Fox Sports, an average of 18.6 million viewers tuned in to see the Dodgers come back from an early deficit to beat the New York […]",
  "author": "Varietyschneider",
  "published": "Fri, 01 Nov 2024 00:17:58 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Los Angeles Dodgers",
    "Tv Ratings",
    "World Series"
  ],
  "byline": "Michael Schneider",
  "length": 3216,
  "excerpt": "Fox Sports averaged 18.6 million viewers on Wednesday as the Los Angeles Dodgers clinched the World Series in Game 5.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "Fox is celebrating like they’re Freddie Freeman, posting strong numbers on Wednesday night as the Los Angeles Dodgers clinched the World Series in Game 5. According to Nielsen data via Fox Sports, an average of 18.6 million viewers tuned in to see the Dodgers come back from an early deficit to beat the New York Yankees 7-6. That number comes from audiences tuning in via Fox, Fox Deportes and Fox Sports streaming services. On Fox itself, the game averaged 18.152 million viewers, as well as a 4.25 rating and 46 share among adults 18-49 and a 5.27 rating/42 share with adults 25-54. The network easily dominated the night, more than doubling the combined total of ABC/NBC/CBS/The CW. Overall, the five-game World Series averaged 15.81 million viewers — the best since the 2017 contest, when the Dodgers faced off against the Houston Astros. (Ahem.) In Los Angeles, Game 5 averaged a 21.1 rating and a 55 share of viewers, while the number was 14.8/39 in New York. Popular on Variety According to Fox Sports, this reps the best number for a World Series Game 5 since 2017 (averaging 18.96 million viewers). The peak for this game was between 11:15 p.m. to 11:30 p.m. ET, when the audience climbed to 21.27 million viewers on Fox. It had already been a strong World Series for Fox, with the nation’s two largest markets in the game. The dream match-up of the Dodgers vs. the Yankees boosted overall interest in this year’s MLB championship round. And it repped quite a turnaround from 2023’s much lower numbers, when a Texas Rangers/Arizona Diamonbacks matchup failed to excite the larger population. (Game 5 was up 58% on Fox vs. the 2023 Game 5.) Heading into Game 5, the 2024 World Series had already seen its best start since 2017, averaging 14.98 million viewers. Game 4, the only win by the Yankees, had been tops with 16.7 million viewers across Fox, Fox Deportes and Fox Sports streaming, making it Fox’s most-watched Game 4 since 2016. It was also up 92% on Fox vs. 2023’s Game 4 (8.5 million viewers). The 2024 World Series opened on quite a high note, thanks to Freeman’s walk-off grand slam, which gave the Dodgers that first win. That Game 1 averaged 15.2 million viewers when Fox, Fox Deportes, Univision and Fox Sports streaming was included. And it was the most-watched Game 1 since 2017 (olus up 62% vs. last year’s Game 1). That was followed by Dodgers wins in Game 2 (13.8 million viewers, the most-watched Game 2 since 2018 and up 65% from 2023) and Game 3 (13.6 million viewers, the most-watched Game 3 since 2018 and up 63% from 2023). This World Series has also posted record numbers for Spanish language coverage. According to Fox Sports, Game 4 averaged 419,000 which made it the most-watched World Series Game 4 in Spanish language TV history. Freeman was named the MVP of the World Series, which gave the Dodgers its eighth World Series win in franchise history. The Dodgers most recently won in the pandemic-shortened 2020 season, and had to forgo a victory celebration as a result. This time, plans are already set for a parade in downtown Los Angeles on Friday, followed by an ticketed event at Dodger Stadium.",
  "image": "https://variety.com/wp-content/uploads/2024/10/GettyImages-2182034365.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tFox is celebrating like they’re Freddie Freeman, posting strong numbers on Wednesday night as the \u003ca href=\"https://variety.com/t/los-angeles-dodgers/\" id=\"auto-tag_los-angeles-dodgers\" data-tag=\"los-angeles-dodgers\"\u003eLos Angeles Dodgers\u003c/a\u003e \u003ca href=\"https://variety.com/2024/tv/news/los-angeles-dodgers-win-world-series-game-5-yankees-1236195890/\"\u003eclinched the World Series\u003c/a\u003e in Game 5. According to Nielsen data via Fox Sports, an average of 18.6 million viewers tuned in to see the Dodgers come back from an early deficit to beat the New York Yankees 7-6.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThat number comes from audiences tuning in via Fox, Fox Deportes and Fox Sports streaming services. On Fox itself, the game averaged 18.152 million viewers, as well as a 4.25 rating and 46 share among adults 18-49 and a 5.27 rating/42 share with adults 25-54. The network easily dominated the night, more than doubling the combined total of ABC/NBC/CBS/The CW.\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tOverall, the five-game \u003ca href=\"https://variety.com/t/world-series/\" id=\"auto-tag_world-series\" data-tag=\"world-series\"\u003eWorld Series\u003c/a\u003e averaged 15.81 million viewers — the best since the 2017 contest, when the Dodgers faced off against the Houston Astros. (Ahem.) In Los Angeles, Game 5 averaged a 21.1 rating and a 55 share of viewers, while the number was 14.8/39 in New York.\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tAccording to Fox Sports, this reps the best number for a World Series Game 5 since 2017 (averaging 18.96 million viewers). The peak for this game was between 11:15 p.m. to 11:30 p.m. ET, when the audience climbed to 21.27 million viewers on Fox.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIt had already been a strong World Series for Fox, with the nation’s two largest markets in the game. The dream match-up of the Dodgers vs. the Yankees boosted overall interest in this year’s MLB championship round. And it repped quite a turnaround from 2023’s much lower numbers, when a Texas Rangers/Arizona Diamonbacks matchup failed to excite the larger population. (Game 5 was up 58% on Fox vs. the 2023 Game 5.)\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tHeading into Game 5, the 2024 World Series had already seen its best start since 2017, averaging 14.98 million viewers. Game 4, the only win by the Yankees, had been tops with 16.7 million viewers across Fox, Fox Deportes and Fox Sports streaming, making it Fox’s most-watched Game 4 since 2016. It was also up 92% on Fox vs. 2023’s Game 4 (8.5 million viewers).\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe 2024 World Series opened on quite a high note, thanks to Freeman’s walk-off grand slam, which gave the Dodgers that first win. That Game 1 averaged 15.2 million viewers when Fox, Fox Deportes, Univision and Fox Sports streaming was included. And it was the most-watched Game 1 since 2017 (olus up 62% vs. last year’s Game 1).\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tThat was followed by Dodgers wins in Game 2 (13.8 million viewers, the most-watched Game 2 since 2018 and up 65% from 2023) and Game 3 (13.6 million viewers, the most-watched Game 3 since 2018 and up 63% from 2023).\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThis World Series has also posted record numbers for Spanish language coverage. According to Fox Sports, Game 4 averaged 419,000 which made it the most-watched World Series Game 4 in Spanish language TV history.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tFreeman was named the MVP of the World Series, which gave the Dodgers its eighth World Series win in franchise history. The Dodgers most recently won in the pandemic-shortened 2020 season, and had to forgo a victory celebration as a result. This time, plans are already set for a parade in downtown Los Angeles on Friday, followed by an ticketed event at Dodger Stadium.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-01T00:17:58Z",
  "modifiedTime": "2024-11-01T00:20:04Z"
}
