{
  "id": "7a45e17e-9a40-47df-8118-0e05287e879f",
  "title": "Costume Designer Paul Tazewell on Winning a Tony and Oscar Within Months: ‘This Black, Queer Little Boy in Akron, Ohio Had No Idea He Would Have the Year That He Had’",
  "link": "https://variety.com/2025/artisans/news/costume-designer-paul-tazewell-wins-tony-award-death-becomes-her-1236422860/",
  "description": "Costume designer Paul Tazewell won a Tony Award for his work on the Broadway musical “Death Becomes Her.” Tazewell, who worked on the film version of “Wicked, made Oscar history earlier this year as the first Black man to win best costume design. During his acceptance speech, Tazewell said, “The Black, queer, little boy, in […]",
  "author": "Jazztangcay",
  "published": "Mon, 09 Jun 2025 00:41:53 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Paul Tazewell",
    "Tony Awards"
  ],
  "byline": "Jazz Tangcay",
  "length": 1481,
  "excerpt": "Costume Designer Paul Tazewell on winning an Oscar and Tony in the same year. \"This Black, Queer Little Boy in Akron, Ohio had no idea he would have the year that he had.\"",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "Costume designer Paul Tazewell won a Tony Award for his work on the Broadway musical “Death Becomes Her.” Tazewell, who worked on the film version of “Wicked, made Oscar history earlier this year as the first Black man to win best costume design. During his acceptance speech, Tazewell said, “The Black, queer, little boy, in Akron, Ohio, had no idea that in 2025, he would have the year that he had.” Popular on Variety He joins Bob Fosse, who also achieved the feat of winning a Tony Award and Oscar in the same year. This is Tazewell’s second Tony Award. He previously won for “Hamilton.” In his Tony speech on Sunday, Tazewell added: “I have dressed so many of you, and I have worked with the rest of you out there in creating amazing worlds and telling wonderful stories, and it’s a huge privilege to be a meaningful part of this Broadway community.” Speaking about his work adapting some of the most iconic costumes from the 1992 film of “Death Becomes Her,” Tazewell told Variety last month, “I knew that it was going to be a huge challenge, because if the rest of the audience loved it in the way that I did, there were going to be a lot of expectations.” He added that bringing the film’s story to the stage had benefits. “Musical theater and live performance open up a different way of telling the story,” he said. “So, in some way, it allows me to broaden my inspiration for how we want to tell the story.",
  "image": "https://variety.com/wp-content/uploads/2025/06/GettyImages-2219228099.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tCostume designer \u003ca href=\"https://variety.com/t/paul-tazewell/\" id=\"auto-tag_paul-tazewell\" data-tag=\"paul-tazewell\"\u003ePaul Tazewell\u003c/a\u003e \u003ca data-id=\"https://variety.com/2025/legit/awards/tony-awards-winners-2025-1236422457/\" data-type=\"link\" href=\"https://variety.com/2025/legit/awards/tony-awards-winners-2025-1236422457/\"\u003ewon a Tony Award \u003c/a\u003efor his work on the Broadway musical “Death Becomes Her.” \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tTazewell, who worked on the film version of “Wicked, made Oscar history earlier this year as the first Black man to win best costume design. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tDuring his acceptance speech, Tazewell said, “The Black, queer, little boy, in Akron, Ohio, had no idea that in 2025, he would have the year that he had.” \n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tHe joins Bob Fosse, who also achieved the feat of winning a Tony Award and Oscar in the same year. This is Tazewell’s second Tony Award. He previously won for “Hamilton.”\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tIn his Tony speech on Sunday, Tazewell added: “I have dressed so many of you, and I have worked with the rest of you out there in creating amazing worlds and telling wonderful stories, and it’s a huge privilege to be a meaningful part of this Broadway community.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSpeaking about his work adapting some of the most iconic costumes from the 1992 film of “Death Becomes Her,” Tazewell told \u003cem\u003eVariety\u003c/em\u003e last month, “I knew that it was going to be a huge challenge, because if the rest of the audience loved it in the way that I did, there were going to be a lot of expectations.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tHe added that bringing the film’s story to the stage had benefits. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Musical theater and live performance open up a different way of telling the story,” he said. “So, in some way, it allows me to broaden my inspiration for how we want to tell the story.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-06-09T00:41:53Z",
  "modifiedTime": "2025-06-09T00:49:04Z"
}
