{
  "id": "905a3962-1209-4c24-850c-8fdc588d9ba5",
  "title": "Elizabeth Nissen, Veteran ABC News Correspondent, Dies at 71",
  "link": "https://variety.com/2025/tv/news/elizabeth-nissen-dead-abc-news-1236278544/",
  "description": "Elizabeth Nissen, a veteran ABC News correspondent, died Jan. 7 in Ann Arbor, Mich., three days after her birthday. She was 71. Nissen’s death was first reported and confirmed by ABC News, although the cause of death was not revealed. Throughout her long and respected career in broadcast journalism as a correspondent covering news, war, […]",
  "author": "Matthew Minton",
  "published": "Sun, 19 Jan 2025 23:33:12 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Obituaries",
    "People News",
    "ABC News",
    "Elizabeth Nissen",
    "NBC",
    "Oscars",
    "Princess Diana"
  ],
  "byline": "Matt Minton",
  "length": 1660,
  "excerpt": "Elizabeth Nissen, a veteran ABC News Correspondent remembered for her coverage the night of Princess Diana's death, died Jan. 7. She was 71.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "Elizabeth Nissen, a veteran ABC News correspondent, died Jan. 7 in Ann Arbor, Mich., three days after her birthday. She was 71. Nissen’s death was first reported and confirmed by ABC News, although the cause of death was not revealed. Throughout her long and respected career in broadcast journalism as a correspondent covering news, war, sports, science and art, Nissen worked for CNN and the public television network WGBH. She also worked in print media with The Wall Street Journal and Newsweek. When working at ABC, some of her top coverage was on “Nightline” and “World News Tonight.” Notably, she is remembered for her “World News Tonight” coverage of the evening that Princess Diana died in 1997. Popular on Variety Nissen was also a co-founder and senior producer of NBC Learn, which provides educational video resources for students and teachers. Nissen’s obituary reads that as “a lifelong reader, learner and teacher, Beth was passionate about communicating information in a relatable way. She prepared her students to be critical thinkers, and helped teachers improve methods and techniques for more effective instruction.” Her obituary remembered her for “her wit, her knowledge, her compassion and her nurturing of friendships through extensive personal correspondence.” The obituary also described her as a caregiver who was an active member of her local Rotary Club and “The Adelphies” group at the 1st Presbyterian Church in Ann Arbor. Nissen is survived by five siblings and was an aunt to nine nieces and nephews. At this time, no memorial service is planned, per Nissen’s request.",
  "image": "https://variety.com/wp-content/uploads/2025/01/MixCollage-19-Jan-2025-03-29-PM-8164.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\t\u003ca href=\"https://variety.com/t/elizabeth-nissen/\" id=\"auto-tag_elizabeth-nissen\" data-tag=\"elizabeth-nissen\"\u003eElizabeth Nissen\u003c/a\u003e, a veteran \u003ca href=\"https://variety.com/t/abc-news/\" id=\"auto-tag_abc-news\" data-tag=\"abc-news\"\u003eABC News\u003c/a\u003e correspondent, died Jan. 7 in Ann Arbor, Mich., three days after her birthday. She was 71.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tNissen’s death was first reported and confirmed by \u003ca href=\"https://abcnews.go.com/US/elizabeth-nissen-veteran-abc-news-correspondent-dies/story?id=117831558\" rel=\"nofollow\" target=\"_blank\"\u003eABC News\u003c/a\u003e, although the cause of death was not revealed.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThroughout her long and respected career in broadcast journalism as a correspondent covering news, war, sports, science and art, Nissen worked for CNN and the public television network WGBH. She also worked in print media with The Wall Street Journal and Newsweek.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWhen working at ABC, some of her top coverage was on “Nightline” and “World News Tonight.” Notably, she is remembered for her “World News Tonight” coverage of the evening that \u003ca href=\"https://variety.com/t/princess-diana/\" id=\"auto-tag_princess-diana\" data-tag=\"princess-diana\"\u003ePrincess Diana\u003c/a\u003e died in 1997.\n\n\t\u003c/p\u003e\n\n\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tNissen was also a co-founder and senior producer of \u003ca href=\"https://www.nbcnews.com/nbcnewslearn\" rel=\"nofollow\" target=\"_blank\"\u003eNBC Learn\u003c/a\u003e, which provides educational video resources for students and teachers.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tNissen’s \u003ca href=\"https://obits.mlive.com/us/obituaries/annarbor/name/elizabeth-nissen-obituary?id=57245662\" rel=\"nofollow\" target=\"_blank\"\u003eobituary reads\u003c/a\u003e that as “a lifelong reader, learner and teacher, Beth was passionate about communicating information in a relatable way. She prepared her students to be critical thinkers, and helped teachers improve methods and techniques for more effective instruction.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tHer obituary remembered her for “her wit, her knowledge, her compassion and her nurturing of friendships through extensive personal correspondence.” The obituary also described her as a caregiver who was an active member of her local Rotary Club and “The Adelphies” group at the 1st Presbyterian Church in Ann Arbor.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tNissen is survived by five siblings and was an aunt to nine nieces and nephews. At this time, no memorial service is planned, per Nissen’s request.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-01-19T23:33:12Z",
  "modifiedTime": "2025-01-19T23:33:18Z"
}
