{
  "id": "945a232e-0b2a-4769-94e7-cdf0720a10fb",
  "title": "We Live In Time Review: A Sweet, Solid Weepy Drama",
  "link": "https://www.slashfilm.com/1685569/we-live-in-time-review-andrew-garfield-florence-pugh-movie/",
  "description": "We Live in Time is a gentle, tear-jerking melodrama with excellent performances from Florence Pugh and Andrew Garfield. Here's our review.",
  "author": "Witney Seibold",
  "published": "Thu, 10 Oct 2024 20:41:25 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Drama Movies",
    "Movie Reviews"
  ],
  "byline": "Witney Seibold",
  "length": 6229,
  "excerpt": "We Live in Time is a gentle, tear-jerking melodrama with excellent performances from Florence Pugh and Andrew Garfield. Here's our review.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slash-film-favicon-448x448.png",
  "text": "A24 The most notable detail about John Crowley's new romantic drama \"We Live in Time\" is how brazenly uncomplicated it is. Apart from one stylistic flourish, there is nothing contrived or convoluted about it. It's a very direct love story about a couple that falls in love, has a lot of sex, meets each other's families, bickers about wanting kids, has a daughter, and then faces the ultimate antagonist of all lovers, death. The weirdest things about Almut (Florence Pugh) and Tobias (Andrew Garfield) are their names. Almut does have big dreams, however. She is a professional Anglo-Bavarian chef who aims to one day compete in the Bocuse D'Or, a prestigious worldwide cooking competition. Tobias, meanwhile, is assertively average, working as a mid-manager for Weetabix, the company that produces wheat-flavored scouring pads.  There is something refreshingly direct about \"We Live in Time.\" It's a gentle, tear-jerking melodrama in the old-Hollywood mode, assured that the love lives of two ordinary people will make for an extraordinary emotional journey. It quietly remixes various elements of other notable melodramas — wrestling with cancer, arguing about parenthood, high-pressure professional kitchens, wistful first dates, unusual meet-cutes — and emerges as something gently moving and definitely cry-worthy. It's very telling that the film's publicists handed out free tissue packages to the critics attending the \"We Live in Time\" screenings.  Crowley's one stylistic flourish is that \"We Live in Time\" is presented out-of-chronological-order. The chronology isn't cleverly wielded, however. Nothing is covertly hidden by the twisty narrative, nor is anything permitted to be a surprise reveal. The only advantage the out-of-order storytelling gives \"We Live in Time\" was an avoidance of back-ending the film with all the bummer stuff. She lives with thyme A24 Luckily, audience may be distracted by the excellent performances by Florence Pugh and Andrew Garfield. Pugh in particular grants a lot of subtle complexity to her simpler scenes, revealing gradually that she has a rich inner life, as well as a harrowing inner conflict. She is the one who, once diagnosed with ovarian cancer, begins to practically weigh the benefits of having six, active, non-chemo-heavy months at the end of her life, or twelve months full of treatment and deterioration. She is also the one concerned about her legacy; there's nothing like a sudden reminder of one's mortality that forces a person to consider how they might be remembered. Almut, although she knows she may be dying, is still ambitious.  Tobias, meanwhile, is a stuffed shirt. He is keen on becoming a father, but possesses few interests beyond his daughter and his wife. Tobias doesn't quite fit the standards of the Flawless Rescue Stud — the fictional male counterbalance to the Manic Pixie Dreamgirl — but he does live to serve Almut. When she is pregnant, he knows to strip naked and climb into the bathtub with her, sporting a four-foot-long tube of Jaffa Cakes. He knows what a woman needs.  Small, moving details are revealed throughout. Tobias, for instance, spends a lot of time with his father (Douglas Hodge), and the two seem to be very close. His mother's fate is revealed later. Almut has hidden the fact that she had a thriving career in a separate field before becoming a chef, and Tobias wonders why it was kept a secret. When those secrets are revealed, however, they're not large, mind-blowing, or narrative-altering. They merely enrich an already down-to-earth, relatable story.  As mentioned above, it's refreshingly direct. Gimmickry, and lack thereof A24 Crowley may be telling a melodramatic story, but he studiously avoids sentimentality. This is not a schmaltzy, everything-sparkles-all-the-time romance in the mold of Richard Curtis (\"Love, Actually\"), and it mostly plays fair with its larger, romantic moments; although they may be gently thrown, there are no cheap shots. He also mercifully doesn't get hung-up on dreary, domestic cancer emotionalism like in, say, \"Stepmom.\" There are tears, but they are organic. One can credit Garfield, but mostly Pugh, for giving \"We Live in Time\" a great deal of its relatable humanity.  There is, however, a distinct lack of grounded realism in \"We Live in Time.\" The gimmick of the editing leaves it feeling more like a construct than an organic outcropping of the story. I suppose there is a thematic undercurrent of \"time running out\" — it is a tale of mortality after all — but it's not as important a theme as living together, loving together, and weathering the difficulties. If anything, \"We Live in Time\" is more about leaving a mark, creating important memories, and having complete agency over the way your life is to be defined. \"We Live in Memory,\" however, doesn't have quite the same punch.  Crowley previously made stirring dramas like \"Boy A,\" also starring Garfield, as well as the blissfully moving \"Brooklyn\" in 2015, which was nominated for three Academy Awards. Crowley, however, also helmed clunky thrillers like \"Closed Circuit\" and the critically panned \"The Goldfinch.\" With \"We Live in Time,\" he is playing to both sides, as it were, telling a story of emotional heft, but replete with the slick style of a high-end Hollywood drama. The style was unnecessary, but the hefty elements were enough to elicit sniffles.  /Film rating: 8 out of 10 \"We Live in Time\" opens in theaters on October 11, 2024.",
  "image": "https://www.slashfilm.com/img/gallery/we-live-in-time-review-a-sweet-solid-weepy-drama/l-intro-1728591761.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n                        \n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n                \u003cdiv\u003e\n                \n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1685569/we-live-in-time-review-andrew-garfield-florence-pugh-movie/\" data-post-title=\"We Live in Time Review: A Sweet, Solid Weepy Drama\" data-slide-num=\"0\" data-post-id=\"1685569\"\u003e\n                                             \u003cpicture id=\"p7d7cf468ded069dcd531f13bff2fe16b\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/we-live-in-time-review-a-sweet-solid-weepy-drama/intro-1728591761.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/we-live-in-time-review-a-sweet-solid-weepy-drama/intro-1728591761.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/we-live-in-time-review-a-sweet-solid-weepy-drama/intro-1728591761.jpg\" data-slide-url=\"https://www.slashfilm.com/1685569/we-live-in-time-review-andrew-garfield-florence-pugh-movie/\" data-post-id=\"1685569\" data-slide-num=\"0\" data-slide-title=\"We Live in Time Review: A Sweet, Solid Weepy Drama: \" width=\"780\" height=\"438\" alt=\"We Live in Time\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eA24\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n                \n                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003e\u003cstrong\u003eThe most notable detail about \u003ca href=\"https://www.slashfilm.com/1618549/we-live-in-time-trailer-andrew-garfield-florence-pugh/\" target=\"_blank\"\u003eJohn Crowley\u0026#39;s new romantic drama \u0026#34;We Live in Time\u0026#34;\u003c/a\u003e is how brazenly uncomplicated it is.\u003c/strong\u003e Apart from one stylistic flourish, there is nothing contrived or convoluted about it. It\u0026#39;s a very direct love story about a couple that falls in love, has a lot of sex, meets each other\u0026#39;s families, bickers about wanting kids, has a daughter, and then faces the ultimate antagonist of all lovers, death. The weirdest things about Almut (Florence Pugh) and Tobias (Andrew Garfield) are their names. Almut does have big dreams, however. She is a professional Anglo-Bavarian chef who aims to one day compete in the Bocuse D\u0026#39;Or, a prestigious worldwide cooking competition. Tobias, meanwhile, is assertively average, working as a mid-manager for Weetabix, the company that produces wheat-flavored scouring pads. \u003c/p\u003e\n\n\u003cp\u003eThere is something refreshingly direct about \u0026#34;We Live in Time.\u0026#34; It\u0026#39;s a gentle, tear-jerking melodrama in the old-Hollywood mode, assured that the love lives of two ordinary people will make for an extraordinary emotional journey. It quietly remixes various elements of other notable melodramas — wrestling with cancer, arguing about parenthood, high-pressure professional kitchens, wistful first dates, unusual meet-cutes — and emerges as something gently moving and definitely cry-worthy. It\u0026#39;s very telling that the film\u0026#39;s publicists handed out free tissue packages to the critics attending the \u0026#34;We Live in Time\u0026#34; screenings. \u003c/p\u003e\n\u003cp\u003eCrowley\u0026#39;s one stylistic flourish is that \u0026#34;We Live in Time\u0026#34; is presented out-of-chronological-order. The chronology isn\u0026#39;t cleverly wielded, however. Nothing is covertly hidden by the twisty narrative, nor is anything permitted to be a surprise reveal. The only advantage the out-of-order storytelling gives \u0026#34;We Live in Time\u0026#34; was an avoidance of back-ending the film with all the bummer stuff.\u003c/p\u003e\n\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \u003ch2\u003eShe lives with thyme\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1685569/we-live-in-time-review-andrew-garfield-florence-pugh-movie/\" data-post-title=\"We Live in Time Review: A Sweet, Solid Weepy Drama\" data-slide-num=\"1\" data-post-id=\"1685569\"\u003e\n                                             \u003cpicture id=\"pff4affb64ab697b6607580d453c4b0bd\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/we-live-in-time-review-a-sweet-solid-weepy-drama/she-lives-with-thyme-1728591761.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/we-live-in-time-review-a-sweet-solid-weepy-drama/she-lives-with-thyme-1728591761.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/we-live-in-time-review-a-sweet-solid-weepy-drama/she-lives-with-thyme-1728591761.jpg\" data-slide-url=\"https://www.slashfilm.com/1685569/we-live-in-time-review-andrew-garfield-florence-pugh-movie/\" data-post-id=\"1685569\" data-slide-num=\"1\" data-slide-title=\"We Live in Time Review: A Sweet, Solid Weepy Drama: She lives with thyme\" width=\"780\" height=\"438\" alt=\"We Live in Time\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eA24\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003e\u003cstrong\u003eLuckily, audience may be distracted by the excellent performances by Florence Pugh and Andrew Garfield.\u003c/strong\u003e Pugh in particular grants a lot of subtle complexity to her simpler scenes, revealing gradually that she has a rich inner life, as well as a harrowing inner conflict. She is the one who, once diagnosed with ovarian cancer, begins to practically weigh the benefits of having six, active, non-chemo-heavy months at the end of her life, or twelve months full of treatment and deterioration. She is also the one concerned about her legacy; there\u0026#39;s nothing like a sudden reminder of one\u0026#39;s mortality that forces a person to consider how they might be remembered. Almut, although she knows she may be dying, is still ambitious. \u003c/p\u003e\n\n\u003cp\u003eTobias, meanwhile, is a stuffed shirt. He is keen on becoming a father, but possesses few interests beyond his daughter and his wife. Tobias doesn\u0026#39;t quite fit the standards of \u003ca href=\"https://archive.nerdist.com/editorial-the-flawless-rescue-stud/\" target=\"_blank\"\u003ethe Flawless Rescue Stud\u003c/a\u003e — the fictional male counterbalance \u003ca href=\"https://www.slashfilm.com/569218/almost-penny-lane-manic-pixie-dream-girl-criticism/\" target=\"_blank\"\u003eto the Manic Pixie Dreamgirl\u003c/a\u003e — but he does live to serve Almut. When she is pregnant, he knows to strip naked and climb into the bathtub with her, sporting a four-foot-long tube of Jaffa Cakes. He knows what a woman needs. \u003c/p\u003e\n\u003cp\u003eSmall, moving details are revealed throughout. Tobias, for instance, spends a lot of time with his father (Douglas Hodge), and the two seem to be very close. His mother\u0026#39;s fate is revealed later. Almut has hidden the fact that she had a thriving career in a separate field before becoming a chef, and Tobias wonders why it was kept a secret. When those secrets are revealed, however, they\u0026#39;re not large, mind-blowing, or narrative-altering. They merely enrich an already down-to-earth, relatable story. \u003c/p\u003e\n\n\u003cp\u003eAs mentioned above, it\u0026#39;s refreshingly direct.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \u003ch2\u003eGimmickry, and lack thereof\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1685569/we-live-in-time-review-andrew-garfield-florence-pugh-movie/\" data-post-title=\"We Live in Time Review: A Sweet, Solid Weepy Drama\" data-slide-num=\"2\" data-post-id=\"1685569\"\u003e\n                                             \u003cpicture id=\"pd2b577c0a59f34e15120fff84d9905c7\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/we-live-in-time-review-a-sweet-solid-weepy-drama/gimmickry-and-lack-thereof-1728591761.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/we-live-in-time-review-a-sweet-solid-weepy-drama/gimmickry-and-lack-thereof-1728591761.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/we-live-in-time-review-a-sweet-solid-weepy-drama/gimmickry-and-lack-thereof-1728591761.jpg\" data-slide-url=\"https://www.slashfilm.com/1685569/we-live-in-time-review-andrew-garfield-florence-pugh-movie/\" data-post-id=\"1685569\" data-slide-num=\"2\" data-slide-title=\"We Live in Time Review: A Sweet, Solid Weepy Drama: Gimmickry, and lack thereof\" width=\"780\" height=\"438\" alt=\"We Live in Time\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eA24\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003e\u003cstrong\u003eCrowley may be telling a melodramatic story, but he studiously avoids sentimentality.\u003c/strong\u003e This is not a schmaltzy, everything-sparkles-all-the-time romance in the mold of Richard Curtis (\u0026#34;Love, Actually\u0026#34;), and it mostly plays fair with its larger, romantic moments; although they may be gently thrown, there are no cheap shots. He also mercifully doesn\u0026#39;t get hung-up on dreary, domestic cancer emotionalism like in, say, \u0026#34;Stepmom.\u0026#34; There are tears, but they are organic. One can credit Garfield, but mostly Pugh, for giving \u0026#34;We Live in Time\u0026#34; a great deal of its relatable humanity. \u003c/p\u003e\n\n\u003cp\u003eThere is, however, a distinct lack of grounded realism in \u0026#34;We Live in Time.\u0026#34; The gimmick of the editing leaves it feeling more like a construct than an organic outcropping of the story. I suppose there is a thematic undercurrent of \u0026#34;time running out\u0026#34; — it is a tale of mortality after all — but it\u0026#39;s not as important a theme as living together, loving together, and weathering the difficulties. If anything, \u0026#34;We Live in Time\u0026#34; is more about leaving a mark, creating important memories, and having complete agency over the way your life is to be defined. \u0026#34;We Live in Memory,\u0026#34; however, doesn\u0026#39;t have quite the same punch. \u003c/p\u003e\n\u003cp\u003eCrowley previously made stirring dramas like \u0026#34;Boy A,\u0026#34; also starring Garfield, as well as the blissfully moving \u0026#34;Brooklyn\u0026#34; in 2015, which was nominated for three Academy Awards. Crowley, however, also helmed clunky thrillers like \u0026#34;Closed Circuit\u0026#34; \u003ca href=\"https://www.slashfilm.com/568971/the-goldfinch-review/\" target=\"_blank\"\u003eand the critically panned \u0026#34;The Goldfinch.\u0026#34;\u003c/a\u003e With \u0026#34;We Live in Time,\u0026#34; he is playing to both sides, as it were, telling a story of emotional heft, but replete with the slick style of a high-end Hollywood drama. The style was unnecessary, but the hefty elements were enough to elicit sniffles. \u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003e/Film rating: 8 out of 10\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u0026#34;We Live in Time\u0026#34; opens in theaters on October 11, 2024.\u003c/em\u003e\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-10-10T20:41:25Z",
  "modifiedTime": "2024-10-10T20:41:25Z"
}
