{
  "id": "9c4bbfee-05c7-453d-a669-b8088e9d32ad",
  "title": "Why Julian Glover's Grand Maester Pycelle Left Game Of Thrones",
  "link": "https://www.slashfilm.com/1805843/why-julian-glover-grand-maester-pycelle-left-game-of-thrones/",
  "description": "Here's why Julian Glover asked for his scheming Grand Maester Pycelle character to go when he did on HBO's Game of Thrones.",
  "author": "Valerie Ettenhofer",
  "published": "Sat, 22 Mar 2025 22:45:00 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Drama Shows",
    "Fantasy Shows"
  ],
  "byline": "Valerie Ettenhofer",
  "length": 4697,
  "excerpt": "Why did Grand Maester Pycelle leave Game of Thrones? Because Julian Glover asked for his scheming character to be written off the show.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slash-film-favicon-448x448.png",
  "text": "HBO Julian Glover is probably one of the only actors who asked to be killed off of \"Game of Thrones.\" Glover admitted as much at Montreal Comic Con in 2018 (per ScreenHub), explaining that he wanted his Grand Maester Pycelle to bite the bullet before his season 6 demise. A vital character in George R.R. Martin's \"A Song of Ice And Fire\" series, on screen Pycelle became one of the most extraneous background players as the HBO adaptation wore on. \"I didn't want to do [season 6] because I realized I was being completely dismissed as a character,\" Glover told IGN ahead of the fantasy series' ending. Speaking of Lena Headey's character, he recalled: \"Cersei ticked me off all the time, and I never had any comeback. So that wasn't any fun to play.\" The actor made a similar statement at the aforementioned pop culture convention, reportedly explaining that his character in the TV show never really went anywhere and he became bored of playing a tired, elderly man who spent most of his time fuming at Cersei. The man behind Maester Pycelle got bored with his character HBO Glover is right that Pycelle became a wallflower in the overcrowded series' massive cast of characters, but the Maester plays a pivotal role in both Martin's version of the story and David Benioff and D.B. Weiss' ambitious, messy TV show. Pycelle was, after all, one of the men who whispered in the ear of the Mad King Aerys, leading to the Sacking of King's Landing. As a master of poisons, he was also behind some of the series' biggest and most merciless power shifts. Yet due to his age, Pycelle was often portrayed in the TV series as an old guard opposite younger schemers like Aidan Gillan's Littlefinger and Conleth Hill's Lord Varys. By season 6, it was clear that it was time for Pycelle to go. The veteran performer told IGN that he spoke to the showrunners ahead of season 6, saying, \"Look, I don't want to do this anymore, it's not interesting to go on doing this and go on doing this, and what's going to happen to him?\" In response, they pitched him a \"wonderful scene.\" Glover, as was typical for the show's cast, wasn't privy to the details of the scene ahead of time, but he ended up loving the result. The actor has called it a \"damn good scene,\" telling the outlet that it \"is exactly the sort of way I wanted to go out.\" In the show's season 6 finale, Pycelle gets lured to what Glover calls \"this awful cell-like, prison-like atmosphere,\" where he gets stabbed to death by the creepy kid spies operating under Qyburn's (Anton Lesser) command. Glover is proud of how his death scene turned out HBO \"The actual death scene itself was so cunningly contrived,\" Glover told interviewers, noting the \"wonderful irony\" that the oldest character on the show was killed off by a bunch of kids. In Martin's \"A Dance With Dragons,\" it's Varys who kills Pycelle in support of the Lannisters, and his death scene is brutal in a different way. One of the last things his ally Kevan (Ian Gelder in the TV show) sees before he's also killed is Pycelle's corpse, leaking blood onto a book he was reading before death while \"all around his candle were bits of bone and brain, islands in a lake of melted wax.\" It's a memorable, gory death scene in a franchise full of them. That image is haunting and gnarly, but the scene Glover shot was more action-packed. The actor noted that it had to be shot in one take due to all the fake blood, and he had to nail a stunt fall after the kid attackers overwhelmed Pycelle. \"And I did get it in one and then that was very satisfactory, and I was very happy to say goodbye to people on that particular moment,\" he told IGN. Glover was smart to ask for an out, even if his character was set to die at some point anyway. The final season of \"Game of Thrones\" was poorly received, while he went on to appear in acclaimed shows and films like \"Inside No. 9,\" \"The Crown,\" and Todd Field's \"Tár.\"",
  "image": "https://www.slashfilm.com/img/gallery/why-julian-glovers-grand-maester-pycelle-left-game-of-thrones/l-intro-1741364604.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n    \n                \u003cdiv\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1805843/why-julian-glover-grand-maester-pycelle-left-game-of-thrones/\" data-post-title=\"Why Julian Glover\u0026#39;s Grand Maester Pycelle Left Game Of Thrones\" data-slide-num=\"0\" data-post-id=\"1805843\"\u003e\n                                             \u003cpicture id=\"pc4c1c635e79a9e997d519722f61a686b\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-julian-glovers-grand-maester-pycelle-left-game-of-thrones/intro-1741364604.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-julian-glovers-grand-maester-pycelle-left-game-of-thrones/intro-1741364604.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/why-julian-glovers-grand-maester-pycelle-left-game-of-thrones/intro-1741364604.jpg\" data-slide-url=\"https://www.slashfilm.com/1805843/why-julian-glover-grand-maester-pycelle-left-game-of-thrones/\" data-post-id=\"1805843\" data-slide-num=\"0\" data-slide-title=\"Why Julian Glover\u0026#39;s Grand Maester Pycelle Left Game Of Thrones: \" width=\"780\" height=\"438\" alt=\"Julian Glover\u0026#39;s Maester Pycelle addresses someone whose back is to the camera in Game of Thrones\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eHBO\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eJulian Glover is probably one of the only actors who asked to be killed off of \u0026#34;Game of Thrones.\u0026#34; Glover admitted as much at Montreal Comic Con in 2018 (\u003ca href=\"https://screenhub.blog/2018/07/12/montreal-comiccon-q-and-a-with-game-of-thrones-star-wars-actor-julian-glover-screenhub-entertainment/\" target=\"_blank\"\u003eper ScreenHub\u003c/a\u003e), explaining that he wanted his Grand Maester Pycelle to bite the bullet before his season 6 demise. A vital character in George R.R. Martin\u0026#39;s \u0026#34;A Song of Ice And Fire\u0026#34; series, on screen Pycelle became one of the most extraneous background players as the HBO adaptation wore on.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u0026#34;I didn\u0026#39;t want to do [season 6] because I realized I was being completely dismissed as a character,\u0026#34; Glover \u003ca href=\"https://www.ign.com/articles/2019/04/10/maester-pycelle-julian-glover-when-i-died-on-game-of-thrones\" target=\"_blank\"\u003etold IGN\u003c/a\u003e ahead of the fantasy series\u0026#39; ending. Speaking of Lena Headey\u0026#39;s character, he recalled: \u0026#34;Cersei ticked me off all the time, and I never had any comeback. So that wasn\u0026#39;t any fun to play.\u0026#34; The actor made a similar statement at the aforementioned pop culture convention, reportedly explaining that his character in the TV show never really went anywhere and he became bored of playing a tired, elderly man who spent most of his time fuming at Cersei.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eThe man behind Maester Pycelle got bored with his character\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1805843/why-julian-glover-grand-maester-pycelle-left-game-of-thrones/\" data-post-title=\"Why Julian Glover\u0026#39;s Grand Maester Pycelle Left Game Of Thrones\" data-slide-num=\"1\" data-post-id=\"1805843\"\u003e\n                                             \u003cpicture id=\"p6d08cd6995faf824280eff1688dcbf78\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-julian-glovers-grand-maester-pycelle-left-game-of-thrones/the-man-behind-maester-pycelle-got-bored-with-his-character-1741364604.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-julian-glovers-grand-maester-pycelle-left-game-of-thrones/the-man-behind-maester-pycelle-got-bored-with-his-character-1741364604.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/why-julian-glovers-grand-maester-pycelle-left-game-of-thrones/the-man-behind-maester-pycelle-got-bored-with-his-character-1741364604.jpg\" data-slide-url=\"https://www.slashfilm.com/1805843/why-julian-glover-grand-maester-pycelle-left-game-of-thrones/\" data-post-id=\"1805843\" data-slide-num=\"1\" data-slide-title=\"Why Julian Glover\u0026#39;s Grand Maester Pycelle Left Game Of Thrones: The man behind Maester Pycelle got bored with his character\" width=\"780\" height=\"438\" alt=\"Julian Glover\u0026#39;s Maester Pycelle holds up a necklace in Game of Thrones\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eHBO\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eGlover is right that Pycelle became a wallflower in the overcrowded series\u0026#39; massive cast of characters, but the Maester plays a pivotal role in both Martin\u0026#39;s version of the story and David Benioff and D.B. Weiss\u0026#39; ambitious, messy TV show. Pycelle was, after all, one of the men who whispered in the ear of the Mad King Aerys, leading to the Sacking of King\u0026#39;s Landing. As a master of poisons, he was also behind some of the series\u0026#39; biggest and most merciless power shifts. Yet due to his age, Pycelle was often portrayed in the TV series as an old guard opposite younger schemers like Aidan Gillan\u0026#39;s Littlefinger and Conleth Hill\u0026#39;s Lord Varys. By season 6, it was clear that it was time for Pycelle to go.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eThe veteran performer told IGN that he spoke to the showrunners ahead of season 6, saying, \u0026#34;Look, I don\u0026#39;t want to do this anymore, it\u0026#39;s not interesting to go on doing this and go on doing this, and what\u0026#39;s going to happen to him?\u0026#34; In response, they pitched him a \u0026#34;wonderful scene.\u0026#34; Glover, as was typical for the show\u0026#39;s cast, wasn\u0026#39;t privy to the details of the scene ahead of time, but he ended up loving the result. The actor has called it a \u0026#34;damn good scene,\u0026#34; telling the outlet that it \u0026#34;is exactly the sort of way I wanted to go out.\u0026#34; \u003ca href=\"https://www.slashfilm.com/545032/game-of-thrones-season-6-finale-recap/\" target=\"_blank\"\u003eIn the show\u0026#39;s season 6 finale\u003c/a\u003e, Pycelle gets lured to what Glover calls \u0026#34;this awful cell-like, prison-like atmosphere,\u0026#34; where he gets stabbed to death by the creepy kid spies operating under Qyburn\u0026#39;s (Anton Lesser) command.\u003c/p\u003e\n\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eGlover is proud of how his death scene turned out\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1805843/why-julian-glover-grand-maester-pycelle-left-game-of-thrones/\" data-post-title=\"Why Julian Glover\u0026#39;s Grand Maester Pycelle Left Game Of Thrones\" data-slide-num=\"2\" data-post-id=\"1805843\"\u003e\n                                             \u003cpicture id=\"pb27932293160ef70caf7399be623dd52\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-julian-glovers-grand-maester-pycelle-left-game-of-thrones/glover-is-proud-of-how-his-death-scene-turned-out-1741364605.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-julian-glovers-grand-maester-pycelle-left-game-of-thrones/glover-is-proud-of-how-his-death-scene-turned-out-1741364605.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/why-julian-glovers-grand-maester-pycelle-left-game-of-thrones/glover-is-proud-of-how-his-death-scene-turned-out-1741364605.jpg\" data-slide-url=\"https://www.slashfilm.com/1805843/why-julian-glover-grand-maester-pycelle-left-game-of-thrones/\" data-post-id=\"1805843\" data-slide-num=\"2\" data-slide-title=\"Why Julian Glover\u0026#39;s Grand Maester Pycelle Left Game Of Thrones: Glover is proud of how his death scene turned out\" width=\"780\" height=\"438\" alt=\"Julian Glover\u0026#39;s Maester Pycelle looks at a figure in the darkness in Game of Thrones\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eHBO\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003e\u0026#34;The actual death scene itself was so cunningly contrived,\u0026#34; Glover told interviewers, noting the \u0026#34;wonderful irony\u0026#34; that the oldest character on the show was killed off by a bunch of kids. In Martin\u0026#39;s \u0026#34;A Dance With Dragons,\u0026#34; it\u0026#39;s Varys who kills Pycelle in support of the Lannisters, and his death scene is brutal in a different way. One of the last things his ally Kevan (Ian Gelder in the TV show) sees before he\u0026#39;s also killed is Pycelle\u0026#39;s corpse, leaking blood onto a book he was reading before death while \u0026#34;all around his candle were bits of bone and brain, islands in a lake of melted wax.\u0026#34; \u003ca href=\"https://www.slashfilm.com/1140768/the-most-brutal-deaths-in-game-of-thrones/\" target=\"_blank\"\u003eIt\u0026#39;s a memorable, gory death scene in a franchise full of them\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eThat image is haunting and gnarly, but the scene Glover shot was more action-packed. The actor noted that it had to be shot in one take due to all the fake blood, and he had to nail a stunt fall after the kid attackers overwhelmed Pycelle. \u0026#34;And I did get it in one and then that was very satisfactory, and I was very happy to say goodbye to people on that particular moment,\u0026#34; he told IGN. Glover was smart to ask for an out, even if his character was set to die at some point anyway. The \u003ca href=\"https://www.slashfilm.com/566490/game-of-thrones-final-season-problems/\" target=\"_blank\"\u003efinal season of \u0026#34;Game of Thrones\u0026#34; was poorly received\u003c/a\u003e, while he went on to appear in acclaimed shows and films like \u0026#34;Inside No. 9,\u0026#34; \u0026#34;The Crown,\u0026#34; and Todd Field\u0026#39;s \u0026#34;Tár.\u0026#34;\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-03-22T22:45:00Z",
  "modifiedTime": "2025-03-22T22:45:00Z"
}
