{
  "id": "9dbb2b75-e7fe-48c6-9023-e6a0babd6f69",
  "title": "Gracie Abrams’ ‘That’s So True’ Looks Poised to Break the Logjam at the Top of the Charts — and She Says Its Success ‘Makes My Heart Crack Open and Grow Ten Sizes’",
  "link": "https://variety.com/2024/music/news/gracie-abrams-thats-so-true-charts-hot-100-spotify-1236211919/",
  "description": "When Gracie Abrams opens the final dates on Taylor Swift’s Eras Tour in Canada in early December, fans may be putting in even more of an effort than usual to arrive early. By then, Abrams could have something that no opening act for Swift could previously claim over the tour’s nearly two-year run: a No. […]",
  "author": "Chris Willman",
  "published": "Sat, 16 Nov 2024 00:22:51 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Eras Tour",
    "Gracie Abrams",
    "Interscope Geffen A\u0026M",
    "Taylor Swift"
  ],
  "byline": "Chris Willman",
  "length": 9301,
  "excerpt": "Gracie Abrams is 'grateful and in disbelief' at how 'That's So True' quickly rose to No. 1 on the Spotify chart, with others possibly to follow.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "When Gracie Abrams opens the final dates on Taylor Swift‘s Eras Tour in Canada in early December, fans may be putting in even more of an effort than usual to arrive early. By then, Abrams could have something that no opening act for Swift could previously claim over the tour’s nearly two-year run: a No. 1 U.S. single at the time she is doing those dates. Abrams’ “That’s So True” is turning out to be such a fast and unexpected hitthat many believe it stands a strong chance of rising to the top of the Hot 100 in the coming weeks, finally dethroning Shaboozey’s seemingly indomitable “A Bar Song (Tipsy).” But even if it should ultimately falls a little shy of that mark, it’s already a certifiable smash by several measures. It’s topped the Spotify Top 50 USA streaming chart on a daily basis for more than a week running now, and has been a steady firmament in the top 5 of Spotify’s global chart, too. And as of this week, the tune became Abrams’ first No. 1 song in the U.K. “It’s nuts,” Abrams tells Variety. “The concept of even one person anywhere in the world liking the song as much as I do makes my heart crack open and then grow ten sizes. I’m grateful and I’m in disbelief.”  Popular on Variety Here’s what’s also so true: Virtually no one else quite saw success of this magnitude coming so quickly for this song, either. Abrams has certainly had a successful run as a young artist, and made it as high as No. 2 on the Billboard 200 album chart, but her highest-charting single to date — just a few weeks ago — was “I Love You, I’m Sorry,” which peaked at a pretty good No. 19. There was little pause to gather reinforcements after that before “That’s So True” suddenly began tromping its way toward the top of all these rankings. The song’s success has also driven the deluxe version of her “The Secret of Us” album back into the top 5 in the U.S. “That’s So True” was one of four new songs added to the expanded edition that came out only about a month ago, hitting the streets Oct. 18. Is Abrams herself at all surprised that it was a so-called bonus track that looks like it’s the one for her, or was this part of a long-planned master strategy? “It doesn’t seem weird for it to have been a deluxe track necessarily, but the entire situation is blowing my mind,” she says. “I can’t wrap my head around the fact that ‘That’s So True’ is having the life that it is right now… I can very confidently admit that it wasn’t some master plan. This song fell into the deluxe bucket because we didn’t finish writing it until after I had already turned in the standard edition of the album.” If “That’s So True” does go to No. 1 on the Hot 100, or even enter the top 5, which seems like a safe bet, it will come as a relief to veteran chartwatchers, who’ve had good reason to become bored with the static upper ranks of the chart. Looking at the current rankings, no song in the top 6 singles has been on the chart for fewer than 12 weeks, and most have been there for 25-30 weeks (or 65, in the case of Teddy Swims’ “Lose Control”). Until Abrams can bust up that logjam, it will continue to be as if the chart got frozen in amber some time in the summer. “That’s So True,” which is at No. 13 as of this writing, may only be in its third week on the chart, but an important factor here is that Abrams’ hardcore fans were high on it well before the single or deluxe album even came out. Abrams had played the song live repeatedly at her late summer headlining shows (like her three-night stand at L.A.’s Greek). Although the conventional wisdom has often been in recent years that surprising all the fans at once with a midnight-Thursday release is the way to go, Abrams is proving anew that letting live versions of an unreleased song pick up some simmering power can be at least as savvy a release strategy, at least when the song is right. Says Sam Riback, Interscope Geffen A\u0026M’s co-president and head of pop/rock A\u0026R, “We knew it was a key song and that’s why it was like the key focus track of the deluxe. Did we know it was gonna be as big as it was gonna be? No, but we knew it was special and we knew that the fans really loved it when she had teased it in the early days of some of the live shows. I believe one of ’em was even back when she was like doing a little European run. After that the fans knew every word and the connection to that song we knew was special.” And yet… she wasn’t lying; it wasn’t done. “In that moment,” Riback says, “we just kind of think, OK, when the time’s right and she feels like she has a production of it that she’s happy with — because it definitely went through some versions of production — we’ll find the right moment to showcase it. And the timing of the deluxe was really just kind of when everything came together creatively, when she felt like she had the right production of that song and some of the others.” Riback adds that giving fans a live sneak preview well in advance “creates that just uniquely special bond she has with her fan base where they feel like they get to hear it first. They’re in on it first, before the passive fan may or may not hear it on a playlist. It’s part of the way Gracie is always communicating to her fans via teasing songs on socials or workshopping stuff or playing stuff live. To me, that back and forth dialogue that she has with her fans creates this special bond that they’re all in this together, so when it does come out on a Spotify and it does hit No. 1 on the global charts, her fans are already like, ‘Yeah, duh, I’ve been at this party already'” — but are still taking a rooting interest in getting everyone else in the door. The standard edition of the album came out in July, so there was a three-month gap before the deluxe hit… versus the matter of waiting just a few days or even just a few hours for a deluxe that has almost come to be the norm now. “I do see some artists do a deluxe immediately after, and I don’t know — that strategy I guess can work,” Riback says, “but I think I really like spacing. If you know you have songs that you really want to capture a specific moment, I really like to elongate that as much as possible.” The growth has been substantial during the track’s short official run: Spotify says there was an 80% pickup in streams during the week of Nov. 5-12. Michelle An, IGA’s co-president and head of creative strategy, has worked with Abrams for the five years since she released her first music through the label. “It’s always sort of first and foremost been about Gracie as a songwriter,” An says. “I think that fans have always connected with Gracie and her lyrics, and then when she’s communicating with her fans on socials, even though it’s being viewed by hundreds of thousands and millions of people, it feels like a one-on-one or giggle that you’re having with your best friend. So I think it’s just brick by brick with the original fans that bought in, and ias it keeps growing bigger and bigger and bigger, it still feels one-on-one.” Interestingly, there is no elaborate music video for “That’s So True” — just the same so-called lyric video there is for the other three new tracks from the deluxe. These songs play over a repeating loop of a closeup of Abrams mouthing the song titles in question. It helps in keeping things that simple and low-budget that fans just really, really like Abrams’ mouth, often commenting on their adoration of the small gap in her teeth, and show no signs of getting tired of that recurring, low-concept closeup. “Gracie has this amazing ability to make the minimal feel really elevated,” An ays. Very few songs that reach the top of the Spotify charts nowadays — and potentially No. 1 on the Hot 100 — start with the sound of a strumming guitar, but that’s so Gracie. Some fans immediately likened “That’s So True” when they first heard it to the song “Risk,” which was the first single off the standard version of the album. (And that was a point in its favor, even if the song wasn’t a major hit with the general public.) “I think they compare it to ‘Risk’ because of the strumming pattern,” Abrams says. “The chords are in the same world, but it’s the strumming pattern that I personally found myself writing with a lot over the past year. Something rhythmic and catchy about it. I like that it feels percussive on its own. Maybe that’s what they’re hearing and feeling into, also.” One more thing Abrams has in common with Swift, besides being besties and recurring tourmates: they’re both famous for bringing the bridge back. Look at the comments for “That’s So True” and you’ll certainly find many that enthuse over the bridge being the best part of the song. “”Gracie builds bridges better than specialized engineers,” quipped one fan on the song’s YouTube page. “First of all, thank you for saying that,” Abrams says when that comment and others like it are brought to her attention. “I believe that bridges are 100% underrated. They are most of the time my favorite piece to write, and any opportunity to hammer in the intensity of a feeling in a song is the dream of my life. I get so thrilled when the fans react to them the way they have with ‘That’s So True.'”",
  "image": "https://variety.com/wp-content/uploads/2024/11/Lead-Press-Photo-Abby-Waisler-e1731712139556.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tWhen \u003ca href=\"https://variety.com/t/gracie-abrams/\" id=\"auto-tag_gracie-abrams\" data-tag=\"gracie-abrams\"\u003eGracie Abrams\u003c/a\u003e opens the final dates on \u003ca href=\"https://variety.com/t/taylor-swift/\" id=\"auto-tag_taylor-swift\" data-tag=\"taylor-swift\"\u003eTaylor Swift\u003c/a\u003e‘s \u003ca href=\"https://variety.com/t/eras-tour/\" id=\"auto-tag_eras-tour\" data-tag=\"eras-tour\"\u003eEras Tour\u003c/a\u003e in Canada in early December, fans may be putting in even more of an effort than usual to arrive early. By then, Abrams could have something that no opening act for Swift could previously claim over the tour’s nearly two-year run: a No. 1 U.S. single at the time she is doing those dates.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAbrams’ “That’s So True” is turning out to be such a fast and unexpected hitthat many believe it stands a strong chance of rising to the top of the Hot 100 in the coming weeks, finally dethroning Shaboozey’s seemingly indomitable “A Bar Song (Tipsy).” But even if it should ultimately falls a little shy of that mark, it’s already a certifiable smash by several measures. It’s topped the Spotify Top 50 USA streaming chart on a daily basis for more than a week running now, and has been a steady firmament in the top 5 of Spotify’s global chart, too. And as of this week, the tune became Abrams’ first No. 1 song in the U.K. \n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\t“It’s nuts,” Abrams tells \u003cem\u003eVariety\u003c/em\u003e. “The concept of even one person anywhere in the world liking the song as much as I do makes my heart crack open and then grow ten sizes. I’m grateful and I’m in disbelief.” \n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tHere’s what’s also so true: Virtually no one else quite saw success of this magnitude coming so quickly for this song, either. Abrams has certainly had a successful run as a young artist, and made it as high as No. 2 on the Billboard 200 album chart, but her highest-charting single to date — just a few weeks ago — was “I Love You, I’m Sorry,” which peaked at a pretty good No. 19. There was little pause to gather reinforcements after that before “That’s So True” suddenly began tromping its way toward the top of all these rankings. The song’s success has also driven the deluxe version of her “The Secret of Us” album back into the top 5 in the U.S.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“That’s So True” was one of four new songs added to the expanded edition that came out only about a month ago, hitting the streets Oct. 18. Is Abrams herself at all surprised that it was a so-called bonus track that looks like it’s \u003cem\u003ethe one\u003c/em\u003e for her, or was this part of a long-planned master strategy?\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“It doesn’t seem weird for it to have been a deluxe track necessarily, but the entire situation is blowing my mind,” she says. “I can’t wrap my head around the fact that ‘That’s So True’ is having the life that it is right now… I can very confidently admit that it wasn’t some master plan. This song fell into the deluxe bucket because we didn’t finish writing it until after I had already turned in the standard edition of the album.”\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tIf “That’s So True” does go to No. 1 on the Hot 100, or even enter the top 5, which seems like a safe bet, it will come as a relief to veteran chartwatchers, who’ve had good reason to become bored with the static upper ranks of the chart. Looking at the current rankings, no song in the top 6 singles has been on the chart for fewer than 12 weeks, and most have been there for 25-30 weeks (or 65, in the case of Teddy Swims’ “Lose Control”). Until Abrams can bust up that logjam, it will continue to be as if the chart got frozen in amber some time in the summer.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“That’s So True,” which is at No. 13 as of this writing, may only be in its third week on the chart, but an important factor here is that Abrams’ hardcore fans were high on it well before the single or deluxe album even came out. Abrams had played the song live repeatedly at her late summer headlining shows (like her three-night stand at L.A.’s Greek). Although the conventional wisdom has often been in recent years that surprising all the fans at once with a midnight-Thursday release is the way to go, Abrams is proving anew that letting live versions of an unreleased song pick up some simmering power can be at least as savvy a release strategy, at least when the song is right.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSays Sam Riback, Interscope Geffen A\u0026amp;M’s co-president and head of pop/rock A\u0026amp;R, “We knew it was a key song and that’s why it was like the key focus track of the deluxe. Did we know it was gonna be as big as it was gonna be? No, but we knew it was special and we knew that the fans really loved it when she had teased it in the early days of some of the live shows. I believe one of ’em was even back when she was like doing a little European run. After that the fans knew every word and the connection to that song we knew was special.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAnd yet… she wasn’t lying; it wasn’t done. “In that moment,” Riback says, “we just kind of think, OK, when the time’s right and she feels like she has a production of it that she’s happy with — because it definitely went through some versions of production — we’ll find the right moment to showcase it. And the timing of the deluxe was really just kind of when everything came together creatively, when she felt like she had the right production of that song and some of the others.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tRiback adds that giving fans a live sneak preview well in advance “creates that just uniquely special bond she has with her fan base where they feel like they get to hear it first. They’re in on it first, before the passive fan may or may not hear it on a playlist. It’s part of the way Gracie is always communicating to her fans via teasing songs on socials or workshopping stuff or playing stuff live. To me, that back and forth dialogue that she has with her fans creates this special bond that they’re all in this together, so when it does come out on a Spotify and it does hit No. 1 on the global charts, her fans are already like, ‘Yeah, duh, I’ve been at this party already\u0026#39;” — but are still taking a rooting interest in getting everyone else in the door.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tThe standard edition of the album came out in July, so there was a three-month gap before the deluxe hit… versus the matter of waiting just a few days or even just a few hours for a deluxe that has almost come to be the norm now. “I do see some artists do a deluxe immediately after, and I don’t know — that strategy I guess can work,” Riback says, “but I think I really like spacing. If you know you have songs that you really want to capture a specific moment, I really like to elongate that as much as possible.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe growth has been substantial during the track’s short official run: Spotify says there was an 80% pickup in streams during the week of Nov. 5-12.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tMichelle An, IGA’s co-president and head of creative strategy, has worked with Abrams for the five years since she released her first music through the label. “It’s always sort of first and foremost been about Gracie as a songwriter,” An says. “I think that fans have always connected with Gracie and her lyrics, and then when she’s communicating with her fans on socials, even though it’s being viewed by hundreds of thousands and millions of people, it feels like a one-on-one or giggle that you’re having with your best friend. So I think it’s just brick by brick with the original fans that bought in, and ias it keeps growing bigger and bigger and bigger, it still feels one-on-one.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tInterestingly, there is no elaborate music video for “That’s So True” — just the same so-called lyric video there is for the other three new tracks from the deluxe. These songs play over a repeating loop of a closeup of Abrams mouthing the song titles in question. It helps in keeping things that simple and low-budget that fans just really, really like Abrams’ mouth, often commenting on their adoration of the small gap in her teeth, and show no signs of getting tired of that recurring, low-concept closeup.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Gracie has this amazing ability to make the minimal feel really elevated,” An ays.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Gracie Abrams - That’s So True (Official Lyric Video)\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/BDHM8cyJQa8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tVery few songs that reach the top of the Spotify charts nowadays — and potentially No. 1 on the Hot 100 — start with the sound of a strumming guitar, but that’s so Gracie. Some fans immediately likened “That’s So True” when they first heard it to the song “Risk,” which was the first single off the standard version of the album. (And that was a point in its favor, even if the song wasn’t a major hit with the general public.)\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“I think they compare it to ‘Risk’ because of the strumming pattern,” Abrams says. “The chords are in the same world, but it’s the strumming pattern that I personally found myself writing with a lot over the past year. Something rhythmic and catchy about it. I like that it feels percussive on its own. Maybe that’s what they’re hearing and feeling into, also.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tOne more thing Abrams has in common with Swift, besides being besties and recurring tourmates: they’re both famous for bringing the bridge back. Look at the comments for “That’s So True” and you’ll certainly find many that enthuse over the bridge being the best part of the song. “”Gracie builds bridges better than specialized engineers,” quipped one fan on the song’s YouTube page.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t“First of all, thank you for saying that,” Abrams says when that comment and others like it are brought to her attention. “I believe that bridges are 100% underrated. They are most of the time my favorite piece to write, and any opportunity to hammer in the intensity of a feeling in a song is the dream of my life. I get so thrilled when the fans react to them the way they have with ‘That’s So True.\u0026#39;”\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"That’s So True (Live From Radio City Music Hall)\" width=\"500\" height=\"375\" src=\"https://www.youtube.com/embed/iw37feGoAiY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-11-16T00:22:51Z",
  "modifiedTime": "2024-11-16T00:29:06Z"
}
