{
  "id": "a1680365-264b-4b5e-8812-d0fb31e993e8",
  "title": "‘Pod Save The UK’s Nish Kumar On Invading Canada, Breaking America, Trump, Elon Musk, \u0026 Comedy Traversing The Globe",
  "link": "https://deadline.com/2025/03/nish-kumar-trump-pod-save-the-uk-interview-1236352745/",
  "description": "“We live in the stupidest possible version of human history,” said Nish Kumar to a roaring packed Largo at the Coronet in LA last week, perfectly summing up 2025 so far. Cited as one of the 50 best comedians of the 21st century by the UK’s The Guardian and the subject of a recent New […]",
  "author": "Dominic Patten",
  "published": "Sat, 29 Mar 2025 00:08:01 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "News",
    "Politics",
    "After Midnight",
    "CAA",
    "Comedy",
    "Crooked Media",
    "Donald Trump",
    "Elon Musk",
    "Quibi"
  ],
  "byline": "Dominic Patten",
  "length": 12972,
  "excerpt": "Nish Kumar jumped over the pond for his latest tour, \u0026 the Pod Save the UK co-host isn't here to play nice",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "“We live in the stupidest possible version of human history,” said Nish Kumar to a roaring packed Largo at the Coronet in LA last week, perfectly summing up 2025 so far. Cited as one of the 50 best comedians of the 21st century by the UK’s The Guardian and the subject of a recent New York Times profile that raised his American profile considerably, After Midnight alum Kumar’s relentless shiving and mocking of pompous and populist politicians was on full display on March 20 in those back-to-back shows at the iconic venue on La Cienega Blvd. From Donald Trump and MAGA authoritarianism, UK right winger Nigel Farage (“if gout was a guy”) and race riots, and how horrible Kash Patel and Rishi Sunak are, Kumar raged against the moronic and self-declared messiahs. There was also material on his mother’s obsession with Princess Diana, woke scolding, the return of Nazis to public life, and the Russian invasion of Ukraine, but the co-host of Crooked Media’s Pod Save the UK (with journalist Coco Khan) saved special vinegar for Elon Musk. To Kumar, DOGE chief Musk is, among other lows, a “man so congenitally unpleasant he is fighting a daily battle to be named history’s worst white South African.” Watch on Deadline Days later, the former host of the BBC satirical news show The Mash Report days equally  captured the cartoonish and calamitous  Signal app scandal enveloping Trump’s National Security team “Also, you know, I guess we all just need to keep an eye on our own phones, because you might wake up one morning and realize you’ve been added to a text chain that’s talking about plans to invade Canada,” CAA-repped Kumar said. Telling his live audiences that some acquaintances have asked him to lay off the politics and do more traditional stand-up about what is in his fridge, Kumar proved as far from kissing the ring or bending the knee as possible in our increasingly authoritarian era. To that, the comedian inspired by the 1990s barrier shattering Goodness Gracious Me and chatted with me as his North American tour enters its final week, about Trump’s war on Canada, low expectations, that Signal fiasco, breaking America,and his parents fears about crossing the 49th parallel. DEADLINE: Having seen your second show at Largo last week, let me ask you in the interest of non-political comedy: What is in your fridge? NISH KUMAR: (LAUGHS) Well, actually, currently my fridge, the fridge that I’m most closest to, is in a hotel room. So, I guess currently what’s in my fridge is, I imagine, some incredibly expensive soft drinks DEADLINE: Now we have that out of the way, you have been touring a divided North America with a very political stand-up show since late February starting in Toronto. You’re doing two shows in Chicago on Friday and ending this part of the tour in Madison, Wisconsin on March 30. So, what’s the vibe you’re picking up in a continent where everything in Canada and America is sharply political right now? KUMAR: I landed in Toronto on February the 20th, I believe, and it was the week that the hockey games had happened and the Canadians were booing the American national anthem. it was angrier than I thought it was possible for Canadians to be, like Canadians were justifiably furious. So yeah, there was, we kind of landed into the middle of that kind of, like real anger and frustration. And then we were in Toronto, and then Montreal, and then I went into Boston. You know, I’m speaking to a very small, very specific demographic of Americans, but there is a lot of anger and a lot of hurt I think that a lot of American people are feeling right now, and certainly that is true over the boarder as well. DEADLINE: With all that anger, and it is very real, we can all see that, were you worried that your, let’s just say, MAGA critical material could have seen you held up at the boarder coming into the States, and, if so, how do you counter that? KUMAR: I mean, like, the show is the show, you know. I’m not going to change the material. It is what it is. Yeah, that’s what I do. And also, I believe that I’m still doing that in a country whose First Amendment to its Constitution enshrines freedom of speech. So, I believe that I’m still operating under those terms. DEADLINE: That feels like increasingly thin ice to many, especially for someone who doesn’t have white skin … KUMAR: You know, if we’re just being completely and utterly candid here, I have just had a very a conversation with a very, very tense and stressed mother on the phone about the fact that I am re-entering America on Thursday. I’m doing so with a valid O-1 visa, and I’m doing so to go and do pre-book shows with a flight that leaves the following week that takes me to Melbourne to do a run of pre book shows at the Melbourne Comedy Festival. But what’s also true is my parents are incredibly stressed/ They are reading stories about people being grabbed at the border, and they are wondering whether that will happen to me. And that is just that is just a reality of where we are at the moment in the conversation is that people who have all of their paperwork in order are genuinely frightened at the moment. DEADLINE: What are the consequences in your opinion for America in that conversation? KUMAR: Well, if you start really saber rattling, and you make it difficult for people to come into your country, there are economic consequences. Those consequences will be felt by Americans if tourists start being put off coming. There are parts of America that tourism is a huge industry that helps keep the country and keep people employed and keep the country’s economy buoyant. There are also consequences to imposing tariffs on a neighbor with whom you share a land border. Yet, Elon Musk and Donald Trump will not face the consequences of the tariffs. Elon Musk and Donald Trump will not face the consequences of tourists being put off coming to this country because they’re hearing stories that a Canadian actress was detained and without any kind of judicial oversight, put in an immigration detention facility. And the reason I stress Canadian in that instance is that is a white Canadian person. Black and Brown people have long since feared the immigration policies. That is something that has been a part of the fear. But if they’re now doing this to white people, that is something that is something that is going to scare absolutely everybody. Wearing a “Trump Was Right About Everything” hat, Elon Musk looks on as Donald Trump hosts a cabinet meeting in the White House on March 24, 2025 (Photo by Brendan SMIALOWSKI / AFP) (Photo by BRENDAN SMIALOWSKI/AFP via Getty Images) DEADLINE: In the realm of fear, the scandal of the week in the ever-scandalizing Trump administration is National Security Advisor Mike Waltz earlier this month breaking almost every security protocol in the book by adding the editor of the Atlantic Jeffrey Goldberg to a group Signal app chat with Vice-President Vance, the DEI hating Secretary of Defense Pete Hegseth and other top administration officials over plans to bomb Yemen and the Houthi. Then they all denied it, say there was nothing classified on the chat, and, once Goldberg released parts of the military specifics that Hegseth put on the not secure chat, they tried to discredit him by insisting they were “attack plans” not “war plans” and hence no big whoop …. KUMAR: The thing that shocks me about it is, I wouldn’t trust them to organize a group chat.  You know, it’s quite an astonishing thing to understand that they couldn’t work out who was in a Signal group. That is that feels like it should be something that is very deeply worrying to people. And it also does slightly fly in the face of this idea that there’s a lot of rhetoric about we need to get rid of DEI because we need the best and the brightest. Currently, some of the best and the brightest appear to be people that can’t use their phones. So that is something that I think is worth examining and worth considering. Also, you know, I guess we all just need to keep an eye on our own phones, because you might wake up one morning and realize you’ve been added to a text chain that’s talking about plans to invade Canada. DEADLINE: Invasion not being the operative term, between your very short lived Quibi show and your very busy Pod Save the UK duties for Crooked Media, you haven’t toured a lot in the States — so what were your expectations for this tour? KUMAR: (LAUGHS) I thought, listen, let’s just try. Let’s just see what the market is. Let’s see if people will come out. And let’s do comedy clubs, and let’s do these small rooms and see how it goes. DEADLINE: And? KUMAR: And so, my American agents put it all together. And I came at this with truly no expectations outside of the cities that I performed in before, which were Montreal in Canada and Toronto and New York and LA in the States. I was fully prepared to like, take a bath. I was fully like I’m writing off this money. Let’s see how it goes. And then the tickets went on sale, and like, I got a text a day later or something. My partner got a text from her family, a large chunk of whom are Canadians who live in Toronto, saying, Can you add more dates? And that was when we actually looked at the ticket sales and realized that things were sort of filling up. DEADLINE: A good feeling … KUMAR: Yeah! So, we had to add late shows in places like Largo in LA, Vancouver, Toronto, Montreal, and then, Chicago, Seattle, Portland, New York. Suddenly, it was very much like there was a sort of scramble to go. We have not adequately appreciated the demand for ticket, which is the right way round. That’s what you want in your career, and really it’s what I want in my life. I try and approach things with such healthily low expectations that I’m always permanently surprised by any glimmer of success DEADLINE: That’s a line… KUMAR: No really. Keeping on theme, my ambitions for my life and career was so low that my main priority was I would like to be a comedian, and not have to be an office temp at the same time. DEADLINE: Ambition achieved, globally. KUMAR: Then my other ambition beyond that was I wanted to do  a British political show, which I did do for a few years. So that was really exciting. Beyond that, my other ambition, mainly, is just to sort of tour as a comedian. DEADLINE: Well, as Taylor Tomlinson made clear walking away from CBS’ After Midnight, touring and stand-up are the real deal … KUMAR: Yeah, part of touring as a comedian is it opens up the whole world to you. You can see whole different parts of the world, and especially in the advent of high-speed internet, it has created a market, global market for English language stand up across the world.   When I was a kid, the comedian equivalents of someone as big as I am in Britain, which is like, great, very nice, but I’m not like an arena act in Britain. But the idea that someone at my size, who is like, you know, doing 900 to 1000 seat theaters in the UK would be able to come over and tour in America, and that’d be a financially worthwhile thing to do was inconceivable. Like, the only British comedians that actually went to America were, like, the biggest, biggest comedians, you know. So you know, Eddie Izzard, Billy Connolly, then, lately, Ricky Gervais. They were the only people who could come and actually do shows in America. Whereas now, because of the internet, it’s created this whole other substrata of comedy fans who really want to see the more obscure. DEADLINE: So, a few more dates in America, and what’s next? KUMAR: I actually don’t really know, because I’ve been touring so intensely For this tour, I can tell you immediately what’s next, which is, I go straight to Australia and New Zealand. Then I go back to London and I film this show. Then we try and work out what we do with it once we filmed it. After that, I do a bunch of shows at the Edinburgh Fringe Festival in August, and then, at the moment, I genuinely don’t know what is happening next. DEADLINE: Seems like quite a plan. KUMAR: Thanks. You know, I’m not really like one of history’s great long-term planners, due to what my girlfriend, mental health professionals and several audience members have described as a textbook case of ADHD. So, like, that’s not necessarily my forte. So, at the minute, my plan is to film this show. Then I need to edit that show with my friends who make it, and then work out what I do with that show. And then after that, we I’ll be doing more Pods Save the UK. I’ve got September of this year bookmarked to do podcasts in and then I’m really really going to sit on my sofa. Like, really sit on it, really get that ass indentation.",
  "image": "https://deadline.com/wp-content/uploads/2025/03/nish-kumar-cbs-getty-feb-2024.jpg?w=857",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\t“We live in the stupidest possible version of human history,” said Nish Kumar to a roaring packed Largo at the Coronet in LA last week, perfectly summing up 2025 so far. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tCited as one of the 50 best comedians of the 21\u003csup\u003est\u003c/sup\u003e century by the UK’s \u003cem\u003eThe Guardian\u003c/em\u003e and the subject of a recent \u003cem\u003eNew York Times \u003c/em\u003eprofile that raised his American profile considerably,  \u003cem\u003e\u003ca href=\"https://deadline.com/tag/after-midnight/\" id=\"auto-tag_after-midnight\" data-tag=\"after-midnight\"\u003eAfter Midnight\u003c/a\u003e \u003c/em\u003ealum Kumar’s relentless shiving and mocking of pompous and populist politicians was on full display on March 20 in those back-to-back shows at the iconic venue on La Cienega Blvd. From \u003ca href=\"https://deadline.com/tag/donald-trump/\" id=\"auto-tag_donald-trump\" data-tag=\"donald-trump\"\u003eDonald Trump\u003c/a\u003e and MAGA authoritarianism, UK right winger Nigel Farage (“if gout was a guy”) and race riots, and how horrible Kash Patel and Rishi Sunak are, Kumar raged against the moronic and self-declared messiahs. There was also material on his mother’s obsession with Princess Diana, woke scolding, the return of Nazis to public life, and the Russian invasion of Ukraine, but the co-host of \u003ca href=\"https://deadline.com/tag/crooked-media/\" id=\"auto-tag_crooked-media\" data-tag=\"crooked-media\"\u003eCrooked Media\u003c/a\u003e’s\u003cem\u003e Pod Save the UK\u003c/em\u003e (with journalist Coco Khan) saved special vinegar for \u003ca href=\"https://deadline.com/tag/elon-musk/\" id=\"auto-tag_elon-musk\" data-tag=\"elon-musk\"\u003eElon Musk\u003c/a\u003e.\n\n\t\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\n\tTo Kumar, DOGE chief Musk is, among other lows, a “man so congenitally unpleasant he is fighting a daily battle to be named history’s worst white South African.”\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234771711\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tDays later, the former host of the BBC satirical news show\u003cem\u003e The Mash Report \u003c/em\u003edays equally  captured the cartoonish and calamitous  Signal app scandal enveloping Trump’s National Security team “Also, you know, I guess we all just need to keep an eye on our own phones, because you might wake up one morning and realize you’ve been added to a text chain that’s talking about plans to invade Canada,” \u003ca href=\"https://deadline.com/tag/caa/\" id=\"auto-tag_caa\" data-tag=\"caa\"\u003eCAA\u003c/a\u003e-repped Kumar said.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tTelling his live audiences that some acquaintances have asked him to lay off the politics and do more traditional stand-up about what is in his fridge, Kumar proved as far from kissing the ring or bending the knee as possible in our increasingly authoritarian era. To that, the comedian inspired by the 1990s barrier shattering \u003cem\u003eGoodness Gracious Me\u003c/em\u003e and chatted with me as his North American tour enters its final week, about Trump’s war on Canada, low expectations, that Signal fiasco, breaking America,and his parents fears about crossing the 49\u003csup\u003eth\u003c/sup\u003e parallel.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE:\u003cem\u003e Having seen your second show at Largo last week, let me ask you in the interest of non-political \u003ca href=\"https://deadline.com/tag/comedy/\" id=\"auto-tag_comedy\" data-tag=\"comedy\"\u003ecomedy\u003c/a\u003e: What is in your fridge?\u003c/em\u003e\u003c/strong\u003e\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eNISH KUMAR: \u003c/strong\u003e(LAUGHS) Well, actually, currently my fridge, the fridge that I’m most closest to, is in a hotel room. So, I guess currently what’s in my fridge is, I imagine, some incredibly expensive soft drinks\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE: \u003cem\u003eNow we have that out of the way, you have been touring a divided North America with a very political stand-up show since late February starting in Toronto. You’re doing two shows in Chicago on Friday and ending this part of the tour in Madison, Wisconsin on March 30. So, what’s the vibe you’re picking up in a continent where everything in Canada and America is sharply political right now?\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKUMAR:\u003c/strong\u003e I landed in Toronto on February the 20th, I believe, and it was the week that the hockey games had happened and the Canadians were booing the American national anthem. it was angrier than I thought it was possible for Canadians to be, like Canadians were justifiably furious. So yeah, there was, we kind of landed into the middle of that kind of, like real anger and frustration. And then we were in Toronto, and then Montreal, and then I went into Boston. You know, I’m speaking to a very small, very specific demographic of Americans, but there is a lot of anger and a lot of hurt I think that a lot of American people are feeling right now, and certainly that is true over the boarder as well.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE:\u003cem\u003e With all that anger, and it is very real, we can all see that, were you worried that your, let’s just say, MAGA critical material could have seen you held up at the boarder coming into the States, and, if so, how do you counter that?\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKUMAR:\u003c/strong\u003e I mean, like, the show is the show, you know.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tI’m not going to change the material. It is what it is. Yeah, that’s what I do. And also, I believe that I’m still doing that in a country whose First Amendment to its Constitution enshrines freedom of speech. So, I believe that I’m still operating under those terms.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE: \u003cem\u003eThat feels like increasingly thin ice to many, especially for someone who doesn’t have white skin …\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKUMAR:\u003c/strong\u003e You know, if we’re just being completely and utterly candid here, I have just had a very a conversation with a very, very tense and stressed mother on the phone about the fact that I am re-entering America on Thursday. I’m doing so with a valid O-1 visa, and I’m doing so to go and do pre-book shows with a flight that leaves the following week that takes me to Melbourne to do a run of pre book shows at the Melbourne Comedy Festival. But what’s also true is my parents are incredibly stressed/ They are reading stories about people being grabbed at the border, and they are wondering whether that will happen to me. And that is just that is just a reality of where we are at the moment in the conversation is that people who have all of their paperwork in order are genuinely frightened at the moment.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE: \u003cem\u003eWhat are the consequences in your opinion for America in that conversation?\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKUMAR:\u003c/strong\u003e Well, if you start really saber rattling, and you make it difficult for people to come into your country, there are economic consequences. Those consequences will be felt by Americans if tourists start being put off coming. There are parts of America that tourism is a huge industry that helps keep the country and keep people employed and keep the country’s economy buoyant.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThere are also consequences to imposing tariffs on a neighbor with whom you share a land border. Yet, Elon Musk and Donald Trump will not face the consequences of the tariffs. Elon Musk and Donald Trump will not face the consequences of tourists being put off coming to this country because they’re hearing stories that a Canadian actress was detained and without any kind of judicial oversight, put in an immigration detention facility. And the reason I stress Canadian in that instance is that is a white Canadian person. Black and Brown people have long since feared the immigration policies. That is something that has been a part of the fear. But if they’re now doing this to white people, that is something that is something that is going to scare absolutely everybody.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cdiv\u003e\n\t\n\n\u003cfigure\u003e\n\n\t\t\t\n\u003cdiv\u003e\n\t\n\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?w=300\" data-lazy-src=\"https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?w=300\" alt=\"\" data-lazy-srcset=\"https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg 8093w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=150,100 150w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=300,200 300w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=1024,683 1024w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=1536,1024 1536w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=2048,1365 2048w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=630,420 630w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=60,40 60w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=352,235 352w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=900,600 900w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=110,73 110w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=285,190 285w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=320,213 320w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=640,427 640w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=800,533 800w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=1280,853 1280w\" data-lazy-sizes=\"(min-width: 87.5rem) 1000px, (min-width: 78.75rem) 681px, (min-width: 48rem) 450px, (max-width: 48rem) 250px\" height=\"683\" width=\"1024\" decoding=\"\" srcset=\"https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg 8093w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=150,100 150w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=300,200 300w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=1024,683 1024w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=1536,1024 1536w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=2048,1365 2048w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=630,420 630w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=60,40 60w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=352,235 352w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=900,600 900w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=110,73 110w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=285,190 285w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=320,213 320w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=640,427 640w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=800,533 800w, https://deadline.com/wp-content/uploads/2025/03/elon-musk-march-24-getty.jpg?resize=1280,853 1280w\"/\u003e\n\t\t\t\n\t\t\t\u003c/p\u003e\n\t\n\t\u003c/div\u003e\n\t\n\t\t\t\n\t\t\t\n\u003cfigcaption\u003e\n\t\n\t\t\t\t\t\u003cspan\u003eWearing a “Trump Was Right About Everything” hat, Elon Musk looks on as Donald Trump hosts a cabinet meeting in the White House on March 24, 2025 (Photo by Brendan SMIALOWSKI / AFP) (Photo by BRENDAN SMIALOWSKI/AFP via Getty Images)\u003c/span\u003e\n\t\t\n\t\t\t\t\t\t\t\n\t\u003c/figcaption\u003e\n\n\t\t\t\n\u003c/figure\u003e\n\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE:\u003cem\u003e In the realm of fear, the scandal of the week in the ever-scandalizing Trump administration is National Security Advisor Mike Waltz earlier this month breaking almost every security protocol in the book by adding the editor of the Atlantic Jeffrey Goldberg to a group Signal app chat with Vice-President Vance, the DEI hating Secretary of Defense Pete Hegseth and other top administration officials over plans to bomb Yemen and the Houthi. Then they all denied it, say there was nothing classified on the chat, and, \u003ca href=\"https://deadline.com/2025/03/trump-war-plans-the-atlantic-signal-1236350938/\"\u003eonce Goldberg released parts of the military specifics that Hegseth put on the not secure chat,\u003c/a\u003e they tried to discredit him by insisting they were “attack plans” not “war plans” and hence no big whoop ….\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKUMAR:\u003c/strong\u003e The thing that shocks me about it is, I wouldn’t trust them to organize a group chat.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t You know, it’s quite an astonishing thing to understand that they couldn’t work out who was in a Signal group. That is that feels like it should be something that is very deeply worrying to people.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAnd it also does slightly fly in the face of this idea that there’s a lot of rhetoric about we need to get rid of DEI because we need the best and the brightest. Currently, some of the best and the brightest appear to be people that can’t use their phones. So that is something that I think is worth examining and worth considering. Also, you know, I guess we all just need to keep an eye on our own phones, because you might wake up one morning and realize you’ve been added to a text chain that’s talking about plans to invade Canada.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE:\u003cem\u003e Invasion not being the operative term, between your very short lived \u003ca href=\"https://deadline.com/tag/quibi/\" id=\"auto-tag_quibi\" data-tag=\"quibi\"\u003eQuibi\u003c/a\u003e show and your very busy Pod Save the UK duties for Crooked Media, you haven’t toured a lot in the States — so what were your expectations for this tour?\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKUMAR:\u003c/strong\u003e (LAUGHS) I thought, listen, let’s just try. Let’s just see what the market is. Let’s see if people will come out. And let’s do comedy clubs, and let’s do these small rooms and see how it goes.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE:\u003cem\u003e And?\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKUMAR:\u003c/strong\u003e And so, my American agents put it all together. And I came at this with truly no expectations outside of the cities that I performed in before, which were Montreal in Canada and Toronto and New York and LA in the States. I was fully prepared to like, take a bath. I was fully like I’m writing off this money. Let’s see how it goes. And then the tickets went on sale, and like, I got a text a day later or something. My partner got a text from her family, a large chunk of whom are Canadians who live in Toronto, saying, Can you add more dates? And that was when we actually looked at the ticket sales and realized that things were sort of filling up.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE:\u003cem\u003e A good feeling …\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKUMAR:\u003c/strong\u003e Yeah! So, we had to add late shows in places like Largo in LA, Vancouver, Toronto, Montreal, and then, Chicago, Seattle, Portland, New York. Suddenly, it was very much like there was a sort of scramble to go. We have not adequately appreciated the demand for ticket, which is the right way round. That’s what you want in your career, and really it’s what I want in my life. I try and approach things with such healthily low expectations that I’m always permanently surprised by any glimmer of success\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE:\u003cem\u003e That’s a line…\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKUMAR:\u003c/strong\u003e No really. Keeping on theme, my ambitions for my life and career was so low that my main priority was I would like to be a comedian, and not have to be an office temp at the same time.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE:\u003cem\u003e Ambition achieved, globally.\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKUMAR:\u003c/strong\u003e Then my other ambition beyond that was I wanted to do  a British political show, which I did do for a few years. So that was really exciting. Beyond that, my other ambition, mainly, is just to sort of tour as a comedian.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE:\u003cem\u003e Well,\u003ca href=\"https://deadline.com/2025/03/after-midnight-canceled-cbs-taylor-tomlinson-1236351453/\"\u003e as Taylor Tomlinson made clear walking away from CBS’ After Midnight\u003c/a\u003e, touring and stand-up are the real deal …\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKUMAR:\u003c/strong\u003e Yeah, part of touring as a comedian is it opens up the whole world to you. You can see whole different parts of the world, and especially in the advent of high-speed internet, it has created a market, global market for English language stand up across the world.  \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWhen I was a kid, the comedian equivalents of someone as big as I am in Britain, which is like, great, very nice, but I’m not like an arena act in Britain. But the idea that someone at my size, who is like, you know, doing 900 to 1000 seat theaters in the UK would be able to come over and tour in America, and that’d be a financially worthwhile thing to do was inconceivable. Like, the only British comedians that actually went to America were, like, the biggest, biggest comedians, you know. So you know, Eddie Izzard, Billy Connolly, then, lately, Ricky Gervais. They were the only people who could come and actually do shows in America. Whereas now, because of the internet, it’s created this whole other substrata of comedy fans who really want to see the more obscure.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cdiv\u003e\n\u003cblockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/reel/DHv4XstPYED/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e\u003c/blockquote\u003e\n\u003c/div\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE:\u003cem\u003e So, a few more dates in America, and what’s next?\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKUMAR: \u003c/strong\u003eI actually don’t really know, because I’ve been touring so intensely\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tFor this tour, I can tell you immediately what’s next, which is, I go straight to Australia and New Zealand. Then I go back to London and I film this show. Then we try and work out what we do with it once we filmed it. After that, I do a bunch of shows at the Edinburgh Fringe Festival in August, and then, at the moment, I genuinely don’t know what is happening next.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDEADLINE:\u003cem\u003e Seems like quite a plan.\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKUMAR:\u003c/strong\u003e Thanks. You know, I’m not really like one of history’s great long-term planners, due to what my girlfriend, mental health professionals and several audience members have described as a textbook case of ADHD. So, like, that’s not necessarily my forte. So, at the minute, my plan is to film this show. Then I need to edit that show with my friends who make it, and then work out what I do with that show. And then after that, we I’ll be doing more \u003cem\u003ePods Save the UK.\u003c/em\u003e I’ve got September of this year bookmarked to do podcasts in and then I’m really really going to sit on my sofa. Like, really sit on it, really get that ass indentation.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "14 min read",
  "publishedTime": "2025-03-29T00:08:01Z",
  "modifiedTime": "2025-03-29T00:25:18Z"
}
