{
  "id": "a21bd9a2-754e-4294-ae58-0954bf0eb388",
  "title": "1989's Batman Was Nearly A Bizarrely Overcrowded Movie From A Classic James Bond Screenwriter",
  "link": "https://www.slashfilm.com/1835264/batman-1989-original-script-james-bond-writer-tom-mankiewicz/",
  "description": "Before Tim Burton delivered the pop culture juggernaut of 1989's Batman movie, a James Bond screenwriter took a crack at the script.",
  "author": "Joe Roberts",
  "published": "Sat, 26 Apr 2025 22:45:00 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Action \u0026 Adventure Movies",
    "Superhero Movies"
  ],
  "byline": "Joe Roberts",
  "length": 7996,
  "excerpt": "Before Tim Burton delivered the pop culture juggernaut of 1989's Batman movie, a James Bond screenwriter took a crack at the script.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slashfilm-favicon.png",
  "text": "Warner Bros. 1989's \"Batman\" made Tim Burton a box office hero, exposed mass audiences to a truly dark interpretation of the Dark Knight, and ensured Joker actor Jack Nicholson never ran out of money for the rest of his life. The movie was a major success, changing how Hollywood marketed blockbuster movies going forward and influencing every single superhero movie that came in its wake. Burton himself is a big part of why the movie worked as well as it did, holding fast to his artistic vision for the character even as Warner Bros. tried to steer him away from it at multiple turns. But we also wouldn't have that vision without Sam Hamm and Warren Skaaren's script, which contains some of the most memorable lines in superhero movie history, from Joker's \"Where does he get those wonderful toys?\" to Michael Keaton's legendary \"I'm Batman.\" Advertisement Interestingly enough, that script took a lot of time to get to the point it did. Multiple writers worked on the \"Batman\" screenplay over the years, which, back in the early '80s, took the form of a Tom Mankiewicz-penned script that would have been a heck of a lot different than Burton's immersive expressionist effort. Mankiewicz, who passed away in 2010, had a stellar career as a Hollywood scenarist prior to taking a shot at \"Batman.\" He contributed to the script for 1971's \"Diamonds are Forever,\" receiving a shared writing credit with Richard Maibaum for Sean Connery's less than triumphant return to the role that had made him a star, before going on to write multiple Bond movies in the following years. He penned Roger Moore's first outing with 1973's \"Live and Let Die,\" and once again shared credit with Maibaum on 1974's \"The Man with the Golden Gun\" before contributing uncredited writing work to 1977's \"The Spy Who Loved Me.\" Advertisement The year after that Bond installment debuted, Mankiewicz received an unusual credit on Richard Donner's \"Superman,\" which landed him in trouble. The writer was listed as \"creative consultant\" on the film after helping Donner rewrite, cast, screen test, and location scout the movie, but found himself in hot water with the Writer's Guild due to the placement of his credit. The matter was sorted out, however, and Mankiewicz would go on to write the screenplay for what would have been another DC superhero's first blockbuster outing, authoring a script for a Batman movie that was never actually shot — and judging by the screenplay itself, that was probably a good thing. Tom Mankiewicz wrote an uneven Batman script with multiple villains Warner Bros. The \"Batman\" TV series of the 1960s, which ran for three seasons before being cancelled, made Batman a pop culture mainstay and undoubtedly contributed to his enduring status. But it also convinced the masses that the character was a bit of a joke. One man who was eager to change that perception was Michael Uslan, a lawyer and comic book writer who had always hoped to see a truly dark version of the Dark Knight on the big screen. In 1979, Uslan and producer Benjamin Melniker bought the film rights to Batman, and unveiled the project at the 1980 New York Comic Art Convention. Advertisement Of course, it would take almost an entire decade for the movie to materialize as the unimpeachably great Tim Burton film that was 1989's \"Batman,\" and during that time, it seems the project underwent multiple changes. One potential version of the movie came from Tom Mankiewicz, who wrote a script for a film that was nothing like the dark and gothic tale Burton would eventually present. The script introduced not only Batman, but his kid sidekick Robin, alongside assorted Gotham villains including the Joker, Penguin, Joe Chill, and corrupt councilman Rupert Thorne. Instead of Vicky Vale, who was played by Kim Basinger in the 1989 movie, Mankiewicz's script used the character of Silver St. Cloud for the love interest. Advertisement Much like 1992's \"Batman Returns,\" then, Mankiewicz's \"Batman\" likely would have suffered from trying to introduce too many characters. Considering the tone of his script was a bit uneven to say the least, that all suggests the movie wouldn't have been quite the triumph that 1989's \"Batman\" was ... but that's not to say it didn't have some good ideas.  Mankiewicz's \"Batman\" script was first written in 1983 and opens in 1960, where a ten-year-old Bruce Wayne is shown living with his parents and Alfred at Wayne Manor, before the family attends a screening of the Audrey Hepburn film \"The Nun's Story.\" We all know how that particular outing ends, and while Sam Hamm's final script for \"Batman\" would make the controversial choice to have The Joker be the killer of Bruce's parents, Mankiewicz's version stayed true to comic book lore and kept Joe Chill as the perpetrator. As the script goes on, however, the commitment to classically dark Batman stories slips somewhat. Tom Mankiewicz's Batman was a crammed, muddled affair Warner Bros. After showing the death of Bruce Wayne's parents, Tom Mankiewicz's screenplay then introduces the Joker, who according to Mankiewicz was not supposed to be \"a buffoon\" like his 1960s TV counterpart, and was instead envisioned as being \"terribly scary.\" The writer spoke to Starlog magazine in 1983 for a feature entitled \"From Bond to Batman\" (via ComicBookMovie), and laid out his vision for the Dark Knight in detail. The story would have seen Thomas Wayne running for city council against the corrupt Rupert Thorne. After Thomas is slain, Thorne wins by default. The script then includes a montage of Bruce training himself, before we see an older version of the character in the early-'70s discovering the cave beneath Wayne Manor, which all sounds very much like what we eventually saw in \"Batman Begins.\" Advertisement In the present day, Batman finally arrives to thwart hostage takers on a subway, prompting incredulity and outright hostility from Commissioner Gordon. The Dark Knight actually appears in the commissioner's office later to offer his services in taking down the Joker, which Gordon reluctantly accepts. There are other moments that predated the Christopher Nolan movies, too, like Joker crashing a party thrown by Bruce Wayne to menace the guests. Robin is eventually introduced after Bruce attends the circus and witnesses the death of Dick Grayson's parents, much like in 1995's \"Batman Forever\" (an overlooked Batman movie that's more groundbreaking than you remember). This is on top of a Penguin appearance, a love story between Bruce and Silver St. Cloud, and the entire Batman origin story, making for a truly packed script that surely wouldn't have held together had it been put into production. Advertisement Later, things get a little more wacky, with Batman using a giant rubber band and thumbtack to take out Thorne, knocking him into a similarly giant pencil sharpener that kills him. As such, even while Mankiewicz told Starlog that he wanted Batman's outfit to be \"truly frightening\" and clearly wanted to take the character in a new direction, there were obviously elements of the script that just didn't fit with this darker tone and sound like they would have been more at home in the 1960s series.",
  "image": "https://www.slashfilm.com/img/gallery/1989s-batman-was-nearly-a-bizarrely-overcrowded-movie-from-a-classic-james-bond-screenwriter/l-intro-1744729191.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                \n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1835264/batman-1989-original-script-james-bond-writer-tom-mankiewicz/\" data-post-title=\"1989\u0026#39;s Batman Was Nearly A Bizarrely Overcrowded Movie From A Classic James Bond Screenwriter\" data-slide-num=\"0\" data-post-id=\"1835264\"\u003e\n                                             \u003cpicture id=\"p95e62e88755ac398d7ba181cadfb48b9\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/1989s-batman-was-nearly-a-bizarrely-overcrowded-movie-from-a-classic-james-bond-screenwriter/intro-1744729191.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/1989s-batman-was-nearly-a-bizarrely-overcrowded-movie-from-a-classic-james-bond-screenwriter/intro-1744729191.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/1989s-batman-was-nearly-a-bizarrely-overcrowded-movie-from-a-classic-james-bond-screenwriter/intro-1744729191.jpg\" data-slide-url=\"https://www.slashfilm.com/1835264/batman-1989-original-script-james-bond-writer-tom-mankiewicz/\" data-post-id=\"1835264\" data-slide-num=\"0\" data-slide-title=\"1989\u0026#39;s Batman Was Nearly A Bizarrely Overcrowded Movie From A Classic James Bond Screenwriter: \" width=\"780\" height=\"438\" alt=\"The Batman cowel is seen hanging in a chamber in Batman\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eWarner Bros.\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n                \n                \n\u003cp dir=\"ltr\"\u003e1989\u0026#39;s \u003ca href=\"https://www.slashfilm.com/1607899/batman-1989-tim-burton-box-office-superhero/\" target=\"_blank\"\u003e\u0026#34;Batman\u0026#34; made Tim Burton a box office hero\u003c/a\u003e, exposed mass audiences to a truly dark interpretation of the Dark Knight, and ensured \u003ca href=\"https://www.slashfilm.com/1155076/box-office-smash-batman-likely-never-made-a-profit-and-it-was-the-jokers-fault/\" target=\"_blank\"\u003eJoker actor Jack Nicholson never ran out of money for the rest of his life\u003c/a\u003e. The movie was a major success, changing how Hollywood marketed blockbuster movies going forward and influencing every single superhero movie that came in its wake. Burton himself is a big part of why the movie worked as well as it did, holding fast to his artistic vision for the character even as Warner Bros. tried to steer him away from it at multiple turns. But we also wouldn\u0026#39;t have that vision without Sam Hamm and Warren Skaaren\u0026#39;s script, which contains some of the most memorable lines in superhero movie history, from Joker\u0026#39;s \u0026#34;Where does he get those wonderful toys?\u0026#34; to Michael Keaton\u0026#39;s legendary \u0026#34;I\u0026#39;m Batman.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eInterestingly enough, that script took a lot of time to get to the point it did. Multiple writers worked on the \u0026#34;Batman\u0026#34; screenplay over the years, which, back in the early \u0026#39;80s, took the form of a Tom Mankiewicz-penned script that would have been a heck of a lot different than Burton\u0026#39;s immersive expressionist effort. Mankiewicz, who passed away in 2010, had a stellar career as a Hollywood scenarist prior to taking a shot at \u0026#34;Batman.\u0026#34; He contributed to the script for 1971\u0026#39;s \u0026#34;Diamonds are Forever,\u0026#34; receiving a shared writing credit with Richard Maibaum for Sean Connery\u0026#39;s less than triumphant return to the role that had made him a star, before going on to write multiple Bond movies in the following years. He penned Roger Moore\u0026#39;s first outing with 1973\u0026#39;s \u0026#34;Live and Let Die,\u0026#34; and once again shared credit with Maibaum on 1974\u0026#39;s \u0026#34;The Man with the Golden Gun\u0026#34; before contributing uncredited writing work to 1977\u0026#39;s \u0026#34;The Spy Who Loved Me.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eThe year after that Bond installment debuted, \u003ca href=\"https://www.slashfilm.com/1175271/writer-tom-mankiewiczs-unusual-credit-on-richard-donners-superman-movies-landed-him-in-trouble/\" target=\"_blank\"\u003eMankiewicz received an unusual credit on Richard Donner\u0026#39;s \u0026#34;Superman,\u0026#34; which landed him in trouble\u003c/a\u003e. The writer was listed as \u0026#34;creative consultant\u0026#34; on the film after helping Donner rewrite, cast, screen test, and location scout the movie, but found himself in hot water with the Writer\u0026#39;s Guild due to the placement of his credit. The matter was sorted out, however, and Mankiewicz would go on to write the screenplay for what would have been another DC superhero\u0026#39;s first blockbuster outing, authoring a script for a Batman movie that was never actually shot — and judging by the screenplay itself, that was probably a good thing.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eTom Mankiewicz wrote an uneven Batman script with multiple villains\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1835264/batman-1989-original-script-james-bond-writer-tom-mankiewicz/\" data-post-title=\"1989\u0026#39;s Batman Was Nearly A Bizarrely Overcrowded Movie From A Classic James Bond Screenwriter\" data-slide-num=\"1\" data-post-id=\"1835264\"\u003e\n                                             \u003cpicture id=\"pbcc5eb3e825e97cc117235d8e6f45496\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/1989s-batman-was-nearly-a-bizarrely-overcrowded-movie-from-a-classic-james-bond-screenwriter/tom-mankiewicz-wrote-an-uneven-batman-script-with-multiple-villains-1744729191.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/1989s-batman-was-nearly-a-bizarrely-overcrowded-movie-from-a-classic-james-bond-screenwriter/tom-mankiewicz-wrote-an-uneven-batman-script-with-multiple-villains-1744729191.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/1989s-batman-was-nearly-a-bizarrely-overcrowded-movie-from-a-classic-james-bond-screenwriter/tom-mankiewicz-wrote-an-uneven-batman-script-with-multiple-villains-1744729191.jpg\" data-slide-url=\"https://www.slashfilm.com/1835264/batman-1989-original-script-james-bond-writer-tom-mankiewicz/\" data-post-id=\"1835264\" data-slide-num=\"1\" data-slide-title=\"1989\u0026#39;s Batman Was Nearly A Bizarrely Overcrowded Movie From A Classic James Bond Screenwriter: Tom Mankiewicz wrote an uneven Batman script with multiple villains\" width=\"780\" height=\"438\" alt=\"Jack Nicholson\u0026#39;s Joker looks up while smiling in Batman\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eWarner Bros.\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eThe \u003ca href=\"https://www.slashfilm.com/1808126/why-adam-west-batman-show-canceled/\" target=\"_blank\"\u003e\u0026#34;Batman\u0026#34; TV series of the 1960s, which ran for three seasons before being cancelled\u003c/a\u003e, made Batman a pop culture mainstay and undoubtedly contributed to his enduring status. But it also convinced the masses that the character was a bit of a joke. One man who was eager to change that perception was Michael Uslan, a lawyer and comic book writer who had always hoped to see a truly dark version of the Dark Knight on the big screen. In 1979, Uslan and producer Benjamin Melniker bought the film rights to Batman, and unveiled the project at the 1980 New York Comic Art Convention.\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eOf course, it would take almost an entire decade for the movie to materialize as the unimpeachably great Tim Burton film that was 1989\u0026#39;s \u0026#34;Batman,\u0026#34; and during that time, it seems the project underwent multiple changes. One potential version of the movie came from Tom Mankiewicz, who wrote a script for a film that was nothing like the dark and gothic tale Burton would eventually present. The \u003ca href=\"https://indiegroundfilms.wordpress.com/wp-content/uploads/2014/01/batman-jan-10-84-2nd-tom-mankiewicz-version.pdf\" target=\"_blank\"\u003escript\u003c/a\u003e introduced not only Batman, but his kid sidekick Robin, alongside assorted Gotham villains including the Joker, Penguin, Joe Chill, and corrupt councilman Rupert Thorne. Instead of Vicky Vale, who was played by Kim Basinger in the 1989 movie, Mankiewicz\u0026#39;s script used the character of Silver St. Cloud for the love interest.\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eMuch like 1992\u0026#39;s \u0026#34;Batman Returns,\u0026#34; then, Mankiewicz\u0026#39;s \u0026#34;Batman\u0026#34; likely would have suffered from trying to introduce too many characters. Considering the tone of his script was a bit uneven to say the least, that all suggests the movie wouldn\u0026#39;t have been quite the triumph that 1989\u0026#39;s \u0026#34;Batman\u0026#34; was ... but that\u0026#39;s not to say it didn\u0026#39;t have some good ideas. \u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eMankiewicz\u0026#39;s \u0026#34;Batman\u0026#34; script was first written in 1983 and opens in 1960, where a ten-year-old Bruce Wayne is shown living with his parents and Alfred at Wayne Manor, before the family attends a screening of the Audrey Hepburn film \u0026#34;The Nun\u0026#39;s Story.\u0026#34; We all know how that particular outing ends, and while Sam Hamm\u0026#39;s final script for \u0026#34;Batman\u0026#34; would make the controversial choice to have The Joker be the killer of Bruce\u0026#39;s parents, Mankiewicz\u0026#39;s version stayed true to comic book lore and kept Joe Chill as the perpetrator. As the script goes on, however, the commitment to classically dark Batman stories slips somewhat.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eTom Mankiewicz\u0026#39;s Batman was a crammed, muddled affair\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1835264/batman-1989-original-script-james-bond-writer-tom-mankiewicz/\" data-post-title=\"1989\u0026#39;s Batman Was Nearly A Bizarrely Overcrowded Movie From A Classic James Bond Screenwriter\" data-slide-num=\"2\" data-post-id=\"1835264\"\u003e\n                                             \u003cpicture id=\"pe50221338b8daa0009e3512d2d76b901\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/1989s-batman-was-nearly-a-bizarrely-overcrowded-movie-from-a-classic-james-bond-screenwriter/tom-mankiewiczs-batman-was-a-crammed-muddled-affair-1744729192.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/1989s-batman-was-nearly-a-bizarrely-overcrowded-movie-from-a-classic-james-bond-screenwriter/tom-mankiewiczs-batman-was-a-crammed-muddled-affair-1744729192.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/1989s-batman-was-nearly-a-bizarrely-overcrowded-movie-from-a-classic-james-bond-screenwriter/tom-mankiewiczs-batman-was-a-crammed-muddled-affair-1744729192.jpg\" data-slide-url=\"https://www.slashfilm.com/1835264/batman-1989-original-script-james-bond-writer-tom-mankiewicz/\" data-post-id=\"1835264\" data-slide-num=\"2\" data-slide-title=\"1989\u0026#39;s Batman Was Nearly A Bizarrely Overcrowded Movie From A Classic James Bond Screenwriter: Tom Mankiewicz\u0026#39;s Batman was a crammed, muddled affair\" width=\"780\" height=\"438\" alt=\"Michael Keaton\u0026#39;s Batman holds a thug close to his face in Batman\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eWarner Bros.\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eAfter showing the death of Bruce Wayne\u0026#39;s parents, Tom Mankiewicz\u0026#39;s screenplay then introduces the Joker, who according to Mankiewicz was not supposed to be \u0026#34;a buffoon\u0026#34; like his 1960s TV counterpart, and was instead envisioned as being \u0026#34;terribly scary.\u0026#34; The writer spoke to Starlog magazine in 1983 for a feature entitled \u0026#34;From Bond to Batman\u0026#34; (via \u003ca href=\"https://comicbookmovie.com/batman/batman-a-retrospective-of-tom-mankiewicz-unfilmed-script-a21031#gs.lme52q\" target=\"_blank\"\u003eComicBookMovie\u003c/a\u003e), and laid out his vision for the Dark Knight in detail. The story would have seen Thomas Wayne running for city council against the corrupt Rupert Thorne. After Thomas is slain, Thorne wins by default. The script then includes a montage of Bruce training himself, before we see an older version of the character in the early-\u0026#39;70s discovering the cave beneath Wayne Manor, which all sounds very much like what we eventually saw in \u0026#34;Batman Begins.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eIn the present day, Batman finally arrives to thwart hostage takers on a subway, prompting incredulity and outright hostility from Commissioner Gordon. The Dark Knight actually appears in the commissioner\u0026#39;s office later to offer his services in taking down the Joker, which Gordon reluctantly accepts. There are other moments that predated the Christopher Nolan movies, too, like Joker crashing a party thrown by Bruce Wayne to menace the guests.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eRobin is eventually introduced after Bruce attends the circus and witnesses the death of Dick Grayson\u0026#39;s parents, much like in 1995\u0026#39;s \u003ca href=\"https://www.slashfilm.com/1787529/batman-forever-groundbreaking-movie-reasons/\" target=\"_blank\"\u003e\u0026#34;Batman Forever\u0026#34; (an overlooked Batman movie that\u0026#39;s more groundbreaking than you remember)\u003c/a\u003e. This is on top of a Penguin appearance, a love story between Bruce and Silver St. Cloud, and the entire Batman origin story, making for a truly packed script that surely wouldn\u0026#39;t have held together had it been put into production.\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eLater, things get a little more wacky, with Batman using a giant rubber band and thumbtack to take out Thorne, knocking him into a similarly giant pencil sharpener that kills him. As such, even while Mankiewicz told Starlog that he wanted Batman\u0026#39;s outfit to be \u0026#34;truly frightening\u0026#34; and clearly wanted to take the character in a new direction, there were obviously elements of the script that just didn\u0026#39;t fit with this darker tone and sound like they would have been more at home in the 1960s series.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-04-26T22:45:00Z",
  "modifiedTime": "2025-04-26T22:45:00Z"
}
