{
  "id": "a50a1155-224a-4bd6-b1de-8a9702dc1775",
  "title": "Mysterious Sci-Fi Thriller 'Levels' Trailer with Peter Mooney \u0026 Cara Gee",
  "link": "https://www.firstshowing.net/2024/mysterious-sci-fi-thriller-levels-trailer-with-peter-mooney-cara-gee/",
  "description": "\"This is as real as anything I know...\" Is it? Or is she just saying that? RLJE Films has revealed an official trailer for an indie action sci-fi thriller called Levels, the feature debut of Canadian indie filmmaker Adam Stern. This is set to open in November including on VOD right away. The vague one-liner: After witnessing his girlfriend's murder, a man risks everything, including reality itself, to discover the truth. In the future, a man watches in horror as his girlfriend gets murdered and the killer seemingly disappears into mid-air. He soon embarks on a voyage of discovery that leads to shocking revelations that his own reality is not what it appears to be. The indie sci-fi film stars Cara Gee, ​​Peter Mooney, Aaron Abrams, and David Hewlett. From this trailer, it seems like he's stuck in some kind of massive video game simulation - \"the first digital universe\". Hence the different \"levels\" of the world he has to navigate in order to figure out what happened to her and what's really going on. Not bad, seems like a ...",
  "author": "Alex Billington",
  "published": "Thu, 10 Oct 2024 13:22:55 +0000",
  "source": "https://www.firstshowing.net/feed/",
  "categories": [
    "Indies",
    "Sci-Fi",
    "To Watch",
    "Trailer"
  ],
  "byline": "Alex Billington",
  "length": 2411,
  "excerpt": "\"This is as real as anything I know...\" Is it? Or is she just saying that? RLJE Films has revealed an official trailer for an indie action sci-fi thriller called Levels, the feature debut of Canadian indie filmmaker Adam Stern. This is set to open in November including on VOD right away. The vague one-liner:",
  "siteName": "FirstShowing.net",
  "favicon": "https://www.firstshowing.net/favicon-32x32.png",
  "text": "TRAILERS by October 10, 2024Source: YouTube \"This is as real as anything I know...\" Is it? Or is she just saying that? RLJE Films has revealed an official trailer for an indie action sci-fi thriller called Levels, the feature debut of Canadian indie filmmaker Adam Stern. This is set to open in November including on VOD right away. The vague one-liner: After witnessing his girlfriend's murder, a man risks everything, including reality itself, to discover the truth. In the future, a man watches in horror as his girlfriend gets murdered and the killer seemingly disappears into mid-air. He soon embarks on a voyage of discovery that leads to shocking revelations that his own reality is not what it appears to be. The indie sci-fi film stars Cara Gee, ​​Peter Mooney, Aaron Abrams, and David Hewlett. From this trailer, it seems like he's stuck in some kind of massive video game simulation - \"the first digital universe\". Hence the different \"levels\" of the world he has to navigate in order to figure out what happened to her and what's really going on. Not bad, seems like a cool idea, I'm curious. Check out this footage below. Here's the main official trailer (+ poster) for Adam Stern's sci-fi film Levels, direct from YouTube: Snapping awake from a nightmare, Joe (Mooney) takes a breath before returning to his supposed reality. On the surface, it seems like an average day in an average man's life, but after his girlfriend, Ash (Gee), can be heard delivering Joe a cautionary message, things flip upside down. Ash is shot by an unknown assailant who makes a break for it. When Joe chases after the perp, her attacker vanishes into thin air. On a mission to find out the truth, Joe bites off more than he can chew, as he comes to find that everything he thought he knew about his world may very well have been a lie. Levels is written and directed by Canadian genre producer / filmmaker Adam Stern, making his feature directorial debut after directing a few other shorts previously; he also founded Artifex Studios in Canada. Produced by Kyle Bornais, Tony Wosk, and Adam Stern. This hasn't premiered at any festivals or elsewhere, as far as we know. RLJE Films will debut Stern's Levels in select US theaters + on VOD starting November 1st, 2024 this fall. Is anyone interested? Find more posts: Indies, Sci-Fi, To Watch, Trailer prev next",
  "image": "https://media2.firstshowing.net/firstshowing/img16/LevelsThrillerposterbigmainTW2.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n\t\t\u003ch2 id=\"pagetitle\"\u003e\u003ca href=\"https://www.firstshowing.net/category/trailers/\" title=\"Click for more trailers\"\u003eTRAILERS\u003c/a\u003e\n\t\t\u003c/h2\u003e\n\n\t\t\n\t\t\u003cdiv\u003e\n\n\t\t\t\n\t\t\t\u003cp\u003eby \t\t\u003cbr/\u003eOctober 10, 2024\u003cbr/\u003e\u003cem\u003eSource:\u003c/em\u003e \u003ca href=\"https://www.youtube.com/watch?v=cCggBmznfTA\" rel=\"noopener nofollow\" target=\"_blank\"\u003eYouTube\u003c/a\u003e\u003cbr/\u003e\u003c/p\u003e\n\t\t\u003cp\u003e\u003ca href=\"https://www.firstshowing.net/2024/mysterious-sci-fi-thriller-levels-trailer-with-peter-mooney-cara-gee/\"\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/LevelsThrillerposterbigmainTsr2.jpg\" alt=\"Levels Trailer\" width=\"350\" height=\"168\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u0026#34;This is as real as anything I know...\u0026#34;\u003c/em\u003e Is it? Or is she just saying that? RLJE Films has revealed an official trailer for an indie action sci-fi thriller called \u003cstrong\u003e\u003cem\u003eLevels\u003c/em\u003e\u003c/strong\u003e, the feature debut of Canadian indie filmmaker Adam Stern. This is set to open in November including on VOD right away. The vague one-liner: After witnessing his girlfriend\u0026#39;s murder, a man risks everything, including reality itself, to discover the truth. In the future, a man watches in horror as his girlfriend gets murdered and the killer seemingly disappears into mid-air. He soon embarks on a voyage of discovery that leads to shocking revelations that his own reality is not what it appears to be. The \u003ca href=\"https://www.firstshowing.net/category/indies/\"\u003eindie\u003c/a\u003e \u003ca href=\"https://www.firstshowing.net/category/sci-fi/\"\u003esci-fi film\u003c/a\u003e stars \u003cstrong\u003eCara Gee\u003c/strong\u003e, ​​\u003cstrong\u003ePeter Mooney\u003c/strong\u003e, \u003cstrong\u003eAaron Abrams\u003c/strong\u003e, and \u003cstrong\u003eDavid Hewlett\u003c/strong\u003e. From this trailer, it seems like he\u0026#39;s stuck in some kind of massive video game simulation - \u0026#34;the first digital universe\u0026#34;. Hence the different \u0026#34;levels\u0026#34; of the world he has to navigate in order to figure out what happened to her and what\u0026#39;s really going on. Not bad, seems like a cool idea, I\u0026#39;m curious. Check out this footage below.\u003cspan id=\"more-713551\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eHere\u0026#39;s the main official trailer (+ poster) for Adam Stern\u0026#39;s sci-fi film \u003cstrong\u003e\u003cem\u003eLevels\u003c/em\u003e\u003c/strong\u003e, direct from \u003ca href=\"https://www.youtube.com/watch?v=cCggBmznfTA\" rel=\"noopener\" target=\"_blank\"\u003eYouTube\u003c/a\u003e:\u003c/p\u003e\n\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/LevelsThrillerposterbigmain5992.jpg?width=599\" alt=\"Levels Sci-Fi Film\" width=\"599\" height=\"337\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/LevelsThrillerposterbigmain5991.jpg?width=599\" alt=\"Levels Poster\" width=\"599\" height=\"864\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSnapping awake from a nightmare, Joe (Mooney) takes a breath before returning to his supposed reality. On the surface, it seems like an average day in an average man\u0026#39;s life, but after his girlfriend, Ash (Gee), can be heard delivering Joe a cautionary message, things flip upside down. Ash is shot by an unknown assailant who makes a break for it. When Joe chases after the perp, her attacker vanishes into thin air. On a mission to find out the truth, Joe bites off more than he can chew, as he comes to find that everything he thought he knew about his world may very well have been a lie.\u003c/em\u003e \u003cem\u003eLevels\u003c/em\u003e is written and directed by Canadian genre producer / filmmaker \u003ca href=\"https://www.imdb.com/name/nm0827618/\" rel=\"noopener\" target=\"_blank\"\u003e\u003cstrong\u003eAdam Stern\u003c/strong\u003e\u003c/a\u003e, making his feature directorial debut after directing a few other shorts previously; he also founded Artifex Studios in Canada. Produced by Kyle Bornais, Tony Wosk, and Adam Stern. This hasn\u0026#39;t premiered at any festivals or elsewhere, as far as we know. RLJE Films will debut Stern\u0026#39;s \u003cem\u003eLevels\u003c/em\u003e in select US theaters + on VOD starting \u003ca href=\"https://www.firstshowing.net/schedule2024/#nov\"\u003e\u003cstrong\u003eNovember 1st, 2024\u003c/strong\u003e\u003c/a\u003e this fall. \u003cem\u003eIs anyone interested?\u003c/em\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eFind more posts:\u003c/strong\u003e \u003ca href=\"https://www.firstshowing.net/category/indies/\" rel=\"category tag\"\u003eIndies\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/sci-fi/\" rel=\"category tag\"\u003eSci-Fi\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/worthwatching/\" rel=\"category tag\"\u003eTo Watch\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/trailers/\" rel=\"category tag\"\u003eTrailer\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\u003c/div\u003e\n\n\t\n\u003cdiv id=\"rightbar\"\u003e\n\t\t\u003cul id=\"slnav\"\u003e\n\t\t\t\u003cli id=\"prev\"\u003e\u003ca href=\"#\"\u003eprev\u003c/a\u003e\u003c/li\u003e\n\t\t    \u003cli id=\"next\"\u003e\u003ca href=\"#\"\u003enext\u003c/a\u003e\u003c/li\u003e\n\t\t\u003c/ul\u003e\n\t\t\u003cul id=\"slides\"\u003e\n\n\t\t\u003c/ul\u003e\n\t\t\u003c/div\u003e\n      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-10T09:22:55-04:00",
  "modifiedTime": null
}
