{
  "id": "accdf16f-5408-4c4c-97c9-6c3aef211250",
  "title": "Why Has Ju Haknyeon Left The BOYZ? Group Exit Explained",
  "link": "https://www.comingsoon.net/guides/news/1990989-ju-haknyeon-the-boyz-exit-explained-reason",
  "description": "K-pop star Ju Haknyeon has left the music group The Boyz. The K-pop act’s managing agency, One Hundred, released an official statement regarding the 26-year-old artist’s sudden exit from the group. The music agency revealed personal issues as the cause of Ju Haknyeon’s departure from The Boyz. So, why exactly did Haknyeon leave The Boyz? […] The post Why Has Ju Haknyeon Left The BOYZ? Group Exit Explained appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
  "author": "Arpita Adhya",
  "published": "Thu, 19 Jun 2025 01:14:54 +0000",
  "source": "https://www.comingsoon.net/feed",
  "categories": [
    "Guides",
    "Ju Haknyeon",
    "K-Pop",
    "Pop Culture",
    "Pop Culture FAQ",
    "the boyz"
  ],
  "byline": "Arpita Adhya",
  "length": 2573,
  "excerpt": "K-pop star Ju Haknyeon has left The Boyz due to personal issues, according to managing agency One Hundred. Here are more details on his exit.",
  "siteName": "ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More",
  "favicon": "https://www.comingsoon.net/wp-content/uploads/sites/3/2022/12/cs_ico_144x144.png?w=144",
  "text": "K-pop star Ju Haknyeon has left the music group The Boyz. The K-pop act’s managing agency, One Hundred, released an official statement regarding the 26-year-old artist’s sudden exit from the group. The music agency revealed personal issues as the cause of Ju Haknyeon’s departure from The Boyz. So, why exactly did Haknyeon leave The Boyz? Here are all the details we’ve gathered on the same. Why did Ju Haknyeon exit The BOYZ? K-pop fans were shocked to learn that the South Korean-Hong Kongese singer and actor is leaving the group, The Boyz. The boy band’s label issued an official statement on X (formerly Twitter) that revealed “issues involving Ju Haknyeon’s private life” have led to the star’s departure from the group. The announcement further disclosed that after verifying “facts” regarding Haknyeon’s private life, the music label has decided to terminate his exclusive contract. The company One Hundred stated, “We have come to recognize the seriousness of this issue and have clearly determined that it is no longer possible for us to maintain the trust in him as an artist. After sufficient discussions with the members of THE BOYZ, we have made the final decision for Ju Haknyeon to depart the team and to terminate his exclusive contract.” The controversies regarding Haknyeon’s private life previously emerged after Korean media outlets had reported that the K-pop star had met a Japanese adult video star. The reports alleged that he visited a bar in Roppongi on May 29, 2025. They further claimed he spent time there with former adult video actress Asuka Kirara. (via Chosun Biz) Some media reports also included pictures of Haknyeon hugging Kirara on the early morning of May 30. Once the photos surfaced, fans expressed their disappointment regarding the singer’s activities. Dating culture for celebrities in Korea remains a taboo topic, as many international fans have often discussed. Ju Haknyeon debuted in the K-pop industry on December 6, 2017, as the vocalist, rapper, and lead dancer of The Boyz. Before that, he competed in Mnet’s survival show Produce 101 Season 2. Haknyeon left the show in the 19th position. Apart from his music career, Haknyeon has appeared in several variety shows. He made his acting debut in the 2022 horror film Seoul Ghost Story, which also featured several other K-pop stars. This includes Golden Child’s Jaehyun, WJSN’s SeolA and Exy, Monsta X’s Shownu, Oh My Girl’s Arin, and BTOB’s Minhyuk. Meanwhile, Ju Haknyeon has yet to comment personally on his departure from The Boyz.",
  "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/06/MixCollage-19-Jun-2025-06-41-AM-8812.jpg?resize=1200,630",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eK-pop star \u003cstrong\u003e\u003ca href=\"https://www.comingsoon.net/tag/ju-haknyeon\"\u003eJu Haknyeon\u003c/a\u003e\u003c/strong\u003e has left the music group \u003cstrong\u003e\u003ca href=\"https://www.comingsoon.net/tag/the-boyz\"\u003eThe Boyz\u003c/a\u003e\u003c/strong\u003e. The K-pop act’s managing agency, One Hundred, released an official statement regarding the 26-year-old artist’s sudden exit from the group. The music agency revealed personal issues as the cause of Ju Haknyeon’s departure from The Boyz.\u003c/p\u003e\n\n\n\n\u003cp\u003eSo, why exactly did Haknyeon leave The Boyz? Here are all the details we’ve gathered on the same.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-why-did-ju-haknyeon-exit-the-boyz\"\u003eWhy did Ju Haknyeon exit The BOYZ?\u003c/h2\u003e\n\n\n\n\u003cp\u003eK-pop fans were shocked to learn that the South Korean-Hong Kongese singer and actor is leaving the group, The Boyz. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe boy band’s label issued an \u003ca href=\"https://x.com/THEBOYZ_officl/status/1935241491179585774\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eofficial statement on X (formerly Twitter)\u003c/a\u003e that revealed “issues involving Ju Haknyeon’s private life” have led to the star’s departure from the group. The announcement further disclosed that after verifying “facts” regarding Haknyeon’s private life, the music label has decided to terminate his exclusive contract. \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThe company One Hundred stated, “We have come to recognize the seriousness of this issue and have clearly determined that it is no longer possible for us to maintain the trust in him as an artist. After sufficient discussions with the members of THE BOYZ, we have made the final decision for Ju Haknyeon to depart the team and to terminate his exclusive contract.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThe controversies regarding Haknyeon’s private life previously emerged after Korean media outlets had reported that the K-pop star had met a Japanese adult video star. The reports alleged that he visited a bar in Roppongi on May 29, 2025. They further claimed he spent time there with former adult video actress Asuka Kirara. (via \u003ca href=\"https://biz.chosun.com/en/en-entertainment/2025/06/18/BQDXDMWKEVCVNHSPYEOZSKAZVY/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eChosun Biz\u003c/a\u003e)\u003c/p\u003e\n\n\n\n\u003cp\u003eSome media reports also included pictures of Haknyeon hugging Kirara on the early morning of May 30. Once the photos surfaced, fans expressed their disappointment regarding the singer’s activities. Dating culture for celebrities in Korea remains a taboo topic, as many international fans have often discussed.\u003c/p\u003e\n\n\n\n\u003cp\u003eJu Haknyeon debuted in the K-pop industry on December 6, 2017, as the vocalist, rapper, and lead dancer of The Boyz. Before that, he competed in Mnet’s survival show Produce 101 Season 2. Haknyeon left the show in the 19th position.\u003c/p\u003e\n\n\n\n\u003cp\u003eApart from his music career, Haknyeon has appeared in several variety shows. He made his acting debut in the 2022 horror film Seoul Ghost Story, which also featured several other K-pop stars. This includes Golden Child’s Jaehyun, WJSN’s SeolA and Exy, Monsta X’s Shownu, Oh My Girl’s Arin, and BTOB’s Minhyuk.\u003c/p\u003e\n\n\n\n\u003cp\u003eMeanwhile, Ju Haknyeon has yet to comment personally on his departure from The Boyz.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-06-19T01:14:54Z",
  "modifiedTime": "2025-06-19T01:15:12Z"
}
