{
  "id": "b4213393-f837-454d-b205-091d6b7d33ce",
  "title": "Wrestlers vs Satanists Horror Comedy Film 'Dark Match' Official Trailer",
  "link": "https://www.firstshowing.net/2025/wrestlers-vs-satanists-horror-comedy-film-dark-match-official-trailer/",
  "description": "\"Five matches. Five offerings.\" Who's ready to rumble (with the Devil)?! Shudder has unveiled an official trailer for an indie horror comedy film called Dark Match, which will be streaming on Shudder at the end of this month. It first premiered at the 2024 Fantasia Film Festival last year, and also played at FrightFest and Fantasy Filmfest. A group of small-time wrestlers find out just how real wrestling can get when they become guests of honor at a match held by Satanists in a small community. This wrestling horror comedy pits small-time wrestling company against a town of crazy people. With an ensemble cast led by the living legend Chris Jericho, Dark Match is heading direct to streaming on Shudder to view. The indie flick stars Sara Canning, Steven Ogg, Michael Eklund, Ayisha Issa, + Chris Jericho, among others. It looks especially fun if you're a pro-wrestling fan and horror fan finally waiting to see these two worlds mashed up. Here's the official trailer (+ poster) for Lowell Dean's horror film Dark Match, direct from YouTube: A small-time wrestling company accepts a well-paying gig located in a backwoods town only to learn, too late, that the local community is run […]",
  "author": "Alex Billington",
  "published": "Wed, 08 Jan 2025 23:49:32 +0000",
  "source": "https://www.firstshowing.net/feed/",
  "categories": [
    "Horror",
    "Indies",
    "To Watch",
    "Trailer"
  ],
  "byline": "Alex Billington",
  "length": 2039,
  "excerpt": "\"Five matches. Five offerings.\" Who's ready to rumble (with the Devil)?! Shudder has unveiled an official trailer for an indie horror comedy film called Dark Match, which will be streaming on Shudder at the end of this month. It first premiered at the 2024 Fantasia Film Festival last year, and also played at FrightFest and",
  "siteName": "FirstShowing.net",
  "favicon": "https://www.firstshowing.net/favicon-32x32.png",
  "text": "TRAILERS by January 8, 2025Source: YouTube \"Five matches. Five offerings.\" Who's ready to rumble (with the Devil)?! Shudder has unveiled an official trailer for an indie horror comedy film called Dark Match, which will be streaming on Shudder at the end of this month. It first premiered at the 2024 Fantasia Film Festival last year, and also played at FrightFest and Fantasy Filmfest. A group of small-time wrestlers find out just how real wrestling can get when they become guests of honor at a match held by Satanists in a small community. This wrestling horror comedy pits small-time wrestling company against a town of crazy people. With an ensemble cast led by the living legend Chris Jericho, Dark Match is heading direct to streaming on Shudder to view. The indie flick stars Sara Canning, Steven Ogg, Michael Eklund, Ayisha Issa, + Chris Jericho, among others. It looks especially fun if you're a pro-wrestling fan and horror fan finally waiting to see these two worlds mashed up. Here's the official trailer (+ poster) for Lowell Dean's horror film Dark Match, direct from YouTube: A small-time wrestling company accepts a well-paying gig located in a backwoods town only to learn, too late, that the local community is run by a mysterious cult leader with devious plans for their match. With an ensemble cast led by living legend Chris Jericho, Dark Match will be streaming on Shudder soon. Dark Match is written and directed by Canadian genre filmmaker Lowell Dean, director of the films 13 Eerie, WolfCop, Another WolfCop, and SuperGrid previously, also this year's Die Alone, along with a few other shorts. It's produced by Rhonda Baker, Don Depoe, Michael Feehan, Johnny Mac, and Michael Peterson. This initially premiered at the 2024 Fantasia Film Festival last year, and it also played at FrightFest in the UK. Shudder will debut Dark Match streaming on Shudder starting January 31st, 2025. Look any good? Find more posts in: Horror, Indies, To Watch, Trailer prev next",
  "image": "https://media2.firstshowing.net/firstshowing/img16/DarkMatchHorrorPosterbigTW1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\t\t\u003ch2 id=\"pagetitle\"\u003e\u003ca href=\"https://www.firstshowing.net/category/trailers/\" title=\"Click for more trailers\"\u003eTRAILERS\u003c/a\u003e\n\t\t\u003c/h2\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\n\t\t\t\u003cp\u003eby \t\t\u003cbr/\u003eJanuary 8, 2025\u003cbr/\u003e\u003cem\u003eSource:\u003c/em\u003e \u003ca href=\"https://www.youtube.com/watch?v=2Q556EL8DGU\" rel=\"noopener nofollow\" target=\"_blank\"\u003eYouTube\u003c/a\u003e\u003cbr/\u003e\u003c/p\u003e\n\t\t\u003cp\u003e\u003ca href=\"https://www.firstshowing.net/2025/wrestlers-vs-satanists-horror-comedy-film-dark-match-official-trailer/\"\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/DarkMatchHorrorPosterbigTsr1.jpg\" alt=\"Dark Match Trailer\" width=\"350\" height=\"168\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u0026#34;Five matches. Five offerings.\u0026#34;\u003c/em\u003e Who\u0026#39;s ready to rumble (with the Devil)?! Shudder has unveiled an official trailer for an indie horror comedy film called \u003cstrong\u003e\u003cem\u003eDark Match\u003c/em\u003e\u003c/strong\u003e, which will be streaming on Shudder at the end of this month. It first premiered at the 2024 Fantasia Film Festival last year, and also played at FrightFest and Fantasy Filmfest. A group of small-time wrestlers find out just how real wrestling can get when they become guests of honor at a match held by Satanists in a small community. This wrestling horror comedy pits small-time wrestling company against a town of crazy people. With an ensemble cast led by the living legend \u003cstrong\u003eChris Jericho\u003c/strong\u003e, \u003cem\u003eDark Match\u003c/em\u003e is heading direct to streaming on Shudder to view. The indie flick stars \u003cstrong\u003eSara Canning\u003c/strong\u003e, \u003cstrong\u003eSteven Ogg\u003c/strong\u003e, \u003cstrong\u003eMichael Eklund\u003c/strong\u003e, \u003cstrong\u003eAyisha Issa\u003c/strong\u003e, + \u003cstrong\u003eChris Jericho\u003c/strong\u003e, among others. It looks especially fun if you\u0026#39;re a pro-wrestling fan and horror fan finally waiting to see these two worlds mashed up.\u003cspan id=\"more-723736\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eHere\u0026#39;s the official trailer (+ poster) for Lowell Dean\u0026#39;s horror film \u003cstrong\u003e\u003cem\u003eDark Match\u003c/em\u003e\u003c/strong\u003e, direct from \u003ca href=\"https://www.youtube.com/watch?v=2Q556EL8DGU\" rel=\"noopener\" target=\"_blank\"\u003eYouTube\u003c/a\u003e:\u003c/p\u003e\n\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/DarkMatchHorrorPosterbig5991.jpg?width=599\" alt=\"Dark Match Poster\" width=\"599\" height=\"899\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eA small-time wrestling company accepts a well-paying gig located in a backwoods town only to learn, too late, that the local community is run by a mysterious cult leader with devious plans for their match. With an ensemble cast led by living legend Chris Jericho, Dark Match will be streaming on Shudder soon.\u003c/em\u003e \u003cem\u003eDark Match\u003c/em\u003e is written and directed by Canadian genre filmmaker \u003ca href=\"https://www.imdb.com/name/nm3366745/\" rel=\"noopener\" target=\"_blank\"\u003e\u003cstrong\u003eLowell Dean\u003c/strong\u003e\u003c/a\u003e, director of the films \u003cem\u003e13 Eerie\u003c/em\u003e, \u003cem\u003eWolfCop\u003c/em\u003e, \u003cem\u003eAnother WolfCop\u003c/em\u003e, and \u003cem\u003eSuperGrid\u003c/em\u003e previously, also this year\u0026#39;s \u003ca href=\"https://www.firstshowing.net/2024/carrie-anne-moss-frank-grillo-in-zombie-thriller-die-alone-trailer/\" rel=\"noopener nofollow \" target=\"_blank\"\u003e\u003cem\u003eDie Alone\u003c/em\u003e\u003c/a\u003e, along with a few other shorts. It\u0026#39;s produced by Rhonda Baker, Don Depoe, Michael Feehan, Johnny Mac, and Michael Peterson. This initially premiered at the 2024 Fantasia Film Festival last year, and it also played at FrightFest in the UK. Shudder will debut \u003cem\u003eDark Match\u003c/em\u003e streaming on Shudder starting \u003ca href=\"https://www.firstshowing.net/schedule2025/#jan\"\u003e\u003cstrong\u003eJanuary 31st, 2025\u003c/strong\u003e\u003c/a\u003e. \u003cem\u003eLook any good?\u003c/em\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eFind more posts in:\u003c/strong\u003e \u003ca href=\"https://www.firstshowing.net/category/horror/\" rel=\"category tag\"\u003eHorror\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/indies/\" rel=\"category tag\"\u003eIndies\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/worthwatching/\" rel=\"category tag\"\u003eTo Watch\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/trailers/\" rel=\"category tag\"\u003eTrailer\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\u003c/div\u003e\n\t\u003cdiv id=\"rightbar\"\u003e\n\t\t\u003cul id=\"slnav\"\u003e\n\t\t\t\u003cli id=\"prev\"\u003e\u003ca href=\"#\"\u003eprev\u003c/a\u003e\u003c/li\u003e\n\t\t    \u003cli id=\"next\"\u003e\u003ca href=\"#\"\u003enext\u003c/a\u003e\u003c/li\u003e\n\t\t\u003c/ul\u003e\n\t\t\u003cul id=\"slides\"\u003e\n\n\t\t\u003c/ul\u003e\n\t\t\u003c/div\u003e      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-08T18:49:32-05:00",
  "modifiedTime": null
}
