{
  "id": "b54a3a96-ce57-41c8-96e6-3dc39f2b7448",
  "title": "A BREED APART - Heavy on the Laughs, Light on the Scares",
  "link": "https://www.aintitcool.com/node/83612?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
  "description": "Last-Modified: Tue, 20 May 2025 19:16:00 GMT Content-Type: application/rss+xml; charset=utf-8 Ain't It Cool News Feedhttp://www.aintitcool.com/The best in movie, TV, DVD and comic book news.en-usTue, 20 May 2025 19:16:00 +0000A BREED APART - Heavy on the Laughs, Light on the Scareshttps://www.aintitcool.com/node/83612?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsLast-Modified: Tue, 20 May 2025 19:16:00 GMT Content-Type: application/rss+xml; charset=utf-8 Ain't It Cool News Feedhttp://www.aintitcool.com/The best in movie, TV, DVD and comic book news.en-usTue, 20 May 2025 19:16:00 +0000A BREED APART - Heavy on the Laughs, Light on the Scareshttps://www.aintitcool.com/node/83612?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsLast-Modified: Tue, 20 May 2025 19:16:00 GMT Content-Type: application/rss+xml; charset=utf-8 \u003c?xml version=\"1.0\" encoding=\"utf-8\"?\u003e \u003crss xmlns:atom=\"http://www.w3.org/2005/Atom\" version=\"2.0\"\u003e\u003cchannel\u003e\u003ctitle\u003eAin't It Cool News Feed\u003c/title\u003e\u003clink\u003ehttp://www.aintitcool.com/\u003c/link\u003e\u003cdescription\u003eThe best in movie, TV, DVD and comic book news.\u003c/description\u003e\u003catom:link href=\"http://www.aintitcool.com/node/feed/\" rel=\"self\"\u003e\u003c/atom:link\u003e\u003clanguage\u003een-us\u003c/language\u003e\u003clastBuildDate\u003eTue, 20 May 2025 19:16:00 +0000\u003c/lastBuildDate\u003e\u003citem\u003e\u003ctitle\u003eA BREED APART - Heavy on the Laughs, Light on the Scares\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/node/83612?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;A BREED APART - Heavy on the Laughs, Light on the Scares - McEric reviews the new horror/comedy from the Furst Brothers starring Grace Caroline Currey and Page Kennedy.\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/node/83612?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Hello all! McEric here with a review of the Furst Brothers' new horror/comedy A BREED APART, out now in theaters and on-demand. The film follows several Internet celebrities who are invited to an island overrun by rabid dogs to compete for a prize... survival. Check out the trailer:\u0026lt;br\u0026gt; \u0026lt;br\u0026gt; The film stars Grace Caroline Currey (SHAZAM: FURY OF THE GODS, FALL), Virginia Gardner (FALL, 2018's HALLOWEEN), Page Kennedy (THE MEG, THE MEG 2), Troy Gentile (ABC's \"The Goldbergs\"), Riele Downs (Nickelodeon's \"Henry Danger\"), Zak Steiner (Netflix's \"Jessica Jones\"),and Hayden Panittiere (NBC's \"Heroes\"). The film is directed by Griff Furst and brother Nathan Furst, whose previous collaboration as co-directors brought us NIGHTMARE SHARK. Solo, Griff Furst has directed such films as SWAMP SHARK, GHOST SHARK, and TRAILER PARK SHARK, so he clearly knows his way around a creature feature... even if he doesn't really want to.\u0026lt;br\u0026gt; \"Who is Louie Myman?\" I asked when we spoke this past Friday. [Louie Myman is the credited director of Furst's films 100 MILLION BC and ALLIGATOR ALLEY.)\u0026lt;br\u0026gt; \"Oh, Louie Myman! Do you know Alan Smithee?\"\u0026lt;br\u0026gt; \"Yes.\"\u0026lt;br\u0026gt; \"He's Alan Smithee's brother. Yeah, I mean, it's a tough thing. It's an interesting thing to explore. It's like when you do a creature feature and it rates well, and it does well, they just offer you more of them. And I love them, don't get me wrong. I grew up watching all these creature features - Mysterious Island and Jaws and Cujo. I love those movies, but I love ALL kinds of movies. The creature feature, itself,\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/node/83612?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eMcEric\u003c/dc:creator\u003e\u003cpubDate\u003eTue, 20 May 2025 19:16:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83612\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eBarbarella Says Tim Robinson Makes FRIENDSHIP Fantastic!\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/friendshipreview2025-83611/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;Barbarella Says Tim Robinson Makes FRIENDSHIP Fantastic!\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/friendshipreview2025-83611/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Hey friends! Barbarella here back from hiatus, and I’m delighted to share my thoughts on A24’s newest release, Friendship, which is out NOW! Sometimes people watch trailers and think, “Oh this movie is like [insert movie about a similar topic].” If you’re thinking that about Friendship, it’s not. Genuinely funny without being cruel, Andrew DeYoung’s exploration of adult male friendship proves charming and elicits more than a few hearty laughs from me. \u0026lt;br\u0026gt; In an era where seemingly fewer friendships exist in the real world than online, making new friends may be challenging, particularly for adult men. Keeping them may be nearly impossible. \u0026lt;br\u0026gt; When Craig (Tim Robinson) receives a misdelivered package intended for cool new neighbor Austin (Paul Rudd), Craig walks it over to him. Upon meeting the charismatic and friendly guy, he quickly gets invited in and finds himself actually making friends. His expressions reveal his delight in this newly formed camaraderie with someone who is just so darned interesting. One can’t help but feel happy for his new accomplishment.  \u0026lt;br\u0026gt; Sadly, new friendships are fragile, and in a group setting, Craig doesn’t make the best impression on the guys. It doesn’t take long before Austin begins distancing himself from the awkward neighbor. In his desperation to rekindle the closeness they once shared, Craig makes some questionable decisions that lead to more awkward situations and laughs.\u0026lt;br\u0026gt; On the surface, this is a quirky comedy that relies heavily on Tim Robinson’s performance. However, there is much more to this movie. Throughout, it addresses many common insecurities that men\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/friendshipreview2025-83611/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eBarbarella\u003c/dc:creator\u003e\u003cpubDate\u003eSat, 17 May 2025 14:41:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83611\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eNew (and Old) Releases This Week, with McEric!\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/renner-neighborhood-watch-mob-cops-young-werther-83610/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;McEric cleans up his inbox by dumping reviews for NEIGHBORHOOD WATCH, RENNER, MOB COPS, and YOUNG WERTHER.\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/renner-neighborhood-watch-mob-cops-young-werther-83610/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Hello all! \u0026lt;br\u0026gt; I've got some reviews of two films releasing this Friday, April 25th - but thought I'd also take this opportunity to highlight two other films that are already out there but I haven't yet found the time to cover. Hopefully there's something here for everyone, so let's get right to it:\u0026lt;br\u0026gt; First up is NEIGHBORHOOD WATCH, starring Jack Quaid (NOVOCAINE, THE COMPANION, \"The Boys\"), Jeffrey Dean Morgan (\"The Boys,\" \"The Walking Dead\"), and Malin Ackerman (WATCHMEN, SLAYERS), directed by Duncan Skiles (THE CLOVEHITCH KILLER) and written by Sean Farley. The film features troubled young man Simon McNally (Quaid), who is trying to find his feet after spending a decade in a facility for mental health treatment, and his paranoid ex-security guard neighbor Ed Deerman. The two form an unlikely partnership when Simon believes he's seen a woman kidnapped but is deemed an unreliable witness by police due to his history and behavior. The two men take it upon themselves to investigate the crime and rescue the woman, revealing a deeper web of villainy in their quiet town.\u0026lt;br\u0026gt; \u0026lt;br\u0026gt; Quaid and Morgan have great chemistry, and Quaid, specifically, does some great work in this film. Whereas the majority of his characters have been able to rely and charm and humor, Simon is stripped of these tools due to the abuse he received at a young age, so the tricks that Quaid would normally utilize to endear himself to audiences are out of reach. Quaid does a great job of humanizing McNally as a\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/renner-neighborhood-watch-mob-cops-young-werther-83610/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eMcEric\u003c/dc:creator\u003e\u003cpubDate\u003eThu, 24 Apr 2025 20:33:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83610\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eGina Gershon talks HIGH ROLLERS\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/gina-gershon-interview-killer-joe-showgirls-83609/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;Actress Gina Gershon speaks with McEric about new film HIGH ROLLERS with John Travolta and cult classics SHOWGIRLS and KILLER JOE.\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/gina-gershon-interview-killer-joe-showgirls-83609/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;When I received an email asking me if I wanted to watch a brand new independent film starring John Travolta, Gina Gershon, and Lukas Haas, my first instinct was to say no. When I was told I might be able to interview Gina Gershon, I said sure, and watched Ives’ HIGH ROLLERS. What follows was my experience:\u0026lt;br\u0026gt; \u0026lt;br\u0026gt; This film isn’t good, you guys, but I did watch the whole thing, not only because I had to. It’s a caper, and once I get into a caper, I can’t walk away. I’ve got to know if and how they’ll pull it off. I think that’s universal. That said, this is not a good caper. \u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; The film opens with Travolta as Mason with Gershon as Amy on a beautiful beach, looking out at the crystal blue water. They are gathered with their friends and team to watch two of their own tie the knot, but before they can both conclude their “I dos,” attack helicopters descend, accompanied by SUVS filled with masked mercenaries. They are held at gunpoint and Amy is taken. In a blink, the baddies are gone and the team is unharmed - you know, like mercenaries are wont to do. Next, Mason is giving chase in his muscle car in a poorly edited road piece, concluding in a crash that likely accounts for the film’s entire budget.This is followed by the team grouped around a table while Mason exposition dumps their accolades for the sake of the audience.\u0026lt;br\u0026gt; \u0026lt;br\u0026gt; They are contacted by\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/gina-gershon-interview-killer-joe-showgirls-83609/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eMcEric\u003c/dc:creator\u003e\u003cpubDate\u003eTue, 18 Mar 2025 19:24:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83609\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eNew Releases - RAGING MIDLIFE and AMERICAN DREAMER\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/reviews-raging-midlife-american-dreamer-83608/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;McEric reviews (new) releases RAGING MIDLIFE and AMERICAN DREAMER.\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/reviews-raging-midlife-american-dreamer-83608/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Hello all! McEric here with a quick review of two (new) releases hitting the market this St. Patrick's Day Weekend, both of which I actually enjoyed.\u0026lt;br\u0026gt; RAGING MIDLIFE\u0026lt;br\u0026gt; First was RAGING MIDLIFE, a movie that was pitched to me as starring Paula Abdul (I'm a massive fan), Eddie Griffin (DOUBLE TAKE), Walter Koenig (STAR TREK), and Motch O. Mann, the world's foremost Macho Man Randy Savage impersonator. Yeah, I hear it, too. Luckily, I didn't read any further. I saw Paula Abdul's name and shouted \"I'm in!\" Going in to this film blind is the best way to see it. As I'm furnishing you with a review, however, I must speak further to the film. If you want to skip down to AMERICAN DREAMER and go in blind, I do suggest it. Otherwise, here we go.\u0026lt;br\u0026gt; \u0026lt;br\u0026gt; The film, written by Nic Costa and Rob Taylor, and directed by the latter, follows childhood friends Alex and Mark, now in their midlives (see that?) who are chasing their dragon - a purple tanktop once worn by their favorite wrestler, Raging Abe. Raging Abe is a Macho Man Randy Savage-type character who wears a stove pipe hat and chin beard and lives by five \"proclamations,\" all meant to help his young fans navigate life and walk as better people. The film opens with grainy footage of a talk show appearance (think Arsenio Hall) from Raging Abe and his handler, Mary Todd, played by Abdul. The action opens in the eighties with young Alex and Mark ringside\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/reviews-raging-midlife-american-dreamer-83608/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eMcEric\u003c/dc:creator\u003e\u003cpubDate\u003eSat, 15 Mar 2025 16:35:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83608\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eBarbarella Chats with BLOAT actors Malcolm Fuller and Sawyer Jones\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/bloatinterviewmalcolmsawyer-83607/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;Barbarella Chats with BLOAT actors Malcolm Fuller and Sawyer Jones\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/bloatinterviewmalcolmsawyer-83607/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Hey friends! Barbarella here to chat about feeling bloated. Wait that’s not right. I’m here to chat a bit about Bloat, which will be in Theaters, On Demand and On Digital March 7, 2025. It’s a new horror thriller in which Ben McKenzie (“Gotham,” “The O.C.”) plays Jack, a man stuck working while his family vacations in Japan. As if the FOMO isn’t bad enough, one of his sons starts behaving strangely after almost drowning, and his wife, played by Bojana Novakovic (Edge of Darkness, Drag Me to Hell), must grapple with everything essentially alone, while Jack grows increasingly frustrated with his inability to do anything more than bear witness and offer recommendations and theories. \u0026lt;br\u0026gt; \u0026lt;br\u0026gt; Bloat proves to be pretty fun, generating some tension from the fact that poor Jack is stuck in front of a screen in another country, balancing work and family drama from afar. His sense of powerlessness and the increasing frustration that develops as he video-chats with his family and hears increasingly more unsettling news makes him relatable and really heightens the unease I feel while watching. While the final act doesn't engage me as much as the setup leading up to it, I enjoy enough of the concepts within the story that overall, I like the movie. \u0026lt;br\u0026gt; I got the opportunity to chat with the actors who play the two sons, Malcolm Fuller and Sawyer Jones. Check it out!\u0026lt;br\u0026gt; Barbara: Would you guys tell me about the casting process. Did you get sent the script or did you have to audition? What was that like\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/bloatinterviewmalcolmsawyer-83607/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eBarbarella\u003c/dc:creator\u003e\u003cpubDate\u003eFri, 07 Mar 2025 16:22:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83607\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eDirector Simon West and Star Lucy Liu Talk OLD GUY\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/simon-west-lucy-liu-interview-old-guy-mceric-83606/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;Director Simon West and star Lucy Liu talk OLD GUY, starring Christoph Waltz, now streaming everywhere!\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/simon-west-lucy-liu-interview-old-guy-mceric-83606/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Director Simon West should be a household name; his first film was a little picture from 1997 called CON AIR. Perhaps you've heard of it? He went on to helm similar big budget action extravaganzas, such as 2001's LARA CROFT: TOMB RAIDER and 2012's THE EXPENDABLES 2. Eventually, however, time and changing tastes caught up with West, and now he's directing smaller budget flicks, from action to drama, that move at a slightly slower pace and appeal to a different audience. \u0026lt;br\u0026gt; The same could be said for Danny Dolinski, the titular OLD GUY of West's latest feature, played by Academy-Award Winner Christoph Waltz (INGLORIOUS BASTERDS, THE GREEN HORNET). Danny's a wetworks expert in a field saturated with hot young assassins, desperately trying to prove he's still relevant, often to his detriment. After recovering from a wrist injury that found him relegated to a cleaner role at a local bakery, Danny is itching to get back in the field. When he's told the only role available is support for young assassing Wihlborg (Cooper Hoffman), he is understandably unenthused. He invites his longtime friend Anata (Lucy Liu) along for their job since it'll take them to some charming locations around Europe, and once underway, tries to take point on every hit. Things don't go as planned.\u0026lt;br\u0026gt; \u0026lt;br\u0026gt; As you can probably already divine, there are so many parallels between Waltz's OLD GUY and West's career. Danny was once the best, the biggest game in town, and his name still opens doors... but the game has\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/simon-west-lucy-liu-interview-old-guy-mceric-83606/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eMcEric\u003c/dc:creator\u003e\u003cpubDate\u003eWed, 26 Feb 2025 20:15:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83606\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eJulianna Margulies and Gretchen Mol Talk MILLERS IN MARRIAGE\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/interview-julianna-margulies-gretchen-mol-mceric-83605/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;Julianna Margulies and Gretchen Mol Talk MILLERS IN MARRIAGE, Edward Burns\u0026amp;#39; latest with Eric McClanahan\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/interview-julianna-margulies-gretchen-mol-mceric-83605/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Edward Burns made quite the impression after winning the Best Picture prize at the Sundance Film Festival with his 1995 masterpiece THE BROTHERS MCMULLEN, signifying the emergence of a new and singular voice. The plot synopsis for the film was \"Three Irish Catholic brothers from Long Island struggle to deal with love, marriage, and infidelity.\" Now, thirty years later, Burns has returned with a new vision, MILLERS IN MARRIAGE, with the plot synopsis sounding vaguely familiar - \"Three Irish Catholic siblings from New York struggle to deal with love, marriage, and infidelity.\" What can I say? Dude's got range.\u0026lt;br\u0026gt; \u0026lt;br\u0026gt; \u0026lt;br\u0026gt; However, I'm not here to say that Edward Burns is a one-trick pony or that MILLERS IN MARRIAGE is recycled and tired. Truth is, I really liked this movie. The cast is impeccable and the narrative kept me interested, even when I thought some plot points were a bit contrived or predictable. Burns crafts characters that we want to care about, even if they're narcissistic, self-destructive, manipulative, or just plain wrong. Burns' gift of character and dialogue is that we are drawn into the maw of the devouring devils of his narratives. \u0026lt;br\u0026gt; \u0026lt;br\u0026gt; This film is no different. Following the Miller siblings, Andy (Burns), Maggie (Julianna Margulies), and Eve (Gretchen Mol), and their orbiting cadre of lovers. Andy is a painter, fresh off a separation from his wife Tina (Morena Baccarin) and now dating one of her former colleagues Renee (Minnie Driver). Maggie is an active novelist married to inert novelist Nick (Campbell Scott),\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/interview-julianna-margulies-gretchen-mol-mceric-83605/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eMcEric\u003c/dc:creator\u003e\u003cpubDate\u003eTue, 25 Feb 2025 01:43:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83605\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eSpider One's New Flick LITTLE BITES Releases on Physical Media and SHUDDER This Week\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/little-bites-interviews-spider-one-krsy-fox-mceric-83604/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;Writer/Director Spider One and star Krsy Fox speak with McEric about their new film LITTLE BITES, releasing on physical media Tuesday 2/18 and streaming on SHUDDER Friday 2/21.\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/little-bites-interviews-spider-one-krsy-fox-mceric-83604/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Parenthood is sacrifice, and that is the message behind the latest horror film from filmmaker Michael Cummings, aka Spider One of Powerman 5000, aka Rob Zombie's brother. As he puts it in his director's statement:\u0026lt;br\u0026gt; \"In the film, Mindy’s relationship with her monster, Agyar, is clearly my allegory for parenthood. His bites are her pain. His words are her insecurities. His intentions are to prove Mindy’s failure as a parent. We are in solidarity with Mindy, even if, at times we are frustrated and baffled by her actions. And that is exactly the point. She doesn’t know what to do. None of us do. Framing this movie in horror was a natural choice.\"\u0026lt;br\u0026gt; \u0026lt;br\u0026gt; LITTLE BITES tells the story of Mindy Vogel (Krsy Fox, TERRIFIER 3), who is inexplicably saddled with a demon, Agyar (Jon Skarloff, CAPTAIN AMERICA: THE WINTER SOLDIER) that demands to feast upon her daughter, Alice. Unwilling to acquiesce, Mindy sends Alice to stay with her mother (Bonnie Arons, THE NUN) while she placates the monster with bites of her own flesh, spinning a plan to rid of her the burden once and for all. \u0026lt;br\u0026gt; I had the opportunity to speak with writer/director Spider One and lead actress Krsy Fox, neither of whom I felt comfortable addressing by name because I didn't feel entirely sure if Krsy was just pronounced \"Krissy\" and I couldn't rightly look a man in the face and call him \"Spider\".\u0026lt;br\u0026gt; \u0026lt;br\u0026gt; I really wanted to like this feature when I sat down to watch it, and a lot about it is quite\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/little-bites-interviews-spider-one-krsy-fox-mceric-83604/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eMcEric\u003c/dc:creator\u003e\u003cpubDate\u003eTue, 18 Feb 2025 08:34:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83604\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eTHE THINKING GAME Stream this Friday\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/the-thinking-game-greg-kohs-gary-krieg-83603/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;McEric talks to director Greg Kohs and producer Gary Krieg about the new documentary THE THINKING GAME\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/the-thinking-game-greg-kohs-gary-krieg-83603/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;It’s apparent that we’re living in the future, but how did we get here? Moreover, who shepherded us into this bold new world? Director Greg Kohrs and producer Gary Krieg sought this very answer and it brought them to Demis Hassabis.\u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; Demis Hassabis began his journey as a young chess prodigy before shifting gears toward changing the world. He was drawn to the game as a “A fun thinking game,” but after a particularly long battle at a world tournament, he saw a futility in wasting his brain on games when there were real challenges to which he could apply his talents. \u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; During a gap year between high school and college, Demis got an internship at Bullfrog games, where he implemented rudimentary AI into a PC game called Theme Park. His innovation allowed the NPCs to react to each other as well as the gamers’ intervention and create a more interconnected and immersive experience. This caught the eye of Electronic Arts and changed the trajectory of video games for years to come. Despite this transformative influence, Demis focused on college and after graduation sought to tackle the issue of Artificial General Intelligence.\u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; For the uninitiated, Artificial General Intelligence refers to a true thinking creation. Inspired to a point by the AI Deep Blue defeating Chess master Kasparov in 1997, Demis was duly impressed by the victory but saw the limitation of an innovation that could ONLY play chess. As admirable as that was, Demis saw an imminent future where an AI could beat\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/the-thinking-game-greg-kohs-gary-krieg-83603/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eMcEric\u003c/dc:creator\u003e\u003cpubDate\u003eThu, 06 Feb 2025 01:26:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83603\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eSundance Midnight Selection TOUCH ME\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/touch-me-sundance-midnight-83602/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;McEric chats with the writer/director and stars of the Sundance Midnight Selection TOUCH ME\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/touch-me-sundance-midnight-83602/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;The Sundance Film Festival is preparing to hit Park City, Utah once again this Thursday, January 23rd through February 2nd, boasting 88 feature films and a slew of shorts and industry panels. One of the highlights of the festival each year is the Midnight Program, which screens genre pictures late at night. Just last year this program brought us I SAW THE TV GLOW, IN A VIOLENT NATURE, and LOVE LIES BLEEDING, to give you an idea of the type of fare one might find. One particular title in this year's program caught my interest when I read the synopsis and stood out as something that would assuredly be unique. The film is called TOUCH ME by writer/director Addison Heimann, and its synopsis reads:\u0026lt;br\u0026gt; Two codependent best friends become addicted to the heroin-like touch of an alien narcissist who may or may not be trying to take over the world.\u0026lt;br\u0026gt; \u0026lt;br\u0026gt; TOUCH ME is a brilliant meditation on addiction, codependency, and the universal search for acceptance and peace in an ever-increasingly chaotic world. The film's use of color is exquisite, and the four lead actors who propel the story turn in some amazing work. I knew the film would be weird but it exceeded my expectations, and if you like your allegories laugh-out-loud funny and interspersed with tentacle sex, you will love this film, too.\u0026lt;br\u0026gt; I was able to talk to writer/director Addison Heimann, stars Olivia Taylor Dudley, Lou Taylor Pucci, Jordan Gavaris, and Marlene Forte about the film, some of the technical wizardry\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/touch-me-sundance-midnight-83602/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eMcEric\u003c/dc:creator\u003e\u003cpubDate\u003eTue, 21 Jan 2025 04:16:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83602\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eNOSFERATU - Succumb to the Darkness\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/nosferatu-review-eric-mcclanahan-83601/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;Eric McClanahan reviews Robert Eggers\u0026amp;#39;s latest film, NOSFERATU.\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/nosferatu-review-eric-mcclanahan-83601/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Wouldst thou like to live immortally?\u0026lt;br\u0026gt; Robert Eggers is back in theaters with his latest vision, NOSFERATU, a remake of the 1922 film of the same name, which was itself an unlicensed retelling of Bram Stoker's DRACULA. For those who don't know, Eggers is the visionary behind such standout films as THE VVITCH, THE LIGHTHOUSE, and THE NORTHMAN. His films have earned him a fiercely dedicated fanbase and heavy auteur status in Hollywood, essentially giving him carte blanche when it comes to making his films. NOSFERATU is the culmination of that legacy and that power, for better or worse.\u0026lt;br\u0026gt; \u0026lt;br\u0026gt; I saw NOSFERATU last night in a packed theater, my second choice theater as the first had already sold out by the time I arrived. It was preceded by trailers for THE WOLF MAN and THE MONKEY, tailored to its audience of artistic horror hounds. The movie begins with simple white text over black backgrounds, and the first thing the audience hears is a woman crying the darkness. From there, the film is two plus hours of atmosphere and mood, stretched to its near breaking point before the final fade out. Eggers is a master of tone, an Edgar Allan Poe of the visual form, and his legacy as a visual storyteller receives no tarnish with this entry into his oeuvre. So much is explored with a muted color palette and expert use of light and shadow. The camera pulls into darkness, pulls the bodies onscreen into rooms into which they cannot see,\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/nosferatu-review-eric-mcclanahan-83601/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eMcEric\u003c/dc:creator\u003e\u003cpubDate\u003eTue, 31 Dec 2024 01:37:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83601\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eJames Fox Discusses His Documentary THE PROGRAM\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/interview-james-fox-the-program-uap-reports-83600/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;Filmmaker James Fox discusses his new documentary THE PROGRAM which examines the United States government\u0026amp;#39;s pre-existing relationship with UAPs.\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/interview-james-fox-the-program-uap-reports-83600/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;In a new AND NOW FOR SOMETHING COMPLETELY DIFFERENT SEGMENT, I will do something terrifically similar to what I did the last time I did this segment, and now that I'm reading that out loud I realize how ridiculous it sounds. Regardless, I once again enter the realm of Unidentified Anomalous Phenomena and speak with a specialist about what the United States knows, what it doesn't, and the barriers that are preventing it from disclosing its full knowledge to the public.\u0026lt;br\u0026gt; Let's get one thing established right away: the conversation around alien visitation has changed. When I chatted with Disclosure Activist Stephen Bassett back in 2021, we weren't discussing if these visitations were real but rather why we weren't being told about them. Even the classification has changed - they're no longer Unidentified Flying Objects but Unidentified Anomalous Phenomenon, or UAPs. Our government has come clean about their interest in UAPs, largely due to military concerns, and they take sightings seriously. The Defense Department's All-domain Anomaly Resolution Office was created to investigate unidentified anomalies to determine if they're foreign or domestic, dangerous or innocuous, earthbound or alien. That part is transparent, but THE PROGRAM's findings aren't, and that is the subject of filmmaker James Fox's new documentary, THE PROGRAM.\u0026lt;br\u0026gt; \u0026lt;br\u0026gt; I chatted with James Fox, filmmaker of The Phenomenon, Moment of Contact, and I Know What I Saw, to discuss THE PROGRAM after viewing it, and though we were able to talk for quite a while, I didn't really have that many questions. Not because the\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/interview-james-fox-the-program-uap-reports-83600/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eMcEric\u003c/dc:creator\u003e\u003cpubDate\u003eFri, 27 Dec 2024 19:50:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83600\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eBLOODY AXE WOUND is a Bloody Good Time!\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/bloody-axe-wound-hilarie-burton-morgan-interview-83599/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;McEric chats with produced Hilarie Burton Morgan and star Molly Brown about the new SHUDDER exclusive BLOODY AXE WOUND, a coming-of-age slasher comedy with heart(s) to spare.\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/bloody-axe-wound-hilarie-burton-morgan-interview-83599/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Everything about film has changed, and while some lambast this brave new world, it does have its silver linings. Streaming services took over channels and then became their own studios. For every Netflix dud there's a great horror film championed by SHUDDER, Bloody Disgusting, or Fangoria that would go otherwise unproduced. SHUDDER, specifically, has been picking up amazing films, from last year's LATE NIGHT WITH THE DEVIL to this year's IN A VIOLENT NATURE. The studio is ending the year strong with a meta take on the coming-of-age slasher rom-com called BLOODY AXE WOUND, releasing in limited theaters before landing on the streamer in early 2025. The synopsis is as follows:\u0026lt;br\u0026gt; Abbie Bladecut (Sari Arambulo, \"A.P. Bio\") is a teenager torn between the macabre traditions of her family’s bloody trade and the tender stirrings of her first crush (Molly Brown, \"Dexter: Original Sin\"). In the small town of Clover Falls, Abbie’s father, Roger Bladecut (Billy Burke, TWILIGHT), has built an infamous legacy by capturing real-life killings on tape and selling them to eager customers, but as Abbie delves deeper into the grisly family business, she begins to wonder if it’s time to take the family tradition in a new direction. \u0026lt;br\u0026gt; \u0026lt;br\u0026gt; The conceit of the film is surprisingly fresh in a genre that finds new ways to reinvent itself with shocking regularity. Set within the confines of a horror film, we see what it might be like to grow up in a family where the patriarch is a serial killer/slasher who rises from the grave\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/bloody-axe-wound-hilarie-burton-morgan-interview-83599/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eMcEric\u003c/dc:creator\u003e\u003cpubDate\u003eFri, 27 Dec 2024 05:10:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83599\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eBarbarella Dives into Conversation with FREEDIVER Director Michael John Warren!\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/michaeljohnwarreninterview2024freediver-83598/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;Barbarella Dives into Conversation with FREEDIVER Director Michael John Warren!\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/michaeljohnwarreninterview2024freediver-83598/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Hey friends! Barbarella here. Michael John Warren’s latest documentary Freediver is available on Prime Video, or buy or rent on Digital starting December 7, 2024. The film plunges viewers into the world of competitive freediving as it chronicles Alexey Molchanov’s unprecedented attempt to set world records in multiple categories of the sport. Opening with some explanations about diving’s impact on the body, the film draws me back to memories of getting certified to scuba. Prior to those classes, the risks about which I knew were drowning, underwater predators (e.g. sharks), and the bends. Yet, those first days in the classroom, we learned a whole horde of other damaging or fatal consequences of diving that I had never previously considered. Once we were all sufficiently terrified of the consequences of our planned endeavor, it was time to don our gear and plunge into the depths. And we did, despite the inherent risks of injury and death. \u0026lt;br\u0026gt; Although risk-free to myself, witnessing Alexey move gracefully deeper into peril in Freediver proves almost as nerve-wracking as my first open-water dive and leaves me pondering questions, like “How long could I hold my breath?” - the answer is not long at all - or “Would I ever consider free diving?” The answer is maybe, but absolutely not competitively. Those people are insane, superhuman, or both!\u0026lt;br\u0026gt; Whether they are insane or not, I spend much of the film in awe of these people who have trained their bodies to perform skills the human body was never meant to experience.\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/michaeljohnwarreninterview2024freediver-83598/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eBarbarella\u003c/dc:creator\u003e\u003cpubDate\u003eFri, 06 Dec 2024 12:45:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83598\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eTim Sheridan - Creator Interview\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/tim-sheridan-alan-scott-green-lantern-interview-83597/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=comics\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;Tim Sheridan chats about Alan Scott: Green Lantern, Superman: Man of Tomorrow, Batman: The Long Halloween, and adapting legacy stories to small and large screens.\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/tim-sheridan-alan-scott-green-lantern-interview-83597/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=comics\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;When I got into this racket over six years ago, I did so as a fan. In fact, it was a passing text exchange with a friend about the movie A QUIET PLACE that ended with “Hey, do you want to write about movies for a website?” Flash forward, here I am, having interviewed over a hundred creatives in my time with this site and others. Typically, I’ll get an email from a PR firm asking if I want to screen a film and speak with attached talent or read a book and speak with the author. I rarely say no as I firmly believe that everyone is worth talking to and every person you come in contact with can teach you something that you might not learn in your own sphere of social contacts or experiences.\u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; This interview is different. This subject I hunted down. I saw that he was going to be at New York Comic Con this year signing books in Artist Alley, and I’d already interacted with him briefly on Twitter (back when it was Twitter) so I felt I could swing over and say hello. I did, and of course he had some fans in front of him when I arrived so I decided to hang back and let them have their moment. Watching him interact with these fans confirmed everything I believed about this writer - he couldn’t be any nicer, any more accommodating, or any more grateful for the people who celebrate his art.\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/tim-sheridan-alan-scott-green-lantern-interview-83597/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=comics\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eMcEric\u003c/dc:creator\u003e\u003cpubDate\u003eSat, 30 Nov 2024 08:54:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83597\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eJenni \"JWoww\" Farley on Writing/Directing DEVON\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/jenni-jwoww-farley-interview-devon-83596/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;McEric chats with reality star Jenni \u0026amp;quot;JWoww\u0026amp;quot; Farley on her feature-film debut as writer/director of the found-footage horror film DEVON.\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/jenni-jwoww-farley-interview-devon-83596/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Found footage horror. Do you love it? Do you hate it? Do you think it is its own genre or do you lump it in with its overarching tone - slasher, supernatural, monster, etc. Love it or hate it, the convention is here to stay, as it offers a realistic, relatable approach to horror that blurs the lines between reality, film, empathy, and voyeurism.\u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; So, when I got an email asking if I wanted to screen the feature DEVON, written and directed by Jenni “JWoww” Farley, I said “of course I do!” My wife is a fan of “Jersey Shore” and has been since day one, so I mostly did it for her, but I was also very curious what the singular star would bring to the horror pantheon. The logline read:\u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; Devon's parents never stopped searching for answers after her disappearance from a notorious asylum. Years after the incident, a mysterious website draws five adventurers to the abandoned asylum where she was last seen. Armed with cameras, they plunge into the darkness, unaware they’re filming their own descent into horror—never meant to return.\u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; \u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; I got the chance to chat with writer/director/producer Jenni “JWoww” Farley about jumping into a feature-length film, the serendipitous location, and her crew. \u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; \u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; Eric McClanahan: Hey, Jenni! How are you?\u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; Jenni “JWoww” Farley: Good. Nervous. \u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; EM: Nervous? Why are you nervous?\u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; JJF: I feel like this is [me] kind of starting my career over. It’s a different world, a different element. I am a superfan of horror films; I have been since I\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/jenni-jwoww-farley-interview-devon-83596/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eMcEric\u003c/dc:creator\u003e\u003cpubDate\u003eFri, 15 Nov 2024 01:07:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83596\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eHIPPO'S Writer/Director Mark Rapaport Chats Video Games, Sex Talks, and Black-and-White Filmmaking\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/markrapaportinterview2024hippo-83595/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;HIPPO\u0026amp;#39;S Writer/Director Mark Rapaport Chats Video Games, Sex Talks, and Black-and-White Filmmaking\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/markrapaportinterview2024hippo-83595/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Hey, friends! Barbarella here to talk about dark comedy Hippo, or more accurately to share the conversation I had with Hippo’s director and writer Mark Rapaport. Genuinely funny, this incredible film has the potential to achieve cult status, so long as people take a chance on this black-and-white gem and actually see it. I recommend that they do. Hippo stars Kimball Farley, Lilla Kizlinger, Eliza Roberts, and Eric Roberts as the narrator. It tells the story of two exceptionally different teens being raised by their mother in a somewhat isolated existence. At times, it reminds me of Yorgos Lanthimos’ Dogtooth, in the way that the children in Hippo are sheltered, while not in the same extreme way they were in the Greek film, both films make strong points about the detriment of isolation. The two would make a great double-feature, but if you want to jump on this one first, Hippo will be in select theaters November 8. \u0026lt;br\u0026gt; \u0026lt;br\u0026gt; At any rate, after a night of minimal sleep due to staying out late at the Pink concert, I caught up with Mark Rapaport, and we had a fun chat about the movie. Check it out!\u0026lt;br\u0026gt; Barbara: Why go black and white with this? \u0026lt;br\u0026gt; Mark: I've always loved classic movies, but I never thought I would make a movie in black and white until my cinematographer started taking photos of black and white, and I was like, “These are so cool and good, why don't more people shoot in black and white? Maybe we should do something like that.” He was very into that. When\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/markrapaportinterview2024hippo-83595/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eBarbarella\u003c/dc:creator\u003e\u003cpubDate\u003eFri, 08 Nov 2024 15:59:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83595\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eSpooky Picks for Fright Night Flicks\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/hold-your-breath-die-alone-bhff-83594/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;McEric highlights a few spooky films for your Halloween night, including DIE ALONE and HOLD YOUR BREATH.\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/hold-your-breath-die-alone-bhff-83594/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;‘Tis the season, for a few more hours, before Mariah Carey breaks through her ice-cocoon and heralds in the winter holidays. If you need a couple of thrillers to hold back the tide of the inevitable, I’ve got you covered with a couple of brand new features released this very month: HOLD YOUR BREATH and DIE ALONE.\u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; DIE ALONE stars Carrie-Anne Moss (THE MATRIX, “The Acolyte”), Frank Grillo (CAPTAIN AMERICA: THE WINTER SOLDIER, ONE DAY AS A LION), Douglas Smith (HBO’s “Big Love”), and Kimberly-Sue Murray (Netflix’s “V-Wars”). The film is written and directed by Lowell Dean (WOLFCOP, SUPERGRID) and released by Quiver Distribution. After an outbreak turns the majority of the population into plant-based zombies, a young man (Smith) with amnesia searches for his lost love and stumbles across a rugged survivalist (Moss). Check out the trailer:\u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; \u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; If you’re getting “The Last of Us” vibes, you’re on the right track. The film features some pretty great creature effects, apt desolation to sell the apocalypse, and a surprisingly original story. Moss is the star of the show, by far, and carries her scenes with a deadpan humor that keeps the heavy subject matter from swallowing the viewer in despair. The budget limitations are clear but the film that emerges is certainly a smart, fun ride that hits all the points of an apocalyptic thriller with a (predictable) plot twist and great performances.\u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; I got the chance to chat with Carrie-Anne Moss about the production of the film, her bicycle-riding skills, and dream roles.\u0026lt;br\u0026gt; \u0026lt;br\u0026gt; Carrie-Anne\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/hold-your-breath-die-alone-bhff-83594/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eMcEric\u003c/dc:creator\u003e\u003cpubDate\u003eFri, 01 Nov 2024 00:45:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83594\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eSnake Plotzkin Reviews THE LIFE AND DEATHS OF CHRISTOPHER LEE\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/lifeanddeathsofchristopherleeffreview2024-83593/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;Snake Plotzkin Reviews THE LIFE AND DEATHS OF CHRISTOPHER LEE\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/lifeanddeathsofchristopherleeffreview2024-83593/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Snake Plotzkin, reporting from Fantastic Fest 2024, where I got to see the biographical documentary, The Life and Deaths of Christopher Lee. I’m a big fan of Hammer horror, and I will watch literally any Hammer film with Christopher Lee and Peter Cushing in it. One of my favorite Hammer films is Rasputin the Mad Monk, which, if you haven’t seen it, is one of Lee’s best performances. The gigantically tall Lee stalks around St. Peterburg as the mad monk, hypnotizing women, seducing them, and then yelling at them to get out of his room and leave their money on the bed. It’s amazing. \u0026lt;br\u0026gt; \u0026lt;br\u0026gt; If The Life and Deaths of Christopher Lee had been made up completely of anecdotes about Christopher Lee and Peter Cushing on the Hammer films, I would honestly have been very satisfied with it. But the movie unexpectedly goes much further, revealing not just another side of the actor, but multiple facets. For instance, did you know that Christopher Lee fought Nazis? That he may have been the inspiration for James Bond (which was written by his cousin)? That he released two heavy metal albums? Well, this movie goes where no marionette-narrated biopic has gone before, using a mix of interviews, animation, and puppetry to bring Christopher Lee to life (the man himself passed away in 2015).\u0026lt;br\u0026gt; Yes, I said puppetry. The movie is narrated by a marionette of Christopher Lee – who, in an uncanny imitation of Lee’s sonorous voice (played by Peter Szymon Serafinowicz, an English actor\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/lifeanddeathsofchristopherleeffreview2024-83593/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003estaff\u003c/dc:creator\u003e\u003cpubDate\u003eSat, 05 Oct 2024 14:56:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83593\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eSTRANGE HARVEST: THE OCCULT MURDER IN THE INLAND EMPIRE Premieres at Fantastic Fest 2024!\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/strangeharvestinterview2024-83592/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;STRANGE HARVEST: THE OCCULT MURDER IN THE INLAND EMPIRE Premieres at Fantastic Fest 2024!\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/strangeharvestinterview2024-83592/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Hey friends. Barbarella here. Strange Harvest: The Occult Murder in the Inland Empire is a long title for a great narrative utilizing the true-crime documentary format. The format proves so effective at tricking my brain into thinking I’m watching actual footage of crime scenes and caught-on-tape moments that I had to occasionally remind myself to relax, it’s only a movie. \u0026lt;br\u0026gt; It made its world premiere at Fantastic Fest 2024 on September 22, 2024 at 11:50 p.m. CT, and I had the delightful opportunity to sit down with genre director Stuart Ortiz, and actors Peter Zisso and Terri Apple in Austin last week. Check it out!\u0026lt;br\u0026gt; \u0026lt;br\u0026gt; Barbara: I'm one of these people that I can watch the most gruesome stuff in movies, and it doesn't bother me, heads getting drilled and stuff.\u0026lt;br\u0026gt; Peter: Bless You. \u0026lt;br\u0026gt; Barbara: But it really upsets me to see people getting hurt, even these skateboarding videos and such, and this movie messed with my brain because I knew it’s fictional, but my brain got tricked into thinking it was real at times because the way it was done. I'm very impressed with the effectiveness of that. \u0026lt;br\u0026gt; Stuart: Thank you.  \u0026lt;br\u0026gt; Barbara: Why do this in a true crime format? What were you going for? \u0026lt;br\u0026gt; Stuart: I just think it's a really interesting way to tell a story, and in particular to tell a horror story because it just allows you to have this vantage point that you don't normally have with horror, to investigate certain details or aspects of a horror story that you wouldn't focus on necessarily in a more conventional story. I\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/strangeharvestinterview2024-83592/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eBarbarella\u003c/dc:creator\u003e\u003cpubDate\u003eSat, 05 Oct 2024 02:02:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83592\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eKevin Smith Talks THE 4:30 MOVIE\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/kevin-smith-interview-eric-mcclanahan-430-movie-83591/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;Kevin Smith Talks to McEric about THE 4:30 MOVIE\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/kevin-smith-interview-eric-mcclanahan-430-movie-83591/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Kevin Smith’s THE 4:30 MOVIE is coming home today, available on digital through all major retailers. The film tells the story of young Brian David, an avatar of Kevin Smith, and his adventures at the local Atlantic Cinema where he watches films with his friends Burny and Belly in 1986. It’s a departure from the View Askewniverse that Smith started thirty years ago, which admittedly stretched to its possible breaking point as the characters within encountered rebel angels, demons, Hollywood, jewel thieves, terrorists, and a monkey. THE 4:30 MOVIE offers a much more grounded story of a simpler time when the cinema and video store ruled the weekend, and the lives on the silver screen either mirrored our own or showed us worlds we could only imagine. \u0026lt;br\u0026gt; \u0026lt;br\u0026gt; I had the opportunity to chat with Kevin Smith yesterday in support of the film’s digital release and it went exactly as I thought it would: we were given six minutes, I asked one question, and he talked for eight. What I got in that response, though, was a good deal of wisdom about what the filmmaker attempts when he puts his memories to screen for our amusement, how he’s remained relevant, and where his ideas originate. Prior to the interview’s start, my cat Bennie decided she needed to be part of it all, as well, and leapt onto the seat behind me. \u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; Eric McClanahan - Hi Kevin!\u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; Kevin Smith - Hello, Eric! How are you?\u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; EM - I’m well, thank you!\u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; KS - Look at that cat!\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/kevin-smith-interview-eric-mcclanahan-430-movie-83591/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eMcEric\u003c/dc:creator\u003e\u003cpubDate\u003eTue, 01 Oct 2024 08:37:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83591\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eInterview with the Cast of TERRIFIER 3\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/terrifier-3-david-howard-thornton-lauren-lavera-83590/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;McEric chats with David Howard Thornton (Art the Clown) and Lauren Lavera (Sienna Shaw) ahead of Damien Leone\u0026amp;#39;s TERRIFIER 3\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/terrifier-3-david-howard-thornton-lauren-lavera-83590/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Time to crawl out from under your bridges, ghouls, because Damien Leone’s Art the Clown is back in TERRIFIER 3, hitting theaters October 11th. This time the terror is set against the backdrop of Christmas, with Art (David Howard Thornton) returning to hunt down Sienna (Lauren Lavera) after she cut his head off in the last installment. The film picks up right at the end of Part 2 before allowing Art to take a five year siesta while Sienna spends time in facilities piecing her psyche back together. Young Jonathan Shaw (Elliott Fullam) isn’t so young anymore, attending college near his Aunt and Uncle, Jessica and Mark (Margaret Anne Florence and Alex Ross), with whom Sienna stays after being checked out of the latest facility. \u0026lt;br\u0026gt; \u0026lt;br\u0026gt; The film opens with Art dispatching a family while dressed in a Santa Claus suit, letting the audience know right away that no one is safe. The entire film plays out as a supercut of gory kills and dark humor, with occasional moments of genuine world-building that allows the supporting cast to really stretch their acting muscles. Plotwise, the film seems to be more focused on showcasing creative kills than telling a cohesive story, and the end seems somewhat rushed, as though the filmmakers had almost forgotten that they had to end the thing. \u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; What a TERRIFIER fan is looking for, however, is exactly what they’ll find in 3: inventive kills, stomach-turning sound design, laughs that’ll make you question your own morality, and surprises. When I got\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/terrifier-3-david-howard-thornton-lauren-lavera-83590/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eMcEric\u003c/dc:creator\u003e\u003cpubDate\u003eTue, 01 Oct 2024 01:03:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83590\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eBarbarella Talks AI With SUBSERVIENCE Director S.K. Dale\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/skdaleinterview2024subservience-83589/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;Barbarella Talks AI With SUBSERVIENCE Director S.K. Dale\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/skdaleinterview2024subservience-83589/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Hi friends, Barbarella here. Sci-fi film Subservience, starring Megan Fox, Michele Morrone  (his name’s Italian so the “ch” is pronounced like a “k”), Madeline Zima, and Matilda Firth, just came out on Demand and Digital, so let’s talk about AI. Do you think artificial intelligence will bring about major medical advancements, or do you envision more of a Terminator situation evolving? I tend to think it’s not the AI itself but whoever’s behind it that should be on whom we focus our concern. When it comes to cinema, filmmakers always hold technology responsible, because let’s face it, that makes for a more entertaining movie. I would argue Will Honley and April Maguire’s screenplay puts at least some of the onus on the humans. Maybe don’t say certain things to a Sim that’s constantly evolving and learning; that’s all I’m saying. If it weren’t for one comment made to Alice (Megan Fox), the attractive Sim acquired to help out around the house, perhaps a lot of mayhem could have been avoided. \u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; I appreciate that the conflict in Subservience primarily occurs within the family unit, as this makes it more believable to me. Favoring older technologies, Nick (Michele Morrone) isn’t the biggest fan of artificial intelligence, but when he and his sick wife (Madeline Zima) can’t keep up with managing the household and children, he caves and gets Alice, the best new Sim on the market, to help out, and you know that’s not going to work out quite how everyone expects, well, at least how everyone\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/skdaleinterview2024subservience-83589/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eBarbarella\u003c/dc:creator\u003e\u003cpubDate\u003eSat, 14 Sep 2024 13:57:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83589\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eTHE 4:30 MOVIE's Cast Speaks About Kevin Smith's New Comedy\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/interview-cast-new-kevin-smith-film-83588/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;McEric chats with the cast of Kevin Smith\u0026amp;#39;s THE 4:30 MOVIE\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/interview-cast-new-kevin-smith-film-83588/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Writer/Director Kevin Smith began his View Askewniverse in 1994 with his breakout hit CLERKS. The film tells the story of a couple of slackers working dead-end jobs in New Jersey in the 1990s and the conversations and misadventures they dabble in along the way. The film paved the way for countless stories, and so far nine films by Smith have rounded out its canon, along with several animated adventures and more in the pages of comic books. Before Dante and Randall ever sat around the Quik Stop and chatted about JAWS, STAR WARS, or even NAVY SEALS, young Kevin Smith was a New Jersey native soaking up inspiration on the silver screen at his local movie theater, the Atlantic Highlands Cinema. Flash forward to today and he owns that theater, rebranded as the Smodcastle, where he showcases new releases, repertory classics, film festivals, and even special screenings of “Movies With Kev,” where he screens a classic and participates in a Q\u0026amp;A following the screening.\u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; Finally the formative experiences of young Kev are getting their own film treatment, with Kevin Smith’s newest release, THE 4:30 MOVIE, premiering tomorrow in cinemas around the country. The film, not set within the View Askewniverse, tells the story of a young man named Brian David, a not-even-thinly-veiled stand-in for Kevin Smith, played by Austin Zajur, who one day in the late spring of 1986 asks his crush Melody Barnegat (Siena Agudong) to meet him at the movies. This is much to the chagrin of his two\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/interview-cast-new-kevin-smith-film-83588/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eMcEric\u003c/dc:creator\u003e\u003cpubDate\u003eFri, 13 Sep 2024 00:11:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83588\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eShiloh Fernandez Discusses Working With Nadine Crocker on CONTINUE\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/shilohfernandezinterview2024continue-83586/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;Shiloh Fernandez Discusses Working With Nadine Crocker on CONTINUE\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/shilohfernandezinterview2024continue-83586/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Hey, friends! Barbarella here. It feels a little wrong that I have a ton of pep today while I’m covering a movie about the very serious topic of suicide, but here we are. Continue makes a personal and powerful statement from writer, director, and star Nadine Crocker, who survived her own suicide attempt in her twenties. In Theaters, On Demand and Digital September 6, 2024, Continue escorts viewers through Dean’s struggles as she experience life after a suicide attempt. Beautifully shot, the film also includes an unexpected love story, albeit, I’m not sure I believe that two people would be that flirtatious while discussing their past traumas, but just because I wouldn’t flirt while sharing horrific things from the past doesn’t mean it’s not possible that some people might. Anyway, before I veer too far off-topic, the movie stars an actor of whom I’ve been a fan since first seeing him about fifteen years ago in an independent film at Fantastic Fest called Deadgirl, and I’m grateful to have the opportunity to chat with that actor, Shiloh Fernandez, about the film. \u0026lt;br\u0026gt; Right out of the gate, I share my love of Deadgirl and Shiloh’s performance in it. Check out his response and the rest of our conversation! \u0026lt;br\u0026gt; Shiloh: That is so sweet. It’s still one of my favorite movies. I loved doing a small movie like that, and all these years later, to do Continue, I think it was maybe the 2nd smallest. It is really neat having these small movies make an impact. \u0026lt;br\u0026gt; Barbara: I don’t know what it says about me, but Deadgirl was one\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/shilohfernandezinterview2024continue-83586/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eBarbarella\u003c/dc:creator\u003e\u003cpubDate\u003eFri, 06 Sep 2024 11:06:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83586\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eBarbarella and Director Audrey Cummings Discuss Western PLACE OF BONES!\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/audreycummingsinterview2024placeofbones-83585/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;Barbarella and Director Audrey Cummings Discuss Western PLACE OF BONES!\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/audreycummingsinterview2024placeofbones-83585/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Hey, friends. Barbarella here. A new Western, Place of Bones, rides into theaters and on digital Friday, August 23, 2024. Unlike the Westerns of yesteryear, this one is female-led, with Audrey Cummings in the director’s chair and Heather Graham shining in the lead role as a mother who, along with her daughter (Brielle Robillard), must fight for survival when a gang of outlaws, led by Tom Hopper, arrives in the area.   \u0026lt;br\u0026gt; I’ve been a Tom Hopper fan ever since he won me over with his enticing portrayal of Billy Bones in Black Sails. He earns additional adoration from me through the way he injects subtle humor as villain Bear John in this film. I find myself laughing at moments that I’m fairly certain weren’t intended to be funny, yet he fires wit like a true sharp-shooter with a faint exasperation about him that’s just funny. However, he’s not the only one who offers something more than just delivering what’s written on the page. Corin Nemec, Brielle Robillard, and Heather Graham also add an extra something that gives insight into their characters and adds a bit of snark to the exchanges.\u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; I had the opportunity to speak with Audrey Cummings, and I sometimes like to break the ice with a question about Muppet-casting on remakes. While she placed Kermit, Miss Piggy and Fozzy Bear in the lead roles of Calhoun (Corin Nemec), Pandora (Heather Graham), and Hester (Brielle Robillard), I took a completely different approach, thinking it would be fun to have Statler and\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/audreycummingsinterview2024placeofbones-83585/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eBarbarella\u003c/dc:creator\u003e\u003cpubDate\u003eThu, 22 Aug 2024 23:29:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83585\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003e#ALL MY FRIENDS ARE DEAD\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/all-my-friends-are-dead-interview-83584/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;#ALL MY FRIENDS ARE DEAD director Marcus Dunstan and star Jade Pettyjohn talk to McEric about the new slasher comedy!\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/all-my-friends-are-dead-interview-83584/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;There was every manner of film at this year’s Tribeca Festival, and I managed to take in thirteen features, four shorts, and an episodic premiere by the time the whole thing wrapped this past June. One of the highlights was the opportunity to interview two of the lead talents behind the new slasher ALL MY FRIENDS ARE DEAD: director Marcus Dunstan and star Jade Pettyjohn. We met at the Roxy Hotel bar and restaurant, a favorite meetup spot of mine, on a Saturday morning. I was, admittedly, running late, but they were so patient and gracious with me and I always appreciate that from stars and filmmakers, whose lives are probably ten times as cluttered as mine. \u0026lt;br\u0026gt; Its logline says of the film: “A group of college friends rents an airbnb for the biggest music festival of the year. However, their weekend of partying soon takes a deadly turn as a masked killer murders them one by one according to their sins.”\u0026lt;br\u0026gt; \u0026lt;br\u0026gt; The film, though familiar in synopsis, finds a way to inject new life into a tired formula. The design of the killer is unique, the kills are creative, the victims are fighters rather than training dummies, for the most part, and the twist(s) are welcome.\u0026lt;br\u0026gt;  \u0026lt;br\u0026gt; Marcus Dunstan is perpetually smiling, speaking in a small voice from a large, gentle face. Jade Pettyjohn is excitable, clearly enjoying being at the festival and also talking about this joyous diversion in her filmography. We couldn’t help but jump right in. Unfortunately, I recorded this\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/all-my-friends-are-dead-interview-83584/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=reviews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eMcEric\u003c/dc:creator\u003e\u003cpubDate\u003eSat, 17 Aug 2024 00:12:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83584\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eCheck Out This Trailer for Psychological Thriller SLINGSHOT!!\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/slingshottrailer-83583/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;Check Out This Trailer for Psychological Thriller SLINGSHOT!!\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/slingshottrailer-83583/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;Hey friends, Barbarella here. It seems like ages since we’ve had a really cool psychological thriller that takes place in space, but it appears that Slingshot may fill that void. When a trio of elite astronauts set to undertake a risky slingshot maneuver, potential issues with both the ship and a crew member add to the dangers of the mission. Starring Casey Affleck, Laurence Fishburne, Emily Beecham, Tomer Capone, and David Morrissey, the film hits theaters nationwide August 30th.\u0026lt;br\u0026gt; Check out the trailer!\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/slingshottrailer-83583/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eBarbarella\u003c/dc:creator\u003e\u003cpubDate\u003eTue, 30 Jul 2024 21:00:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83583\u003c/guid\u003e\u003c/item\u003e\u003citem\u003e\u003ctitle\u003eSDCC Robert Downey Jr returns to MCU!\u003c/title\u003e\u003clink\u003ehttps://www.aintitcool.com/sdcc-robert-downey-returns-83582/?utm_source=full-feed\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u003c/link\u003e\u003cdescription\u003e\u0026lt;p\u0026gt;Robert Downey Jr is back but not as we know it!\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/sdcc-robert-downey-returns-83582/?utm_source=inside-top\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Read the full article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;In perhaps the most shocking story to come out of this year's otherwise short-on news panel from Marvel Studios, Robert Downey Jr is returning to the MCU. It has just been announced that he has been cast as none other than the great green dictator Doctor Doom. Taking to the stage Downey Jr had this to say:\u0026lt;br\u0026gt; \"New mask, same task...What can I tell ya, I like playing complicated characters.\"\u0026lt;br\u0026gt; Whether or not he’ll be the genuine Earth 616 version or the Doom from the alternate Universe Fantastic Four: First Steps seems to be set in remains to be seen. Either way, welcome back to the fold RDJ.\u0026lt;br\u0026gt; The panel revealed that Downey Jr’s Doom would make his presence known in the freshly titled Avengers: Doomsday which has a release date of May 2026 with Avengers: Secret Wars following in May 2027.\u0026lt;br\u0026gt;  Let us know what you think of this curveball in the comments down below!\u0026lt;/p\u0026gt; \u0026lt;p\u0026gt;\u0026lt;a href=\"https://www.aintitcool.com/sdcc-robert-downey-returns-83582/?utm_source=inside-bottom\u0026amp;utm_medium=feed\u0026amp;utm_term=coolnews\u0026amp;utm_campaign=1310_RSS\"\u0026gt;\u0026lt;b\u0026gt;Finish the article on AICN\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt;\u0026lt;/p\u0026gt; \u003c/description\u003e\u003cdc:creator xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\u003eHouseOfMacleod\u003c/dc:creator\u003e\u003cpubDate\u003eSun, 28 Jul 2024 08:58:00 +0000\u003c/pubDate\u003e\u003cguid\u003e83582\u003c/guid\u003e\u003c/item\u003e\u003c/channel\u003e\u003c/rss\u003eMcEricTue, 20 May 2025 19:16:00 +000083612Barbarella Says Tim Robinson Makes FRIENDSHIP Fantastic!https://www.aintitcool.com/friendshipreview2025-83611/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eBarbarella Says Tim Robinson Makes FRIENDSHIP Fantastic!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/friendshipreview2025-83611/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHey friends! Barbarella here back from hiatus, and I’m delighted to share my thoughts on A24’s newest release, Friendship, which is out NOW! Sometimes people watch trailers and think, “Oh this movie is like [insert movie about a similar topic].” If you’re thinking that about Friendship, it’s not. Genuinely funny without being cruel, Andrew DeYoung’s exploration of adult male friendship proves charming and elicits more than a few hearty laughs from me. \u003cbr\u003e In an era where seemingly fewer friendships exist in the real world than online, making new friends may be challenging, particularly for adult men. Keeping them may be nearly impossible. \u003cbr\u003e When Craig (Tim Robinson) receives a misdelivered package intended for cool new neighbor Austin (Paul Rudd), Craig walks it over to him. Upon meeting the charismatic and friendly guy, he quickly gets invited in and finds himself actually making friends. His expressions reveal his delight in this newly formed camaraderie with someone who is just so darned interesting. One can’t help but feel happy for his new accomplishment.  \u003cbr\u003e Sadly, new friendships are fragile, and in a group setting, Craig doesn’t make the best impression on the guys. It doesn’t take long before Austin begins distancing himself from the awkward neighbor. In his desperation to rekindle the closeness they once shared, Craig makes some questionable decisions that lead to more awkward situations and laughs.\u003cbr\u003e On the surface, this is a quirky comedy that relies heavily on Tim Robinson’s performance. However, there is much more to this movie. Throughout, it addresses many common insecurities that men\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/friendshipreview2025-83611/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaSat, 17 May 2025 14:41:00 +000083611New (and Old) Releases This Week, with McEric!https://www.aintitcool.com/renner-neighborhood-watch-mob-cops-young-werther-83610/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eMcEric cleans up his inbox by dumping reviews for NEIGHBORHOOD WATCH, RENNER, MOB COPS, and YOUNG WERTHER.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/renner-neighborhood-watch-mob-cops-young-werther-83610/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHello all! \u003cbr\u003e I've got some reviews of two films releasing this Friday, April 25th - but thought I'd also take this opportunity to highlight two other films that are already out there but I haven't yet found the time to cover. Hopefully there's something here for everyone, so let's get right to it:\u003cbr\u003e First up is NEIGHBORHOOD WATCH, starring Jack Quaid (NOVOCAINE, THE COMPANION, \"The Boys\"), Jeffrey Dean Morgan (\"The Boys,\" \"The Walking Dead\"), and Malin Ackerman (WATCHMEN, SLAYERS), directed by Duncan Skiles (THE CLOVEHITCH KILLER) and written by Sean Farley. The film features troubled young man Simon McNally (Quaid), who is trying to find his feet after spending a decade in a facility for mental health treatment, and his paranoid ex-security guard neighbor Ed Deerman. The two form an unlikely partnership when Simon believes he's seen a woman kidnapped but is deemed an unreliable witness by police due to his history and behavior. The two men take it upon themselves to investigate the crime and rescue the woman, revealing a deeper web of villainy in their quiet town.\u003cbr\u003e \u003cbr\u003e Quaid and Morgan have great chemistry, and Quaid, specifically, does some great work in this film. Whereas the majority of his characters have been able to rely and charm and humor, Simon is stripped of these tools due to the abuse he received at a young age, so the tricks that Quaid would normally utilize to endear himself to audiences are out of reach. Quaid does a great job of humanizing McNally as a\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/renner-neighborhood-watch-mob-cops-young-werther-83610/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricThu, 24 Apr 2025 20:33:00 +000083610Gina Gershon talks HIGH ROLLERShttps://www.aintitcool.com/gina-gershon-interview-killer-joe-showgirls-83609/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eActress Gina Gershon speaks with McEric about new film HIGH ROLLERS with John Travolta and cult classics SHOWGIRLS and KILLER JOE.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/gina-gershon-interview-killer-joe-showgirls-83609/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eWhen I received an email asking me if I wanted to watch a brand new independent film starring John Travolta, Gina Gershon, and Lukas Haas, my first instinct was to say no. When I was told I might be able to interview Gina Gershon, I said sure, and watched Ives’ HIGH ROLLERS. What follows was my experience:\u003cbr\u003e \u003cbr\u003e This film isn’t good, you guys, but I did watch the whole thing, not only because I had to. It’s a caper, and once I get into a caper, I can’t walk away. I’ve got to know if and how they’ll pull it off. I think that’s universal. That said, this is not a good caper. \u003cbr\u003e  \u003cbr\u003e The film opens with Travolta as Mason with Gershon as Amy on a beautiful beach, looking out at the crystal blue water. They are gathered with their friends and team to watch two of their own tie the knot, but before they can both conclude their “I dos,” attack helicopters descend, accompanied by SUVS filled with masked mercenaries. They are held at gunpoint and Amy is taken. In a blink, the baddies are gone and the team is unharmed - you know, like mercenaries are wont to do. Next, Mason is giving chase in his muscle car in a poorly edited road piece, concluding in a crash that likely accounts for the film’s entire budget.This is followed by the team grouped around a table while Mason exposition dumps their accolades for the sake of the audience.\u003cbr\u003e \u003cbr\u003e They are contacted by\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/gina-gershon-interview-killer-joe-showgirls-83609/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricTue, 18 Mar 2025 19:24:00 +000083609New Releases - RAGING MIDLIFE and AMERICAN DREAMERhttps://www.aintitcool.com/reviews-raging-midlife-american-dreamer-83608/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eMcEric reviews (new) releases RAGING MIDLIFE and AMERICAN DREAMER.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/reviews-raging-midlife-american-dreamer-83608/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHello all! McEric here with a quick review of two (new) releases hitting the market this St. Patrick's Day Weekend, both of which I actually enjoyed.\u003cbr\u003e RAGING MIDLIFE\u003cbr\u003e First was RAGING MIDLIFE, a movie that was pitched to me as starring Paula Abdul (I'm a massive fan), Eddie Griffin (DOUBLE TAKE), Walter Koenig (STAR TREK), and Motch O. Mann, the world's foremost Macho Man Randy Savage impersonator. Yeah, I hear it, too. Luckily, I didn't read any further. I saw Paula Abdul's name and shouted \"I'm in!\" Going in to this film blind is the best way to see it. As I'm furnishing you with a review, however, I must speak further to the film. If you want to skip down to AMERICAN DREAMER and go in blind, I do suggest it. Otherwise, here we go.\u003cbr\u003e \u003cbr\u003e The film, written by Nic Costa and Rob Taylor, and directed by the latter, follows childhood friends Alex and Mark, now in their midlives (see that?) who are chasing their dragon - a purple tanktop once worn by their favorite wrestler, Raging Abe. Raging Abe is a Macho Man Randy Savage-type character who wears a stove pipe hat and chin beard and lives by five \"proclamations,\" all meant to help his young fans navigate life and walk as better people. The film opens with grainy footage of a talk show appearance (think Arsenio Hall) from Raging Abe and his handler, Mary Todd, played by Abdul. The action opens in the eighties with young Alex and Mark ringside\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/reviews-raging-midlife-american-dreamer-83608/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricSat, 15 Mar 2025 16:35:00 +000083608Barbarella Chats with BLOAT actors Malcolm Fuller and Sawyer Joneshttps://www.aintitcool.com/bloatinterviewmalcolmsawyer-83607/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eBarbarella Chats with BLOAT actors Malcolm Fuller and Sawyer Jones\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/bloatinterviewmalcolmsawyer-83607/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHey friends! Barbarella here to chat about feeling bloated. Wait that’s not right. I’m here to chat a bit about Bloat, which will be in Theaters, On Demand and On Digital March 7, 2025. It’s a new horror thriller in which Ben McKenzie (“Gotham,” “The O.C.”) plays Jack, a man stuck working while his family vacations in Japan. As if the FOMO isn’t bad enough, one of his sons starts behaving strangely after almost drowning, and his wife, played by Bojana Novakovic (Edge of Darkness, Drag Me to Hell), must grapple with everything essentially alone, while Jack grows increasingly frustrated with his inability to do anything more than bear witness and offer recommendations and theories. \u003cbr\u003e \u003cbr\u003e Bloat proves to be pretty fun, generating some tension from the fact that poor Jack is stuck in front of a screen in another country, balancing work and family drama from afar. His sense of powerlessness and the increasing frustration that develops as he video-chats with his family and hears increasingly more unsettling news makes him relatable and really heightens the unease I feel while watching. While the final act doesn't engage me as much as the setup leading up to it, I enjoy enough of the concepts within the story that overall, I like the movie. \u003cbr\u003e I got the opportunity to chat with the actors who play the two sons, Malcolm Fuller and Sawyer Jones. Check it out!\u003cbr\u003e Barbara: Would you guys tell me about the casting process. Did you get sent the script or did you have to audition? What was that like\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/bloatinterviewmalcolmsawyer-83607/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaFri, 07 Mar 2025 16:22:00 +000083607Director Simon West and Star Lucy Liu Talk OLD GUYhttps://www.aintitcool.com/simon-west-lucy-liu-interview-old-guy-mceric-83606/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eDirector Simon West and star Lucy Liu talk OLD GUY, starring Christoph Waltz, now streaming everywhere!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/simon-west-lucy-liu-interview-old-guy-mceric-83606/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eDirector Simon West should be a household name; his first film was a little picture from 1997 called CON AIR. Perhaps you've heard of it? He went on to helm similar big budget action extravaganzas, such as 2001's LARA CROFT: TOMB RAIDER and 2012's THE EXPENDABLES 2. Eventually, however, time and changing tastes caught up with West, and now he's directing smaller budget flicks, from action to drama, that move at a slightly slower pace and appeal to a different audience. \u003cbr\u003e The same could be said for Danny Dolinski, the titular OLD GUY of West's latest feature, played by Academy-Award Winner Christoph Waltz (INGLORIOUS BASTERDS, THE GREEN HORNET). Danny's a wetworks expert in a field saturated with hot young assassins, desperately trying to prove he's still relevant, often to his detriment. After recovering from a wrist injury that found him relegated to a cleaner role at a local bakery, Danny is itching to get back in the field. When he's told the only role available is support for young assassing Wihlborg (Cooper Hoffman), he is understandably unenthused. He invites his longtime friend Anata (Lucy Liu) along for their job since it'll take them to some charming locations around Europe, and once underway, tries to take point on every hit. Things don't go as planned.\u003cbr\u003e \u003cbr\u003e As you can probably already divine, there are so many parallels between Waltz's OLD GUY and West's career. Danny was once the best, the biggest game in town, and his name still opens doors... but the game has\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/simon-west-lucy-liu-interview-old-guy-mceric-83606/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricWed, 26 Feb 2025 20:15:00 +000083606Julianna Margulies and Gretchen Mol Talk MILLERS IN MARRIAGEhttps://www.aintitcool.com/interview-julianna-margulies-gretchen-mol-mceric-83605/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eJulianna Margulies and Gretchen Mol Talk MILLERS IN MARRIAGE, Edward Burns\u0026#39; latest with Eric McClanahan\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/interview-julianna-margulies-gretchen-mol-mceric-83605/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eEdward Burns made quite the impression after winning the Best Picture prize at the Sundance Film Festival with his 1995 masterpiece THE BROTHERS MCMULLEN, signifying the emergence of a new and singular voice. The plot synopsis for the film was \"Three Irish Catholic brothers from Long Island struggle to deal with love, marriage, and infidelity.\" Now, thirty years later, Burns has returned with a new vision, MILLERS IN MARRIAGE, with the plot synopsis sounding vaguely familiar - \"Three Irish Catholic siblings from New York struggle to deal with love, marriage, and infidelity.\" What can I say? Dude's got range.\u003cbr\u003e \u003cbr\u003e \u003cbr\u003e However, I'm not here to say that Edward Burns is a one-trick pony or that MILLERS IN MARRIAGE is recycled and tired. Truth is, I really liked this movie. The cast is impeccable and the narrative kept me interested, even when I thought some plot points were a bit contrived or predictable. Burns crafts characters that we want to care about, even if they're narcissistic, self-destructive, manipulative, or just plain wrong. Burns' gift of character and dialogue is that we are drawn into the maw of the devouring devils of his narratives. \u003cbr\u003e \u003cbr\u003e This film is no different. Following the Miller siblings, Andy (Burns), Maggie (Julianna Margulies), and Eve (Gretchen Mol), and their orbiting cadre of lovers. Andy is a painter, fresh off a separation from his wife Tina (Morena Baccarin) and now dating one of her former colleagues Renee (Minnie Driver). Maggie is an active novelist married to inert novelist Nick (Campbell Scott),\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/interview-julianna-margulies-gretchen-mol-mceric-83605/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricTue, 25 Feb 2025 01:43:00 +000083605Spider One's New Flick LITTLE BITES Releases on Physical Media and SHUDDER This Weekhttps://www.aintitcool.com/little-bites-interviews-spider-one-krsy-fox-mceric-83604/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eWriter/Director Spider One and star Krsy Fox speak with McEric about their new film LITTLE BITES, releasing on physical media Tuesday 2/18 and streaming on SHUDDER Friday 2/21.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/little-bites-interviews-spider-one-krsy-fox-mceric-83604/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eParenthood is sacrifice, and that is the message behind the latest horror film from filmmaker Michael Cummings, aka Spider One of Powerman 5000, aka Rob Zombie's brother. As he puts it in his director's statement:\u003cbr\u003e \"In the film, Mindy’s relationship with her monster, Agyar, is clearly my allegory for parenthood. His bites are her pain. His words are her insecurities. His intentions are to prove Mindy’s failure as a parent. We are in solidarity with Mindy, even if, at times we are frustrated and baffled by her actions. And that is exactly the point. She doesn’t know what to do. None of us do. Framing this movie in horror was a natural choice.\"\u003cbr\u003e \u003cbr\u003e LITTLE BITES tells the story of Mindy Vogel (Krsy Fox, TERRIFIER 3), who is inexplicably saddled with a demon, Agyar (Jon Skarloff, CAPTAIN AMERICA: THE WINTER SOLDIER) that demands to feast upon her daughter, Alice. Unwilling to acquiesce, Mindy sends Alice to stay with her mother (Bonnie Arons, THE NUN) while she placates the monster with bites of her own flesh, spinning a plan to rid of her the burden once and for all. \u003cbr\u003e I had the opportunity to speak with writer/director Spider One and lead actress Krsy Fox, neither of whom I felt comfortable addressing by name because I didn't feel entirely sure if Krsy was just pronounced \"Krissy\" and I couldn't rightly look a man in the face and call him \"Spider\".\u003cbr\u003e \u003cbr\u003e I really wanted to like this feature when I sat down to watch it, and a lot about it is quite\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/little-bites-interviews-spider-one-krsy-fox-mceric-83604/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricTue, 18 Feb 2025 08:34:00 +000083604THE THINKING GAME Stream this Fridayhttps://www.aintitcool.com/the-thinking-game-greg-kohs-gary-krieg-83603/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eMcEric talks to director Greg Kohs and producer Gary Krieg about the new documentary THE THINKING GAME\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/the-thinking-game-greg-kohs-gary-krieg-83603/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eIt’s apparent that we’re living in the future, but how did we get here? Moreover, who shepherded us into this bold new world? Director Greg Kohrs and producer Gary Krieg sought this very answer and it brought them to Demis Hassabis.\u003cbr\u003e  \u003cbr\u003e Demis Hassabis began his journey as a young chess prodigy before shifting gears toward changing the world. He was drawn to the game as a “A fun thinking game,” but after a particularly long battle at a world tournament, he saw a futility in wasting his brain on games when there were real challenges to which he could apply his talents. \u003cbr\u003e  \u003cbr\u003e During a gap year between high school and college, Demis got an internship at Bullfrog games, where he implemented rudimentary AI into a PC game called Theme Park. His innovation allowed the NPCs to react to each other as well as the gamers’ intervention and create a more interconnected and immersive experience. This caught the eye of Electronic Arts and changed the trajectory of video games for years to come. Despite this transformative influence, Demis focused on college and after graduation sought to tackle the issue of Artificial General Intelligence.\u003cbr\u003e  \u003cbr\u003e For the uninitiated, Artificial General Intelligence refers to a true thinking creation. Inspired to a point by the AI Deep Blue defeating Chess master Kasparov in 1997, Demis was duly impressed by the victory but saw the limitation of an innovation that could ONLY play chess. As admirable as that was, Demis saw an imminent future where an AI could beat\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/the-thinking-game-greg-kohs-gary-krieg-83603/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricThu, 06 Feb 2025 01:26:00 +000083603Sundance Midnight Selection TOUCH MEhttps://www.aintitcool.com/touch-me-sundance-midnight-83602/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eMcEric chats with the writer/director and stars of the Sundance Midnight Selection TOUCH ME\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/touch-me-sundance-midnight-83602/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eThe Sundance Film Festival is preparing to hit Park City, Utah once again this Thursday, January 23rd through February 2nd, boasting 88 feature films and a slew of shorts and industry panels. One of the highlights of the festival each year is the Midnight Program, which screens genre pictures late at night. Just last year this program brought us I SAW THE TV GLOW, IN A VIOLENT NATURE, and LOVE LIES BLEEDING, to give you an idea of the type of fare one might find. One particular title in this year's program caught my interest when I read the synopsis and stood out as something that would assuredly be unique. The film is called TOUCH ME by writer/director Addison Heimann, and its synopsis reads:\u003cbr\u003e Two codependent best friends become addicted to the heroin-like touch of an alien narcissist who may or may not be trying to take over the world.\u003cbr\u003e \u003cbr\u003e TOUCH ME is a brilliant meditation on addiction, codependency, and the universal search for acceptance and peace in an ever-increasingly chaotic world. The film's use of color is exquisite, and the four lead actors who propel the story turn in some amazing work. I knew the film would be weird but it exceeded my expectations, and if you like your allegories laugh-out-loud funny and interspersed with tentacle sex, you will love this film, too.\u003cbr\u003e I was able to talk to writer/director Addison Heimann, stars Olivia Taylor Dudley, Lou Taylor Pucci, Jordan Gavaris, and Marlene Forte about the film, some of the technical wizardry\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/touch-me-sundance-midnight-83602/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricTue, 21 Jan 2025 04:16:00 +000083602NOSFERATU - Succumb to the Darknesshttps://www.aintitcool.com/nosferatu-review-eric-mcclanahan-83601/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eEric McClanahan reviews Robert Eggers\u0026#39;s latest film, NOSFERATU.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/nosferatu-review-eric-mcclanahan-83601/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eWouldst thou like to live immortally?\u003cbr\u003e Robert Eggers is back in theaters with his latest vision, NOSFERATU, a remake of the 1922 film of the same name, which was itself an unlicensed retelling of Bram Stoker's DRACULA. For those who don't know, Eggers is the visionary behind such standout films as THE VVITCH, THE LIGHTHOUSE, and THE NORTHMAN. His films have earned him a fiercely dedicated fanbase and heavy auteur status in Hollywood, essentially giving him carte blanche when it comes to making his films. NOSFERATU is the culmination of that legacy and that power, for better or worse.\u003cbr\u003e \u003cbr\u003e I saw NOSFERATU last night in a packed theater, my second choice theater as the first had already sold out by the time I arrived. It was preceded by trailers for THE WOLF MAN and THE MONKEY, tailored to its audience of artistic horror hounds. The movie begins with simple white text over black backgrounds, and the first thing the audience hears is a woman crying the darkness. From there, the film is two plus hours of atmosphere and mood, stretched to its near breaking point before the final fade out. Eggers is a master of tone, an Edgar Allan Poe of the visual form, and his legacy as a visual storyteller receives no tarnish with this entry into his oeuvre. So much is explored with a muted color palette and expert use of light and shadow. The camera pulls into darkness, pulls the bodies onscreen into rooms into which they cannot see,\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/nosferatu-review-eric-mcclanahan-83601/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricTue, 31 Dec 2024 01:37:00 +000083601James Fox Discusses His Documentary THE PROGRAMhttps://www.aintitcool.com/interview-james-fox-the-program-uap-reports-83600/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eFilmmaker James Fox discusses his new documentary THE PROGRAM which examines the United States government\u0026#39;s pre-existing relationship with UAPs.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/interview-james-fox-the-program-uap-reports-83600/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eIn a new AND NOW FOR SOMETHING COMPLETELY DIFFERENT SEGMENT, I will do something terrifically similar to what I did the last time I did this segment, and now that I'm reading that out loud I realize how ridiculous it sounds. Regardless, I once again enter the realm of Unidentified Anomalous Phenomena and speak with a specialist about what the United States knows, what it doesn't, and the barriers that are preventing it from disclosing its full knowledge to the public.\u003cbr\u003e Let's get one thing established right away: the conversation around alien visitation has changed. When I chatted with Disclosure Activist Stephen Bassett back in 2021, we weren't discussing if these visitations were real but rather why we weren't being told about them. Even the classification has changed - they're no longer Unidentified Flying Objects but Unidentified Anomalous Phenomenon, or UAPs. Our government has come clean about their interest in UAPs, largely due to military concerns, and they take sightings seriously. The Defense Department's All-domain Anomaly Resolution Office was created to investigate unidentified anomalies to determine if they're foreign or domestic, dangerous or innocuous, earthbound or alien. That part is transparent, but THE PROGRAM's findings aren't, and that is the subject of filmmaker James Fox's new documentary, THE PROGRAM.\u003cbr\u003e \u003cbr\u003e I chatted with James Fox, filmmaker of The Phenomenon, Moment of Contact, and I Know What I Saw, to discuss THE PROGRAM after viewing it, and though we were able to talk for quite a while, I didn't really have that many questions. Not because the\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/interview-james-fox-the-program-uap-reports-83600/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricFri, 27 Dec 2024 19:50:00 +000083600BLOODY AXE WOUND is a Bloody Good Time!https://www.aintitcool.com/bloody-axe-wound-hilarie-burton-morgan-interview-83599/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eMcEric chats with produced Hilarie Burton Morgan and star Molly Brown about the new SHUDDER exclusive BLOODY AXE WOUND, a coming-of-age slasher comedy with heart(s) to spare.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/bloody-axe-wound-hilarie-burton-morgan-interview-83599/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eEverything about film has changed, and while some lambast this brave new world, it does have its silver linings. Streaming services took over channels and then became their own studios. For every Netflix dud there's a great horror film championed by SHUDDER, Bloody Disgusting, or Fangoria that would go otherwise unproduced. SHUDDER, specifically, has been picking up amazing films, from last year's LATE NIGHT WITH THE DEVIL to this year's IN A VIOLENT NATURE. The studio is ending the year strong with a meta take on the coming-of-age slasher rom-com called BLOODY AXE WOUND, releasing in limited theaters before landing on the streamer in early 2025. The synopsis is as follows:\u003cbr\u003e Abbie Bladecut (Sari Arambulo, \"A.P. Bio\") is a teenager torn between the macabre traditions of her family’s bloody trade and the tender stirrings of her first crush (Molly Brown, \"Dexter: Original Sin\"). In the small town of Clover Falls, Abbie’s father, Roger Bladecut (Billy Burke, TWILIGHT), has built an infamous legacy by capturing real-life killings on tape and selling them to eager customers, but as Abbie delves deeper into the grisly family business, she begins to wonder if it’s time to take the family tradition in a new direction. \u003cbr\u003e \u003cbr\u003e The conceit of the film is surprisingly fresh in a genre that finds new ways to reinvent itself with shocking regularity. Set within the confines of a horror film, we see what it might be like to grow up in a family where the patriarch is a serial killer/slasher who rises from the grave\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/bloody-axe-wound-hilarie-burton-morgan-interview-83599/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricFri, 27 Dec 2024 05:10:00 +000083599Barbarella Dives into Conversation with FREEDIVER Director Michael John Warren!https://www.aintitcool.com/michaeljohnwarreninterview2024freediver-83598/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eBarbarella Dives into Conversation with FREEDIVER Director Michael John Warren!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/michaeljohnwarreninterview2024freediver-83598/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHey friends! Barbarella here. Michael John Warren’s latest documentary Freediver is available on Prime Video, or buy or rent on Digital starting December 7, 2024. The film plunges viewers into the world of competitive freediving as it chronicles Alexey Molchanov’s unprecedented attempt to set world records in multiple categories of the sport. Opening with some explanations about diving’s impact on the body, the film draws me back to memories of getting certified to scuba. Prior to those classes, the risks about which I knew were drowning, underwater predators (e.g. sharks), and the bends. Yet, those first days in the classroom, we learned a whole horde of other damaging or fatal consequences of diving that I had never previously considered. Once we were all sufficiently terrified of the consequences of our planned endeavor, it was time to don our gear and plunge into the depths. And we did, despite the inherent risks of injury and death. \u003cbr\u003e Although risk-free to myself, witnessing Alexey move gracefully deeper into peril in Freediver proves almost as nerve-wracking as my first open-water dive and leaves me pondering questions, like “How long could I hold my breath?” - the answer is not long at all - or “Would I ever consider free diving?” The answer is maybe, but absolutely not competitively. Those people are insane, superhuman, or both!\u003cbr\u003e Whether they are insane or not, I spend much of the film in awe of these people who have trained their bodies to perform skills the human body was never meant to experience.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/michaeljohnwarreninterview2024freediver-83598/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaFri, 06 Dec 2024 12:45:00 +000083598Tim Sheridan - Creator Interviewhttps://www.aintitcool.com/tim-sheridan-alan-scott-green-lantern-interview-83597/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=comics\u003cp\u003eTim Sheridan chats about Alan Scott: Green Lantern, Superman: Man of Tomorrow, Batman: The Long Halloween, and adapting legacy stories to small and large screens.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/tim-sheridan-alan-scott-green-lantern-interview-83597/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=comics\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eWhen I got into this racket over six years ago, I did so as a fan. In fact, it was a passing text exchange with a friend about the movie A QUIET PLACE that ended with “Hey, do you want to write about movies for a website?” Flash forward, here I am, having interviewed over a hundred creatives in my time with this site and others. Typically, I’ll get an email from a PR firm asking if I want to screen a film and speak with attached talent or read a book and speak with the author. I rarely say no as I firmly believe that everyone is worth talking to and every person you come in contact with can teach you something that you might not learn in your own sphere of social contacts or experiences.\u003cbr\u003e  \u003cbr\u003e This interview is different. This subject I hunted down. I saw that he was going to be at New York Comic Con this year signing books in Artist Alley, and I’d already interacted with him briefly on Twitter (back when it was Twitter) so I felt I could swing over and say hello. I did, and of course he had some fans in front of him when I arrived so I decided to hang back and let them have their moment. Watching him interact with these fans confirmed everything I believed about this writer - he couldn’t be any nicer, any more accommodating, or any more grateful for the people who celebrate his art.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/tim-sheridan-alan-scott-green-lantern-interview-83597/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=comics\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricSat, 30 Nov 2024 08:54:00 +000083597Jenni \"JWoww\" Farley on Writing/Directing DEVONhttps://www.aintitcool.com/jenni-jwoww-farley-interview-devon-83596/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eMcEric chats with reality star Jenni \u0026quot;JWoww\u0026quot; Farley on her feature-film debut as writer/director of the found-footage horror film DEVON.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/jenni-jwoww-farley-interview-devon-83596/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eFound footage horror. Do you love it? Do you hate it? Do you think it is its own genre or do you lump it in with its overarching tone - slasher, supernatural, monster, etc. Love it or hate it, the convention is here to stay, as it offers a realistic, relatable approach to horror that blurs the lines between reality, film, empathy, and voyeurism.\u003cbr\u003e  \u003cbr\u003e So, when I got an email asking if I wanted to screen the feature DEVON, written and directed by Jenni “JWoww” Farley, I said “of course I do!” My wife is a fan of “Jersey Shore” and has been since day one, so I mostly did it for her, but I was also very curious what the singular star would bring to the horror pantheon. The logline read:\u003cbr\u003e  \u003cbr\u003e Devon's parents never stopped searching for answers after her disappearance from a notorious asylum. Years after the incident, a mysterious website draws five adventurers to the abandoned asylum where she was last seen. Armed with cameras, they plunge into the darkness, unaware they’re filming their own descent into horror—never meant to return.\u003cbr\u003e  \u003cbr\u003e \u003cbr\u003e  \u003cbr\u003e I got the chance to chat with writer/director/producer Jenni “JWoww” Farley about jumping into a feature-length film, the serendipitous location, and her crew. \u003cbr\u003e  \u003cbr\u003e \u003cbr\u003e  \u003cbr\u003e Eric McClanahan: Hey, Jenni! How are you?\u003cbr\u003e  \u003cbr\u003e Jenni “JWoww” Farley: Good. Nervous. \u003cbr\u003e  \u003cbr\u003e EM: Nervous? Why are you nervous?\u003cbr\u003e  \u003cbr\u003e JJF: I feel like this is [me] kind of starting my career over. It’s a different world, a different element. I am a superfan of horror films; I have been since I\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/jenni-jwoww-farley-interview-devon-83596/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricFri, 15 Nov 2024 01:07:00 +000083596HIPPO'S Writer/Director Mark Rapaport Chats Video Games, Sex Talks, and Black-and-White Filmmakinghttps://www.aintitcool.com/markrapaportinterview2024hippo-83595/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eHIPPO\u0026#39;S Writer/Director Mark Rapaport Chats Video Games, Sex Talks, and Black-and-White Filmmaking\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/markrapaportinterview2024hippo-83595/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHey, friends! Barbarella here to talk about dark comedy Hippo, or more accurately to share the conversation I had with Hippo’s director and writer Mark Rapaport. Genuinely funny, this incredible film has the potential to achieve cult status, so long as people take a chance on this black-and-white gem and actually see it. I recommend that they do. Hippo stars Kimball Farley, Lilla Kizlinger, Eliza Roberts, and Eric Roberts as the narrator. It tells the story of two exceptionally different teens being raised by their mother in a somewhat isolated existence. At times, it reminds me of Yorgos Lanthimos’ Dogtooth, in the way that the children in Hippo are sheltered, while not in the same extreme way they were in the Greek film, both films make strong points about the detriment of isolation. The two would make a great double-feature, but if you want to jump on this one first, Hippo will be in select theaters November 8. \u003cbr\u003e \u003cbr\u003e At any rate, after a night of minimal sleep due to staying out late at the Pink concert, I caught up with Mark Rapaport, and we had a fun chat about the movie. Check it out!\u003cbr\u003e Barbara: Why go black and white with this? \u003cbr\u003e Mark: I've always loved classic movies, but I never thought I would make a movie in black and white until my cinematographer started taking photos of black and white, and I was like, “These are so cool and good, why don't more people shoot in black and white? Maybe we should do something like that.” He was very into that. When\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/markrapaportinterview2024hippo-83595/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaFri, 08 Nov 2024 15:59:00 +000083595Spooky Picks for Fright Night Flickshttps://www.aintitcool.com/hold-your-breath-die-alone-bhff-83594/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eMcEric highlights a few spooky films for your Halloween night, including DIE ALONE and HOLD YOUR BREATH.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/hold-your-breath-die-alone-bhff-83594/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003e‘Tis the season, for a few more hours, before Mariah Carey breaks through her ice-cocoon and heralds in the winter holidays. If you need a couple of thrillers to hold back the tide of the inevitable, I’ve got you covered with a couple of brand new features released this very month: HOLD YOUR BREATH and DIE ALONE.\u003cbr\u003e  \u003cbr\u003e DIE ALONE stars Carrie-Anne Moss (THE MATRIX, “The Acolyte”), Frank Grillo (CAPTAIN AMERICA: THE WINTER SOLDIER, ONE DAY AS A LION), Douglas Smith (HBO’s “Big Love”), and Kimberly-Sue Murray (Netflix’s “V-Wars”). The film is written and directed by Lowell Dean (WOLFCOP, SUPERGRID) and released by Quiver Distribution. After an outbreak turns the majority of the population into plant-based zombies, a young man (Smith) with amnesia searches for his lost love and stumbles across a rugged survivalist (Moss). Check out the trailer:\u003cbr\u003e  \u003cbr\u003e \u003cbr\u003e  \u003cbr\u003e If you’re getting “The Last of Us” vibes, you’re on the right track. The film features some pretty great creature effects, apt desolation to sell the apocalypse, and a surprisingly original story. Moss is the star of the show, by far, and carries her scenes with a deadpan humor that keeps the heavy subject matter from swallowing the viewer in despair. The budget limitations are clear but the film that emerges is certainly a smart, fun ride that hits all the points of an apocalyptic thriller with a (predictable) plot twist and great performances.\u003cbr\u003e  \u003cbr\u003e I got the chance to chat with Carrie-Anne Moss about the production of the film, her bicycle-riding skills, and dream roles.\u003cbr\u003e \u003cbr\u003e Carrie-Anne\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/hold-your-breath-die-alone-bhff-83594/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricFri, 01 Nov 2024 00:45:00 +000083594Snake Plotzkin Reviews THE LIFE AND DEATHS OF CHRISTOPHER LEEhttps://www.aintitcool.com/lifeanddeathsofchristopherleeffreview2024-83593/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eSnake Plotzkin Reviews THE LIFE AND DEATHS OF CHRISTOPHER LEE\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/lifeanddeathsofchristopherleeffreview2024-83593/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eSnake Plotzkin, reporting from Fantastic Fest 2024, where I got to see the biographical documentary, The Life and Deaths of Christopher Lee. I’m a big fan of Hammer horror, and I will watch literally any Hammer film with Christopher Lee and Peter Cushing in it. One of my favorite Hammer films is Rasputin the Mad Monk, which, if you haven’t seen it, is one of Lee’s best performances. The gigantically tall Lee stalks around St. Peterburg as the mad monk, hypnotizing women, seducing them, and then yelling at them to get out of his room and leave their money on the bed. It’s amazing. \u003cbr\u003e \u003cbr\u003e If The Life and Deaths of Christopher Lee had been made up completely of anecdotes about Christopher Lee and Peter Cushing on the Hammer films, I would honestly have been very satisfied with it. But the movie unexpectedly goes much further, revealing not just another side of the actor, but multiple facets. For instance, did you know that Christopher Lee fought Nazis? That he may have been the inspiration for James Bond (which was written by his cousin)? That he released two heavy metal albums? Well, this movie goes where no marionette-narrated biopic has gone before, using a mix of interviews, animation, and puppetry to bring Christopher Lee to life (the man himself passed away in 2015).\u003cbr\u003e Yes, I said puppetry. The movie is narrated by a marionette of Christopher Lee – who, in an uncanny imitation of Lee’s sonorous voice (played by Peter Szymon Serafinowicz, an English actor\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/lifeanddeathsofchristopherleeffreview2024-83593/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e staffSat, 05 Oct 2024 14:56:00 +000083593STRANGE HARVEST: THE OCCULT MURDER IN THE INLAND EMPIRE Premieres at Fantastic Fest 2024!https://www.aintitcool.com/strangeharvestinterview2024-83592/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eSTRANGE HARVEST: THE OCCULT MURDER IN THE INLAND EMPIRE Premieres at Fantastic Fest 2024!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/strangeharvestinterview2024-83592/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHey friends. Barbarella here. Strange Harvest: The Occult Murder in the Inland Empire is a long title for a great narrative utilizing the true-crime documentary format. The format proves so effective at tricking my brain into thinking I’m watching actual footage of crime scenes and caught-on-tape moments that I had to occasionally remind myself to relax, it’s only a movie. \u003cbr\u003e It made its world premiere at Fantastic Fest 2024 on September 22, 2024 at 11:50 p.m. CT, and I had the delightful opportunity to sit down with genre director Stuart Ortiz, and actors Peter Zisso and Terri Apple in Austin last week. Check it out!\u003cbr\u003e \u003cbr\u003e Barbara: I'm one of these people that I can watch the most gruesome stuff in movies, and it doesn't bother me, heads getting drilled and stuff.\u003cbr\u003e Peter: Bless You. \u003cbr\u003e Barbara: But it really upsets me to see people getting hurt, even these skateboarding videos and such, and this movie messed with my brain because I knew it’s fictional, but my brain got tricked into thinking it was real at times because the way it was done. I'm very impressed with the effectiveness of that. \u003cbr\u003e Stuart: Thank you.  \u003cbr\u003e Barbara: Why do this in a true crime format? What were you going for? \u003cbr\u003e Stuart: I just think it's a really interesting way to tell a story, and in particular to tell a horror story because it just allows you to have this vantage point that you don't normally have with horror, to investigate certain details or aspects of a horror story that you wouldn't focus on necessarily in a more conventional story. I\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/strangeharvestinterview2024-83592/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaSat, 05 Oct 2024 02:02:00 +000083592Kevin Smith Talks THE 4:30 MOVIEhttps://www.aintitcool.com/kevin-smith-interview-eric-mcclanahan-430-movie-83591/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eKevin Smith Talks to McEric about THE 4:30 MOVIE\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/kevin-smith-interview-eric-mcclanahan-430-movie-83591/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eKevin Smith’s THE 4:30 MOVIE is coming home today, available on digital through all major retailers. The film tells the story of young Brian David, an avatar of Kevin Smith, and his adventures at the local Atlantic Cinema where he watches films with his friends Burny and Belly in 1986. It’s a departure from the View Askewniverse that Smith started thirty years ago, which admittedly stretched to its possible breaking point as the characters within encountered rebel angels, demons, Hollywood, jewel thieves, terrorists, and a monkey. THE 4:30 MOVIE offers a much more grounded story of a simpler time when the cinema and video store ruled the weekend, and the lives on the silver screen either mirrored our own or showed us worlds we could only imagine. \u003cbr\u003e \u003cbr\u003e I had the opportunity to chat with Kevin Smith yesterday in support of the film’s digital release and it went exactly as I thought it would: we were given six minutes, I asked one question, and he talked for eight. What I got in that response, though, was a good deal of wisdom about what the filmmaker attempts when he puts his memories to screen for our amusement, how he’s remained relevant, and where his ideas originate. Prior to the interview’s start, my cat Bennie decided she needed to be part of it all, as well, and leapt onto the seat behind me. \u003cbr\u003e  \u003cbr\u003e Eric McClanahan - Hi Kevin!\u003cbr\u003e  \u003cbr\u003e Kevin Smith - Hello, Eric! How are you?\u003cbr\u003e  \u003cbr\u003e EM - I’m well, thank you!\u003cbr\u003e  \u003cbr\u003e KS - Look at that cat!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/kevin-smith-interview-eric-mcclanahan-430-movie-83591/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricTue, 01 Oct 2024 08:37:00 +000083591Interview with the Cast of TERRIFIER 3https://www.aintitcool.com/terrifier-3-david-howard-thornton-lauren-lavera-83590/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eMcEric chats with David Howard Thornton (Art the Clown) and Lauren Lavera (Sienna Shaw) ahead of Damien Leone\u0026#39;s TERRIFIER 3\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/terrifier-3-david-howard-thornton-lauren-lavera-83590/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eTime to crawl out from under your bridges, ghouls, because Damien Leone’s Art the Clown is back in TERRIFIER 3, hitting theaters October 11th. This time the terror is set against the backdrop of Christmas, with Art (David Howard Thornton) returning to hunt down Sienna (Lauren Lavera) after she cut his head off in the last installment. The film picks up right at the end of Part 2 before allowing Art to take a five year siesta while Sienna spends time in facilities piecing her psyche back together. Young Jonathan Shaw (Elliott Fullam) isn’t so young anymore, attending college near his Aunt and Uncle, Jessica and Mark (Margaret Anne Florence and Alex Ross), with whom Sienna stays after being checked out of the latest facility. \u003cbr\u003e \u003cbr\u003e The film opens with Art dispatching a family while dressed in a Santa Claus suit, letting the audience know right away that no one is safe. The entire film plays out as a supercut of gory kills and dark humor, with occasional moments of genuine world-building that allows the supporting cast to really stretch their acting muscles. Plotwise, the film seems to be more focused on showcasing creative kills than telling a cohesive story, and the end seems somewhat rushed, as though the filmmakers had almost forgotten that they had to end the thing. \u003cbr\u003e  \u003cbr\u003e What a TERRIFIER fan is looking for, however, is exactly what they’ll find in 3: inventive kills, stomach-turning sound design, laughs that’ll make you question your own morality, and surprises. When I got\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/terrifier-3-david-howard-thornton-lauren-lavera-83590/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricTue, 01 Oct 2024 01:03:00 +000083590Barbarella Talks AI With SUBSERVIENCE Director S.K. Dalehttps://www.aintitcool.com/skdaleinterview2024subservience-83589/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eBarbarella Talks AI With SUBSERVIENCE Director S.K. Dale\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/skdaleinterview2024subservience-83589/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHi friends, Barbarella here. Sci-fi film Subservience, starring Megan Fox, Michele Morrone  (his name’s Italian so the “ch” is pronounced like a “k”), Madeline Zima, and Matilda Firth, just came out on Demand and Digital, so let’s talk about AI. Do you think artificial intelligence will bring about major medical advancements, or do you envision more of a Terminator situation evolving? I tend to think it’s not the AI itself but whoever’s behind it that should be on whom we focus our concern. When it comes to cinema, filmmakers always hold technology responsible, because let’s face it, that makes for a more entertaining movie. I would argue Will Honley and April Maguire’s screenplay puts at least some of the onus on the humans. Maybe don’t say certain things to a Sim that’s constantly evolving and learning; that’s all I’m saying. If it weren’t for one comment made to Alice (Megan Fox), the attractive Sim acquired to help out around the house, perhaps a lot of mayhem could have been avoided. \u003cbr\u003e  \u003cbr\u003e I appreciate that the conflict in Subservience primarily occurs within the family unit, as this makes it more believable to me. Favoring older technologies, Nick (Michele Morrone) isn’t the biggest fan of artificial intelligence, but when he and his sick wife (Madeline Zima) can’t keep up with managing the household and children, he caves and gets Alice, the best new Sim on the market, to help out, and you know that’s not going to work out quite how everyone expects, well, at least how everyone\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/skdaleinterview2024subservience-83589/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaSat, 14 Sep 2024 13:57:00 +000083589THE 4:30 MOVIE's Cast Speaks About Kevin Smith's New Comedyhttps://www.aintitcool.com/interview-cast-new-kevin-smith-film-83588/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003eMcEric chats with the cast of Kevin Smith\u0026#39;s THE 4:30 MOVIE\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/interview-cast-new-kevin-smith-film-83588/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eWriter/Director Kevin Smith began his View Askewniverse in 1994 with his breakout hit CLERKS. The film tells the story of a couple of slackers working dead-end jobs in New Jersey in the 1990s and the conversations and misadventures they dabble in along the way. The film paved the way for countless stories, and so far nine films by Smith have rounded out its canon, along with several animated adventures and more in the pages of comic books. Before Dante and Randall ever sat around the Quik Stop and chatted about JAWS, STAR WARS, or even NAVY SEALS, young Kevin Smith was a New Jersey native soaking up inspiration on the silver screen at his local movie theater, the Atlantic Highlands Cinema. Flash forward to today and he owns that theater, rebranded as the Smodcastle, where he showcases new releases, repertory classics, film festivals, and even special screenings of “Movies With Kev,” where he screens a classic and participates in a Q\u0026A following the screening.\u003cbr\u003e  \u003cbr\u003e Finally the formative experiences of young Kev are getting their own film treatment, with Kevin Smith’s newest release, THE 4:30 MOVIE, premiering tomorrow in cinemas around the country. The film, not set within the View Askewniverse, tells the story of a young man named Brian David, a not-even-thinly-veiled stand-in for Kevin Smith, played by Austin Zajur, who one day in the late spring of 1986 asks his crush Melody Barnegat (Siena Agudong) to meet him at the movies. This is much to the chagrin of his two\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/interview-cast-new-kevin-smith-film-83588/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricFri, 13 Sep 2024 00:11:00 +000083588Shiloh Fernandez Discusses Working With Nadine Crocker on CONTINUEhttps://www.aintitcool.com/shilohfernandezinterview2024continue-83586/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eShiloh Fernandez Discusses Working With Nadine Crocker on CONTINUE\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/shilohfernandezinterview2024continue-83586/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHey, friends! Barbarella here. It feels a little wrong that I have a ton of pep today while I’m covering a movie about the very serious topic of suicide, but here we are. Continue makes a personal and powerful statement from writer, director, and star Nadine Crocker, who survived her own suicide attempt in her twenties. In Theaters, On Demand and Digital September 6, 2024, Continue escorts viewers through Dean’s struggles as she experience life after a suicide attempt. Beautifully shot, the film also includes an unexpected love story, albeit, I’m not sure I believe that two people would be that flirtatious while discussing their past traumas, but just because I wouldn’t flirt while sharing horrific things from the past doesn’t mean it’s not possible that some people might. Anyway, before I veer too far off-topic, the movie stars an actor of whom I’ve been a fan since first seeing him about fifteen years ago in an independent film at Fantastic Fest called Deadgirl, and I’m grateful to have the opportunity to chat with that actor, Shiloh Fernandez, about the film. \u003cbr\u003e Right out of the gate, I share my love of Deadgirl and Shiloh’s performance in it. Check out his response and the rest of our conversation! \u003cbr\u003e Shiloh: That is so sweet. It’s still one of my favorite movies. I loved doing a small movie like that, and all these years later, to do Continue, I think it was maybe the 2nd smallest. It is really neat having these small movies make an impact. \u003cbr\u003e Barbara: I don’t know what it says about me, but Deadgirl was one\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/shilohfernandezinterview2024continue-83586/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaFri, 06 Sep 2024 11:06:00 +000083586Barbarella and Director Audrey Cummings Discuss Western PLACE OF BONES!https://www.aintitcool.com/audreycummingsinterview2024placeofbones-83585/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eBarbarella and Director Audrey Cummings Discuss Western PLACE OF BONES!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/audreycummingsinterview2024placeofbones-83585/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHey, friends. Barbarella here. A new Western, Place of Bones, rides into theaters and on digital Friday, August 23, 2024. Unlike the Westerns of yesteryear, this one is female-led, with Audrey Cummings in the director’s chair and Heather Graham shining in the lead role as a mother who, along with her daughter (Brielle Robillard), must fight for survival when a gang of outlaws, led by Tom Hopper, arrives in the area.   \u003cbr\u003e I’ve been a Tom Hopper fan ever since he won me over with his enticing portrayal of Billy Bones in Black Sails. He earns additional adoration from me through the way he injects subtle humor as villain Bear John in this film. I find myself laughing at moments that I’m fairly certain weren’t intended to be funny, yet he fires wit like a true sharp-shooter with a faint exasperation about him that’s just funny. However, he’s not the only one who offers something more than just delivering what’s written on the page. Corin Nemec, Brielle Robillard, and Heather Graham also add an extra something that gives insight into their characters and adds a bit of snark to the exchanges.\u003cbr\u003e  \u003cbr\u003e I had the opportunity to speak with Audrey Cummings, and I sometimes like to break the ice with a question about Muppet-casting on remakes. While she placed Kermit, Miss Piggy and Fozzy Bear in the lead roles of Calhoun (Corin Nemec), Pandora (Heather Graham), and Hester (Brielle Robillard), I took a completely different approach, thinking it would be fun to have Statler and\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/audreycummingsinterview2024placeofbones-83585/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaThu, 22 Aug 2024 23:29:00 +000083585#ALL MY FRIENDS ARE DEADhttps://www.aintitcool.com/all-my-friends-are-dead-interview-83584/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews\u003cp\u003e#ALL MY FRIENDS ARE DEAD director Marcus Dunstan and star Jade Pettyjohn talk to McEric about the new slasher comedy!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/all-my-friends-are-dead-interview-83584/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eThere was every manner of film at this year’s Tribeca Festival, and I managed to take in thirteen features, four shorts, and an episodic premiere by the time the whole thing wrapped this past June. One of the highlights was the opportunity to interview two of the lead talents behind the new slasher ALL MY FRIENDS ARE DEAD: director Marcus Dunstan and star Jade Pettyjohn. We met at the Roxy Hotel bar and restaurant, a favorite meetup spot of mine, on a Saturday morning. I was, admittedly, running late, but they were so patient and gracious with me and I always appreciate that from stars and filmmakers, whose lives are probably ten times as cluttered as mine. \u003cbr\u003e Its logline says of the film: “A group of college friends rents an airbnb for the biggest music festival of the year. However, their weekend of partying soon takes a deadly turn as a masked killer murders them one by one according to their sins.”\u003cbr\u003e \u003cbr\u003e The film, though familiar in synopsis, finds a way to inject new life into a tired formula. The design of the killer is unique, the kills are creative, the victims are fighters rather than training dummies, for the most part, and the twist(s) are welcome.\u003cbr\u003e  \u003cbr\u003e Marcus Dunstan is perpetually smiling, speaking in a small voice from a large, gentle face. Jade Pettyjohn is excitable, clearly enjoying being at the festival and also talking about this joyous diversion in her filmography. We couldn’t help but jump right in. Unfortunately, I recorded this\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/all-my-friends-are-dead-interview-83584/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=reviews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e McEricSat, 17 Aug 2024 00:12:00 +000083584Check Out This Trailer for Psychological Thriller SLINGSHOT!!https://www.aintitcool.com/slingshottrailer-83583/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eCheck Out This Trailer for Psychological Thriller SLINGSHOT!!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/slingshottrailer-83583/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eHey friends, Barbarella here. It seems like ages since we’ve had a really cool psychological thriller that takes place in space, but it appears that Slingshot may fill that void. When a trio of elite astronauts set to undertake a risky slingshot maneuver, potential issues with both the ship and a crew member add to the dangers of the mission. Starring Casey Affleck, Laurence Fishburne, Emily Beecham, Tomer Capone, and David Morrissey, the film hits theaters nationwide August 30th.\u003cbr\u003e Check out the trailer!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/slingshottrailer-83583/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e BarbarellaTue, 30 Jul 2024 21:00:00 +000083583SDCC Robert Downey Jr returns to MCU!https://www.aintitcool.com/sdcc-robert-downey-returns-83582/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews\u003cp\u003eRobert Downey Jr is back but not as we know it!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/sdcc-robert-downey-returns-83582/?utm_source=inside-top\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eRead the full article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003eIn perhaps the most shocking story to come out of this year's otherwise short-on news panel from Marvel Studios, Robert Downey Jr is returning to the MCU. It has just been announced that he has been cast as none other than the great green dictator Doctor Doom. Taking to the stage Downey Jr had this to say:\u003cbr\u003e \"New mask, same task...What can I tell ya, I like playing complicated characters.\"\u003cbr\u003e Whether or not he’ll be the genuine Earth 616 version or the Doom from the alternate Universe Fantastic Four: First Steps seems to be set in remains to be seen. Either way, welcome back to the fold RDJ.\u003cbr\u003e The panel revealed that Downey Jr’s Doom would make his presence known in the freshly titled Avengers: Doomsday which has a release date of May 2026 with Avengers: Secret Wars following in May 2027.\u003cbr\u003e  Let us know what you think of this curveball in the comments down below!\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://www.aintitcool.com/sdcc-robert-downey-returns-83582/?utm_source=inside-bottom\u0026utm_medium=feed\u0026utm_term=coolnews\u0026utm_campaign=1310_RSS\"\u003e\u003cb\u003eFinish the article on AICN\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e HouseOfMacleodSun, 28 Jul 2024 08:58:00 +000083582McEricTue, 20 May 2025 19:16:00 +000083612Barbarella Says Tim Robinson Makes FRIENDSHIP Fantastic!https://www.aintitcool.com/friendshipreview2025-83611/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsBarbarella Says Tim Robinson Makes FRIENDSHIP Fantastic! Read the full article on AICN Hey friends! Barbarella here back from hiatus, and I’m delighted to share my thoughts on A24’s newest release, Friendship, which is out NOW! Sometimes people watch trailers and think, “Oh this movie is like [insert movie about a similar topic].” If you’re thinking that about Friendship, it’s not. Genuinely funny without being cruel, Andrew DeYoung’s exploration of adult male friendship proves charming and elicits more than a few hearty laughs from me.  In an era where seemingly fewer friendships exist in the real world than online, making new friends may be challenging, particularly for adult men. Keeping them may be nearly impossible.  When Craig (Tim Robinson) receives a misdelivered package intended for cool new neighbor Austin (Paul Rudd), Craig walks it over to him. Upon meeting the charismatic and friendly guy, he quickly gets invited in and finds himself actually making friends. His expressions reveal his delight in this newly formed camaraderie with someone who is just so darned interesting. One can’t help but feel happy for his new accomplishment.   Sadly, new friendships are fragile, and in a group setting, Craig doesn’t make the best impression on the guys. It doesn’t take long before Austin begins distancing himself from the awkward neighbor. In his desperation to rekindle the closeness they once shared, Craig makes some questionable decisions that lead to more awkward situations and laughs. On the surface, this is a quirky comedy that relies heavily on Tim Robinson’s performance. However, there is much more to this movie. Throughout, it addresses many common insecurities that men Finish the article on AICN BarbarellaSat, 17 May 2025 14:41:00 +000083611New (and Old) Releases This Week, with McEric!https://www.aintitcool.com/renner-neighborhood-watch-mob-cops-young-werther-83610/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsMcEric cleans up his inbox by dumping reviews for NEIGHBORHOOD WATCH, RENNER, MOB COPS, and YOUNG WERTHER. Read the full article on AICN Hello all!  I've got some reviews of two films releasing this Friday, April 25th - but thought I'd also take this opportunity to highlight two other films that are already out there but I haven't yet found the time to cover. Hopefully there's something here for everyone, so let's get right to it: First up is NEIGHBORHOOD WATCH, starring Jack Quaid (NOVOCAINE, THE COMPANION, \"The Boys\"), Jeffrey Dean Morgan (\"The Boys,\" \"The Walking Dead\"), and Malin Ackerman (WATCHMEN, SLAYERS), directed by Duncan Skiles (THE CLOVEHITCH KILLER) and written by Sean Farley. The film features troubled young man Simon McNally (Quaid), who is trying to find his feet after spending a decade in a facility for mental health treatment, and his paranoid ex-security guard neighbor Ed Deerman. The two form an unlikely partnership when Simon believes he's seen a woman kidnapped but is deemed an unreliable witness by police due to his history and behavior. The two men take it upon themselves to investigate the crime and rescue the woman, revealing a deeper web of villainy in their quiet town. Quaid and Morgan have great chemistry, and Quaid, specifically, does some great work in this film. Whereas the majority of his characters have been able to rely and charm and humor, Simon is stripped of these tools due to the abuse he received at a young age, so the tricks that Quaid would normally utilize to endear himself to audiences are out of reach. Quaid does a great job of humanizing McNally as a Finish the article on AICN McEricThu, 24 Apr 2025 20:33:00 +000083610Gina Gershon talks HIGH ROLLERShttps://www.aintitcool.com/gina-gershon-interview-killer-joe-showgirls-83609/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsActress Gina Gershon speaks with McEric about new film HIGH ROLLERS with John Travolta and cult classics SHOWGIRLS and KILLER JOE. Read the full article on AICN When I received an email asking me if I wanted to watch a brand new independent film starring John Travolta, Gina Gershon, and Lukas Haas, my first instinct was to say no. When I was told I might be able to interview Gina Gershon, I said sure, and watched Ives’ HIGH ROLLERS. What follows was my experience: This film isn’t good, you guys, but I did watch the whole thing, not only because I had to. It’s a caper, and once I get into a caper, I can’t walk away. I’ve got to know if and how they’ll pull it off. I think that’s universal. That said, this is not a good caper.    The film opens with Travolta as Mason with Gershon as Amy on a beautiful beach, looking out at the crystal blue water. They are gathered with their friends and team to watch two of their own tie the knot, but before they can both conclude their “I dos,” attack helicopters descend, accompanied by SUVS filled with masked mercenaries. They are held at gunpoint and Amy is taken. In a blink, the baddies are gone and the team is unharmed - you know, like mercenaries are wont to do. Next, Mason is giving chase in his muscle car in a poorly edited road piece, concluding in a crash that likely accounts for the film’s entire budget.This is followed by the team grouped around a table while Mason exposition dumps their accolades for the sake of the audience. They are contacted by Finish the article on AICN McEricTue, 18 Mar 2025 19:24:00 +000083609New Releases - RAGING MIDLIFE and AMERICAN DREAMERhttps://www.aintitcool.com/reviews-raging-midlife-american-dreamer-83608/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsMcEric reviews (new) releases RAGING MIDLIFE and AMERICAN DREAMER. Read the full article on AICN Hello all! McEric here with a quick review of two (new) releases hitting the market this St. Patrick's Day Weekend, both of which I actually enjoyed. RAGING MIDLIFE First was RAGING MIDLIFE, a movie that was pitched to me as starring Paula Abdul (I'm a massive fan), Eddie Griffin (DOUBLE TAKE), Walter Koenig (STAR TREK), and Motch O. Mann, the world's foremost Macho Man Randy Savage impersonator. Yeah, I hear it, too. Luckily, I didn't read any further. I saw Paula Abdul's name and shouted \"I'm in!\" Going in to this film blind is the best way to see it. As I'm furnishing you with a review, however, I must speak further to the film. If you want to skip down to AMERICAN DREAMER and go in blind, I do suggest it. Otherwise, here we go. The film, written by Nic Costa and Rob Taylor, and directed by the latter, follows childhood friends Alex and Mark, now in their midlives (see that?) who are chasing their dragon - a purple tanktop once worn by their favorite wrestler, Raging Abe. Raging Abe is a Macho Man Randy Savage-type character who wears a stove pipe hat and chin beard and lives by five \"proclamations,\" all meant to help his young fans navigate life and walk as better people. The film opens with grainy footage of a talk show appearance (think Arsenio Hall) from Raging Abe and his handler, Mary Todd, played by Abdul. The action opens in the eighties with young Alex and Mark ringside Finish the article on AICN McEricSat, 15 Mar 2025 16:35:00 +000083608Barbarella Chats with BLOAT actors Malcolm Fuller and Sawyer Joneshttps://www.aintitcool.com/bloatinterviewmalcolmsawyer-83607/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsBarbarella Chats with BLOAT actors Malcolm Fuller and Sawyer Jones Read the full article on AICN Hey friends! Barbarella here to chat about feeling bloated. Wait that’s not right. I’m here to chat a bit about Bloat, which will be in Theaters, On Demand and On Digital March 7, 2025. It’s a new horror thriller in which Ben McKenzie (“Gotham,” “The O.C.”) plays Jack, a man stuck working while his family vacations in Japan. As if the FOMO isn’t bad enough, one of his sons starts behaving strangely after almost drowning, and his wife, played by Bojana Novakovic (Edge of Darkness, Drag Me to Hell), must grapple with everything essentially alone, while Jack grows increasingly frustrated with his inability to do anything more than bear witness and offer recommendations and theories.  Bloat proves to be pretty fun, generating some tension from the fact that poor Jack is stuck in front of a screen in another country, balancing work and family drama from afar. His sense of powerlessness and the increasing frustration that develops as he video-chats with his family and hears increasingly more unsettling news makes him relatable and really heightens the unease I feel while watching. While the final act doesn't engage me as much as the setup leading up to it, I enjoy enough of the concepts within the story that overall, I like the movie.  I got the opportunity to chat with the actors who play the two sons, Malcolm Fuller and Sawyer Jones. Check it out! Barbara: Would you guys tell me about the casting process. Did you get sent the script or did you have to audition? What was that like Finish the article on AICN BarbarellaFri, 07 Mar 2025 16:22:00 +000083607Director Simon West and Star Lucy Liu Talk OLD GUYhttps://www.aintitcool.com/simon-west-lucy-liu-interview-old-guy-mceric-83606/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsDirector Simon West and star Lucy Liu talk OLD GUY, starring Christoph Waltz, now streaming everywhere! Read the full article on AICN Director Simon West should be a household name; his first film was a little picture from 1997 called CON AIR. Perhaps you've heard of it? He went on to helm similar big budget action extravaganzas, such as 2001's LARA CROFT: TOMB RAIDER and 2012's THE EXPENDABLES 2. Eventually, however, time and changing tastes caught up with West, and now he's directing smaller budget flicks, from action to drama, that move at a slightly slower pace and appeal to a different audience.  The same could be said for Danny Dolinski, the titular OLD GUY of West's latest feature, played by Academy-Award Winner Christoph Waltz (INGLORIOUS BASTERDS, THE GREEN HORNET). Danny's a wetworks expert in a field saturated with hot young assassins, desperately trying to prove he's still relevant, often to his detriment. After recovering from a wrist injury that found him relegated to a cleaner role at a local bakery, Danny is itching to get back in the field. When he's told the only role available is support for young assassing Wihlborg (Cooper Hoffman), he is understandably unenthused. He invites his longtime friend Anata (Lucy Liu) along for their job since it'll take them to some charming locations around Europe, and once underway, tries to take point on every hit. Things don't go as planned. As you can probably already divine, there are so many parallels between Waltz's OLD GUY and West's career. Danny was once the best, the biggest game in town, and his name still opens doors... but the game has Finish the article on AICN McEricWed, 26 Feb 2025 20:15:00 +000083606Julianna Margulies and Gretchen Mol Talk MILLERS IN MARRIAGEhttps://www.aintitcool.com/interview-julianna-margulies-gretchen-mol-mceric-83605/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsJulianna Margulies and Gretchen Mol Talk MILLERS IN MARRIAGE, Edward Burns' latest with Eric McClanahan Read the full article on AICN Edward Burns made quite the impression after winning the Best Picture prize at the Sundance Film Festival with his 1995 masterpiece THE BROTHERS MCMULLEN, signifying the emergence of a new and singular voice. The plot synopsis for the film was \"Three Irish Catholic brothers from Long Island struggle to deal with love, marriage, and infidelity.\" Now, thirty years later, Burns has returned with a new vision, MILLERS IN MARRIAGE, with the plot synopsis sounding vaguely familiar - \"Three Irish Catholic siblings from New York struggle to deal with love, marriage, and infidelity.\" What can I say? Dude's got range. However, I'm not here to say that Edward Burns is a one-trick pony or that MILLERS IN MARRIAGE is recycled and tired. Truth is, I really liked this movie. The cast is impeccable and the narrative kept me interested, even when I thought some plot points were a bit contrived or predictable. Burns crafts characters that we want to care about, even if they're narcissistic, self-destructive, manipulative, or just plain wrong. Burns' gift of character and dialogue is that we are drawn into the maw of the devouring devils of his narratives.  This film is no different. Following the Miller siblings, Andy (Burns), Maggie (Julianna Margulies), and Eve (Gretchen Mol), and their orbiting cadre of lovers. Andy is a painter, fresh off a separation from his wife Tina (Morena Baccarin) and now dating one of her former colleagues Renee (Minnie Driver). Maggie is an active novelist married to inert novelist Nick (Campbell Scott), Finish the article on AICN McEricTue, 25 Feb 2025 01:43:00 +000083605Spider One's New Flick LITTLE BITES Releases on Physical Media and SHUDDER This Weekhttps://www.aintitcool.com/little-bites-interviews-spider-one-krsy-fox-mceric-83604/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsWriter/Director Spider One and star Krsy Fox speak with McEric about their new film LITTLE BITES, releasing on physical media Tuesday 2/18 and streaming on SHUDDER Friday 2/21. Read the full article on AICN Parenthood is sacrifice, and that is the message behind the latest horror film from filmmaker Michael Cummings, aka Spider One of Powerman 5000, aka Rob Zombie's brother. As he puts it in his director's statement: \"In the film, Mindy’s relationship with her monster, Agyar, is clearly my allegory for parenthood. His bites are her pain. His words are her insecurities. His intentions are to prove Mindy’s failure as a parent. We are in solidarity with Mindy, even if, at times we are frustrated and baffled by her actions. And that is exactly the point. She doesn’t know what to do. None of us do. Framing this movie in horror was a natural choice.\" LITTLE BITES tells the story of Mindy Vogel (Krsy Fox, TERRIFIER 3), who is inexplicably saddled with a demon, Agyar (Jon Skarloff, CAPTAIN AMERICA: THE WINTER SOLDIER) that demands to feast upon her daughter, Alice. Unwilling to acquiesce, Mindy sends Alice to stay with her mother (Bonnie Arons, THE NUN) while she placates the monster with bites of her own flesh, spinning a plan to rid of her the burden once and for all.  I had the opportunity to speak with writer/director Spider One and lead actress Krsy Fox, neither of whom I felt comfortable addressing by name because I didn't feel entirely sure if Krsy was just pronounced \"Krissy\" and I couldn't rightly look a man in the face and call him \"Spider\". I really wanted to like this feature when I sat down to watch it, and a lot about it is quite Finish the article on AICN McEricTue, 18 Feb 2025 08:34:00 +000083604THE THINKING GAME Stream this Fridayhttps://www.aintitcool.com/the-thinking-game-greg-kohs-gary-krieg-83603/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsMcEric talks to director Greg Kohs and producer Gary Krieg about the new documentary THE THINKING GAME Read the full article on AICN It’s apparent that we’re living in the future, but how did we get here? Moreover, who shepherded us into this bold new world? Director Greg Kohrs and producer Gary Krieg sought this very answer and it brought them to Demis Hassabis.   Demis Hassabis began his journey as a young chess prodigy before shifting gears toward changing the world. He was drawn to the game as a “A fun thinking game,” but after a particularly long battle at a world tournament, he saw a futility in wasting his brain on games when there were real challenges to which he could apply his talents.    During a gap year between high school and college, Demis got an internship at Bullfrog games, where he implemented rudimentary AI into a PC game called Theme Park. His innovation allowed the NPCs to react to each other as well as the gamers’ intervention and create a more interconnected and immersive experience. This caught the eye of Electronic Arts and changed the trajectory of video games for years to come. Despite this transformative influence, Demis focused on college and after graduation sought to tackle the issue of Artificial General Intelligence.   For the uninitiated, Artificial General Intelligence refers to a true thinking creation. Inspired to a point by the AI Deep Blue defeating Chess master Kasparov in 1997, Demis was duly impressed by the victory but saw the limitation of an innovation that could ONLY play chess. As admirable as that was, Demis saw an imminent future where an AI could beat Finish the article on AICN McEricThu, 06 Feb 2025 01:26:00 +000083603Sundance Midnight Selection TOUCH MEhttps://www.aintitcool.com/touch-me-sundance-midnight-83602/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsMcEric chats with the writer/director and stars of the Sundance Midnight Selection TOUCH ME Read the full article on AICN The Sundance Film Festival is preparing to hit Park City, Utah once again this Thursday, January 23rd through February 2nd, boasting 88 feature films and a slew of shorts and industry panels. One of the highlights of the festival each year is the Midnight Program, which screens genre pictures late at night. Just last year this program brought us I SAW THE TV GLOW, IN A VIOLENT NATURE, and LOVE LIES BLEEDING, to give you an idea of the type of fare one might find. One particular title in this year's program caught my interest when I read the synopsis and stood out as something that would assuredly be unique. The film is called TOUCH ME by writer/director Addison Heimann, and its synopsis reads: Two codependent best friends become addicted to the heroin-like touch of an alien narcissist who may or may not be trying to take over the world. TOUCH ME is a brilliant meditation on addiction, codependency, and the universal search for acceptance and peace in an ever-increasingly chaotic world. The film's use of color is exquisite, and the four lead actors who propel the story turn in some amazing work. I knew the film would be weird but it exceeded my expectations, and if you like your allegories laugh-out-loud funny and interspersed with tentacle sex, you will love this film, too. I was able to talk to writer/director Addison Heimann, stars Olivia Taylor Dudley, Lou Taylor Pucci, Jordan Gavaris, and Marlene Forte about the film, some of the technical wizardry Finish the article on AICN McEricTue, 21 Jan 2025 04:16:00 +000083602NOSFERATU - Succumb to the Darknesshttps://www.aintitcool.com/nosferatu-review-eric-mcclanahan-83601/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsEric McClanahan reviews Robert Eggers's latest film, NOSFERATU. Read the full article on AICN Wouldst thou like to live immortally? Robert Eggers is back in theaters with his latest vision, NOSFERATU, a remake of the 1922 film of the same name, which was itself an unlicensed retelling of Bram Stoker's DRACULA. For those who don't know, Eggers is the visionary behind such standout films as THE VVITCH, THE LIGHTHOUSE, and THE NORTHMAN. His films have earned him a fiercely dedicated fanbase and heavy auteur status in Hollywood, essentially giving him carte blanche when it comes to making his films. NOSFERATU is the culmination of that legacy and that power, for better or worse. I saw NOSFERATU last night in a packed theater, my second choice theater as the first had already sold out by the time I arrived. It was preceded by trailers for THE WOLF MAN and THE MONKEY, tailored to its audience of artistic horror hounds. The movie begins with simple white text over black backgrounds, and the first thing the audience hears is a woman crying the darkness. From there, the film is two plus hours of atmosphere and mood, stretched to its near breaking point before the final fade out. Eggers is a master of tone, an Edgar Allan Poe of the visual form, and his legacy as a visual storyteller receives no tarnish with this entry into his oeuvre. So much is explored with a muted color palette and expert use of light and shadow. The camera pulls into darkness, pulls the bodies onscreen into rooms into which they cannot see, Finish the article on AICN McEricTue, 31 Dec 2024 01:37:00 +000083601James Fox Discusses His Documentary THE PROGRAMhttps://www.aintitcool.com/interview-james-fox-the-program-uap-reports-83600/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsFilmmaker James Fox discusses his new documentary THE PROGRAM which examines the United States government's pre-existing relationship with UAPs. Read the full article on AICN In a new AND NOW FOR SOMETHING COMPLETELY DIFFERENT SEGMENT, I will do something terrifically similar to what I did the last time I did this segment, and now that I'm reading that out loud I realize how ridiculous it sounds. Regardless, I once again enter the realm of Unidentified Anomalous Phenomena and speak with a specialist about what the United States knows, what it doesn't, and the barriers that are preventing it from disclosing its full knowledge to the public. Let's get one thing established right away: the conversation around alien visitation has changed. When I chatted with Disclosure Activist Stephen Bassett back in 2021, we weren't discussing if these visitations were real but rather why we weren't being told about them. Even the classification has changed - they're no longer Unidentified Flying Objects but Unidentified Anomalous Phenomenon, or UAPs. Our government has come clean about their interest in UAPs, largely due to military concerns, and they take sightings seriously. The Defense Department's All-domain Anomaly Resolution Office was created to investigate unidentified anomalies to determine if they're foreign or domestic, dangerous or innocuous, earthbound or alien. That part is transparent, but THE PROGRAM's findings aren't, and that is the subject of filmmaker James Fox's new documentary, THE PROGRAM. I chatted with James Fox, filmmaker of The Phenomenon, Moment of Contact, and I Know What I Saw, to discuss THE PROGRAM after viewing it, and though we were able to talk for quite a while, I didn't really have that many questions. Not because the Finish the article on AICN McEricFri, 27 Dec 2024 19:50:00 +000083600BLOODY AXE WOUND is a Bloody Good Time!https://www.aintitcool.com/bloody-axe-wound-hilarie-burton-morgan-interview-83599/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsMcEric chats with produced Hilarie Burton Morgan and star Molly Brown about the new SHUDDER exclusive BLOODY AXE WOUND, a coming-of-age slasher comedy with heart(s) to spare. Read the full article on AICN Everything about film has changed, and while some lambast this brave new world, it does have its silver linings. Streaming services took over channels and then became their own studios. For every Netflix dud there's a great horror film championed by SHUDDER, Bloody Disgusting, or Fangoria that would go otherwise unproduced. SHUDDER, specifically, has been picking up amazing films, from last year's LATE NIGHT WITH THE DEVIL to this year's IN A VIOLENT NATURE. The studio is ending the year strong with a meta take on the coming-of-age slasher rom-com called BLOODY AXE WOUND, releasing in limited theaters before landing on the streamer in early 2025. The synopsis is as follows: Abbie Bladecut (Sari Arambulo, \"A.P. Bio\") is a teenager torn between the macabre traditions of her family’s bloody trade and the tender stirrings of her first crush (Molly Brown, \"Dexter: Original Sin\"). In the small town of Clover Falls, Abbie’s father, Roger Bladecut (Billy Burke, TWILIGHT), has built an infamous legacy by capturing real-life killings on tape and selling them to eager customers, but as Abbie delves deeper into the grisly family business, she begins to wonder if it’s time to take the family tradition in a new direction.  The conceit of the film is surprisingly fresh in a genre that finds new ways to reinvent itself with shocking regularity. Set within the confines of a horror film, we see what it might be like to grow up in a family where the patriarch is a serial killer/slasher who rises from the grave Finish the article on AICN McEricFri, 27 Dec 2024 05:10:00 +000083599Barbarella Dives into Conversation with FREEDIVER Director Michael John Warren!https://www.aintitcool.com/michaeljohnwarreninterview2024freediver-83598/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsBarbarella Dives into Conversation with FREEDIVER Director Michael John Warren! Read the full article on AICN Hey friends! Barbarella here. Michael John Warren’s latest documentary Freediver is available on Prime Video, or buy or rent on Digital starting December 7, 2024. The film plunges viewers into the world of competitive freediving as it chronicles Alexey Molchanov’s unprecedented attempt to set world records in multiple categories of the sport. Opening with some explanations about diving’s impact on the body, the film draws me back to memories of getting certified to scuba. Prior to those classes, the risks about which I knew were drowning, underwater predators (e.g. sharks), and the bends. Yet, those first days in the classroom, we learned a whole horde of other damaging or fatal consequences of diving that I had never previously considered. Once we were all sufficiently terrified of the consequences of our planned endeavor, it was time to don our gear and plunge into the depths. And we did, despite the inherent risks of injury and death.  Although risk-free to myself, witnessing Alexey move gracefully deeper into peril in Freediver proves almost as nerve-wracking as my first open-water dive and leaves me pondering questions, like “How long could I hold my breath?” - the answer is not long at all - or “Would I ever consider free diving?” The answer is maybe, but absolutely not competitively. Those people are insane, superhuman, or both! Whether they are insane or not, I spend much of the film in awe of these people who have trained their bodies to perform skills the human body was never meant to experience. Finish the article on AICN BarbarellaFri, 06 Dec 2024 12:45:00 +000083598Tim Sheridan - Creator Interviewhttps://www.aintitcool.com/tim-sheridan-alan-scott-green-lantern-interview-83597/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=comicsTim Sheridan chats about Alan Scott: Green Lantern, Superman: Man of Tomorrow, Batman: The Long Halloween, and adapting legacy stories to small and large screens. Read the full article on AICN When I got into this racket over six years ago, I did so as a fan. In fact, it was a passing text exchange with a friend about the movie A QUIET PLACE that ended with “Hey, do you want to write about movies for a website?” Flash forward, here I am, having interviewed over a hundred creatives in my time with this site and others. Typically, I’ll get an email from a PR firm asking if I want to screen a film and speak with attached talent or read a book and speak with the author. I rarely say no as I firmly believe that everyone is worth talking to and every person you come in contact with can teach you something that you might not learn in your own sphere of social contacts or experiences.   This interview is different. This subject I hunted down. I saw that he was going to be at New York Comic Con this year signing books in Artist Alley, and I’d already interacted with him briefly on Twitter (back when it was Twitter) so I felt I could swing over and say hello. I did, and of course he had some fans in front of him when I arrived so I decided to hang back and let them have their moment. Watching him interact with these fans confirmed everything I believed about this writer - he couldn’t be any nicer, any more accommodating, or any more grateful for the people who celebrate his art. Finish the article on AICN McEricSat, 30 Nov 2024 08:54:00 +000083597Jenni \"JWoww\" Farley on Writing/Directing DEVONhttps://www.aintitcool.com/jenni-jwoww-farley-interview-devon-83596/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsMcEric chats with reality star Jenni \"JWoww\" Farley on her feature-film debut as writer/director of the found-footage horror film DEVON. Read the full article on AICN Found footage horror. Do you love it? Do you hate it? Do you think it is its own genre or do you lump it in with its overarching tone - slasher, supernatural, monster, etc. Love it or hate it, the convention is here to stay, as it offers a realistic, relatable approach to horror that blurs the lines between reality, film, empathy, and voyeurism.   So, when I got an email asking if I wanted to screen the feature DEVON, written and directed by Jenni “JWoww” Farley, I said “of course I do!” My wife is a fan of “Jersey Shore” and has been since day one, so I mostly did it for her, but I was also very curious what the singular star would bring to the horror pantheon. The logline read:   Devon's parents never stopped searching for answers after her disappearance from a notorious asylum. Years after the incident, a mysterious website draws five adventurers to the abandoned asylum where she was last seen. Armed with cameras, they plunge into the darkness, unaware they’re filming their own descent into horror—never meant to return.     I got the chance to chat with writer/director/producer Jenni “JWoww” Farley about jumping into a feature-length film, the serendipitous location, and her crew.      Eric McClanahan: Hey, Jenni! How are you?   Jenni “JWoww” Farley: Good. Nervous.    EM: Nervous? Why are you nervous?   JJF: I feel like this is [me] kind of starting my career over. It’s a different world, a different element. I am a superfan of horror films; I have been since I Finish the article on AICN McEricFri, 15 Nov 2024 01:07:00 +000083596HIPPO'S Writer/Director Mark Rapaport Chats Video Games, Sex Talks, and Black-and-White Filmmakinghttps://www.aintitcool.com/markrapaportinterview2024hippo-83595/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsHIPPO'S Writer/Director Mark Rapaport Chats Video Games, Sex Talks, and Black-and-White Filmmaking Read the full article on AICN Hey, friends! Barbarella here to talk about dark comedy Hippo, or more accurately to share the conversation I had with Hippo’s director and writer Mark Rapaport. Genuinely funny, this incredible film has the potential to achieve cult status, so long as people take a chance on this black-and-white gem and actually see it. I recommend that they do. Hippo stars Kimball Farley, Lilla Kizlinger, Eliza Roberts, and Eric Roberts as the narrator. It tells the story of two exceptionally different teens being raised by their mother in a somewhat isolated existence. At times, it reminds me of Yorgos Lanthimos’ Dogtooth, in the way that the children in Hippo are sheltered, while not in the same extreme way they were in the Greek film, both films make strong points about the detriment of isolation. The two would make a great double-feature, but if you want to jump on this one first, Hippo will be in select theaters November 8.  At any rate, after a night of minimal sleep due to staying out late at the Pink concert, I caught up with Mark Rapaport, and we had a fun chat about the movie. Check it out! Barbara: Why go black and white with this?  Mark: I've always loved classic movies, but I never thought I would make a movie in black and white until my cinematographer started taking photos of black and white, and I was like, “These are so cool and good, why don't more people shoot in black and white? Maybe we should do something like that.” He was very into that. When Finish the article on AICN BarbarellaFri, 08 Nov 2024 15:59:00 +000083595Spooky Picks for Fright Night Flickshttps://www.aintitcool.com/hold-your-breath-die-alone-bhff-83594/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsMcEric highlights a few spooky films for your Halloween night, including DIE ALONE and HOLD YOUR BREATH. Read the full article on AICN ‘Tis the season, for a few more hours, before Mariah Carey breaks through her ice-cocoon and heralds in the winter holidays. If you need a couple of thrillers to hold back the tide of the inevitable, I’ve got you covered with a couple of brand new features released this very month: HOLD YOUR BREATH and DIE ALONE.   DIE ALONE stars Carrie-Anne Moss (THE MATRIX, “The Acolyte”), Frank Grillo (CAPTAIN AMERICA: THE WINTER SOLDIER, ONE DAY AS A LION), Douglas Smith (HBO’s “Big Love”), and Kimberly-Sue Murray (Netflix’s “V-Wars”). The film is written and directed by Lowell Dean (WOLFCOP, SUPERGRID) and released by Quiver Distribution. After an outbreak turns the majority of the population into plant-based zombies, a young man (Smith) with amnesia searches for his lost love and stumbles across a rugged survivalist (Moss). Check out the trailer:     If you’re getting “The Last of Us” vibes, you’re on the right track. The film features some pretty great creature effects, apt desolation to sell the apocalypse, and a surprisingly original story. Moss is the star of the show, by far, and carries her scenes with a deadpan humor that keeps the heavy subject matter from swallowing the viewer in despair. The budget limitations are clear but the film that emerges is certainly a smart, fun ride that hits all the points of an apocalyptic thriller with a (predictable) plot twist and great performances.   I got the chance to chat with Carrie-Anne Moss about the production of the film, her bicycle-riding skills, and dream roles. Carrie-Anne Finish the article on AICN McEricFri, 01 Nov 2024 00:45:00 +000083594Snake Plotzkin Reviews THE LIFE AND DEATHS OF CHRISTOPHER LEEhttps://www.aintitcool.com/lifeanddeathsofchristopherleeffreview2024-83593/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsSnake Plotzkin Reviews THE LIFE AND DEATHS OF CHRISTOPHER LEE Read the full article on AICN Snake Plotzkin, reporting from Fantastic Fest 2024, where I got to see the biographical documentary, The Life and Deaths of Christopher Lee. I’m a big fan of Hammer horror, and I will watch literally any Hammer film with Christopher Lee and Peter Cushing in it. One of my favorite Hammer films is Rasputin the Mad Monk, which, if you haven’t seen it, is one of Lee’s best performances. The gigantically tall Lee stalks around St. Peterburg as the mad monk, hypnotizing women, seducing them, and then yelling at them to get out of his room and leave their money on the bed. It’s amazing.  If The Life and Deaths of Christopher Lee had been made up completely of anecdotes about Christopher Lee and Peter Cushing on the Hammer films, I would honestly have been very satisfied with it. But the movie unexpectedly goes much further, revealing not just another side of the actor, but multiple facets. For instance, did you know that Christopher Lee fought Nazis? That he may have been the inspiration for James Bond (which was written by his cousin)? That he released two heavy metal albums? Well, this movie goes where no marionette-narrated biopic has gone before, using a mix of interviews, animation, and puppetry to bring Christopher Lee to life (the man himself passed away in 2015). Yes, I said puppetry. The movie is narrated by a marionette of Christopher Lee – who, in an uncanny imitation of Lee’s sonorous voice (played by Peter Szymon Serafinowicz, an English actor Finish the article on AICN staffSat, 05 Oct 2024 14:56:00 +000083593STRANGE HARVEST: THE OCCULT MURDER IN THE INLAND EMPIRE Premieres at Fantastic Fest 2024!https://www.aintitcool.com/strangeharvestinterview2024-83592/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsSTRANGE HARVEST: THE OCCULT MURDER IN THE INLAND EMPIRE Premieres at Fantastic Fest 2024! Read the full article on AICN Hey friends. Barbarella here. Strange Harvest: The Occult Murder in the Inland Empire is a long title for a great narrative utilizing the true-crime documentary format. The format proves so effective at tricking my brain into thinking I’m watching actual footage of crime scenes and caught-on-tape moments that I had to occasionally remind myself to relax, it’s only a movie.  It made its world premiere at Fantastic Fest 2024 on September 22, 2024 at 11:50 p.m. CT, and I had the delightful opportunity to sit down with genre director Stuart Ortiz, and actors Peter Zisso and Terri Apple in Austin last week. Check it out! Barbara: I'm one of these people that I can watch the most gruesome stuff in movies, and it doesn't bother me, heads getting drilled and stuff. Peter: Bless You.  Barbara: But it really upsets me to see people getting hurt, even these skateboarding videos and such, and this movie messed with my brain because I knew it’s fictional, but my brain got tricked into thinking it was real at times because the way it was done. I'm very impressed with the effectiveness of that.  Stuart: Thank you.   Barbara: Why do this in a true crime format? What were you going for?  Stuart: I just think it's a really interesting way to tell a story, and in particular to tell a horror story because it just allows you to have this vantage point that you don't normally have with horror, to investigate certain details or aspects of a horror story that you wouldn't focus on necessarily in a more conventional story. I Finish the article on AICN BarbarellaSat, 05 Oct 2024 02:02:00 +000083592Kevin Smith Talks THE 4:30 MOVIEhttps://www.aintitcool.com/kevin-smith-interview-eric-mcclanahan-430-movie-83591/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsKevin Smith Talks to McEric about THE 4:30 MOVIE Read the full article on AICN Kevin Smith’s THE 4:30 MOVIE is coming home today, available on digital through all major retailers. The film tells the story of young Brian David, an avatar of Kevin Smith, and his adventures at the local Atlantic Cinema where he watches films with his friends Burny and Belly in 1986. It’s a departure from the View Askewniverse that Smith started thirty years ago, which admittedly stretched to its possible breaking point as the characters within encountered rebel angels, demons, Hollywood, jewel thieves, terrorists, and a monkey. THE 4:30 MOVIE offers a much more grounded story of a simpler time when the cinema and video store ruled the weekend, and the lives on the silver screen either mirrored our own or showed us worlds we could only imagine.  I had the opportunity to chat with Kevin Smith yesterday in support of the film’s digital release and it went exactly as I thought it would: we were given six minutes, I asked one question, and he talked for eight. What I got in that response, though, was a good deal of wisdom about what the filmmaker attempts when he puts his memories to screen for our amusement, how he’s remained relevant, and where his ideas originate. Prior to the interview’s start, my cat Bennie decided she needed to be part of it all, as well, and leapt onto the seat behind me.    Eric McClanahan - Hi Kevin!   Kevin Smith - Hello, Eric! How are you?   EM - I’m well, thank you!   KS - Look at that cat! Finish the article on AICN McEricTue, 01 Oct 2024 08:37:00 +000083591Interview with the Cast of TERRIFIER 3https://www.aintitcool.com/terrifier-3-david-howard-thornton-lauren-lavera-83590/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsMcEric chats with David Howard Thornton (Art the Clown) and Lauren Lavera (Sienna Shaw) ahead of Damien Leone's TERRIFIER 3 Read the full article on AICN Time to crawl out from under your bridges, ghouls, because Damien Leone’s Art the Clown is back in TERRIFIER 3, hitting theaters October 11th. This time the terror is set against the backdrop of Christmas, with Art (David Howard Thornton) returning to hunt down Sienna (Lauren Lavera) after she cut his head off in the last installment. The film picks up right at the end of Part 2 before allowing Art to take a five year siesta while Sienna spends time in facilities piecing her psyche back together. Young Jonathan Shaw (Elliott Fullam) isn’t so young anymore, attending college near his Aunt and Uncle, Jessica and Mark (Margaret Anne Florence and Alex Ross), with whom Sienna stays after being checked out of the latest facility.  The film opens with Art dispatching a family while dressed in a Santa Claus suit, letting the audience know right away that no one is safe. The entire film plays out as a supercut of gory kills and dark humor, with occasional moments of genuine world-building that allows the supporting cast to really stretch their acting muscles. Plotwise, the film seems to be more focused on showcasing creative kills than telling a cohesive story, and the end seems somewhat rushed, as though the filmmakers had almost forgotten that they had to end the thing.    What a TERRIFIER fan is looking for, however, is exactly what they’ll find in 3: inventive kills, stomach-turning sound design, laughs that’ll make you question your own morality, and surprises. When I got Finish the article on AICN McEricTue, 01 Oct 2024 01:03:00 +000083590Barbarella Talks AI With SUBSERVIENCE Director S.K. Dalehttps://www.aintitcool.com/skdaleinterview2024subservience-83589/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsBarbarella Talks AI With SUBSERVIENCE Director S.K. Dale Read the full article on AICN Hi friends, Barbarella here. Sci-fi film Subservience, starring Megan Fox, Michele Morrone  (his name’s Italian so the “ch” is pronounced like a “k”), Madeline Zima, and Matilda Firth, just came out on Demand and Digital, so let’s talk about AI. Do you think artificial intelligence will bring about major medical advancements, or do you envision more of a Terminator situation evolving? I tend to think it’s not the AI itself but whoever’s behind it that should be on whom we focus our concern. When it comes to cinema, filmmakers always hold technology responsible, because let’s face it, that makes for a more entertaining movie. I would argue Will Honley and April Maguire’s screenplay puts at least some of the onus on the humans. Maybe don’t say certain things to a Sim that’s constantly evolving and learning; that’s all I’m saying. If it weren’t for one comment made to Alice (Megan Fox), the attractive Sim acquired to help out around the house, perhaps a lot of mayhem could have been avoided.    I appreciate that the conflict in Subservience primarily occurs within the family unit, as this makes it more believable to me. Favoring older technologies, Nick (Michele Morrone) isn’t the biggest fan of artificial intelligence, but when he and his sick wife (Madeline Zima) can’t keep up with managing the household and children, he caves and gets Alice, the best new Sim on the market, to help out, and you know that’s not going to work out quite how everyone expects, well, at least how everyone Finish the article on AICN BarbarellaSat, 14 Sep 2024 13:57:00 +000083589THE 4:30 MOVIE's Cast Speaks About Kevin Smith's New Comedyhttps://www.aintitcool.com/interview-cast-new-kevin-smith-film-83588/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviewsMcEric chats with the cast of Kevin Smith's THE 4:30 MOVIE Read the full article on AICN Writer/Director Kevin Smith began his View Askewniverse in 1994 with his breakout hit CLERKS. The film tells the story of a couple of slackers working dead-end jobs in New Jersey in the 1990s and the conversations and misadventures they dabble in along the way. The film paved the way for countless stories, and so far nine films by Smith have rounded out its canon, along with several animated adventures and more in the pages of comic books. Before Dante and Randall ever sat around the Quik Stop and chatted about JAWS, STAR WARS, or even NAVY SEALS, young Kevin Smith was a New Jersey native soaking up inspiration on the silver screen at his local movie theater, the Atlantic Highlands Cinema. Flash forward to today and he owns that theater, rebranded as the Smodcastle, where he showcases new releases, repertory classics, film festivals, and even special screenings of “Movies With Kev,” where he screens a classic and participates in a Q\u0026A following the screening.   Finally the formative experiences of young Kev are getting their own film treatment, with Kevin Smith’s newest release, THE 4:30 MOVIE, premiering tomorrow in cinemas around the country. The film, not set within the View Askewniverse, tells the story of a young man named Brian David, a not-even-thinly-veiled stand-in for Kevin Smith, played by Austin Zajur, who one day in the late spring of 1986 asks his crush Melody Barnegat (Siena Agudong) to meet him at the movies. This is much to the chagrin of his two Finish the article on AICN McEricFri, 13 Sep 2024 00:11:00 +000083588Shiloh Fernandez Discusses Working With Nadine Crocker on CONTINUEhttps://www.aintitcool.com/shilohfernandezinterview2024continue-83586/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsShiloh Fernandez Discusses Working With Nadine Crocker on CONTINUE Read the full article on AICN Hey, friends! Barbarella here. It feels a little wrong that I have a ton of pep today while I’m covering a movie about the very serious topic of suicide, but here we are. Continue makes a personal and powerful statement from writer, director, and star Nadine Crocker, who survived her own suicide attempt in her twenties. In Theaters, On Demand and Digital September 6, 2024, Continue escorts viewers through Dean’s struggles as she experience life after a suicide attempt. Beautifully shot, the film also includes an unexpected love story, albeit, I’m not sure I believe that two people would be that flirtatious while discussing their past traumas, but just because I wouldn’t flirt while sharing horrific things from the past doesn’t mean it’s not possible that some people might. Anyway, before I veer too far off-topic, the movie stars an actor of whom I’ve been a fan since first seeing him about fifteen years ago in an independent film at Fantastic Fest called Deadgirl, and I’m grateful to have the opportunity to chat with that actor, Shiloh Fernandez, about the film.  Right out of the gate, I share my love of Deadgirl and Shiloh’s performance in it. Check out his response and the rest of our conversation!  Shiloh: That is so sweet. It’s still one of my favorite movies. I loved doing a small movie like that, and all these years later, to do Continue, I think it was maybe the 2nd smallest. It is really neat having these small movies make an impact.  Barbara: I don’t know what it says about me, but Deadgirl was one Finish the article on AICN BarbarellaFri, 06 Sep 2024 11:06:00 +000083586Barbarella and Director Audrey Cummings Discuss Western PLACE OF BONES!https://www.aintitcool.com/audreycummingsinterview2024placeofbones-83585/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsBarbarella and Director Audrey Cummings Discuss Western PLACE OF BONES! Read the full article on AICN Hey, friends. Barbarella here. A new Western, Place of Bones, rides into theaters and on digital Friday, August 23, 2024. Unlike the Westerns of yesteryear, this one is female-led, with Audrey Cummings in the director’s chair and Heather Graham shining in the lead role as a mother who, along with her daughter (Brielle Robillard), must fight for survival when a gang of outlaws, led by Tom Hopper, arrives in the area.    I’ve been a Tom Hopper fan ever since he won me over with his enticing portrayal of Billy Bones in Black Sails. He earns additional adoration from me through the way he injects subtle humor as villain Bear John in this film. I find myself laughing at moments that I’m fairly certain weren’t intended to be funny, yet he fires wit like a true sharp-shooter with a faint exasperation about him that’s just funny. However, he’s not the only one who offers something more than just delivering what’s written on the page. Corin Nemec, Brielle Robillard, and Heather Graham also add an extra something that gives insight into their characters and adds a bit of snark to the exchanges.   I had the opportunity to speak with Audrey Cummings, and I sometimes like to break the ice with a question about Muppet-casting on remakes. While she placed Kermit, Miss Piggy and Fozzy Bear in the lead roles of Calhoun (Corin Nemec), Pandora (Heather Graham), and Hester (Brielle Robillard), I took a completely different approach, thinking it would be fun to have Statler and Finish the article on AICN BarbarellaThu, 22 Aug 2024 23:29:00 +000083585#ALL MY FRIENDS ARE DEADhttps://www.aintitcool.com/all-my-friends-are-dead-interview-83584/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews#ALL MY FRIENDS ARE DEAD director Marcus Dunstan and star Jade Pettyjohn talk to McEric about the new slasher comedy! Read the full article on AICN There was every manner of film at this year’s Tribeca Festival, and I managed to take in thirteen features, four shorts, and an episodic premiere by the time the whole thing wrapped this past June. One of the highlights was the opportunity to interview two of the lead talents behind the new slasher ALL MY FRIENDS ARE DEAD: director Marcus Dunstan and star Jade Pettyjohn. We met at the Roxy Hotel bar and restaurant, a favorite meetup spot of mine, on a Saturday morning. I was, admittedly, running late, but they were so patient and gracious with me and I always appreciate that from stars and filmmakers, whose lives are probably ten times as cluttered as mine.  Its logline says of the film: “A group of college friends rents an airbnb for the biggest music festival of the year. However, their weekend of partying soon takes a deadly turn as a masked killer murders them one by one according to their sins.” The film, though familiar in synopsis, finds a way to inject new life into a tired formula. The design of the killer is unique, the kills are creative, the victims are fighters rather than training dummies, for the most part, and the twist(s) are welcome.   Marcus Dunstan is perpetually smiling, speaking in a small voice from a large, gentle face. Jade Pettyjohn is excitable, clearly enjoying being at the festival and also talking about this joyous diversion in her filmography. We couldn’t help but jump right in. Unfortunately, I recorded this Finish the article on AICN McEricSat, 17 Aug 2024 00:12:00 +000083584Check Out This Trailer for Psychological Thriller SLINGSHOT!!https://www.aintitcool.com/slingshottrailer-83583/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsCheck Out This Trailer for Psychological Thriller SLINGSHOT!! Read the full article on AICN Hey friends, Barbarella here. It seems like ages since we’ve had a really cool psychological thriller that takes place in space, but it appears that Slingshot may fill that void. When a trio of elite astronauts set to undertake a risky slingshot maneuver, potential issues with both the ship and a crew member add to the dangers of the mission. Starring Casey Affleck, Laurence Fishburne, Emily Beecham, Tomer Capone, and David Morrissey, the film hits theaters nationwide August 30th. Check out the trailer! Finish the article on AICN BarbarellaTue, 30 Jul 2024 21:00:00 +000083583SDCC Robert Downey Jr returns to MCU!https://www.aintitcool.com/sdcc-robert-downey-returns-83582/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnewsRobert Downey Jr is back but not as we know it! Read the full article on AICN In perhaps the most shocking story to come out of this year's otherwise short-on news panel from Marvel Studios, Robert Downey Jr is returning to the MCU. It has just been announced that he has been cast as none other than the great green dictator Doctor Doom. Taking to the stage Downey Jr had this to say: \"New mask, same task...What can I tell ya, I like playing complicated characters.\" Whether or not he’ll be the genuine Earth 616 version or the Doom from the alternate Universe Fantastic Four: First Steps seems to be set in remains to be seen. Either way, welcome back to the fold RDJ. The panel revealed that Downey Jr’s Doom would make his presence known in the freshly titled Avengers: Doomsday which has a release date of May 2026 with Avengers: Secret Wars following in May 2027.  Let us know what you think of this curveball in the comments down below! Finish the article on AICN HouseOfMacleodSun, 28 Jul 2024 08:58:00 +000083582",
  "author": "McEric",
  "published": "Tue, 20 May 2025 19:16:00 +0000",
  "source": "https://www.aintitcool.com/node/feed/",
  "categories": null,
  "byline": "McEric",
  "length": 6718,
  "excerpt": "A BREED APART - Heavy on the Laughs, Light on the Scares - McEric reviews the new horror/comedy from the Furst Brothers starring Grace Caroline Currey and Page Kennedy.",
  "siteName": "Aint It Cool News",
  "favicon": "",
  "text": "Hello all! McEric here with a review of the Furst Brothers' new horror/comedy A BREED APART, out now in theaters and on-demand. The film follows several Internet celebrities who are invited to an island overrun by rabid dogs to compete for a prize... survival. Check out the trailer: The film stars Grace Caroline Currey (SHAZAM: FURY OF THE GODS, FALL), Virginia Gardner (FALL, 2018's HALLOWEEN), Page Kennedy (THE MEG, THE MEG 2), Troy Gentile (ABC's \"The Goldbergs\"), Riele Downs (Nickelodeon's \"Henry Danger\"), Zak Steiner (Netflix's \"Jessica Jones\"),and Hayden Panittiere (NBC's \"Heroes\"). The film is directed by Griff Furst and brother Nathan Furst, whose previous collaboration as co-directors brought us NIGHTMARE SHARK. Solo, Griff Furst has directed such films as SWAMP SHARK, GHOST SHARK, and TRAILER PARK SHARK, so he clearly knows his way around a creature feature... even if he doesn't really want to. \"Who is Louie Myman?\" I asked when we spoke this past Friday. [Louie Myman is the credited director of Furst's films 100 MILLION BC and ALLIGATOR ALLEY.) \"Oh, Louie Myman! Do you know Alan Smithee?\" \"Yes.\" \"He's Alan Smithee's brother. Yeah, I mean, it's a tough thing. It's an interesting thing to explore. It's like when you do a creature feature and it rates well, and it does well, they just offer you more of them. And I love them, don't get me wrong. I grew up watching all these creature features - Mysterious Island and Jaws and Cujo. I love those movies, but I love ALL kinds of movies. The creature feature, itself, is like a little box.\" \"In truth,\" echoes Nathan, whose background is in film scoring, \"a lot of people don't realize it's not just actors who get typecast. And so, yeah, with filmmakers, it's the same thing. It's like if I do creature features, I can probably do 70 more creature features because I'll just keep getting calls about them.\"  A BREED APART takes a meta approach to the genre, opening fifteen years prior on a remote island where movie star Hayden Hearst (Panettiere) is filming a creature feature about rabid dogs when the stunt dogs actually go rabid. The movie shuts down and the entire crew deserts the island, leaving the dogs to multiply and conquer. In the modern timeline, an Internet Influencer has begun construction of a luxury getaway on the island, but notes that the dogs are still an issue. To humanely deal with the problem, he contacts several other notorious influencers and invites them to the island to rescue as many of the pups as each can, with the one to bag the most awarded with the deed to the island. However, as soon as the contest starts, it becomes apparent that the dogs aren't the ones who need rescuing, and the fight for survival is on.  I'll admit, I was reluctant to cover this film. I let emails languish in my inbox unanswered because I felt that I'd either already seen this movie a dozen times before or deliberately avoided it. When the carrot of speaking to Grace Caroline Currey was dangled, I took the bait and watched the film. I must've missed the phrase \"hilariously harrowing tale of terror\" in the synopsis because I expected this movie to be dire and serious despite its premise. Thankfully, the Furst Brothers are fully aware of the film they're making, and they have a blast making it. A BREED APART is funny, slapsticky, self-aware, and irreverent.  The gathered Internet Influencer characters are clear parodies of reality and literally interchangeable. \"[Virginia Gardner] originally was going to play Collins, my brother, but as my sister. But then as we were workshopping it and trying to figure out what the dynamic would be, it was a couple of days before we had to start filming and we were about to fly out, and I looked at Ginny and I said 'I think that you need to be Thalia.' And she said 'I think so, too.' We called Griff [Furst] and thank goodness we had Zak [Steiner] in the wings, who could jump in as my brother,\" explained Currey when we spoke about reteaming with her FALL co-star. Still other casting was inspired, such as Page Kennedy as Big Farmer Jay. A standout from the days of Vine in his own right as well as an established rapper, Kennedy's Big Farmer Jay is a DIY farmer who raps about chickens into his GoPro while it's mounted to a cow's head during his introduction. In a true art-imitates-life moment, Kennedy told me his latest self-titled album was scheduled to drop the day the film premiered, this past Friday. \"I always typically try to have a project come out when I have an acting project, so this is my sixth album that I'll have dropping. It's probably one of my better albums, sonically, and I'm super excited about it and passionate about it.\"  Troy Gentile as a Crypto Bro is just sleaze personified, and Riele Downs' character Queen Bee is given a somewhat sympathetic backstory as a survivalist, encouraging viewers to root for her as the plot thickens. Currey leads the cast as Violet, a reluctant YouTuber who decorates and eats cakes via her brother Collins' (Steiner) hands. Lured to the island by Vince (Joey Bragg), these personalities clash as the camera frequently resets on Violet as our eyes of reason. The real star of a killer dog movie is typically the dogs, and A BREED APART is no exception. You won't be able to take your eyes off the killer pooches, largely because their presence is so very quixotic and irksome. The quantity is unidentifiable and the effects used to demonize these dogs range from practical and laughable to CGI nightmares - not of fear but rather confusion. The dogs are never scary, but trying to wrap one's mind around what the filmmakers were thinking when they settled on any one shot of them will send one spiraling into a doubt that swallows the wider world like a black hole. It is only at the end, when the credits have begun to roll, that A BREED APART makes sense.  The credits feature BTS of the filmmaking process, with bloopers, dancing, puppets, laughter, smiles, and delirious energy. One gets an idea quickly of how much fun this film was to make and no longer worries about its intent or merit. Its intent was for them to have fun - its merit is in that they've chosen to share that fun. If one is tuning in for a shared experience, they will be rewarded. Film is not a vacuum of individual escape but rather a communal effort of shared experiences. Viewed through this lens, A BREED APART works if one is as aware of the forthcoming viewing experience as the production was aware of what they were making. A BREED APART is currently in theaters and on-demand. Rated R for violent/bloody images, language throughout, and some sexual references. Until next time, take care. -McEric, aka Eric McClanahan-",
  "image": "https://media.aintitcool.com/media/_versions/article_images_2022/mceric/a_breed_apart_article_image_huge.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\u003cp\u003eHello all! McEric here with a review of the Furst Brothers\u0026#39; new horror/comedy A BREED APART, out now in theaters and on-demand. The film follows several Internet celebrities who are invited to an island overrun by rabid dogs to compete for a prize... survival. Check out the trailer:\u003c/p\u003e\n\u003cp\u003e\u003ciframe src=\"https://www.youtube.com/embed/MQudR1Gb7m4?si=kEyJTVIbgJgLyFYV\" width=\"425\" height=\"350\" frameborder=\"0\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003cp\u003eThe film stars Grace Caroline Currey (SHAZAM: FURY OF THE GODS, FALL), Virginia Gardner (FALL, 2018\u0026#39;s HALLOWEEN), Page Kennedy (THE MEG, THE MEG 2), Troy Gentile (ABC\u0026#39;s \u0026#34;The Goldbergs\u0026#34;), Riele Downs (Nickelodeon\u0026#39;s \u0026#34;Henry Danger\u0026#34;), Zak Steiner (Netflix\u0026#39;s \u0026#34;Jessica Jones\u0026#34;),and Hayden Panittiere (NBC\u0026#39;s \u0026#34;Heroes\u0026#34;). The film is directed by Griff Furst and brother Nathan Furst, whose previous collaboration as co-directors brought us NIGHTMARE SHARK. Solo, Griff Furst has directed such films as SWAMP SHARK, GHOST SHARK, and TRAILER PARK SHARK, so he clearly knows his way around a creature feature... even if he doesn\u0026#39;t really want to.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Who is Louie Myman?\u0026#34; I asked when we spoke this past Friday. [Louie Myman is the credited director of Furst\u0026#39;s films 100 MILLION BC and ALLIGATOR ALLEY.)\u003c/p\u003e\n\u003cp\u003e\u0026#34;Oh, Louie Myman! Do you know Alan Smithee?\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;Yes.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;He\u0026#39;s Alan Smithee\u0026#39;s brother. Yeah, I mean, it\u0026#39;s a tough thing. It\u0026#39;s an interesting thing to explore. It\u0026#39;s like when you do a creature feature and it rates well, and it does well, they just offer you more of them. And I love them, don\u0026#39;t get me wrong. I grew up watching all these creature features - Mysterious Island and Jaws and Cujo. I love those movies, but I love ALL kinds of movies. The creature feature, itself, is like a little box.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;In truth,\u0026#34; echoes Nathan, whose background is in film scoring, \u0026#34;a lot of people don\u0026#39;t realize it\u0026#39;s not just actors who get typecast. And so, yeah, with filmmakers, it\u0026#39;s the same thing. It\u0026#39;s like if I do creature features, I can probably do 70 more creature features because I\u0026#39;ll just keep getting calls about them.\u0026#34; \u003c/p\u003e\n\u003cp\u003eA BREED APART takes a meta approach to the genre, opening fifteen years prior on a remote island where movie star Hayden Hearst (Panettiere) is filming a creature feature about rabid dogs when the stunt dogs actually go rabid. The movie shuts down and the entire crew deserts the island, leaving the dogs to multiply and conquer. In the modern timeline, an Internet Influencer has begun construction of a luxury getaway on the island, but notes that the dogs are still an issue. To humanely deal with the problem, he contacts several other notorious influencers and invites them to the island to rescue as many of the pups as each can, with the one to bag the most awarded with the deed to the island. However, as soon as the contest starts, it becomes apparent that the dogs aren\u0026#39;t the ones who need rescuing, and the fight for survival is on. \u003c/p\u003e\n\u003cp\u003eI\u0026#39;ll admit, I was reluctant to cover this film. I let emails languish in my inbox unanswered because I felt that I\u0026#39;d either already seen this movie a dozen times before or deliberately avoided it. When the carrot of speaking to Grace Caroline Currey was dangled, I took the bait and watched the film. I must\u0026#39;ve missed the phrase \u0026#34;hilariously harrowing tale of terror\u0026#34; in the synopsis because I expected this movie to be dire and serious despite its premise. Thankfully, the Furst Brothers are fully aware of the film they\u0026#39;re making, and they have a blast making it. A BREED APART is funny, slapsticky, self-aware, and irreverent. \u003c/p\u003e\n\u003cp\u003eThe gathered Internet Influencer characters are clear parodies of reality and literally interchangeable. \u0026#34;[Virginia Gardner] originally was going to play Collins, my brother, but as my sister. But then as we were workshopping it and trying to figure out what the dynamic would be, it was a couple of days before we had to start filming and we were about to fly out, and I looked at Ginny and I said \u0026#39;I think that you need to be Thalia.\u0026#39; And she said \u0026#39;I think so, too.\u0026#39; We called Griff [Furst] and thank goodness we had Zak [Steiner] in the wings, who could jump in as my brother,\u0026#34; explained Currey \u003ca title=\"Grace Caroline Currey Interview for Nerd Initiative\" href=\"https://www.youtube.com/watch?v=3Ua5SgrS9Do\u0026amp;t=2s\" target=\"_blank\"\u003ewhen we spoke\u003c/a\u003e about reteaming with her FALL co-star.\u003c/p\u003e\n\u003cp\u003e\u003cimg title=\"Riele Downs and Grace Caroline Currey in A BREED APART\" src=\"https://media.aintitcool.com/media/_versions/article_images_2022/mceric/riele_downs_and_grace_caroline_currey_in__a_breed_apart_medium.jpg\" alt=\"Riele Downs and Grace Caroline Currey in A BREED APART\" width=\"300\" height=\"200\"/\u003e\u003c/p\u003e\n\u003cp\u003eStill other casting was inspired, such as Page Kennedy as Big Farmer Jay. A standout from the days of Vine in his own right as well as an established rapper, Kennedy\u0026#39;s Big Farmer Jay is a DIY farmer who raps about chickens into his GoPro while it\u0026#39;s mounted to a cow\u0026#39;s head during his introduction. In a true art-imitates-life moment, Kennedy told me his latest self-titled album was scheduled to drop the day the film premiered, this past Friday. \u0026#34;I always typically try to have a project come out when I have an acting project, so \u003ca title=\"Page Kennedy\u0026#39;s Instagram\" href=\"https://www.instagram.com/pagekennedy/?hl=en\" target=\"_blank\"\u003ethis is my sixth album\u003c/a\u003e that I\u0026#39;ll have dropping. It\u0026#39;s probably one of my better albums, sonically, and I\u0026#39;m super excited about it and passionate about it.\u0026#34; \u003c/p\u003e\n\u003cp\u003eTroy Gentile as a Crypto Bro is just sleaze personified, and Riele Downs\u0026#39; character Queen Bee is given a somewhat sympathetic backstory as a survivalist, encouraging viewers to root for her as the plot thickens. Currey leads the cast as Violet, a reluctant YouTuber who decorates and eats cakes via her brother Collins\u0026#39; (Steiner) hands. Lured to the island by Vince (Joey Bragg), these personalities clash as the camera frequently resets on Violet as our eyes of reason.\u003c/p\u003e\n\u003cp\u003e\u003cimg title=\"Good Dog?\" src=\"https://media.aintitcool.com/media/_versions/article_images_2022/mceric/good_dog_medium.jpg\" alt=\"Bad Dog\" width=\"300\" height=\"169\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe real star of a killer dog movie is typically the dogs, and A BREED APART is no exception. You won\u0026#39;t be able to take your eyes off the killer pooches, largely because their presence is so very quixotic and irksome. The quantity is unidentifiable and the effects used to demonize these dogs range from practical and laughable to CGI nightmares - not of fear but rather confusion. The dogs are never scary, but trying to wrap one\u0026#39;s mind around what the filmmakers were thinking when they settled on any one shot of them will send one spiraling into a doubt that swallows the wider world like a black hole. It is only at the end, when the credits have begun to roll, that A BREED APART makes sense. \u003c/p\u003e\n\u003cp\u003eThe credits feature BTS of the filmmaking process, with bloopers, dancing, puppets, laughter, smiles, and delirious energy. One gets an idea quickly of how much fun this film was to make and no longer worries about its intent or merit. Its intent was for them to have fun - its merit is in that they\u0026#39;ve chosen to share that fun. If one is tuning in for a shared experience, they will be rewarded. Film is not a vacuum of individual escape but rather a communal effort of shared experiences. Viewed through this lens, A BREED APART works if one is as aware of the forthcoming viewing experience as the production was aware of what they were making.\u003c/p\u003e\n\u003cp\u003e\u003cimg title=\"Grace Caroline Currey is a bow-wielding Badass in A BREED APART\" src=\"https://media.aintitcool.com/media/_versions/article_images_2022/mceric/grace_caroline_currey_is_a_bow-wielding_badass_in_a_breed_apart_medium.jpg\" alt=\"Grace Caroline Currey is a bow-wielding Badass in A BREED APART\" width=\"300\" height=\"200\"/\u003e\u003c/p\u003e\n\u003cp\u003eA BREED APART is currently in theaters and on-demand. Rated R for violent/bloody images, language throughout, and some sexual references.\u003c/p\u003e\n\u003cp\u003eUntil next time, take care.\u003c/p\u003e\n\u003cp\u003e-McEric, aka Eric McClanahan-\u003cbr/\u003e\u003cimg title=\"me\" src=\"https://media.aintitcool.com/media/uploads/contributor_photos/mc-eric_medium.jpg\" alt=\"me\" width=\"300\" height=\"401\"/\u003e\u003c/p\u003e\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": null,
  "modifiedTime": null
}
