{
  "id": "bb07c0a8-3075-4e80-a9dd-3bd7ef672b91",
  "title": "Jason Patric \u0026 Sylvester Stallone in New Action Thriller 'Armor' Trailer",
  "link": "https://www.firstshowing.net/2024/jason-patric-sylvester-stallone-in-new-action-thriller-armor-trailer/",
  "description": "\"If you open the doors, we're dead.\" \"Be smart – that's not your money.\" Lionsgate has revealed an official trailer for an action thriller movie called Armor, another of these junk action movies being dumped out on VOD. Even though it has Stallone! They still can't make them any good anymore no matter how hard they try. A father and son working as security guards for an armored truck company encounter a team of would-be robbers while on a bridge. They become trapped and must come up with a plan to escape and ensure their survival. They discover the value of what they have been carrying and join forces to outgun and outwit their attackers. Why is every last action screenplay so boring \u0026 derivative these days? Armor stars Jason Patric and Sylvester Stallone, along with Dash Mihok, Josh Wiggins, Blake Shields, and Erin Ownbey. This looks intense but it all seems so dull and forgettable, just another \"how do they get out of this?\" thriller. Here's the first official trailer for Justin Routt's action movie Armor, direct from YouTube: Academy ...",
  "author": "Alex Billington",
  "published": "Tue, 08 Oct 2024 20:31:50 +0000",
  "source": "https://www.firstshowing.net/feed/",
  "categories": [
    "To Watch",
    "Trailer"
  ],
  "byline": "Alex Billington",
  "length": 2025,
  "excerpt": "\"If you open the doors, we're dead.\" \"Be smart – that's not your money.\" Lionsgate has revealed an official trailer for an action thriller movie called Armor, another of these junk action movies being dumped out on VOD. Even though it has Stallone! They still can't make them any good anymore no matter how hard",
  "siteName": "FirstShowing.net",
  "favicon": "https://www.firstshowing.net/favicon-32x32.png",
  "text": "TRAILERS by October 8, 2024Source: YouTube \"If you open the doors, we're dead.\" \"Be smart – that's not your money.\" Lionsgate has revealed an official trailer for an action thriller movie called Armor, another of these junk action movies being dumped out on VOD. Even though it has Stallone! They still can't make them any good anymore no matter how hard they try. A father and son working as security guards for an armored truck company encounter a team of would-be robbers while on a bridge. They become trapped and must come up with a plan to escape and ensure their survival. They discover the value of what they have been carrying and join forces to outgun and outwit their attackers. Why is every last action screenplay so boring \u0026 derivative these days? Armor stars Jason Patric and Sylvester Stallone, along with Dash Mihok, Josh Wiggins, Blake Shields, and Erin Ownbey. This looks intense but it all seems so dull and forgettable, just another \"how do they get out of this?\" thriller. Here's the first official trailer for Justin Routt's action movie Armor, direct from YouTube: Academy Award-nominee Sylvester Stallone and Jason Patric star in an action-packed, thriller about the lengths one man will go to save what’s left of his family and reclaim his own life. James and his son Casey are armored truck drivers tasked with delivering a suspicious package. Following a violent ambush on the road, James \u0026 Casey are trapped until they discover the value of what they have been carrying and join forces to outgun and outwit their attackers. Armor is directed by American producer / filmmaker Justin Routt, director of the films If I Were Dictator and The Test previously. The screenplay is written by Adrian Speckert and Corey Todd Hughes. Produced by Joel Cohen, Randall Emmett, and Gwen Osborne. Lionsgate releases Routt's Armor in select US theaters + on VOD starting November 22nd, 2024 this fall. Anyone? Find more posts: To Watch, Trailer prev next",
  "image": "https://media2.firstshowing.net/firstshowing/img16/ArmorStalloneTrailermainimgTW1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n\t\t\u003ch2 id=\"pagetitle\"\u003e\u003ca href=\"https://www.firstshowing.net/category/trailers/\" title=\"Click for more trailers\"\u003eTRAILERS\u003c/a\u003e\n\t\t\u003c/h2\u003e\n\n\t\t\n\t\t\u003cdiv\u003e\n\n\t\t\t\n\t\t\t\u003cp\u003eby \t\t\u003cbr/\u003eOctober 8, 2024\u003cbr/\u003e\u003cem\u003eSource:\u003c/em\u003e \u003ca href=\"https://www.youtube.com/watch?v=402_wx35uq8\" rel=\"noopener nofollow\" target=\"_blank\"\u003eYouTube\u003c/a\u003e\u003cbr/\u003e\u003c/p\u003e\n\t\t\u003cp\u003e\u003ca href=\"https://www.firstshowing.net/2024/jason-patric-sylvester-stallone-in-new-action-thriller-armor-trailer/\"\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/ArmorStalloneTrailermainimgTsr1.jpg\" alt=\"Armor Trailer\" width=\"350\" height=\"168\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u0026#34;If you  open the doors, we\u0026#39;re dead.\u0026#34; \u0026#34;Be smart – that\u0026#39;s not your money.\u0026#34;\u003c/em\u003e Lionsgate has revealed an official trailer for an action thriller movie called \u003cstrong\u003e\u003cem\u003eArmor\u003c/em\u003e\u003c/strong\u003e, another of these junk action movies being dumped out on VOD. Even though it has Stallone! They still can\u0026#39;t make them any good anymore no matter how hard they try. A father and son working as security guards for an armored truck company encounter a team of would-be robbers while on a bridge. They become trapped and must come up with a plan to escape and ensure their survival. They discover the value of what they have been carrying and join forces to outgun and outwit their attackers. Why is every last action screenplay so boring \u0026amp; derivative these days? \u003cem\u003eArmor\u003c/em\u003e stars \u003cstrong\u003eJason Patric\u003c/strong\u003e and \u003cstrong\u003eSylvester Stallone\u003c/strong\u003e, along with \u003cstrong\u003eDash Mihok\u003c/strong\u003e, \u003cstrong\u003eJosh Wiggins\u003c/strong\u003e, \u003cstrong\u003eBlake Shields\u003c/strong\u003e, and \u003cstrong\u003eErin Ownbey\u003c/strong\u003e. This looks intense but it all seems so dull and forgettable, just another \u0026#34;how do they get out of this?\u0026#34; thriller.\u003cspan id=\"more-713329\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eHere\u0026#39;s the first official trailer for Justin Routt\u0026#39;s action movie \u003cstrong\u003e\u003cem\u003eArmor\u003c/em\u003e\u003c/strong\u003e, direct from \u003ca href=\"https://www.youtube.com/watch?v=402_wx35uq8\" rel=\"noopener\" target=\"_blank\"\u003eYouTube\u003c/a\u003e:\u003c/p\u003e\n\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/ArmorStalloneTrailermainimg591.jpg?width=599\" alt=\"Armor Movie\" width=\"599\" height=\"337\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/ArmorStalloneTrailermainimg592.jpg?width=599\" alt=\"Armor Movie\" width=\"599\" height=\"337\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAcademy Award-nominee Sylvester Stallone and Jason Patric star in an action-packed, thriller about the lengths one man will go to save what’s left of his family and reclaim his own life. James and his son Casey are armored truck drivers tasked with delivering a suspicious package. Following a violent ambush on the road, James \u0026amp; Casey are trapped until they discover the value of what they have been carrying and join forces to outgun and outwit their attackers.\u003c/em\u003e \u003cem\u003eArmor\u003c/em\u003e is directed by American producer / filmmaker \u003ca href=\"https://www.imdb.com/name/nm1639624/\" rel=\"noopener\" target=\"_blank\"\u003e\u003cstrong\u003eJustin Routt\u003c/strong\u003e\u003c/a\u003e, director of the films \u003cem\u003eIf I Were Dictator\u003c/em\u003e and \u003cem\u003eThe Test\u003c/em\u003e previously. The screenplay is written by Adrian Speckert and Corey Todd Hughes. Produced by Joel Cohen, Randall Emmett, and Gwen Osborne. Lionsgate releases Routt\u0026#39;s Armor in select US theaters + on VOD starting \u003ca href=\"https://www.firstshowing.net/schedule2024/#nov\"\u003e\u003cstrong\u003eNovember 22nd, 2024\u003c/strong\u003e\u003c/a\u003e this fall. \u003cem\u003eAnyone?\u003c/em\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eFind more posts:\u003c/strong\u003e \u003ca href=\"https://www.firstshowing.net/category/worthwatching/\" rel=\"category tag\"\u003eTo Watch\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/trailers/\" rel=\"category tag\"\u003eTrailer\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\u003c/div\u003e\n\n\t\n\u003cdiv id=\"rightbar\"\u003e\n\t\t\u003cul id=\"slnav\"\u003e\n\t\t\t\u003cli id=\"prev\"\u003e\u003ca href=\"#\"\u003eprev\u003c/a\u003e\u003c/li\u003e\n\t\t    \u003cli id=\"next\"\u003e\u003ca href=\"#\"\u003enext\u003c/a\u003e\u003c/li\u003e\n\t\t\u003c/ul\u003e\n\t\t\u003cul id=\"slides\"\u003e\n\n\t\t\u003c/ul\u003e\n\t\t\u003c/div\u003e\n      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-08T16:31:50-04:00",
  "modifiedTime": null
}
