{
  "id": "d99c265d-ec87-412d-a78a-069f72eff44d",
  "title": "One Important Transformers Villain Is Based On Star Trek's Spock",
  "link": "https://www.slashfilm.com/1753443/transformers-villain-shockwave-star-trek-spock/",
  "description": "Leonard Nimoy impacted the Transformers property in multiple ways. One of its villains was even based on his beloved Star Trek character, Spock.",
  "author": "Devin Meenan",
  "published": "Sat, 11 Jan 2025 22:45:20 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Cartoon Shows",
    "Science Fiction Shows"
  ],
  "byline": "Devin Meenan",
  "length": 7658,
  "excerpt": "Leonard Nimoy impacted the Transformers property in multiple ways. One of its villains was even based on his beloved Star Trek character, Spock.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slash-film-favicon-448x448.png",
  "text": "Static Media Spock from \"Star Trek\" is easily one of the most influential science-fiction characters ever, flat-out. Even actor Leonard Nimoy never escaped the Vulcan's shadow — despite having a long, fulfilling career outside of it. Indeed, before his passing in 2015, Nimoy voiced villains in two separate \"Transformers\" films. In the 1986 animated \"Transformers\" film, Nimoy played Galvatron, the reborn form of Decepticon leader Megatron, galvanized by the power of the dark god Unicron. Later, in Michael Bay's 2011 live-action film, \"Transformers: Dark of the Moon,\" Nimoy voiced Sentinel Prime, mentor of Autobot leader Optimus Prime (Peter Cullen). Starting a \"Transformers\" tradition, Sentinel turned out to be a villain, allying himself with the Decepticons to conquer Earth and restore the Transformers' war-ruined world of Cybertron. Aside from his two voiceover roles, Nimoy impacted \"Transformers\" in another important way via Spock. Marvel Comics writer Bob Budiansky, who wrote the original \"Transformers\" character bios and much of the proceeding comic, modeled the Decepticon Shockwave after Spock. Spock's defining character trait was his commitment to logic and restraint on his emotions, so Shockwave was written as an evil version of that: cold, brutally efficient, and willing to usurp Megatron if he felt his leadership performance was lacking. Like his leader, Shockwave transformed into a gun, but a sci-fi laser pistol unlike the realistic Walter P-38 handgun that Megatron became. (Both were toys imported from Japan and rebranded by Hasbro; Megatron began as Takara's \"Gun Robo\" and Shockwave as Toyco's \"4 Changeable Astro Magnum.\") Shockwave's toy debuted on the U.S. market in 1985, in year 2 of \"The Transformers,\" but he's often remembered as a year 1 character because he appeared from the beginning in the cartoon. The animated Shockwave was played by the prolific Corey Burton, with a voice modeled on David Warner's performance in \"TRON.\" Shockwave disappeared from the cartoon after season 2 — a deleted scene from the movie had him killed by Unicron, while some unrealized plans for season 3 had him switch sides to the Autobots. But while \"The Transformers\" forgot about Shockwave, few of the later reboots have. He is one of the franchise's most recurring characters, and part of the \"big four\" Decepticons along with Megatron, Starscream, and Soundwave. While Shockwave has a consistent design (purple color scheme, cannon on his left arm, and a square cyclopean head), later \"Transformers\" projects have reinterpreted his Spock-like characterization in logical and illogical ways. Transformers comics made Shockwave into a formidable villain Cartoon Network The Marvel Shockwave, as written by Budiansky and then British \"Transformers\" writer Simon Furman, was a power player. Frankly, he is the comic's main villain more so than Megatron; after the Decepticons are vanquished in issue #4, Shockwave arrives, massacres the Autobots, takes control from Megatron, and puts the good guys on the run. (The cover of \"Transformers\" #5, drawn by Mark Bright, says it all with three simple words under the title.) Marvel Comics/Hasbro The cartoon was a different story. In \"The Transformers,\" Megatron has Shockwave remain on Cybertron as the planet's guardian. (I'd assume that since his alternate mode was clearly not something made on Earth, the writers decide to have him hold off making his way to our world.) The cartoon Shockwave was also a more forgettable lackey who obeyed Megatron without question and did not have his comic self's logical personality. Later versions of Shockwave mix and match features of his different characterizations in the comic and cartoon. In the too-short-lived \"Transformers: Animated,\" he was depicted as a shapeshifter, one in deep cover as an Autobot security chief named Longarm. This Shockwave was Megatron's inside man on Cybertron, a very clever reimagining of his role in \"The Transformers.\" (Corey Burton, already part of the main cast as Megatron and Autobot doctor Ratchet, even came back to voice the \"Animated\" Shockwave.) This Shockwave's design was a bit different, with a more slender, vertical head and both hands instead of a permanent cannon on his left arm, and he didn't have the fixation on logic either. Though an effective villain, \"Animated\" Shockwave was more emotive and sadistic; he enjoyed taunting his prey and the word \"logic\" never escaped his mouth. Shockwave is the Decepticons' very own Spock Hasbro The same cannot be said of the Shockwave in the following reboot, \"Transformers: Prime.\" This Shockwave was voiced by the baritone David Sobolov, who used a deep and cold voice rather than Burton's British-accented one. His characterization was a halfway point between the cartoon and comic; \"Prime\" Shockwave was devoted to Megatron and to logic. Unfortunately, this sometimes manifested as Shockwave saying \"logical\" or \"logically\" a lot, without actually acting as such. \"Prime\" Shockwave was also depicted as a \"mad\" scientist (though only \"mad\" in the ethical sense, for insanity is illogical), furthering the idea of him as \"Decepticon Spock.\" The Shockwave who has hewed closest to the Marvel characterization is the one from IDW Publishing's \"Transformers\" comics. A long-thinking mastermind, IDW Shockwave is only a nominal Decepticon. He has no loyalty to Megatron or the cause, but was forced him to pick a side and the Decepticons are closer to his vision of Cybertronian galactic dominance than the peacenik Autobots are. In \"Spotlight: Shockwave\" (by Furman and artist Nick Roche), Shockwave enacts a program called \"Regenesis.\" He's calculated that the Autobot-Decepticon war will eventually deplete Cybertron's resources, so he seeds other worlds (including prehistoric Earth) with Energon. After centuries and centuries, the fuel will eventually sprout from the planets' crusts, creating sustainable alternative sources of Energon. IDW Publishing When the war has drained both sides' energy reserves millennia later, Shockwave predicts he will be able to harvest that Energon and \"control the balance of power.\" As a functionally-immortal robot, Shockwave can play the long game, and is one of the few Transformers who proves capable of doing so. In the classic \"Star Trek\" episode \"Mirror, Mirror,\" some of the Enterprise crew venture into a universe where humanity leads the brutal Terran Empire instead of the utopian Federation. The Mirror Spock, famously wearing a goatee, turns out to be less evil than the others — sometimes, peace can be logical. Shockwave, though, provides a vision of what a truly unscrupulous Spock would look like: an intelligent, ruthless, and decisive villain who lays schemes within schemes, and who can play the underling if it suits his purposes but will turn traitor the second it becomes logical to do so.",
  "image": "https://www.slashfilm.com/img/gallery/one-important-transformers-villain-is-based-on-star-treks-spock/l-intro-1736184300.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n    \n                \u003cdiv\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1753443/transformers-villain-shockwave-star-trek-spock/\" data-post-title=\"One Important Transformers Villain Is Based On Star Trek\u0026#39;s Spock\" data-slide-num=\"0\" data-post-id=\"1753443\"\u003e\n                                             \u003cpicture id=\"p9c8d8ca0d3ac7ca49d4f0f8f293f25f8\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/one-important-transformers-villain-is-based-on-star-treks-spock/intro-1736184300.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/one-important-transformers-villain-is-based-on-star-treks-spock/intro-1736184300.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/one-important-transformers-villain-is-based-on-star-treks-spock/intro-1736184300.jpg\" data-slide-url=\"https://www.slashfilm.com/1753443/transformers-villain-shockwave-star-trek-spock/\" data-post-id=\"1753443\" data-slide-num=\"0\" data-slide-title=\"One Important Transformers Villain Is Based On Star Trek\u0026#39;s Spock: \" width=\"780\" height=\"438\" alt=\"Spock from Star Trek and Shockwave from Transformers\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eStatic Media\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eSpock from \u0026#34;Star Trek\u0026#34; is easily one of the most influential science-fiction characters ever, flat-out. Even actor Leonard Nimoy never escaped the Vulcan\u0026#39;s shadow — despite having a long, fulfilling career outside of it. Indeed, before his passing in 2015, Nimoy voiced villains in two separate \u0026#34;Transformers\u0026#34; films.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eIn the 1986 animated \u0026#34;Transformers\u0026#34; film, Nimoy played Galvatron, the reborn form of Decepticon leader Megatron, \u003cem\u003egalvanized\u003c/em\u003e by the power of the dark god Unicron. Later, in Michael Bay\u0026#39;s 2011 live-action film, \u0026#34;Transformers: Dark of the Moon,\u0026#34; Nimoy voiced Sentinel Prime, mentor of Autobot leader Optimus Prime (Peter Cullen). \u003ca href=\"https://www.slashfilm.com/1669166/transformers-one-franchise-trend-sentinel-prime/\" target=\"_blank\"\u003eStarting a \u0026#34;Transformers\u0026#34; tradition, Sentinel turned out to be a villain,\u003c/a\u003e allying himself with the Decepticons to conquer Earth and restore the Transformers\u0026#39; war-ruined world of Cybertron.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eAside from his two voiceover roles, Nimoy impacted \u0026#34;Transformers\u0026#34; in \u003cem\u003eanother\u003c/em\u003e important way via Spock. \u003ca href=\"https://www.slashfilm.com/1722318/transformers-creators-marvel-legends-jim-shooter-dennis-oneil/\" target=\"_blank\"\u003eMarvel Comics writer Bob Budiansky, who wrote the original \u0026#34;Transformers\u0026#34; character bios\u003c/a\u003e and much of the proceeding comic, \u003ca href=\"https://web.archive.org/web/20090728191104/http://rustingcarcass.yuku.com/topic/954/t/Bob-Budiansky.html\" target=\"_blank\"\u003emodeled the Decepticon Shockwave after Spock.\u003c/a\u003e Spock\u0026#39;s defining character trait was his commitment to logic and restraint on his emotions, so Shockwave was written as an evil version of that: cold, brutally efficient, and willing to usurp Megatron if he felt his leadership performance was lacking.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eLike his leader, Shockwave transformed into a gun, but \u003ca href=\"https://tfwiki.net/wiki/File:G1Shockwave_toy.jpg\" target=\"_blank\"\u003ea sci-fi laser pistol\u003c/a\u003e unlike the realistic Walter P-38 handgun \u003ca href=\"https://tfwiki.net/wiki/File:G1Megatron_toy.jpg\" target=\"_blank\"\u003ethat Megatron became\u003c/a\u003e. (Both were toys imported from Japan and rebranded by Hasbro; Megatron began as Takara\u0026#39;s \u0026#34;Gun Robo\u0026#34; and Shockwave as Toyco\u0026#39;s \u0026#34;4 Changeable Astro Magnum.\u0026#34;) Shockwave\u0026#39;s toy debuted on the U.S. market in 1985, in year 2 of \u0026#34;The Transformers,\u0026#34; but he\u0026#39;s often remembered as a year 1 character because he appeared from the beginning in the cartoon. The animated Shockwave was played by the prolific Corey Burton, with a voice modeled on David Warner\u0026#39;s performance in \u0026#34;TRON.\u0026#34;\u003c/p\u003e\n\u003cp\u003eShockwave disappeared from the cartoon after season 2 — a deleted scene from the movie had him killed by Unicron, while \u003ca href=\"https://drive.google.com/file/d/1bid3TK_q2HxH7NR5MDAlGsKe5AlcbBnU/view\" target=\"_blank\"\u003esome unrealized plans for season 3 had him switch sides to the Autobots.\u003c/a\u003e But while \u0026#34;The Transformers\u0026#34; forgot about Shockwave, few of the later reboots have. He is one of the franchise\u0026#39;s most recurring characters, and part of the \u0026#34;big four\u0026#34; Decepticons along with Megatron, Starscream, and Soundwave. While Shockwave has a consistent design (purple color scheme, cannon on his left arm, and a square cyclopean head), later \u0026#34;Transformers\u0026#34; projects have reinterpreted his Spock-like characterization in logical and illogical ways.\u003c/p\u003e\n\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eTransformers comics made Shockwave into a formidable villain\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1753443/transformers-villain-shockwave-star-trek-spock/\" data-post-title=\"One Important Transformers Villain Is Based On Star Trek\u0026#39;s Spock\" data-slide-num=\"1\" data-post-id=\"1753443\"\u003e\n                                             \u003cpicture id=\"p41c390ff18d396f11d5560eb66649da5\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/one-important-transformers-villain-is-based-on-star-treks-spock/transformers-comics-made-shockwave-into-a-formidable-villain-1736184301.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/one-important-transformers-villain-is-based-on-star-treks-spock/transformers-comics-made-shockwave-into-a-formidable-villain-1736184301.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/one-important-transformers-villain-is-based-on-star-treks-spock/transformers-comics-made-shockwave-into-a-formidable-villain-1736184301.jpg\" data-slide-url=\"https://www.slashfilm.com/1753443/transformers-villain-shockwave-star-trek-spock/\" data-post-id=\"1753443\" data-slide-num=\"1\" data-slide-title=\"One Important Transformers Villain Is Based On Star Trek\u0026#39;s Spock: Transformers comics made Shockwave into a formidable villain\" width=\"780\" height=\"438\" alt=\"Shockwave pointing his cannon in Transformers: Animated\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eCartoon Network\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eThe Marvel Shockwave, as written by Budiansky and then British \u0026#34;Transformers\u0026#34; writer Simon Furman, was a power player. Frankly, \u003cem\u003ehe\u003c/em\u003e is the comic\u0026#39;s main villain more so than Megatron; after the Decepticons are vanquished in issue #4, Shockwave arrives, massacres the Autobots, takes control from Megatron, and puts the good guys on the run. (The cover of \u0026#34;Transformers\u0026#34; #5, drawn by Mark Bright, says it all with three simple words under the title.)\u003c/p\u003e\n\n\u003cp\u003e\u003cimg alt=\"The Transformers Issue #5 cover Shockwave\" data-lazy-src=\"https://www.slashfilm.com/img/uploads/embed/it-z4ksQ8-1736119322.jpg\" src=\"https://www.slashfilm.com/img/uploads/embed/it-z4ksQ8-1736119322.jpg\"/\u003e\u003cspan\u003eMarvel Comics/Hasbro\u003c/span\u003e\n\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eThe cartoon was a different story. In \u0026#34;The Transformers,\u0026#34; Megatron has Shockwave remain on Cybertron as the planet\u0026#39;s guardian. (I\u0026#39;d assume that since his alternate mode was clearly not something made on Earth, the writers decide to have him hold off making his way to our world.) The cartoon Shockwave was also a more forgettable lackey who obeyed Megatron without question and did not have his comic self\u0026#39;s logical personality.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eLater versions of Shockwave mix and match features of his different characterizations in the comic and cartoon. In \u003ca href=\"https://www.slashfilm.com/1555524/why-cartoon-network-canceled-transformers-animated/\" target=\"_blank\"\u003ethe too-short-lived \u0026#34;Transformers: Animated,\u0026#34;\u003c/a\u003e he was depicted as a shapeshifter, one in deep cover as an Autobot security chief named Longarm. This Shockwave was Megatron\u0026#39;s inside man on Cybertron, a very clever reimagining of his role in \u0026#34;The Transformers.\u0026#34; (Corey Burton, already part of the main cast as Megatron and Autobot doctor Ratchet, even came back to voice the \u0026#34;Animated\u0026#34; Shockwave.)\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eThis Shockwave\u0026#39;s design was a bit different, with a more slender, vertical head and both hands instead of a permanent cannon on his left arm, and he didn\u0026#39;t have the fixation on logic either. Though an effective villain, \u0026#34;Animated\u0026#34; Shockwave was more emotive and sadistic; he enjoyed taunting his prey and the word \u0026#34;logic\u0026#34; never escaped his mouth.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eShockwave is the Decepticons\u0026#39; very own Spock\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1753443/transformers-villain-shockwave-star-trek-spock/\" data-post-title=\"One Important Transformers Villain Is Based On Star Trek\u0026#39;s Spock\" data-slide-num=\"2\" data-post-id=\"1753443\"\u003e\n                                             \u003cpicture id=\"p9db797db230d64084a9e123a42b5367e\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/one-important-transformers-villain-is-based-on-star-treks-spock/shockwave-is-the-decepticons-very-own-spock-1736184301.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/one-important-transformers-villain-is-based-on-star-treks-spock/shockwave-is-the-decepticons-very-own-spock-1736184301.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/one-important-transformers-villain-is-based-on-star-treks-spock/shockwave-is-the-decepticons-very-own-spock-1736184301.jpg\" data-slide-url=\"https://www.slashfilm.com/1753443/transformers-villain-shockwave-star-trek-spock/\" data-post-id=\"1753443\" data-slide-num=\"2\" data-slide-title=\"One Important Transformers Villain Is Based On Star Trek\u0026#39;s Spock: Shockwave is the Decepticons\u0026#39; very own Spock\" width=\"780\" height=\"438\" alt=\"Shockwave in a green Space Bridge vortex in Transformers: Prime\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eHasbro\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eThe same cannot be said of the Shockwave in the following reboot, \u0026#34;Transformers: Prime.\u0026#34; This Shockwave was voiced by the baritone David Sobolov, who used a deep and cold voice rather than Burton\u0026#39;s British-accented one. His characterization was a halfway point between the cartoon and comic; \u0026#34;Prime\u0026#34; Shockwave was devoted to Megatron \u003cem\u003eand\u003c/em\u003e to logic. Unfortunately, this sometimes manifested as Shockwave saying \u0026#34;logical\u0026#34; or \u0026#34;logically\u0026#34; a lot, without actually acting as such. \u0026#34;Prime\u0026#34; Shockwave was also depicted as a \u0026#34;mad\u0026#34; scientist (though only \u0026#34;mad\u0026#34; in the ethical sense, for insanity is illogical), furthering the idea of him as \u0026#34;Decepticon Spock.\u0026#34;\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eThe Shockwave who has hewed closest to the Marvel characterization is the one from IDW Publishing\u0026#39;s \u0026#34;Transformers\u0026#34; comics. A long-thinking mastermind, IDW Shockwave is only a nominal Decepticon. He has no loyalty to Megatron or the cause, but was forced him to pick a side and the Decepticons are closer to his vision of Cybertronian galactic dominance than the peacenik Autobots are.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eIn \u0026#34;Spotlight: Shockwave\u0026#34; (by Furman and artist Nick Roche), Shockwave enacts a program called \u0026#34;Regenesis.\u0026#34; He\u0026#39;s calculated that the Autobot-Decepticon war will eventually deplete Cybertron\u0026#39;s resources, so he seeds other worlds (including prehistoric Earth) with Energon. After centuries and centuries, the fuel will eventually sprout from the planets\u0026#39; crusts, creating sustainable alternative sources of Energon.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg alt=\"Transformers Spotlight: Shockwave Regenesis Energon program on prehistoric Earth\" data-lazy-src=\"https://www.slashfilm.com/img/uploads/embed/it-6JsQmX-1736118381.jpg\" src=\"https://www.slashfilm.com/img/uploads/embed/it-6JsQmX-1736118381.jpg\"/\u003e\u003cspan\u003eIDW Publishing\u003c/span\u003e\n\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eWhen the war has drained both sides\u0026#39; energy reserves millennia later, Shockwave predicts he will be able to harvest that Energon and \u0026#34;control the balance of power.\u0026#34; As a functionally-immortal robot, Shockwave can play the long game, and is one of the few Transformers who proves capable of doing so.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.slashfilm.com/1568897/star-trek-discovery-nodded-to-mirror-mirror-legendary-original-series-episode/\" target=\"_blank\"\u003eIn the classic \u0026#34;Star Trek\u0026#34; episode \u0026#34;Mirror, Mirror,\u0026#34;\u003c/a\u003e some of the Enterprise crew venture into a universe where humanity leads the brutal Terran Empire instead of the utopian Federation. The Mirror Spock, famously wearing a goatee, turns out to be less evil than the others — sometimes, peace can be logical. Shockwave, though, provides a vision of what a truly unscrupulous Spock would look like: an intelligent, ruthless, and decisive villain who lays schemes within schemes, and who can play the underling if it suits his purposes but will turn traitor the second it becomes logical to do so.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-01-11T22:45:20Z",
  "modifiedTime": "2025-01-11T22:45:20Z"
}
