{
  "id": "ddcb5e07-afac-4423-a583-a8720bb530bf",
  "title": "Jason Alexander's Real-Life Wife Had A Cameo In Seinfeld's Most Controversial Episode",
  "link": "https://www.slashfilm.com/1792911/jason-alexander-wife-cameo-seinfeld-controversial-episode-finale/",
  "description": "Jason Alexander's wife appeared on screen with his character, George Costanza, in several shots during one especially memorable episode of Seinfeld.",
  "author": "Danielle Ryan",
  "published": "Tue, 18 Feb 2025 22:00:31 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Comedy Shows"
  ],
  "byline": "Danielle Ryan",
  "length": 3341,
  "excerpt": "Jason Alexander's wife appeared on screen with his character, George Costanza, in several shots during one especially memorable episode of Seinfeld.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slash-film-favicon-448x448.png",
  "text": "NBC One of the nice things about being on a long-running series is that sometimes you get the chance to have friends and family members make cameos. Just look at \"It's Always Sunny in Philadelphia,\" where all of the gang's spouses have had major cameos and some of their children have even gotten in on the fun. On the hit NBC series \"Seinfeld,\" which helped pave the way for \"It's Always Sunny,\" the cast had a chance to get their loved ones involved on more than one occasion. Close friends and family members made appearances throughout the series, but one of the most important for star Jason Alexander, who played the nebbish George Costanza, came in the show's most controversial episode. It turns out that while several of Alexander's loved ones had gotten a chance to appear on the series, his wife, painter Daena Title, didn't have a cameo until the series finale, thought by many to be the worst \"Seinfeld\" episode of all time. While the episode, which sees George and his best friends Jerry (Jerry Seinfeld), Elaine (Julia Louis-Dreyfus), and Kramer (Michael Richards) end up in prison, didn't exactly win over fans, it did at least give Alexander a chance to get his wife some screen time — even if it was only as a member of the very jury that would sentence his character to a year behind bars. Alexander's wife portrayed the juror who sat right behind him in court NBC Though Alexander is bafflingly the only main cast member to not win an Emmy for his time on the show, he did at least get to make some pretty great memories with his co-stars and their families, along with his own. Over the years, Jerry Seinfeld's mother appeared (in a bookstore in season 8), Dreyfus' half-sister Lauren Bowles had a recurring role as a waitress, Alexander's parents appeared in background roles (his mom rode next to him on the subway in the episode \"The Suicide\"), and even his high school drama teacher apparently got a little background appearance, but it took until the series finale for Alexander's wife to get a moment to shine. In an interview with Variety looking back on the finale, Alexander explained that while the end was bittersweet, it was special for him because of the cameo: \"Particularly sweet for me is that my wife was a jury member. So my wife, who was taking the journey with me, got to be on the set on the show for that last episode.\" In fact, she's seated right behind Alexander in the courtroom, so almost every shot of George features Title as well. You know the old adage about how behind every great man is a woman? Well, they got part of it right. Title wasn't the only cameo in the episode, of course, but it is worth noting that according to producer Suzy Mamann-Greenberg, the entire jury was made up of friends and family of the cast and crew. Who better to throw the \"Seinfeld\" gang in prison than the people who helped their real-life counterparts throughout the series?",
  "image": "https://www.slashfilm.com/img/gallery/jason-alexanders-real-life-wife-had-a-cameo-in-seinfelds-most-controversial-episode/l-intro-1739907172.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n    \n                \u003cdiv\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1792911/jason-alexander-wife-cameo-seinfeld-controversial-episode-finale/\" data-post-title=\"Jason Alexander\u0026#39;s Real-Life Wife Had A Cameo In Seinfeld\u0026#39;s Most Controversial Episode\" data-slide-num=\"0\" data-post-id=\"1792911\"\u003e\n                                             \u003cpicture id=\"p84f953b056e5ace7cf9e45a7a621b850\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/jason-alexanders-real-life-wife-had-a-cameo-in-seinfelds-most-controversial-episode/intro-1739907172.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/jason-alexanders-real-life-wife-had-a-cameo-in-seinfelds-most-controversial-episode/intro-1739907172.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/jason-alexanders-real-life-wife-had-a-cameo-in-seinfelds-most-controversial-episode/intro-1739907172.jpg\" data-slide-url=\"https://www.slashfilm.com/1792911/jason-alexander-wife-cameo-seinfeld-controversial-episode-finale/\" data-post-id=\"1792911\" data-slide-num=\"0\" data-slide-title=\"Jason Alexander\u0026#39;s Real-Life Wife Had A Cameo In Seinfeld\u0026#39;s Most Controversial Episode: \" width=\"780\" height=\"438\" alt=\"Jason Alexander as George Costanza on Seinfeld\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eNBC\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eOne of the nice things about being on a long-running series is that sometimes you get the chance to have friends and family members make cameos. Just look at \u0026#34;It\u0026#39;s Always Sunny in Philadelphia,\u0026#34; where \u003ca href=\"https://www.slashfilm.com/1310989/after-16-seasons-all-sunny-gangs-spouses-have-appeared/\" target=\"_blank\"\u003eall of the gang\u0026#39;s spouses\u003c/a\u003e have had major cameos and \u003ca href=\"https://www.slashfilm.com/1380476/missed-cameo-its-always-sunny-in-philadelphia-season-16/\" target=\"_blank\"\u003esome of their children\u003c/a\u003e have even gotten in on the fun. On the hit NBC series \u0026#34;Seinfeld,\u0026#34; which helped pave the way for \u0026#34;It\u0026#39;s Always Sunny,\u0026#34; the cast had a chance to get their loved ones involved on more than one occasion. Close friends and family members made appearances throughout the series, but one of the most important for star Jason Alexander, who played the nebbish George Costanza, came in the show\u0026#39;s most controversial episode.\u003c/p\u003e\n\n\u003cp\u003eIt turns out that while several of Alexander\u0026#39;s loved ones had gotten a chance to appear on the series, his wife, painter Daena Title, didn\u0026#39;t have a cameo until the series finale, thought by many to be \u003ca href=\"https://www.slashfilm.com/1683799/seinfeld-worst-episodes-ranked/\" target=\"_blank\"\u003ethe worst \u0026#34;Seinfeld\u0026#34; episode of all time\u003c/a\u003e. While the episode, which sees George and his best friends Jerry (Jerry Seinfeld), Elaine (Julia Louis-Dreyfus), and Kramer (Michael Richards) end up in prison, didn\u0026#39;t exactly win over fans, it did at least give Alexander a chance to get his wife some screen time — even if it was only as a member of the very jury that would sentence his character to a year behind bars.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eAlexander\u0026#39;s wife portrayed the juror who sat right behind him in court\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1792911/jason-alexander-wife-cameo-seinfeld-controversial-episode-finale/\" data-post-title=\"Jason Alexander\u0026#39;s Real-Life Wife Had A Cameo In Seinfeld\u0026#39;s Most Controversial Episode\" data-slide-num=\"1\" data-post-id=\"1792911\"\u003e\n                                             \u003cpicture id=\"pcfec7fba7ac5ea8030dfd31d2ea3e4e0\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/jason-alexanders-real-life-wife-had-a-cameo-in-seinfelds-most-controversial-episode/alexanders-wife-portrayed-the-juror-who-sat-right-behind-him-in-court-1739907173.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/jason-alexanders-real-life-wife-had-a-cameo-in-seinfelds-most-controversial-episode/alexanders-wife-portrayed-the-juror-who-sat-right-behind-him-in-court-1739907173.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/jason-alexanders-real-life-wife-had-a-cameo-in-seinfelds-most-controversial-episode/alexanders-wife-portrayed-the-juror-who-sat-right-behind-him-in-court-1739907173.jpg\" data-slide-url=\"https://www.slashfilm.com/1792911/jason-alexander-wife-cameo-seinfeld-controversial-episode-finale/\" data-post-id=\"1792911\" data-slide-num=\"1\" data-slide-title=\"Jason Alexander\u0026#39;s Real-Life Wife Had A Cameo In Seinfeld\u0026#39;s Most Controversial Episode: Alexander\u0026#39;s wife portrayed the juror who sat right behind him in court\" width=\"780\" height=\"438\" alt=\"Jason Alexander as George and Michael Richards as Kramer, with Alexander\u0026#39;s wife Daena Title behind him as a juror on Seinfeld\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eNBC\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eThough Alexander is bafflingly \u003ca href=\"https://www.slashfilm.com/1770876/seinfeld-star-without-emmy-win-jason-alexander/\" target=\"_blank\"\u003ethe only main cast member to not win an Emmy\u003c/a\u003e for his time on the show, he did at least get to make some pretty great memories with his co-stars and their families, along with his own. Over the years, Jerry Seinfeld\u0026#39;s mother appeared (in a bookstore in season 8), Dreyfus\u0026#39; half-sister Lauren Bowles had a recurring role as a waitress, Alexander\u0026#39;s parents appeared in background roles (his mom rode next to him on the subway in the episode \u0026#34;The Suicide\u0026#34;), and even his high school drama teacher apparently got a little background appearance, but it took until the series finale for Alexander\u0026#39;s wife to get a moment to shine. In an interview with Variety looking back on the finale, Alexander explained that while the end was bittersweet, it was special for him because of the cameo:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003e\u0026#34;Particularly sweet for me is that my wife was a jury member. So my wife, who was taking the journey with me, got to be on the set on the show for that last episode.\u0026#34;\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp dir=\"ltr\"\u003eIn fact, she\u0026#39;s seated right behind Alexander in the courtroom, so almost every shot of George features Title as well. You know the old adage about how behind every great man is a woman? Well, they got part of it right. Title wasn\u0026#39;t the only cameo in the episode, of course, but it is worth noting that according to producer Suzy Mamann-Greenberg, the entire jury was made up of friends and family of the cast and crew. Who better to throw the \u0026#34;Seinfeld\u0026#34; gang in prison than the people who helped their real-life counterparts throughout the series?\u003c/p\u003e\n\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-02-18T22:00:31Z",
  "modifiedTime": "2025-02-18T22:00:31Z"
}
