{
  "id": "e4d3d6f7-dd48-43f5-ba5a-77fbe3fb2f8b",
  "title": "‘Lonely Planet’ Review: Laura Dern and Liam Hemsworth Rock the Kasbah in Netflix’s Age Gap Romance",
  "link": "https://variety.com/2024/film/reviews/lonely-planet-review-laura-dern-liam-hemsworth-1236174012/",
  "description": "In a year where we’re seeing younger men woo older women in steamy romances like “The Idea of You” and “Babygirl,” it feels genuinely refreshing that writer-director Susannah Grant’s “Lonely Planet” doesn’t seek to capture the problems that arise when an older woman falls for a man almost half her age. Rather, she’s more interested […]",
  "author": "Courtney Howard",
  "published": "Fri, 11 Oct 2024 00:29:32 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "Reviews",
    "Laura Dern",
    "Liam Hemsworth",
    "Lonely Planet",
    "Susannah Grant"
  ],
  "byline": "Courtney Howard",
  "length": 5354,
  "excerpt": "In 'Lonely Planet,' Laura Dern is an author who romances Liam Hemsworth at a writer’s retreat in Morocco.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "In a year where we’re seeing younger men woo older women in steamy romances like “The Idea of You” and “Babygirl,” it feels genuinely refreshing that writer-director Susannah Grant’s “Lonely Planet” doesn’t seek to capture the problems that arise when an older woman falls for a man almost half her age. Rather, she’s more interested in exploring life’s delicate entanglements that caused these individuals to intersect in the first place. While many of the picture’s finer details are in desperate need of ironing out, the wrinkles within these two characters’ lives are compelling enough. World-renowned novelist Katherine (Laura Dern) is stuck in a rut. Recently separated from her cancer-surviving sculptor ex and kicked out of their home, she’s suffering from a serious case of writer’s block while attempting to pen her next bestseller. She’s travelled thousands of miles to Marrakesh to an exclusive international writer’s retreat to recuperate from her frustrations and focus on her editor’s deadlines. But upon her arrival, the trip proves problematic. Her luggage was lost by the airlines, she learns her scuzzy ex-beau Ugo (Adriano Giannini) is also in attendance, and the water pipes in her luxurious room don’t work. She can’t seem to catch a break. That is, until she does. Enter thirty-something Owen (Liam Hemsworth). He thinks he’s got life figured out, managing a high-stakes job in private equity and playing dutiful boyfriend to invited author Lily (Diana Silvers), an overnight sensation who’s stressed by the mounting pressures of writing her follow-up books. However, fate throws Owen and Katherine together on excursions into the nearby Moroccan marketplaces while the other retreat invitees work and sightsee. The pair form a flirty friendship discussing meaningful topics like travel, careers and the human condition. But at the same time, the façade of Owen and Lily’s seemingly perfect relationship crumbles as their daily conversations rapidly escalate into arguments. It becomes increasingly clear that Owen and Katherine’s paths are meant to collide in a torrid love affair. Popular on Variety Grant has a keen ear for subtext and nuance when it comes to her lead characters, particularly dealing with the thornier aspects leading to Owen and Katherine’s inevitable hot hook-up. She mines the subtleties within the younger couple’s squabbles and strife, signaling that their relationship is more in ruins than the actual ruins they visit during a day trip. Nobody is the stereotypical Bad Guy in Owen and Lily’s split per se, although her arrogance, snide hypocrisy and careless emotional infidelity with fellow writer Rafih (­­­Younès Boucif) is on display far more frequently than his workaholic distractions. Silvers cautiously steers away from undertones in the dialogue that make Lily sound foolish instead of sensible, especially when delivering some of the material’s heartrending notes. The way the characters are drawn is the story’s most appealing trait: Unlike other films of this ilk, Katherine’s not outwardly sexually frustrated, nor is she a victim of her current circumstances. She also isn’t making advances towards Owen, despite small sparks flying whenever they’re together. This couple and their relationship feel real and complex – they’re both going through life mistaking their survival mode for happiness, but when the opportunity for true love arises, they learn through self-acceptance that they can be better versions of themselves together. Dern and Hemsworth are in fine form portraying all of this, adding a vibrant playfulness to the cheesier genre-mandated tropes (like their meet-cute and 3rd act conflict). In her follow-up feature to 2006’s “Catch and Release,” Grant makes a few rookie mistakes. There are minor infractions right from the start, like the pervasive use of distractingly poor visual effects and day-for-night sequences. Considering that Katherine’s catalyst to abandon her room and work out of a storage closet is the lack of functioning plumbing, we wonder at how she often sports recently-washed hair without the use of a shower. It strains credulity that she’d look as daisy-fresh solely from her nightly swim in the pool. Supporting characters outside of the main trio are barely one-dimensional, and their lip-service inclusion fails to add electricity to the proceedings. Ugo and the irascible elderly Nobel Prize-winning Ada (Shosha Goren) are briefly given camera time (the latter of whom features in one of the film’s fleeting funny jokes), but they too suffer from a staggering lack of development. Grant keeps the film’s tone more in line with “Under The Tuscan Sun” versus Netflix’s usual hijinks-laden romantic fare. Still, the narrative’s overarching sentiment that sometimes folks have to get lost in order to find themselves feels akin to a generic platitude emblazoned on home decor instead of a resounding epiphany. There’s a hollowness the aesthetics appear to be masking, from the travelogue-lite shots of the lavish estate and its beautiful desert surroundings, to the warm smiles on locals’ faces as they feed and clothe weary explorers. Though the characters pop and their situations are intriguing, it feels like the algorithm creeped in to make the whole more bland than the ingredients.",
  "image": "https://variety.com/wp-content/uploads/2024/10/LP_20230127_AMF_12031_R3.jpg?crop=0px%2C51px%2C2000px%2C1125px\u0026resize=1000%2C563",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tIn a year where we’re seeing younger men woo older women in steamy romances like “The Idea of You” and “Babygirl,” it feels genuinely refreshing that writer-director \u003ca href=\"https://variety.com/t/susannah-grant/\" id=\"auto-tag_susannah-grant\" data-tag=\"susannah-grant\"\u003eSusannah Grant\u003c/a\u003e’s “\u003ca href=\"https://variety.com/t/lonely-planet/\" id=\"auto-tag_lonely-planet\" data-tag=\"lonely-planet\"\u003eLonely Planet\u003c/a\u003e” doesn’t seek to capture the problems that arise when an older woman falls for a man almost half her age. Rather, she’s more interested in exploring life’s delicate entanglements that caused these individuals to intersect in the first place. While many of the picture’s finer details are in desperate need of ironing out, the wrinkles within these two characters’ lives are compelling enough.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWorld-renowned novelist Katherine (\u003ca href=\"https://variety.com/t/laura-dern/\" id=\"auto-tag_laura-dern\" data-tag=\"laura-dern\"\u003eLaura Dern\u003c/a\u003e) is stuck in a rut. Recently separated from her cancer-surviving sculptor ex and kicked out of their home, she’s suffering from a serious case of writer’s block while attempting to pen her next bestseller. She’s travelled thousands of miles to Marrakesh to an exclusive international writer’s retreat to recuperate from her frustrations and focus on her editor’s deadlines. But upon her arrival, the trip proves problematic. Her luggage was lost by the airlines, she learns her scuzzy ex-beau Ugo (Adriano Giannini) is also in attendance, and the water pipes in her luxurious room don’t work. She can’t seem to catch a break. That is, until she does.\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tEnter thirty-something Owen (\u003ca href=\"https://variety.com/t/liam-hemsworth/\" id=\"auto-tag_liam-hemsworth\" data-tag=\"liam-hemsworth\"\u003eLiam Hemsworth\u003c/a\u003e). He thinks he’s got life figured out, managing a high-stakes job in private equity and playing dutiful boyfriend to invited author Lily (Diana Silvers), an overnight sensation who’s stressed by the mounting pressures of writing her follow-up books. However, fate throws Owen and Katherine together on excursions into the nearby Moroccan marketplaces while the other retreat invitees work and sightsee. The pair form a flirty friendship discussing meaningful topics like travel, careers and the human condition. But at the same time, the façade of Owen and Lily’s seemingly perfect relationship crumbles as their daily conversations rapidly escalate into arguments. It becomes increasingly clear that Owen and Katherine’s paths are meant to collide in a torrid love affair.\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tGrant has a keen ear for subtext and nuance when it comes to her lead characters, particularly dealing with the thornier aspects leading to Owen and Katherine’s inevitable hot hook-up. She mines the subtleties within the younger couple’s squabbles and strife, signaling that their relationship is more in ruins than the actual ruins they visit during a day trip. Nobody is the stereotypical Bad Guy in Owen and Lily’s split per se, although her arrogance, snide hypocrisy and careless emotional infidelity with fellow writer Rafih (­­­Younès Boucif) is on display far more frequently than his workaholic distractions. Silvers cautiously steers away from undertones in the dialogue that make Lily sound foolish instead of sensible, especially when delivering some of the material’s heartrending notes.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tThe way the characters are drawn is the story’s most appealing trait: Unlike other films of this ilk, Katherine’s not outwardly sexually frustrated, nor is she a victim of her current circumstances. She also isn’t making advances towards Owen, despite small sparks flying whenever they’re together. This couple and their relationship feel real and complex – they’re both going through life mistaking their survival mode for happiness, but when the opportunity for true love arises, they learn through self-acceptance that they can be better versions of themselves together. Dern and Hemsworth are in fine form portraying all of this, adding a vibrant playfulness to the cheesier genre-mandated tropes (like their meet-cute and 3\u003csup\u003erd\u003c/sup\u003e act conflict).\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn her follow-up feature to 2006’s “Catch and Release,” Grant makes a few rookie mistakes. There are minor infractions right from the start, like the pervasive use of distractingly poor visual effects and day-for-night sequences. Considering that Katherine’s catalyst to abandon her room and work out of a storage closet is the lack of functioning plumbing, we wonder at how she often sports recently-washed hair without the use of a shower. It strains credulity that she’d look as daisy-fresh solely from her nightly swim in the pool. Supporting characters outside of the main trio are barely one-dimensional, and their lip-service inclusion fails to add electricity to the proceedings. Ugo and the irascible elderly Nobel Prize-winning Ada (Shosha Goren) are briefly given camera time (the latter of whom features in one of the film’s fleeting funny jokes), but they too suffer from a staggering lack of development.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tGrant keeps the film’s tone more in line with “Under The Tuscan Sun” versus Netflix’s usual hijinks-laden romantic fare. Still, the narrative’s overarching sentiment that sometimes folks have to get lost in order to find themselves feels akin to a generic platitude emblazoned on home decor instead of a resounding epiphany. There’s a hollowness the aesthetics appear to be masking, from the travelogue-lite shots of the lavish estate and its beautiful desert surroundings, to the warm smiles on locals’ faces as they feed and clothe weary explorers. Though the characters pop and their situations are intriguing, it feels like the algorithm creeped in to make the whole more bland than the ingredients.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-10-11T00:29:32Z",
  "modifiedTime": "2024-10-11T00:29:46Z"
}
