{
  "id": "ed2cd16f-60de-4936-8ba3-c2a78933150c",
  "title": "Marielle Heller’s ‘Nightbitch’ Formula: Amy Adams, the ‘Most Beautiful Dog in the World,’ Weird Al, and Men Actually Apologizing",
  "link": "https://www.indiewire.com/features/interviews/marielle-heller-nightbitch-amy-adams-beautiful-dog-weird-al-interview-1235044967/",
  "description": "The filmmaker adapted and directed Rachel Yoder's novel of domestic discord into her own beast. She walks IndieWire through making a film that's about much more than a woman turning into a canine.",
  "author": "Kate Erbland",
  "published": "Thu, 26 Dec 2024 20:30:00 +0000",
  "source": "https://www.indiewire.com/feed",
  "categories": [
    "Features",
    "Interviews | Celebrity Interviews \u0026 Insider Takes",
    "Consider This",
    "Film",
    "Interviews",
    "Marielle Heller",
    "nightbitch",
    "TIFF"
  ],
  "byline": "Kate Erbland",
  "length": 15216,
  "excerpt": "Interview: The filmmaker adapted \u0026 directed Rachel Yoder's novel of domestic discord into her own beast. She walks IndieWire through making the film.",
  "siteName": "IndieWire",
  "favicon": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=192",
  "text": "[Editor’s note: This interview was originally published on September 9, 2024 at the Toronto International Film Festival. The film will be available on Hulu on Friday, December 27.] Who hasn’t wanted to turn into a snarling, free-wheeling beast when the pressures of domestic life — hell, of life in general — get too much? Women have transformed into beasts throughout mythological history (like Hecuba, who was turned into a dog as both a respite and a curse, or the Irish tale of Uirne, part of the Fenian Cycle), but that wasn’t always a matter of choice. In Rachel Yoder’s bestselling 2021 novel, “Nightbitch,” that line is a bit fuzzier. Does our heroine become a dog because she wants to or because she has to? That’s just one of the questions at the heart of filmmaker Marielle Heller’s latest film, which adapts Yoder’s story to the big screen. Like her breakout hit “The Diary of a Teenage Girl,” her fact-based grifter tale “Can You Ever Forgive Me?,” and her deep-feeling Mr. Rogers-centric feature “A Beautiful Day in the Neighborhood,” Heller’s latest explores the different facets of being a very real person in a very tough world. Sometimes that includes turning into a dog. The film premiered on the opening weekend of this year’s Toronto International Film Festival before its December theatrical release, complete with the inevitable Oscar buzz around star Amy Adams who, yes, transforms into a dog, but also brings to life the heart and humor Heller injects into the tail (apologies, the tale). Ahead, Heller walks IndieWire through the genesis of her “Nightbitch” affection, the story alterations that made the film hers, casting her stars (Amy Adams and the “most beautiful dog in the world” as her canine alter-ego), and the unexpected power of Weird Al songs, and yes, men actually apologizing. The following interview has been edited and condensed. IndieWire: When did you first read Rachel’s novel? It feels like it must have come to you at the right time. Marielle Heller: It did come to me at the right time. I think I was six months postpartum on my daughter, my second kid, my husband [Jorma Taccone] was making the “MacGruber” TV show, so he left for Albuquerque, and I was alone with two kids for the first time. We moved up into the country during the pandemic, so I was really isolated. I was living really alone, and I had no help. I mean, I had my parents come and help me for a month, but it was months of being on my own, and it was really isolated. It was just a very lonesome time. I would do this thing, where my daughter would wake up at 5:00 AM, and then she’d go down for her first nap at 8:00 AM, and that was right around when my older child was waking up. So I’d put him in front of the TV, and I’d know I’d have a two-hour window to write, and that’s basically how I wrote the script. On the set of ‘Nightbitch’Anne Marie Fox Swerve: I’m sure you’ve seen everyone is loving the use of the Weird Al song “Dare to Be Stupid” during a very fun scene in the film.  OK, so let me tell you about the Weird Al thing. So, two things, my son, at the time I was writing the script, was seven or something, and was obsessed with Weird Al, and so all we would listen to was Weird Al at all times. He was really into the “Transformers” movie from 1987 because my husband, it was his childhood movie, he got my son into it, and that Weird Al song is from the soundtrack.   I would always be blasting it on the radio when I pulled into a school parking lot, and I always felt like, “I don’t give a fuck if all you parents think I’m weird. We’re listening to Weird Al, and I’m singing along, and we’re blasting it.” It was all an ode to my son. And truly, because I had had my own experience of loudly singing Weird Al and realizing it was the moment where I no longer gave a fuck about anything in life and how anyone saw me, I was like, “Right, this has to go in there.” Weird Al texted my husband last night because they are friends. Of course they are. He was like, “My Twitter’s blowing up. I guess ‘Nightbitch’ has premiered.” I assume it was a very easy ask to ask Al? It really was. Jorma just called him to ask, and thank God he just was like, “Sure.” There’s this great moment in the film in which Amy’s character is going to the city to have dinner with friends, and Scoot McNairy’s husband character is like, “I’m babysitting tonight!” That got such a wonderful, audible grown in the audience at the premiere. I mean, my friends who we all have, for the most part, pretty evolved, feminist husbands, still fucking say things like that. It’s not babysitting when it’s your own kid, and yet people constantly say that. The film ends on a different note than the book, one I venture to say it much more positive and shows us a real path forward for this family. When did that become something that you wanted to do?  To me, having a baby is the ultimate act of optimism and choosing hope. And in the book, she doesn’t have a second child. I obviously had just had a second child, and after years of going through this like, “Oh, my God, what have I done?” I somehow still decided to do it again. As I was reading the book and also writing the script, I thought that that the central question was, “Did I make a huge mistake by becoming a mother?”  So how do you answer that question, but by having another, right? It needed to end with birth. Early on, when I started writing the script, I realized the final images needed to be a woman in labor, in her power, having taken everything she learned from becoming Nightbitch to put it into this powerful moment. I think it’s a little odd, truthfully, that people are reframing it that I made it a happier ending than the book, because in the book, they never break up, and they don’t actually say all the hard things. I think I tried to make it go darker. ‘Nightbitch’Searchlight Pictures But that, to me, is happier, that they say the hard things. Yes, they say the hard things that I wanted them to say in the book, that I was like, “Please say this out loud. Please tell him off. Fucking tell him off.” She never fully told him off. And in a movie, you need to take the stakes as far as possible, right? So I was like, “They’ve got to break up.” They have to go to this darker place, and then in order to feel like they earned coming back together, I was like, “I want him to learn.” I also have a thing where I like men to apologize in movies. I like men to cry. I like them to cry too. But everyone always tries to get me to stop having men actually say the words, “I’m sorry.” There’s always notes, and I feel like it’s always going to come out like, “Oh, we didn’t need to hear that.” People don’t want to hear men say, “I’m sorry.” And they especially don’t want to hear men say it in a genuine way, where they’re actually taking accountability for what they’ve done.  It was really important to me that we saw a man take accountability and truly shift and change because I’m married to a changing man. I’m married to a man who’s willing to evolve, and look at himself and shift and change. I think we need to show that on film. I think we need to show men who might fuck up, and might not be their best selves, and may not be the best partners at times, but who are willing to admit it when they fucked up.  I don’t think that’s just a happy ending. I think that’s long-term marriage. My own marriage couldn’t survive if my husband wasn’t willing to do that, and I think most people who are in long-term committed relationships, whether you’re with a man or a woman, you change and grow over the course of being with somebody a lifetime that you spend together. I’ve been with my husband 25 years. We’re different people. The film is very much about the pains and pleasures of motherhood, but I think even women who don’t have children feel it very keenly. It’s really about the expectations of being a woman, even today, automatically, you are the caretaker, especially in mixed gender relationships. I’ve had that same experience with my partner where it’s like, “You know where the cat food is, you do not have to ask me again.” It’s this weird thing where we might feel like we’re in really evolved relationships, and then some gender roles just pop their head back in, and you don’t even intend for them to, and it’s mostly because you haven’t talked it through. When Jorma read the scene where Scoot’s character doesn’t know how to make coffee and is like, “How many scoops is it?,” Jorma was like, “OK, fuck you. I know how to make coffee.” And I was like, “Because you always ask me how many scoops to do, and you always ask me where’s the filters, and where’s the this?”  There’s been so many articles that were written after the pandemic about the emotional labor, the invisible labor that goes into managing a home and that women take on traditionally. I know plenty of people for whom the man takes that on, but there’s usually one partner who takes more on. Another change you make from the book: we really don’t see Amy’s character as the dog, as the titular Nightbitch, nearly as often. What went into that decision? And can we also talk about when we do see her as the dog, and she’s pretty much the most beautiful dog you’ve ever seen in your life?  She’s a gorgeous, powerful animal! Obviously, as books go, they can last for much longer, a film is a much more condensed story. There’s huge plots that were great to read in the book that couldn’t be in the story. There’s a whole pyramid scheme of sorts, and there’s all these other parts of the book that didn’t fit into this story.  But I feel like it’s different when you see a physical dog. As soon as I started writing it, I realized, when you’re actually in the world, physically with her, with her son, in their house, if she leaves and becomes a dog when she’s alone with the son, you’re going to judge her as a mother. And I was like, “I don’t want this to be about that,” I had to always know that the son was safe in the moments when she left, in order to avoid idiots basically being like, “Oh, she’s a terrible mother.” And that’s not the point, and when you’ve read the book, you don’t think about that. It’s not something that enters your mind. She’s able to kind of go back and forth, but also, there’s a repetitive nature to her motherhood, and I didn’t want to then get into a repetitive nature of being the dog.  So, the actual dog, the most beautiful dog in the world, Juno is her name. The trainers adopted her. We went through a big casting process to find, not only Amy’s dog, but the three dogs who represent the three other mothers too. I really wanted her to be this strong, powerful dog, but you start going down the path of talking to dog trainers about which dogs are trainable and can work in this kind of way, and which can’t, and I knew I wanted a Husky-like dog with red, and they were like, there are no Huskies working, in any training, in all of the U.S. Those are not dogs that are as trainable. They don’t tend to be set dogs.  They started searching shelters for red Huskies, and they came across Juno and called me that day, and they were like, “I think we found her. I think we found her.” She was at a shelter in California, I believe. And then they spent five months training her, and then the trainers fell in love with her, and adopted her, and kept her, and she’s the most gorgeous dog you’ve ever seen. She was also young and sort of naughty in a perfect way, but she was incredible. What’s the day like when you lock Amy Adams for this role? The thing about Amy that’s so interesting or incredible is when you talk to her, you just don’t feel like she’s a movie star. She just feels so down to earth, just real. She just makes you feel at ease immediately. And we talked about motherhood immediately. We talked about our kids, and it was just such a mom-to-mom conversation. And then you see her on set, doing her thing, and you’re like, “Oh, my God. She’s Amy Adams.” She’s incredible. She holds all this power within her, but it’s easy to forget because you just talk to her, and she’s so down to earth. In the movie, the first time she attends a Book Babies meeting, when she’s like, “I’m not just going to be friends with moms because they’re other moms,” I wondered if sometimes do you feel that when it comes to being a “female filmmaker”? I do see parallels between lots of the comments I make about being a mother and being a female filmmaker, but it’s less about that and more the feeling of being a little invisible. There’s something about this movie where I feel like I’m trying to make a certain labor visible, and I can’t help but see the parallels within my artistic work, where I want to make the labor of female filmmakers visible as well. Amy Adams and Marielle Heller attend the premiere of ‘Nightbitch’ during the 2024 Toronto International Film Festival at Princess of Wales Theatre on September 07, 2024Getty That bias against other mothers, I had when I started out being a mother, I’m embarrassed to admit. In some way, I always cast myself as an outcast, or not cool, or someone no one wants to talk to whenever I go into a group setting. It’s so weird to even feel like you could have imposter syndrome as a mom, but I had imposter syndrome as a mom, even though I was a mom. Not imposing. In Brooklyn, it was this library story hour in the basement of our library, and all the moms seemed to know each other, and all the moms seemed to have a schedule, and all the moms seemed to be really happy and friends, and they seemed cool, and I didn’t know them, and I didn’t know how to integrate, and so it’s kind of easier to be like, “I don’t want to be friends with other moms just because we had babies in the same six months.”  It was a big evolution for me to recognize that I needed other mothers and that I needed other mothers because I need a pack. I need people to go to for advice. I need people to talk about my kids’ poop with. I need people to send pictures of a rash and be like, “What do you think this is?” I need people to be like, “Oh, my God, I feel the exact same way you feel. This is so hard.” There is something that you are able to do, where you make a film that can be seen as more obviously “female,” a female-centric story, female stars, and yet men really respond to it, too. Do you know you do that? Are you trying to do that? I think I spent my life growing up relating to male characters, and I don’t see why female characters can’t be related to by everybody. I don’t think that gender is such a binary or that’s something we need to be dividing. I think I have parts of myself that are very inherently male and very female, but I also just do love men. I love people. I’m married to a man. I have a wonderful dad who’s here. I made a little man. I care about the genders understanding each other more than I care about tearing us apart. “Nightbitch” premiered at the 2024 Toronto International Film Festival. It is now in theaters, thanks to Searchlight Pictures.",
  "image": "https://www.indiewire.com/wp-content/uploads/2024/09/GettyImages-2170752883.jpg?w=650",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-alias=\"gutenberg-content__content\"\u003e\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"149\" height=\"152\" src=\"https://www.indiewire.com/wp-content/uploads/2023/11/image-5.png?w=149\" alt=\"\" srcset=\"https://www.indiewire.com/wp-content/uploads/2023/11/image-5.png 149w, https://www.indiewire.com/wp-content/uploads/2023/11/image-5.png?resize=98,100 98w, https://www.indiewire.com/wp-content/uploads/2023/11/image-5.png?resize=93,95 93w, https://www.indiewire.com/wp-content/uploads/2023/11/image-5.png?resize=39,40 39w, https://www.indiewire.com/wp-content/uploads/2023/11/image-5.png?resize=147,150 147w, https://www.indiewire.com/wp-content/uploads/2023/11/image-5.png?resize=110,112 110w\" sizes=\"(max-width: 149px) 100vw, 149px\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e[Editor’s note: This interview was originally published on September 9, 2024 at the Toronto International \u003ca href=\"https://www.indiewire.com/t/film/\" id=\"auto-tag_film\" data-tag=\"film\"\u003eFilm\u003c/a\u003e Festival. The film will be available on Hulu on Friday, December 27.]\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eWho \u003cem\u003ehasn’t \u003c/em\u003ewanted to turn into a snarling, free-wheeling beast when the pressures of domestic life — hell, of life in general — get too much? Women have transformed into beasts throughout mythological history (\u003ca rel=\"nofollow\" href=\"https://en.wikipedia.org/wiki/Hecuba\" target=\"_blank\"\u003elike Hecuba\u003c/a\u003e, who was turned into a dog as both a respite and a curse, \u003ca rel=\"nofollow\" href=\"https://en.wikipedia.org/wiki/Bran_and_Sce%C3%B3lang#:~:text=The%20hounds\u0026#39;%20mother%2C%20Uirne%2C,the%20duration%20of%20their%20mythos.\" target=\"_blank\"\u003eor the Irish tale of Uirne\u003c/a\u003e, part of the Fenian Cycle), but that wasn’t always a matter of choice. In Rachel Yoder’s bestselling 2021 novel, “\u003ca href=\"https://www.indiewire.com/t/nightbitch/\" id=\"auto-tag_nightbitch\" data-tag=\"nightbitch\"\u003eNightbitch\u003c/a\u003e,” that line is a bit fuzzier. Does our heroine become a dog because she \u003cem\u003ewants\u003c/em\u003e to or because she \u003cem\u003ehas\u003c/em\u003e to?\n\n\u003c/p\u003e\u003cdiv data-alias=\"cards__inner\" data-component=\"cards-related-content\" data-collapse-to-xs=\"false\" data-layout=\"inline\" data-size=\"md\" data-spacing=\"s-3\" data-cards-spacing=\"s0\"\u003e \u003cdiv data-alias=\"card__inner\" data-post-id=\"1235079892\" data-component=\"card\" data-has-background=\"false\" data-has-overlay=\"false\" data-layout-size=\"xs\" data-layout=\"sidebar\" data-main-alignment=\"s0\" data-main-spacing=\"s0\" data-media-position=\"\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"sixteenByNine\" data-round=\"false\"\u003e\u003ca href=\"https://www.indiewire.com/features/craft/wicked-score-defying-gravity-interview-1235079892/\" title=\"\" target=\"_self\" rel=\"\" data-card-index=\"0\" data-post-id=\"1235079892\"\u003e\u003cp\u003e\u003cimg src=\"https://www.indiewire.com/wp-content/uploads/2024/12/MCDWICK_UV042.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\" alt=\"WICKED, Cynthia Erivo, 2024.  ph: Giles Keyte /© Universal Pictures / Courtesy Everett Collection\" height=\"168\" width=\"300\" srcset=\"https://www.indiewire.com/wp-content/uploads/2024/12/MCDWICK_UV042.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=600%2C337 600w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDWICK_UV042.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=125%2C70 125w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDWICK_UV042.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=660%2C370 660w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDWICK_UV042.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=300%2C168 300w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDWICK_UV042.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=1200%2C675 1200w\" sizes=\"(max-width: 300px) 100vw, 300px\" loading=\"lazy\" decoding=\"async\" fetchpriority=\"auto\" data-attachment-id=\"1235079893\" data-wp-size=\"nova_size__sixteenbynine_small_cropped\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e  \u003cdiv data-alias=\"card__inner\" data-post-id=\"1235080475\" data-component=\"card\" data-has-background=\"false\" data-has-overlay=\"false\" data-layout-size=\"xs\" data-layout=\"sidebar\" data-main-alignment=\"s0\" data-main-spacing=\"s0\" data-media-position=\"\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"sixteenByNine\" data-round=\"false\"\u003e\u003ca href=\"https://www.indiewire.com/features/commentary/dirty-harry-clint-eastwood-fascism-pauline-kael-1235080475/\" title=\"\" target=\"_self\" rel=\"\" data-card-index=\"1\" data-post-id=\"1235080475\"\u003e\u003cp\u003e\u003cimg src=\"https://www.indiewire.com/wp-content/uploads/2024/12/MCDDIHA_EC004.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\" alt=\"DIRTY HARRY, Clint Eastwood, 1971\" height=\"168\" width=\"300\" srcset=\"https://www.indiewire.com/wp-content/uploads/2024/12/MCDDIHA_EC004.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=600%2C337 600w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDDIHA_EC004.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=125%2C70 125w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDDIHA_EC004.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=660%2C370 660w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDDIHA_EC004.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=300%2C168 300w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDDIHA_EC004.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=1200%2C675 1200w\" sizes=\"(max-width: 300px) 100vw, 300px\" loading=\"lazy\" decoding=\"async\" fetchpriority=\"auto\" data-attachment-id=\"1235080478\" data-wp-size=\"nova_size__sixteenbynine_small_cropped\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e \u003c/div\u003e\n\n\n\n\u003cp\u003eThat’s just one of the questions at the heart of \u003ca href=\"https://www.indiewire.com/criticism/movies/nightbitch-review-amy-adams-1235045179/\"\u003efilmmaker Marielle Heller’s latest film\u003c/a\u003e, which adapts Yoder’s \u003ca href=\"https://www.indiewire.com/news/trailers/nightbitch-trailer-amy-adams-1234971311/\"\u003estory to the big screen\u003c/a\u003e. Like her breakout hit “The Diary of a Teenage Girl,” her fact-based grifter tale “Can You Ever Forgive Me?,” and her deep-feeling Mr. Rogers-centric feature “A Beautiful Day in the Neighborhood,” Heller’s latest explores the different facets of being a very real person \u003ca href=\"https://www.indiewire.com/news/general-news/marielle-heller-nightbitch-motherhood-rage-1235028175/\"\u003ein a very tough world\u003c/a\u003e. Sometimes that includes turning into a dog. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe film premiered on the opening weekend of this year’s Toronto International Film Festival before its December theatrical release, complete with the \u003ca href=\"https://www.indiewire.com/news/general-news/amy-adams-oscar-nominations-not-something-i-think-about-1235045151/\"\u003einevitable Oscar buzz around star Amy Adams\u003c/a\u003e who, yes, transforms into a dog, but also brings to life the heart and humor Heller injects into the tail (\u003cem\u003eapologies\u003c/em\u003e, the tale).\u003c/p\u003e\n\n\n\n\u003cp\u003eAhead, Heller walks IndieWire through the genesis of her “Nightbitch” affection, the story alterations that made the film hers, casting her stars (Amy Adams and the “most beautiful dog in the world” as her canine alter-ego), and the unexpected power of Weird Al songs, and yes, men actually apologizing. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eThe following interview has been edited and condensed.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eIndieWire: When did you first read Rachel’s novel? It feels like it must have come to you at the right time.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.indiewire.com/t/marielle-heller/\" id=\"auto-tag_marielle-heller\" data-tag=\"marielle-heller\"\u003eMarielle Heller\u003c/a\u003e: \u003c/strong\u003eIt did come to me at the right time. I think I was six months postpartum on my daughter, my second kid, my husband [Jorma Taccone] was making the “MacGruber” TV show, so he left for Albuquerque, and I was alone with two kids for the first time. We moved up into the country during the pandemic, so I was really isolated. I was living really alone, and I had no help. I mean, I had my parents come and help me for a month, but it was months of being on my own, and it was really isolated. It was just a very lonesome time.\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eI would do this thing, where my daughter would wake up at 5:00 AM, and then she’d go down for her first nap at 8:00 AM, and that was right around when my older child was waking up. So I’d put him in front of the TV, and I’d know I’d have a two-hour window to write, and that’s basically how I wrote the script.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"6192\" height=\"4128\" src=\"https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?w=650\" alt=\"NIGHTBITCH_09292022_AMF_00235.dng\" srcset=\"https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg 6192w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=300,200 300w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=1024,683 1024w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=1536,1024 1536w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=2048,1365 2048w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=150,100 150w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=600,400 600w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=281,187 281w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=1000,667 1000w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=244,163 244w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=1160,773 1160w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=900,600 900w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=143,95 143w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=60,40 60w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=1200,800 1200w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=252,168 252w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=506,337 506w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=1013,675 1013w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=225,150 225w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=450,300 450w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=110,73 110w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=285,190 285w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=320,213 320w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=640,427 640w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=800,533 800w, https://www.indiewire.com/wp-content/uploads/2024/09/Nightbitch-Brandon-Trost-Cinematographer.jpg?resize=1280,853 1280w\" sizes=\"(max-width: 6192px) 100vw, 6192px\"/\u003e\u003cfigcaption\u003eOn the set of ‘Nightbitch’\u003ccite\u003eAnne Marie Fox\u003c/cite\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eSwerve: I’m sure you’ve \u003ca rel=\"nofollow\" href=\"https://x.com/mikeryan/status/1832621624639586600\" target=\"_blank\"\u003eseen everyone is loving the use of the Weird Al song\u003c/a\u003e “Dare to Be Stupid” during a very fun scene in the film. \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eOK, so let me tell you about the Weird Al thing. So, two things, my son, at the time I was writing the script, was seven or something, and was obsessed with Weird Al, and so all we would listen to was Weird Al at all times. He was really into the “Transformers” movie from 1987 because my husband, it was his childhood movie, he got my son into it, and that Weird Al song is from the soundtrack.  \u003c/p\u003e\n\n\n\n\u003cp\u003eI would always be blasting it on the radio when I pulled into a school parking lot, and I always felt like, “I don’t give a fuck if all you parents think I’m weird. We’re listening to Weird Al, and I’m singing along, and we’re blasting it.” It was all an ode to my son. And truly, because I had had my own experience of loudly singing Weird Al and realizing it was the moment where I no longer gave a fuck about anything in life and how anyone saw me, I was like, “Right, this has to go in there.”\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eWeird Al texted my husband last night because they are friends.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eOf course they are.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eHe was like, “My Twitter’s blowing up. I guess ‘Nightbitch’ has premiered.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eI assume it was a very easy ask to ask Al?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eIt really was. Jorma just called him to ask, and thank God he just was like, “Sure.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eThere’s this great moment in the film in which Amy’s character is going to the city to have dinner with friends, and Scoot McNairy’s husband character is like, “I’m babysitting tonight!”\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThat got such a wonderful, audible grown in the audience at the premiere. I mean, my friends who we all have, for the most part, pretty evolved, feminist husbands, still fucking say things like that. It’s not babysitting when it’s your own kid, and yet people constantly say that.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eThe film ends on a different note than the book, one I venture to say it much more positive and shows us a real path forward for this family. When did that become something that you wanted to do? \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eTo me, having a baby is the ultimate act of optimism and choosing hope. And in the book, she doesn’t have a second child. I obviously had just had a second child, and after years of going through this like, “Oh, my God, what have I done?” I somehow still decided to do it again. As I was reading the book and also writing the script, I thought that that the central question was, “Did I make a huge mistake by becoming a mother?” \n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eSo how do you answer that question, but by having another, right? It needed to end with birth. Early on, when I started writing the script, I realized the final images needed to be a woman in labor, in her power, having taken everything she learned from becoming Nightbitch to put it into this powerful moment.\u003c/p\u003e\n\n\n\n\u003cp\u003eI think it’s a little odd, truthfully, that people are reframing it that I made it a \u003cem\u003ehappier\u003c/em\u003e ending than the book, because in the book, they never break up, and they don’t actually say all the hard things. I think I tried to make it go darker.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1286\" height=\"712\" src=\"https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?w=650\" alt=\"\u0026#39;Nightbitch\u0026#39;\" srcset=\"https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png 1286w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?resize=300,166 300w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?resize=1024,567 1024w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?resize=181,100 181w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?resize=125,70 125w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?resize=600,332 600w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?resize=1000,554 1000w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?resize=244,135 244w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?resize=1160,642 1160w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?resize=172,95 172w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?resize=72,40 72w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?resize=1200,664 1200w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?resize=271,150 271w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?resize=542,300 542w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?resize=1084,600 1084w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?resize=150,83 150w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?resize=110,61 110w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?resize=285,158 285w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?resize=320,177 320w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?resize=640,354 640w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?resize=800,443 800w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-9.53.46-AM.png?resize=1280,709 1280w\" sizes=\"(max-width: 1286px) 100vw, 1286px\"/\u003e\u003cfigcaption\u003e‘Nightbitch’\u003ccite\u003eSearchlight Pictures\u003c/cite\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eBut that, to me, is happier, that they say the hard things.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eYes, they say the hard things that I wanted them to say in the book, that I was like, “Please say this out loud. Please tell him off. Fucking tell him off.” She never fully told him off. And in a movie, you need to take the stakes as far as possible, right? So I was like, “They’ve got to break up.” They have to go to this darker place, and then in order to feel like they earned coming back together, I was like, “I want him to learn.” I also have a thing where I like men to apologize in movies.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eI like men to cry.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eI like them to cry too. But everyone always tries to get me to stop having men actually say the words, “I’m sorry.” There’s always notes, and I feel like it’s always going to come out like, “Oh, we didn’t need to hear that.” People don’t want to hear men say, “I’m sorry.” And they especially don’t want to hear men say it in a genuine way, where they’re actually taking accountability for what they’ve done. \n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eIt was really important to me that we saw a man take accountability and truly shift and change because I’m married to a changing man. I’m married to a man who’s willing to evolve, and look at himself and shift and change. I think we need to show that on film. I think we need to show men who might fuck up, and might not be their best selves, and may not be the best partners at times, but who are willing to admit it when they fucked up. \u003c/p\u003e\n\n\n\n\u003cp\u003eI don’t think that’s just a happy ending. I think that’s long-term marriage. My own marriage couldn’t survive if my husband wasn’t willing to do that, and I think most people who are in long-term committed relationships, whether you’re with a man or a woman, you change and grow over the course of being with somebody a lifetime that you spend together. I’ve been with my husband 25 years. We’re different people.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eThe film is very much about the pains and pleasures of motherhood, but I think even women who don’t have children feel it very keenly. It’s really about the expectations of being a woman, even today, automatically, you are the caretaker, especially in mixed gender relationships. I’ve had that same experience with my partner where it’s like, “You know where the cat food is, you do not have to ask me again.”\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s this weird thing where we might feel like we’re in really evolved relationships, and then some gender roles just pop their head back in, and you don’t even intend for them to, and it’s mostly because you haven’t talked it through.\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eWhen Jorma read the scene where Scoot’s character doesn’t know how to make coffee and is like, “How many scoops is it?,” Jorma was like, “OK, fuck you. I know how to make coffee.” And I was like, “Because you \u003cem\u003ealways\u003c/em\u003e ask me how many scoops to do, and you always ask me where’s the filters, and where’s the this?” \u003c/p\u003e\n\n\n\n\u003cp\u003eThere’s been so many articles that were written after the pandemic about the emotional labor, the invisible labor that goes into managing a home and that women take on traditionally. I know plenty of people for whom the man takes that on, but there’s usually one partner who takes more on.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"NIGHTBITCH | Official Trailer | Searchlight Pictures\" width=\"650\" height=\"366\" src=\"https://www.youtube.com/embed/918prRymA-U?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eAnother change you make from the book: we really don’t see Amy’s character as the dog, as the titular Nightbitch, nearly as often. What went into that decision? And can we also talk about when we \u003cem\u003edo \u003c/em\u003esee her as the dog, and she’s pretty much the most beautiful dog you’ve ever seen in your life? \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eShe’s a gorgeous, powerful animal! Obviously, as books go, they can last for much longer, a film is a much more condensed story. There’s huge plots that were great to read in the book that couldn’t be in the story. There’s a whole pyramid scheme of sorts, and there’s all these other parts of the book that didn’t fit into this story. \n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eBut I feel like it’s different when you see a physical dog. As soon as I started writing it, I realized, when you’re actually in the world, physically with her, with her son, in their house, if she leaves and becomes a dog when she’s alone with the son, you’re going to judge her as a mother. And I was like, “I don’t want this to be about that,” I had to always know that the son was safe in the moments when she left, in order to avoid idiots basically being like, “Oh, she’s a terrible mother.” And that’s not the point, and when you’ve read the book, you don’t think about that. It’s not something that enters your mind. She’s able to kind of go back and forth, but also, there’s a repetitive nature to her motherhood, and I didn’t want to then get into a repetitive nature of being the dog. \u003c/p\u003e\n\n\n\n\u003cp\u003eSo, the actual dog, the most beautiful dog in the world, Juno is her name. The trainers adopted her. We went through a big casting process to find, not only Amy’s dog, but the three dogs who represent the three other mothers too. I really wanted her to be this strong, powerful dog, but you start going down the path of talking to dog trainers about which dogs are trainable and can work in this kind of way, and which can’t, and I knew I wanted a Husky-like dog with red, and they were like, there are no Huskies working, in any training, in all of the U.S. Those are not dogs that are as trainable. They don’t tend to be set dogs. \n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eThey started searching shelters for red Huskies, and they came across Juno and called me that day, and they were like, “I think we found her. I think we found her.” She was at a shelter in California, I believe. And then they spent five months training her, and then the trainers fell in love with her, and adopted her, and kept her, and she’s the most gorgeous dog you’ve ever seen. She was also young and sort of naughty in a perfect way, but she was incredible.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWhat’s the day like when you lock Amy Adams for this role?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe thing about Amy that’s so interesting or incredible is when you talk to her, you just don’t feel like she’s a movie star. She just feels so down to earth, just real. She just makes you feel at ease immediately. And we talked about motherhood immediately. We talked about our kids, and it was just such a mom-to-mom conversation.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd then you see her on set, doing her thing, and you’re like, “Oh, my God. She’s Amy Adams.” She’s incredible. She holds all this power within her, but it’s easy to forget because you just talk to her, and she’s so down to earth.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eIn the movie, the first time she attends a Book Babies meeting, when she’s like, “I’m not just going to be friends with moms because they’re other moms,” I wondered if sometimes do you feel that when it comes to being a “female filmmaker”?\u003c/strong\u003e\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eI do see parallels between lots of the comments I make about being a mother and being a female filmmaker, but it’s less about that and more the feeling of being a little invisible. There’s something about this movie where I feel like I’m trying to make a certain labor visible, and I can’t help but see the parallels within my artistic work, where I want to make the labor of female filmmakers visible as well.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1958\" height=\"1032\" src=\"https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png?w=650\" alt=\"TORONTO, ONTARIO - SEPTEMBER 07: (L-R) Amy Adams and Marielle Heller attend the premiere of \u0026#39;Nightbitch\u0026#39; during the 2024 Toronto International Film Festival at Princess of Wales Theatre on September 07, 2024 in Toronto, Ontario.  (Photo by Leon Bennett/Getty Images)\" srcset=\"https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png 1958w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png?resize=300,158 300w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png?resize=1024,540 1024w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png?resize=1536,810 1536w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png?resize=190,100 190w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png?resize=600,316 600w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png?resize=1000,527 1000w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png?resize=244,129 244w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png?resize=1160,611 1160w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png?resize=180,95 180w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png?resize=76,40 76w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png?resize=1200,632 1200w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png?resize=285,150 285w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png?resize=569,300 569w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png?resize=1138,600 1138w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png?resize=150,79 150w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png?resize=110,58 110w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png?resize=320,169 320w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png?resize=640,337 640w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png?resize=800,422 800w, https://www.indiewire.com/wp-content/uploads/2024/09/Screen-Shot-2024-09-08-at-10.44.42-AM.png?resize=1280,675 1280w\" sizes=\"(max-width: 1958px) 100vw, 1958px\"/\u003e\u003cfigcaption\u003eAmy Adams and Marielle Heller attend the premiere of ‘Nightbitch’ during the 2024 Toronto International Film Festival at Princess of Wales Theatre on September 07, 2024\u003ccite\u003eGetty\u003c/cite\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThat bias against other mothers, I had when I started out being a mother, I’m embarrassed to admit. In some way, I always cast myself as an outcast, or not cool, or someone no one wants to talk to whenever I go into a group setting. It’s so weird to even feel like you could have imposter syndrome as a mom, but I had imposter syndrome as a mom, even though I was a mom. Not imposing.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn Brooklyn, it was this library story hour in the basement of our library, and all the moms seemed to know each other, and all the moms seemed to have a schedule, and all the moms seemed to be really happy and friends, and they seemed cool, and I didn’t know them, and I didn’t know how to integrate, and so it’s kind of easier to be like, “I don’t want to be friends with other moms just because we had babies in the same six months.” \n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eIt was a big evolution for me to recognize that I needed other mothers and that I needed other mothers because I need a pack. I need people to go to for advice. I need people to talk about my kids’ poop with. I need people to send pictures of a rash and be like, “What do you think this is?” I need people to be like, “Oh, my God, I feel the exact same way you feel. This is so hard.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eThere is something that you are able to do, where you make a film that can be seen as more obviously “female,” a female-centric story, female stars, and yet men really respond to it, too. Do you know you do that? Are you trying to do that?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eI think I spent my life growing up relating to male characters, and I don’t see why female characters can’t be related to by \u003cem\u003eeverybody\u003c/em\u003e. I don’t think that gender is such a binary or that’s something we need to be dividing. I think I have parts of myself that are very inherently male and very female, but I also just do love men. I love people. I’m married to a man. I have a wonderful dad who’s here. I \u003cem\u003emade\u003c/em\u003e a little man. I care about the genders understanding each other more than I care about tearing us apart.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e“Nightbitch” premiered at the 2024 Toronto International Film Festival. It is now in theaters, thanks to Searchlight Pictures.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "16 min read",
  "publishedTime": "2024-12-26T20:30:00Z",
  "modifiedTime": "2024-12-19T17:42:39Z"
}
