{
  "id": "f5d8cd1b-27dc-4e13-a0e5-bb2123d7dcf2",
  "title": "‘Novocaine’ Amped Up the Romance and Limited Jack Quaid’s Head Wounds So It Was Funny, Not Grim: ‘We Didn’t Want His Face to Be Mashed Potatoes’",
  "link": "https://variety.com/2025/film/news/novocaine-directors-jack-quaid-action-movie-sequel-1236333525/",
  "description": "Dan Berk and Robert Olsen grew up obsessed with the golden era of ’80s action movies, worshipping box office hits like “Midnight Run,” “Lethal Weapon” and “Die Hard.” When they came across the script for a high-concept film named “Novocaine” — in which a mild-mannered man named Nate can’t feel pain and has to save […]",
  "author": "William Earl",
  "published": "Fri, 14 Mar 2025 23:00:00 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Jack Quaid",
    "Novocaine"
  ],
  "byline": "William Earl",
  "length": 4723,
  "excerpt": "\"Novocaine\" directors Dan Berk and Robert Olsen discuss finding humor in the Jack Quaid action film and their hopes for a sequel.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "Dan Berk and Robert Olsen grew up obsessed with the golden era of ’80s action movies, worshipping box office hits like “Midnight Run,” “Lethal Weapon” and “Die Hard.” When they came across the script for a high-concept film named “Novocaine” — in which a mild-mannered man named Nate can’t feel pain and has to save his love interest from violent bank robbers — they loved the idea. But they were eager to add the humor and pathos that elevated their favorites. “There was something about those films where they’re very funny, yet they don’t lose their stakes,” Olsen says. “They’re not such a comedy that they don’t care about the characters. They have protagonists you get to know.” Luckily, Berk and Olsen, who had previously written and directed films such as the 2019 horror comedy “Villains” and the 2022 sci-fi trip “Significant Other,” were able to take a pass at the script and add a levity that would welcome audiences in. The result is their version of “Novocaine,” which opens in theaters Friday via Paramount Pictures. Popular on Variety “It was a necessity to have that blend because there’s so much gore and grisly violence in it that if you didn’t also allow the audience to laugh, it might become gratuitous,” Olsen says. “It might become torture, it might become too much. We always say if he could feel pain and was crying out for his mother like Giovanni Ribisi in ‘Saving Private Ryan’ every time he was getting injured, you wouldn’t want to watch it. The fact that he can’t feel it, and the fact that a lot of those beats of violence are accompanied by or immediately followed by some kind of joke lets you, the audience member, laugh.” The film’s tricky tone of gory violence and comedy rests on Nate’s shoulders, and early on the duo visualized Jack Quaid as the perfect lead. From watching his performance on the murderous superhero series “The Boys,” Berk and Olsen saw an energy in his everyman comedic performances that inspired them to dub him his generation’s Tom Hanks. Yet to perfect this role took an unconventional skill set. “Jack had to rewire his brain so that he could get punched and not flinch,” Olsen says. “Your whole life as an actor, you’re told to sell the hit, and when you get punched, you flinch, you wince, you sell the pain. He had to work with our stunt coordinator, Stanimir Stamatov, to untrain himself from that.” Despite Nate’s ability to not feel pain, Berk and Olsen were meticulous in working to make sure the internal logic of the film stayed grounded, no matter how heightened the situations became. “He’s not a superhero, and we were going to take liberties with how far the human body can be pushed,” Berk says. “Every action movie does, but we wanted to stay within a semi-believable realm within the rule system of our movie. So what we did with our stunt team was we went through and audited every single hit in the movie, and we transferred a lot of those head hits down into body hits. We didn’t want his face to be mashed potatoes by the midpoint of the movie.” Another element that kept the action from becoming too grim was the love story at the heart of the narrative, as Nate is taking all of these blows to save his love interest Sherry (Amber Midthunder). “We think a lot of people will be pleasantly surprised with how we want you to walk away from this movie feeling better about humanity than you did walking in,” Berk says. “We want it to stick with you a little. It’s not just about the shocks and blood and all that, because there are certainly lower-brow versions of our movies, and we really try to avoid making those.” “Our movies are designed to be fun and have a positive vibe under them,” Olsen adds. “A lot of them are exploring love and friendship and things like that. Even our darker stuff usually has some exploration of that.” Ultimately, Berk and Olsen were able to thread the needle on the ambitious “Novocaine,” and if audiences embrace the film, they’d love to dive deeper into the world for a sequel — which serves as a testament to the wholesome joy they felt on the set of their ultraviolent film. “It was a blast, so we would absolutely come back and revisit this world,” Olsen says. “This was the most incredible film set we’ve ever been on, and that’s all because our actors are such incredible people and a film set can be the most fun place in the world. It can be adult summer camp where you’re all hugging and crying at the end and you made all these new friends.” Director Robert Olson, left, Jack Quaid and director Dan Berk on the set of “Novocaine.” Marcos Cruz / PARAMOUNT PICTURES",
  "image": "https://variety.com/wp-content/uploads/2025/03/NOVO_03240RC.jpg?crop=0px%2C0px%2C5128px%2C2885px\u0026resize=1000%2C563",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tDan Berk and Robert Olsen grew up obsessed with the golden era of ’80s action movies, worshipping box office hits like “Midnight Run,” “Lethal Weapon” and “Die Hard.” When they came across the script for a high-concept film named “\u003ca href=\"https://variety.com/t/novocaine/\" id=\"auto-tag_novocaine\" data-tag=\"novocaine\"\u003eNovocaine\u003c/a\u003e” — in which a mild-mannered man named Nate can’t feel pain and has to save his love interest from violent bank robbers — they loved the idea. But they were eager to add the humor and pathos that elevated their favorites.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“There was something about those films where they’re very funny, yet they don’t lose their stakes,” Olsen says. “They’re not such a comedy that they don’t care about the characters. They have protagonists you get to know.”\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tLuckily, Berk and Olsen, who had previously written and directed films such as the 2019 horror comedy “Villains” and the 2022 sci-fi trip “Significant Other,” were able to take a pass at the script and add a levity that would welcome audiences in. The result is their version of “Novocaine,” which opens in theaters Friday via Paramount Pictures.\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\t“It was a necessity to have that blend because there’s so much gore and grisly violence in it that if you didn’t also allow the audience to laugh, it might become gratuitous,” Olsen says. “It might become torture, it might become too much. We always say if he could feel pain and was crying out for his mother like \u003ca rel=\"nofollow\" href=\"https://www.youtube.com/watch?v=XOUJPBziUQw\" target=\"_blank\"\u003eGiovanni Ribisi in ‘Saving Private Ryan’\u003c/a\u003e every time he was getting injured, you wouldn’t want to watch it. The fact that he can’t feel it, and the fact that a lot of those beats of violence are accompanied by or immediately followed by some kind of joke lets you, the audience member, laugh.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe film’s tricky tone of gory violence and comedy rests on Nate’s shoulders, and early on the duo visualized \u003ca href=\"https://variety.com/t/jack-quaid/\" id=\"auto-tag_jack-quaid\" data-tag=\"jack-quaid\"\u003eJack Quaid\u003c/a\u003e as the perfect lead. From watching his performance on the murderous superhero series “The Boys,” Berk and Olsen saw an energy in his everyman comedic performances that inspired them to dub him his generation’s Tom Hanks. Yet to perfect this role took an unconventional skill set.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Jack had to rewire his brain so that he could get punched and not flinch,” Olsen says. “Your whole life as an actor, you’re told to sell the hit, and when you get punched, you flinch, you wince, you sell the pain. He had to work with our stunt coordinator, Stanimir Stamatov, to untrain himself from that.”\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tDespite Nate’s ability to not feel pain, Berk and Olsen were meticulous in working to make sure the internal logic of the film stayed grounded, no matter how heightened the situations became.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“He’s not a superhero, and we were going to take liberties with how far the human body can be pushed,” Berk says. “Every action movie does, but we wanted to stay within a semi-believable realm within the rule system of our movie. So what we did with our stunt team was we went through and audited every single hit in the movie, and we transferred a lot of those head hits down into body hits. We didn’t want his face to be mashed potatoes by the midpoint of the movie.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAnother element that kept the action from becoming too grim was the love story at the heart of the narrative, as Nate is taking all of these blows to save his love interest Sherry (Amber Midthunder).\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“We think a lot of people will be pleasantly surprised with how we want you to walk away from this movie feeling better about humanity than you did walking in,” Berk says. “We want it to stick with you a little. It’s not just about the shocks and blood and all that, because there are certainly lower-brow versions of our movies, and we really try to avoid making those.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Our movies are designed to be fun and have a positive vibe under them,” Olsen adds. “A lot of them are exploring love and friendship and things like that. Even our darker stuff usually has some exploration of that.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tUltimately, Berk and Olsen were able to thread the needle on the ambitious “Novocaine,” and if audiences embrace the film, they’d love to dive deeper into the world for a sequel — which serves as a testament to the wholesome joy they felt on the set of their ultraviolent film.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“It was a blast, so we would absolutely come back and revisit this world,” Olsen says. “This was the most incredible film set we’ve ever been on, and that’s all because our actors are such incredible people and a film set can be the most fun place in the world. It can be adult summer camp where you’re all hugging and crying at the end and you made all these new friends.”\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\t\n\u003cfigure\u003e\n\n\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg?w=1024\" data-lazy-src=\"https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg?w=1024\" alt=\"\" data-lazy-srcset=\"https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg 8192w, https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg?resize=150,100 150w, https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg?resize=300,200 300w, https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg?resize=1920,1280 1920w, https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg?resize=1360,907 1360w, https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg?resize=1000,667 1000w, https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg?resize=910,607 910w, https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg?resize=681,454 681w, https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg?resize=450,300 450w, https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg?resize=250,167 250w\" data-lazy-sizes=\"(min-width: 87.5rem) 1000px, (min-width: 78.75rem) 681px, (min-width: 48rem) 450px, (max-width: 48rem) 250px\" height=\"683\" width=\"1024\" srcset=\"https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg 8192w, https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg?resize=150,100 150w, https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg?resize=300,200 300w, https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg?resize=1920,1280 1920w, https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg?resize=1360,907 1360w, https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg?resize=1000,667 1000w, https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg?resize=910,607 910w, https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg?resize=681,454 681w, https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg?resize=450,300 450w, https://variety.com/wp-content/uploads/2025/03/NOVO_02450R.jpg?resize=250,167 250w\"/\u003e\n\t\n\t\n\t\u003c/p\u003e\n\t\n\t\t\t\n\t\t\t\u003cfigcaption\u003e\n\t\n\t\t\t\t\t\u003cspan\u003eDirector Robert Olson, left, Jack Quaid and director Dan Berk on the set of “Novocaine.”\u003c/span\u003e\n\t\t\t\t\t\t\t\u003ccite\u003eMarcos Cruz / PARAMOUNT PICTURES\u003c/cite\u003e\n\t\t\n\t\u003c/figcaption\u003e\n\n\t\t\t\n\u003c/figure\u003e\n\n\u003c/div\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-03-14T23:00:00Z",
  "modifiedTime": "2025-03-11T23:29:16Z"
}
