{
  "id": "f6db9e48-9c42-4a1b-9b26-beef13831058",
  "title": "Sgt. Rock: Daniel Craig Drops Out of DCU Movie, Replacement Possibly Revealed",
  "link": "https://www.comingsoon.net/movies/news/1924901-sgt-rock-daniel-craig-drops-out-dcu-replacement",
  "description": "Daniel Craig and Queer director Luca Guadagnino will no longer reunite for the DC Universe movie Sgt. Rock. According to THR, Craig has dropped out of the film. The former James Bond actor recently starred in Guadagnino’s Queer, which was released by A24. Despite having some early awards buzz, Craig failed to find much traction. According to the […] The post Sgt. Rock: Daniel Craig Drops Out of DCU Movie, Replacement Possibly Revealed appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
  "author": "Tyler Treese",
  "published": "Thu, 20 Feb 2025 00:52:27 +0000",
  "source": "https://www.comingsoon.net/feed",
  "categories": [
    "Movies",
    "Daniel Craig",
    "Jeremy Allen White",
    "Luca Guadagnino",
    "Movie News",
    "Sgt. Rock"
  ],
  "byline": "Tyler Treese",
  "length": 1527,
  "excerpt": "Daniel Craig and Queer director Luca Guadagnino will no longer reunite for the DC Universe movie Sgt. Rock.",
  "siteName": "ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More",
  "favicon": "https://www.comingsoon.net/wp-content/uploads/sites/3/2022/12/cs_ico_144x144.png?w=144",
  "text": "Daniel Craig and Queer director Luca Guadagnino will no longer reunite for the DC Universe movie Sgt. Rock. According to THR, Craig has dropped out of the film. The former James Bond actor recently starred in Guadagnino’s Queer, which was released by A24. Despite having some early awards buzz, Craig failed to find much traction. According to the outlet, Craig is said to have soured on the role due to Queer’s lack of critical and commercial success, plus scheduling issues with his wife — Rachel Weisz. What is the current status of Sgt. Rock? Back in November 2024, it was reported that while there was no official deal signed between DC Studios and the actor, he was likely to star. It was also looking to be Guadagnino’s next movie. It’s still planning to go ahead, though, as filming is going to occur this summer. The Bear star Jeremy Allen White is named as a possible replacement, although nothing is official. The script for the Sgt. Rock movie is written by Justin Kuritzkes, who also wrote Challengers and Queer. No other casting or plot information is available at this time. Created by Robert Kanigher and Joe Kubert, Sgt. Rock first appeared in DC Comics’ Our Army at War #83, which was published in 1959. The character is a World War II soldier who is known for his combat skills, near-perfect accuracy, calm demeanor, and more. Evil Dead actor Bruce Campbell recently wrote a Sgt. Rock limited series, Sgt. Rock vs. the Army of the Dead, for DC that launched in September 2022. (Source: THR)",
  "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2024/09/daniel-craig-queer.png?resize=1200,630",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003e\u003ca href=\"https://www.comingsoon.net/tag/daniel-craig\"\u003eDaniel Craig\u003c/a\u003e and Queer director \u003ca href=\"https://www.comingsoon.net/tag/luca-Guadagnino\"\u003eLuca Guadagnino\u003c/a\u003e will no longer reunite for the DC Universe movie \u003ca href=\"https://www.comingsoon.net/tag/sgt-rock\"\u003eSgt. Rock\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eAccording to THR, Craig has dropped out of the film. The former James Bond actor recently starred in Guadagnino’s Queer, which was released by A24. Despite having some early awards buzz, Craig failed to find much traction. According to the outlet, Craig is said to have soured on the role due to Queer’s lack of critical and commercial success, plus scheduling issues with his wife — Rachel Weisz.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-what-is-the-current-status-of-sgt-rock\"\u003eWhat is the current status of Sgt. Rock?\u003c/h2\u003e\n\n\n\n\u003cp\u003eBack in November 2024, it \u003ca href=\"https://www.comingsoon.net/movies/news/1881536-daniel-craig-luca-guadagnino-sgt-rock\"\u003ewas reported\u003c/a\u003e that while there was no official deal signed between DC Studios and the actor, he was likely to star. It was also looking to be Guadagnino’s next movie. It’s still planning to go ahead, though, as filming is going to occur this summer. The Bear star Jeremy Allen White is named as a possible replacement, although nothing is official.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe script for the Sgt. Rock movie is written by Justin Kuritzkes, who also wrote Challengers and Queer. No other casting or plot information is available at this time.\u003c/p\u003e\n\n\n\n\u003cp\u003eCreated by Robert Kanigher and Joe Kubert, Sgt. Rock first appeared in DC Comics’ Our Army at War #83, which was published in 1959. The character is a World War II soldier who is known for his combat skills, near-perfect accuracy, calm demeanor, and more. Evil Dead actor Bruce Campbell recently wrote a Sgt. Rock limited series, Sgt. Rock vs. the Army of the Dead, for DC that launched in September 2022.\u003c/p\u003e\n\n\n\n\u003cp\u003e(Source: \u003ca href=\"https://www.hollywoodreporter.com/movies/movie-news/daniel-craig-drops-out-of-dc-studios-sgt-rock-1236141449/#recipient_hashed=3a3baf33fde74a0cf9fc3af244dd666d88a51fe84dd964875093b5a98d5764b6\u0026amp;recipient_salt=920d8b92feb07303a242938a23f9992cf27f3e5e076fcc9aa292a484a5828153\u0026amp;utm_medium=email\u0026amp;utm_source=exacttarget\u0026amp;utm_campaign=Breaking%20News\u0026amp;utm_content=588321_02-19-2025\u0026amp;utm_term=10030496\"\u003eTHR\u003c/a\u003e)\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-02-20T00:52:27Z",
  "modifiedTime": "2025-02-20T00:57:17Z"
}
