[
  {
    "id": "a674aa81-fce6-4b28-bd9a-057a3c5452ab",
    "title": "Episode 228: Free Time",
    "link": "https://play.prx.org/listen?ge=prx_3_5025d76d-8d2b-412e-9645-83d51a3fa334\u0026uf=http%3A%2F%2Ffeeds.thememorypalace.us%2Fthememorypalace",
    "description": "Order The Memory Palace book now, dear listener. On Bookshop.org, on Amazon.com, on Barnes \u0026 Noble, or directly from Random House. Or order the audiobook at places like Libro.fm.The Memory Palace is a proud member of Radiotopia from PRX. Radiotopia is a collective of independently owned and operated podcasts that’s a part of PRX, a not-for-profit public media company. If you’d like to directly support this show, you can make a donation at Radiotopia.fm/donate. I have recently launched a newsletter. You can subscribe to it at thememorypalacepodcast.substack.com. Music Two from Lambert: Fremd and The Open Plantasia from Mort Garson's amazing, ridiculous album of the same name. Two from Danny Bensi and Saunder Jurriaans' score to Christine: Paranoia and Newsroom.  Learn about your ad choices: dovetail.prx.org/ad-choices",
    "author": "Nate DiMeo",
    "published": "Thu, 20 Mar 2025 16:00:00 -0000",
    "image": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/_/3/5025d76d-8d2b-412e-9645-83d51a3fa334/thememorypalace.mp3",
    "source": "http://feeds.thememorypalace.us/thememorypalace",
    "categories": null
  },
  {
    "id": "3565321c-0357-468d-9f67-443629ebbbe5",
    "title": "Episode 227: A Brief Note Written After Learning the National Parks Service Removed the word Transgender from Stonewall's Webpage",
    "link": "https://play.prx.org/listen?ge=prx_3_1db56639-8f12-41b3-a227-effe0c324c36\u0026uf=http%3A%2F%2Ffeeds.thememorypalace.us%2Fthememorypalace",
    "description": "Order The Memory Palace book now, dear listener. On Bookshop.org, on Amazon.com, on Barnes \u0026 Noble, or directly from Random House. Or order the audiobook at places like Libro.fm.The Memory Palace is a proud member of Radiotopia from PRX. Radiotopia is a collective of independently owned and operated podcasts that’s a part of PRX, a not-for-profit public media company. If you’d like to directly support this show, you can make a donation at Radiotopia.fm/donate. I have recently launched a newsletter. You can subscribe to it at thememorypalacepodcast.substack.com. Music Pockets of Light by Ludomyr Melnyk All in Circles and Janvie by Shida Shahabi Between Trees by Akria Kosemura NotesThere are a million things to read about Stonewall, but the thing that I feel like deepened my understanding enough was The New York Public Library's The Stonewall Reader. Particularly the audiobook. Couldn't recommend it enough. Learn about your ad choices: dovetail.prx.org/ad-choices",
    "author": "Nate DiMeo",
    "published": "Tue, 11 Mar 2025 20:40:44 -0000",
    "image": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/_/3/1db56639-8f12-41b3-a227-effe0c324c36/thememorypalace.mp3",
    "source": "http://feeds.thememorypalace.us/thememorypalace",
    "categories": null
  },
  {
    "id": "988fa473-3a90-46e7-9a25-d658f85a216a",
    "title": "Show 72 - Mania for Subjugation II",
    "link": "http://www.dancarlin.com/product/hardcore-history-72-mania-for-subjugation-ii",
    "description": "Is it safe to hand control of the deadliest army in the world to a 20-year old? If you are Thracian, Triballian, Illyrian or Theban, the answer is definitely no. Alexander becomes king and fights off threats to his rule in all directions.",
    "author": "",
    "published": "Thu, 02 Jan 2025 22:16:05 PST",
    "image": "https://dts.podtrac.com/redirect.mp3/traffic.libsyn.com/dancarlinhh/dchha72_Mania_for_Subjugation_II.mp3",
    "source": "https://feeds.feedburner.com/dancarlin/history?format=xml",
    "categories": [
      "Alexander",
      " Alexander the Great",
      " Macedonian",
      " Demosthenes",
      " Greek",
      " Thebes",
      " Athens",
      " Persia",
      " Thrace",
      " Illyria",
      " Delphi",
      " ancient warfare",
      " history",
      " Sparta",
      " military",
      " ancient",
      " conqueror"
    ]
  },
  {
    "id": "a496c993-6aaf-4565-b987-b8a90c487a4b",
    "title": "Show 71 - Mania for Subjugation",
    "link": "http://www.dancarlin.com/product/hardcore-history-71-mania-for-subjugation",
    "description": "What's the recipe for making a historically world-class apex predator? In the case of Alexander the Great, it might be the three Ns: Nature, Nurture, and Nepotism.",
    "author": "",
    "published": "Fri, 07 Jun 2024 12:14:53 PST",
    "image": "https://dts.podtrac.com/redirect.mp3/traffic.libsyn.com/dancarlinhh/dchha71_Mania_for_Subjugation.mp3",
    "source": "https://feeds.feedburner.com/dancarlin/history?format=xml",
    "categories": [
      "Alexander the Great",
      " Phillip II",
      " Macedonia",
      " Macedon",
      " Olympias",
      " Demosthenes",
      " Athens",
      " Sparta",
      " Thebes",
      " Persia",
      " history",
      " podcast",
      " ancient",
      " military",
      " Aristotle",
      " Greece",
      " Hellenistic"
    ]
  },
  {
    "id": "ed75e9d1-7167-439f-bbc5-628efc68b65c",
    "title": "Celebrating the Legacy of the Office of Strategic Services 82 Years On",
    "link": "https://www.historynet.com/celebrating-the-legacy-of-the-office-of-strategic-services-82-years-on/",
    "description": "From the OSS to the CIA, how Wild Bill Donovan shaped the American intelligence community.",
    "author": "Major Nicholas Dockery",
    "published": "Fri, 21 Jun 2024 13:17:24 +0000",
    "image": "https://www.historynet.com/wp-content/uploads/2024/06/The-OSS.jpg",
    "source": "http://www.historynet.com/feed",
    "categories": [
      "Stories",
      "CIA",
      "OSS"
    ]
  },
  {
    "id": "23fe95c2-a8b5-49cc-8777-afedd547b791",
    "title": "Seminoles Taught American Soldiers a Thing or Two About Guerrilla Warfare",
    "link": "https://www.historynet.com/seminole-warrior-vs-us-soldier-book-review-2/",
    "description": "During the 1835–42 Second Seminole War and as Army scouts out West, these warriors from the South proved formidable.",
    "author": "Jon Guttman",
    "published": "Fri, 12 Apr 2024 12:24:00 +0000",
    "image": "https://www.historynet.com/wp-content/uploads/2024/02/book-review-seminole-warrior-ww.jpg",
    "source": "http://www.historynet.com/feed",
    "categories": [
      "Review",
      "Book Review",
      "Florida",
      "military history",
      "Native Americans",
      "Tactics"
    ]
  },
  {
    "id": "0be0fceb-8bfb-44bb-a39f-28c93d527d4a",
    "title": "We the People: The Right to Remain Silent",
    "link": "https://www.npr.org/2025/03/27/1241163687/the-right-to-remain-silent",
    "description": "The Fifth Amendment. You have the right to remain silent when you're being questioned in police custody, thanks to the Fifth's protection against self-incrimination. But most people end up talking to police anyway. Why? Today on Throughline's We the People: the Fifth Amendment, the right to remain silent, and how hard it can be to use it.Learn more about sponsor message choices: podcastchoices.com/adchoicesNPR Privacy Policy",
    "author": "",
    "published": "Thu, 27 Mar 2025 07:00:59 +0000",
    "image": "https://chrt.fm/track/138C95/prfx.byspotify.com/e/play.podtrac.com/npr-510333/traffic.megaphone.fm/NPR3179273964.mp3?d=2916\u0026size=46666484\u0026e=1241163687\u0026t=podcast\u0026p=510333",
    "source": "https://feeds.npr.org/510333/podcast.xml",
    "categories": null
  },
  {
    "id": "78dce684-2f51-4d84-90be-4cbc6d2b8e5d",
    "title": "Sesame Street",
    "link": "https://www.npr.org/2025/03/20/1239646567/throughline-sesame-street",
    "description": "Big Bird, politics, and the ABCs: how a television show made to represent New York City neighborhoods like Harlem and the Bronx became beloved by families around a divided country. This episode originally ran in 2022 as \"Getting to Sesame Street.\"To access bonus episodes and listen to Throughline sponsor-free, subscribe to Throughline+ via Apple Podcasts or at plus.npr.org/throughline.Learn more about sponsor message choices: podcastchoices.com/adchoicesNPR Privacy Policy",
    "author": "",
    "published": "Thu, 20 Mar 2025 07:00:59 +0000",
    "image": "https://chrt.fm/track/138C95/prfx.byspotify.com/e/play.podtrac.com/npr-510333/traffic.megaphone.fm/NPR8359633504.mp3?d=2927\u0026size=46836594\u0026e=1239646567\u0026t=podcast\u0026p=510333",
    "source": "https://feeds.npr.org/510333/podcast.xml",
    "categories": null
  },
  {
    "id": "aaccbc4c-1e34-4fff-9734-87c7ad230334",
    "title": "America’s Path to Polarization: A Short History",
    "link": "http://www.historyisnowmagazine.com/blog/2025/3/27/americas-path-to-polarization-a-short-history",
    "description": "Most Americans are disgusted by politics. Asked in 2023 for one word to describe politics, they responded, “divisive,” “corrupt,” “polarized.” For many, polarization is the root of the problem. Writers lament polarization’s dysfunctional consequences, and a national organization devoted to bridging the partisan divide is flourishing.Yet the 2024 election only deepened polarization. Despite a divisive, topsy turvy campaign, the polls changed little throughout 2024, and the results were within the margin of error. Most voters were locked in, and few changed their minds.Many assume that our current predicament goes back to the 1960s. After all, the ‘60s was decade of dissent and division. It generated bitter conflict over foreign policy, race, women’s rights, sexuality, and a host of highly charged moral issues that would dominate American politics for the next half century.Author Don Nieman’s recent book The Path to Paralysis: How American Politics Became Nasty, Dysfunctional, and a Threat to the Republic, challenges that assumption. Partisanship may be endemic, but polarization is a recent development. Jefferson attacked as an Infidel, available here. How Partisanship and Polarization DifferThere is a big difference between partisan conflict and polarization. American politics has always been contentious. That’s the nature of democratic politics in a country as big, diverse, and dynamic as the U.S. A positive vision may inspire, but negative campaigning and appeals to fear mobilize voters. Federalists charged that Jefferson was a godless Jacobin. Andrew Jackson’s managers alleged that John Quincy Adams had served as a pimp for the Russian Czar. LBJ suggested that Goldwater would unleash nuclear war. George H.W. Bush used Willie Horton to appeal to White fear of Black men.However, there is much more to polarized politics than bitter partisanship and negative campaigning. Politics become polarized when support for the two major parties is  closely divided and upwards of 90% of voters have decided which side they support. When voters get their news from sources that reinforce their prejudices and can’t agree on basic facts.  When wild, baseless conspiracy theories become widely accepted and fear and loathing of the oppositionmotivates voters more than support for their party’s position on the issues. When politicians favor political theater that thrills their base over making the compromises necessary to govern.In 1968, the U.S. was bitterly divided over race and the Vietnam War. Richard Nixon and George Wallace waged divisive presidential campaigns that appealed to fear and promised law and order. It was the opening salvo in a succession of culture wars that would define American politics for the next half century and counting.Yet the country wasn’t polarized. Ticket-splitting was common. States routinely sent Democrats to the U.S. Senate while casting their electoral votes for Republican presidential candidates. And vice versa. Most states were in play in presidential elections and swung back and forth between red and blue control. Some Republicans were moderate and some Democrats conservative. Politicians knew they had to reach the middle, valued compromise, and got things done.Richard Nixon used racially coded language to appeal to White Southerners, but he became the architect of affirmative action.Ronald Reagan was the face of conservative resurgence, but he cut a deal with Democrats to raise taxes, reduce deficits, and save Social Security (a program he hated). President Ronald Reagan with Thomas \"Tip\" O'Neil.George H.W. Bush worked with Democrats to strengthen environmental regulations. He incorporated cap-and-trade policies championed by Democratic senator Al Gore into the Clean Air Act of 1991. He also recognized the threat of climate change and signed the U.N. Framework Convention on Climate Change—the precursor to the Kyoto, Copenhagen, and Paris Climate Agreements.After surviving scurrilous attacks from the right, Bill Clinton joined his nemesis Newt Gingrich to forge a grand compromise on Social Security that was only derailed by Clinton’s affair with Monica Lewinsky and subsequent impeachment.  George W. Bush worked closely with Senator Ted Kennedy to pass sweeping education reform that combined the accountability Republicans demanded with a massive infusion of federal support for schools that served poor children. The Tipping PointPartisanship hardened into polarization following Barack Obama’s election in 2008, when seven long-developing trends converged in a perfect storm. US President Barack Obama taking his Oath of Office. First, massive changes that transformed the media began in the 1980s. Cable TV and talk radio, then the internet and social media ensured that more and more Americans got their news from sources that confirmed their biases. News outlets proliferated. Many were fact free, spreading lies and wild conspiracies. Debates became hotter because Americans couldn’t agree on basic facts much less the best solutions to problems.Second, the transition from an industrial to a service economy, coupled with trickle-down economic policy, led to a sharp increase in income inequality. After 1980, the top 10% did very well, the top 1% better, and the top .1% enjoyed wealth that put the Robber Barons to shame. But middle and working-class Americans struggled. That left many angry, alienated, and suspicious. The 2008 recession and the bank bailouts that followed stoked their anger.Third, the Republican Party became more conservative as it made big gains in the South in the mid-1990s and after. By 2008, well over half of Republicans in the House and Senate came from the South—long the most conservative region of the U.S. The Democratic Party shifted modestly leftward while the GOP took a hard right turn. With moderate Republicans and conservative Democrats endangered species, those most inclined to compromise were missing in action.Fourth, beginning in the late 1960s, immigration surged. By 2020, immigrants constituted 15% of the population, a proportion not seen since the 1910s. Approximately 11 million had entered the country illegally. Many White Americans worried that they were losing their country. The election of a Black president in 2008 reinforced that fear. In 2011, polling revealed that a majority of Republicans believed the baseless birther conspiracy that alleged that Obama hadn’t been born in the U.S. (and therefore wasn’t qualified to serve). It was a sure sign of growing anger, alienation, distrust, and willingness to believe the worst about the enemy.Fifth, the Great Recession of 2008 damaged the Republican brand, and Obama’s convincing victory rattled Republican leaders. They feared a political realignment that would make Democrats the dominant party for a generation. They decided to dig in, oppose everything Obama proposed, refuse to compromise, create gridlock, and make the Democrats look ineffective.Sixth, gerrymandering created safe congressional districts. By the early 2000s, few seats in the House were competitive. Republican incumbents had more to fear from the right flank of their own party than from Democrats. Moving toward the center to compromise with Democrats was unnecessary to sway undecided voters in the general election, and it might invite a conservative challenge in primaries.Finally, and fatally, the GOP embraced populism. The party that had traditionally appealed to fiscal conservatives, the college educated, and the country club set found that by appealing to discontented rural and working-class Whites without a college education they won new recruits. Sarah Palin offered a glimpse of the power of populism in 2008, and the Tea Party Revolt of 2010 confirmed that it worked as Republicans re-took the House. Populism brought new recruits to the party. Many were angry, hostile to establishment politicians they believed had sold them out, and got their news from outlets that traded in conspiracy theories. They didn’t want civil debate or politicians who compromised. They wanted leaders who would fight. Plenty of politicians—including many with Ivy League credentials—eagerly obliged.After the 2010 mid-term elections, politics were polarized. Government regularly faced shutdowns and even default. What little the federal government accomplished was done through executive order.Mainstream Republicans led by alumni of the George W. Bush administration sought to pull the party back after Mitt Romney’s loss in 2012. They produced a major report—the Growth and Opportunity Project—that insisted the party broaden its appeal to the young, people of color, and immigrants. It demanded a return to the center.That didn’t happen. Donald Trump understood how the Republican Party and American politics had changed. Appeals to moderates and undecided voters had become less important in a polarized polity. There were too few of them. Mobilizing his base with a polarizing, populist campaign full of invective, exaggeration, lies, and racist and sexist language worked. It disgusted many Republicans, but Trump’s success and threats of retribution by his base against those who bucked him brought them aroundTrump captured the Republican nomination, won the White House in 2016, and ultimately made the Republican Party his own. Even after two impeachments, unsteady leadership during a global pandemic, incitement of an attempted coup on January 6, 2021, and conviction of a felony, Trump’s base never wavered. They supported him as he waltzed to the Republican nomination and won re-election on November 5, 2024.  Where Do We Go from Here?Since 2016, the U.S. has experienced three presidential and two mid-term elections. The margins of victory have been tight, and power in Washington has shifted between the two major parties. The result has been wild swings in policy exemplified by withdrawing, then re-entering, and once again withdrawing from the Paris Climate Agreement. Congress is gridlocked, and executive orders have taken the place of legislation to address critical issues. American politics remains polarized, to the disgust of most voters, even as they refuse to budge from their commitment to one side of the great divide.Those hoping for a way out of divisiveness and gridlock might look to history. From the 1840s to the early 1860s, conflict over slavery created bitter animosity and stalemate that led to civil war. The war ended slavery and realigned American politics, producing two decades of Republican hegemony. The end of Reconstruction, industrialization, and the agrarian crisis of the 1880s and 1890s once again left the two major parties closely divided with control in Washington shifting frequently. Political conflict was bitter and gridlock the order of the day. The election of 1896 broke the logjam and ushered in over 30 years of Republican dominance. Only a fool would predict how or when or current impasse might end. If history is our guide, the most likely scenario is a crisis that scrambles political loyalties and permits one of the parties to achieve dominance. We can only hope that it’s more like the crisis of the 1890s than the cataclysm of the 1850s. Author Don Nieman’s recent book is The Path to Paralysis: How American Politics Became Nasty, Dysfunctional, and a Threat to the Republic. Available here: Amazon US",
    "author": "George Levrier-Jones",
    "published": "Thu, 27 Mar 2025 22:00:40 +0000",
    "image": "https://images.squarespace-cdn.com/content/v1/50adfa2ae4b0cc1d786569eb/5e74aa2b-bfc3-476a-af0b-41290fded71f/20250327+Jefferson+Infidel.jpeg?format=1000w",
    "source": "https://www.historyisnowmagazine.com/blog?format=RSS",
    "categories": [
      "20th century",
      "Blog Post"
    ]
  },
  {
    "id": "49aaaecc-efab-4f2b-9596-d19e7c36b1a1",
    "title": "The Crimean War – Part 4: Life on the Frontlines \u0026 the Human Experience",
    "link": "http://www.historyisnowmagazine.com/blog/2025/3/26/the-crimean-war-part-4-life-on-the-frontlines-amp-the-human-experience",
    "description": "War is often remembered for its battles, its victories, and its great leaders, but for the ordinary soldier, the reality is far grimmer. Nowhere was this more apparent than in the trenches of the Crimean War, where men endured not just the enemy's gunfire but an even more relentless onslaught: hunger, disease, and the unforgiving elements.Terry Bailey explains.Read part 1 in the series here, part 2 here, and part 3 here. The Mission of Mercy: Florence Nightingale receiving the Wounded at Scutari. By Jerry Barrett. The winter of 1854–1855 turned the besieged city of Sevastopol into a frozen wasteland, where soldiers huddled in ill-equipped trenches, wrapped in tattered uniforms that offered little protection against the biting cold. Food was scarce, medical care was rudimentary at best, and the looming specter of death came as often from sickness as from enemy fire.Rats, lice, and the stench of decay were constant companions. Letters Home painted a picture not of glory but of sheer survival in a war where the greatest challenge was simply staying alive.Yet, amidst this suffering, change was brewing. The horrors of the Crimean War would spark reforms in battlefield medicine, bring women like Florence Nightingale and Mary Seacole into the public eye, and transform war reporting forever. This conflict was not just fought in the trenches, it was fought in the hospitals, the newspapers, and in the minds of those who would demand a better future for the soldiers of tomorrow. Life in the trenches: Mud, hunger and the shadow of deathFor soldiers on the frontlines, the Crimean War was defined not just by battle, but by relentless suffering. The harsh winter of 1854–1855 turned the trenches outside Sevastopol into frozen pits of misery. Soldiers faced extreme cold with inadequate clothing, often wearing threadbare uniforms unsuited to the brutal climate. Supplies were inconsistent, and food shortages left men weak and malnourished. Hard biscuits and salted meat made up the bulk of their diet, with fresh rations arriving sporadically, if at all.Disease was as deadly as enemy fire. Dysentery, typhus, and cholera swept through the ranks, claiming more lives than the battles themselves. Lice and rats were omnipresent, spreading filth and infection. Letters from soldiers described the unimaginable stench of decaying bodies, the cries of the wounded, and the relentless fear of the next attack. Medicine and Florence Nightingale's legacyThe appalling conditions of battlefield hospitals were brought to the world's attention by Florence Nightingale, a determined British nurse who arrived in Scutari in 1854. Hospitals were overwhelmed, with wounded men lying in their filth, untreated for days. Infection was rampant, and medical supplies were scarce.Nightingale, along with a team of nurses, introduced basic hygiene practices, insisting on cleanliness, fresh air, and proper nutrition. Though germ theory was not yet understood, her efforts significantly reduced death rates. Dubbed \"The Lady with the Lamp,\" Nightingale's nightly rounds brought comfort to the suffering, and her work laid the foundation for modern nursing. Women in the war: More than just nursesWhile Nightingale became the face of female contributions to the war effort, many other women played crucial roles. Mary Seacole, a Jamaican-born nurse and entrepreneur, independently travelled to the war zone and set up the \"British Hotel\" near Balaclava, offering soldiers warm meals, medical care, and even morale-boosting comforts like fresh linens and tea. Despite being overlooked by British authorities, Seacole's efforts were widely recognized by the soldiers she treated.Women also played vital roles as camp followers, laundresses, and caregivers. Some disguised themselves as men to fight, while others served as spies or helped transport supplies. The Crimean War broadened the perception of women's capabilities in conflict, laying the groundwork for future involvement in military and medical service. The first war of the press: War correspondents and public opinionThe Crimean War was the first major conflict to be extensively reported in newspapers, changing how wars were perceived at home. William Howard Russell of The Times was the first modern war correspondent, sending back vivid and often damning accounts of the British army's struggles. His reports exposed government mismanagement, the suffering of the soldiers, and the incompetence of some commanders, leading to public outrage and political reforms.Illustrations and early war photography also emerged, with Roger Fenton capturing haunting images of the battlefield. Though staged to avoid showing corpses, his photographs gave civilians a stark glimpse of war's desolation. The press coverage of the Crimean War shaped public perception, fueling both patriotic fervor and calls for change.Needless to say, the Crimean War was more than just a military campaign; it was a turning point in how war was fought, perceived, and remembered. For the soldiers trapped in the trenches, it was a grim struggle against not only the enemy but also disease, hunger, and the merciless elements. The horrors they endured underscored the urgent need for improved logistics, medical care, and military planning, lessons that would influence future conflicts.Florence Nightingale and Mary Seacole's efforts revolutionized battlefield medicine, proving that compassionate and systematic care could save lives even in the direst conditions. Their contributions marked the beginning of modern nursing and demonstrated that women had an indispensable role to play in war beyond traditional domestic spheres. The presence of women in military operations would only grow in significance in the decades to come.At the same time, the Crimean War ushered in a new era of war reporting. The firsthand accounts of war correspondents like William Howard Russell shattered the romanticized image of battle, exposing the incompetence of leadership and the suffering of common soldiers. Photography, though still in its infancy, provided the public with a tangible, visual connection to the realities of war. Never before had the home front been so intimately tied to events on the battlefield, paving the way for future conflicts to be scrutinized through the lens of journalism and public opinion.In many ways, the Crimean War set the stage for the modern era of warfare. The lessons learned in its muddy, disease-ridden trenches shaped military reforms, the evolution of medical care, and the role of the press in holding governments accountable. Though often overshadowed by later conflicts, its impact was profound, leaving behind a legacy that still resonates in military, medical, and journalistic practices today. The site has been offering a wide variety of high-quality, free history content for over 12 years. If you’d like to say ‘thank you’ and help us with site running costs, please consider donating here.",
    "author": "George Levrier-Jones",
    "published": "Wed, 26 Mar 2025 21:42:35 +0000",
    "image": "https://images.squarespace-cdn.com/content/v1/50adfa2ae4b0cc1d786569eb/77bf3d32-ad7b-41d8-a316-ef66ddd41f21/20250326+1024px-Nightingale_receiving_the_Wounded_at_Scutari_by_Jerry_BarrettFXD.jpg?format=1000w",
    "source": "https://www.historyisnowmagazine.com/blog?format=RSS",
    "categories": [
      "19th century",
      "Blog Post"
    ]
  },
  {
    "id": "62775be2-0a4e-41df-94bc-32355ac1a1b7",
    "title": "Riveting Historical Reads: April 2025",
    "link": "https://www.thehistoryreader.com/world-history/riveting-historical-reads-april-2025/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=riveting-historical-reads-april-2025",
    "description": "Looking for your next history read? Check out our favorite new history books publishing in April 2025. Fear No Pharaoh A dramatic history of how American Jews reckoned with slavery—and fought the Civil War. Kreitner illuminates the shifting dynamics of Jewish life in America and the debates about religion, morality, and politics that endure to […] The post Riveting Historical Reads: April 2025 appeared first on The History Reader.",
    "author": "Sara Eslami",
    "published": "Tue, 25 Mar 2025 19:18:40 +0000",
    "image": "https://www.thehistoryreader.com/wp-content/uploads/2025/03/April-25.jpg",
    "source": "https://www.thehistoryreader.com/feed/",
    "categories": [
      "Cultural History",
      "World History",
      "Double Exposure",
      "Eminent Jews",
      "Fear No Pharaoh",
      "hitlers-aristocrats",
      "listicle",
      "Missing Persons",
      "The Birth of Korean Cool",
      "The Last American Road Trip",
      "The Odyssey of Phillis Wheatley",
      "The Rebel Romanov",
      "upcoming books"
    ]
  },
  {
    "id": "f54469fa-bf39-41a5-a950-dcd53dc526e5",
    "title": "Featured Excerpt: The Ride",
    "link": "https://www.thehistoryreader.com/historical-fiction/featured-excerpt-the-ride/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=featured-excerpt-the-ride",
    "description": "by Kostya Kennedy Timed for the 250th anniversary of one of America’s most famous founding events, New York Times bestselling author Kostya Kennedy’s new book, The Ride, reveals fresh research into Paul Revere’s legendary ride. Read on for a featured excerpt. I ECHOES What if the militiamen had not been waiting at the Lexington Green […] The post Featured Excerpt: The Ride appeared first on The History Reader.",
    "author": "Sara Beth Haring",
    "published": "Tue, 25 Mar 2025 09:54:00 +0000",
    "image": "https://www.thehistoryreader.com/wp-content/uploads/2025/03/Battle_of_Lexington.jpeg",
    "source": "https://www.thehistoryreader.com/feed/",
    "categories": [
      "Historical Fiction",
      "Military History",
      "U. S. History",
      "American Revolution",
      "Battle of Lexington",
      "British soldiers",
      "Paul Revere",
      "Revolutionary War"
    ]
  }
]
