[
  {
    "id": "98f40fd1-103c-430b-8c70-9773e6fc6bba",
    "title": "Episode 150: Late One Night",
    "link": "https://play.prx.org/listen?ge=prx_3_3a97b897-15b5-4e73-a156-257145aa9145\u0026uf=http%3A%2F%2Ffeeds.thememorypalace.us%2Fthememorypalace",
    "description": "Pre-order The Memory Palace book now, dear listener. On Bookshop.org, on Amazon.com, on Barnes \u0026 Noble, or directly from Random House.This episode was originally released in October 2019.The Memory Palace is a proud member of Radiotopia from PRX. Radiotopia is a collective of independently owned and operated podcasts that’s a part of PRX, a not-for-profit public media company. If you’d like to directly support this show, you can make a donation at Radiotopia.fm/donate. I have recently launched a newsletter. You can subscribe to it at thememorypalacepodcast.substack.com.",
    "author": "Nate DiMeo",
    "published": "Thu, 17 Oct 2024 19:00:00 -0000",
    "image": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/_/3/3a97b897-15b5-4e73-a156-257145aa9145/thememorypalace.mp3",
    "source": "http://feeds.thememorypalace.us/thememorypalace",
    "categories": null
  },
  {
    "id": "31d4dae3-144a-408d-a060-c06ad31478cd",
    "title": "Episode 222: Ferminia Sarras",
    "link": "https://play.prx.org/listen?ge=prx_3_53bcca43-f8fe-40b1-b47a-f9036b69b8b2\u0026uf=http%3A%2F%2Ffeeds.thememorypalace.us%2Fthememorypalace",
    "description": "Pre-order The Memory Palace book now, dear listener. On Bookshop.org, on Amazon.com, on Barnes \u0026 Noble, or directly from Random House.The Memory Palace is a proud member of Radiotopia from PRX. Radiotopia is a collective of independently owned and operated podcasts that’s a part of PRX, a not-for-profit public media company. If you’d like to directly support this show, you can make a donation at Radiotopia.fm/donate. I have recently launched a newsletter. You can subscribe to it at thememorypalacepodcast.substack.com. Music Riverside by Ann Annie Walking to Town by Lullatone Alice Lake by North Americans Gone for a Wander by Domenique Dumont NotesThe definitive source on Ferminia Sarras (as far as definitive can be in her case) A Mine of Her Own: Women Prospectors in the American West, 1850-1950 by Sally Zanjani.",
    "author": "Nate DiMeo",
    "published": "Thu, 19 Sep 2024 07:30:00 -0000",
    "image": "https://dts.podtrac.com/redirect.mp3/dovetail.prxu.org/_/3/53bcca43-f8fe-40b1-b47a-f9036b69b8b2/thememorypalace.mp3",
    "source": "http://feeds.thememorypalace.us/thememorypalace",
    "categories": null
  },
  {
    "id": "c2e32bbb-9aa1-4c34-8425-52ddac46a3b8",
    "title": "Show 71 - Mania for Subjugation",
    "link": "http://www.dancarlin.com/product/hardcore-history-71-mania-for-subjugation",
    "description": "What's the recipe for making a historically world-class apex predator? In the case of Alexander the Great, it might be the three Ns: Nature, Nurture, and Nepotism.",
    "author": "",
    "published": "Fri, 07 Jun 2024 12:14:53 PST",
    "image": "https://dts.podtrac.com/redirect.mp3/traffic.libsyn.com/dancarlinhh/dchha71_Mania_for_Subjugation.mp3",
    "source": "https://feeds.feedburner.com/dancarlin/history?format=xml",
    "categories": [
      "Alexander the Great",
      " Phillip II",
      " Macedonia",
      " Macedon",
      " Olympias",
      " Demosthenes",
      " Athens",
      " Sparta",
      " Thebes",
      " Persia",
      " history",
      " podcast",
      " ancient",
      " military",
      " Aristotle",
      " Greece",
      " Hellenistic"
    ]
  },
  {
    "id": "ea52d7ee-6fc7-4c30-a45a-53a9ead364f9",
    "title": "Show 70 - Twilight of the Aesir II",
    "link": "http://www.dancarlin.com/product/hardcore-history-70-twilight-of-the-aesir-ii",
    "description": "Pagan Viking Sea Kings spend the 10th and 11th centuries morphing into Christian monarchs. But with rulers like Harald Bluetooth and Svein Forkbeard it's debatable whether things will be any less horrific for Scandinavia's neighbors",
    "author": "",
    "published": "Sun, 19 Nov 2023 12:14:53 PST",
    "image": "https://dts.podtrac.com/redirect.mp3/traffic.libsyn.com/dancarlinhh/dchha70_Twilight_of_the_Aesir_II.mp3",
    "source": "https://feeds.feedburner.com/dancarlin/history?format=xml",
    "categories": [
      "Vikings",
      " Scandinavia",
      " Anglo-Saxon",
      " Franks",
      " Irish",
      " Danes",
      " Norway",
      " Sweden",
      " Rus",
      " Russia",
      " Byzantium",
      " Constantinople",
      " raiding",
      " pirates",
      " history",
      " Forkbeard",
      " Bluetooth",
      "Hairfair",
      " Tryggvason"
    ]
  },
  {
    "id": "86ca03d0-db2b-4eb4-a40b-eaffd272854d",
    "title": "Celebrating the Legacy of the Office of Strategic Services 82 Years On",
    "link": "https://www.historynet.com/celebrating-the-legacy-of-the-office-of-strategic-services-82-years-on/",
    "description": "From the OSS to the CIA, how Wild Bill Donovan shaped the American intelligence community.",
    "author": "Major Nicholas Dockery",
    "published": "Fri, 21 Jun 2024 13:17:24 +0000",
    "image": "https://www.historynet.com/wp-content/uploads/2024/06/The-OSS.jpg",
    "source": "http://www.historynet.com/feed",
    "categories": [
      "Stories",
      "CIA",
      "OSS"
    ]
  },
  {
    "id": "0a1ae24f-5142-418f-953d-9e98ce8085cc",
    "title": "Seminoles Taught American Soldiers a Thing or Two About Guerrilla Warfare",
    "link": "https://www.historynet.com/seminole-warrior-vs-us-soldier-book-review-2/",
    "description": "During the 1835–42 Second Seminole War and as Army scouts out West, these warriors from the South proved formidable.",
    "author": "Jon Guttman",
    "published": "Fri, 12 Apr 2024 12:24:00 +0000",
    "image": "https://www.historynet.com/wp-content/uploads/2024/02/book-review-seminole-warrior-ww.jpg",
    "source": "http://www.historynet.com/feed",
    "categories": [
      "Review",
      "Book Review",
      "Florida",
      "military history",
      "Native Americans",
      "Tactics"
    ]
  },
  {
    "id": "ba6f3c6d-336e-4d6d-98e1-941d45fa9d1f",
    "title": "‘Gunplay’ in the Wild West",
    "link": "https://www.thehistoryreader.com/us-history/gunplay-in-the-wild-west/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=gunplay-in-the-wild-west",
    "description": "This week sees the publication of my new book, Bandit Heaven: The Hole-in-the-Wall Gangs and the Final Chapter of the Wild West. The main characters are Butch Cassidy and the Sundance Kid, but unlike the classic movie, there is also emphasis on a wide range of colorful characters. Two of them are portrayed in the following excerpt from […] The post ‘Gunplay’ in the Wild West appeared first on The History Reader.",
    "author": "Sara Beth Haring",
    "published": "Thu, 31 Oct 2024 20:49:46 +0000",
    "image": "https://www.thehistoryreader.com/wp-content/uploads/2024/10/Butch_Cassidy-216x300.jpg",
    "source": "https://www.thehistoryreader.com/feed/",
    "categories": [
      "U. S. History",
      "Bandit Heaven",
      "Gunslinger",
      "Tom Clavin",
      "Wild West"
    ]
  },
  {
    "id": "7f35ef23-b01e-4513-a491-e979ea7ac695",
    "title": "Schley: The Navy Man Who Saved Greely",
    "link": "https://www.thehistoryreader.com/military-history/schley-the-navy-man-who-saved-greely/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=schley-the-navy-man-who-saved-greely",
    "description": "In 1881, Cdr. Winfield Scott Schley was at the Charlestown Navy Yard reading a newspaper article about the US Army Signal Corps’ ambitious Lady Franklin Bay Expedition. He considered it unusual— even foolhardy—that the US Navy wasn’t in charge of the enterprise, which involved steaming, sailing, and navigating 1800 nautical miles through some of the […] The post Schley: The Navy Man Who Saved Greely appeared first on The History Reader.",
    "author": "Sara Beth Haring",
    "published": "Sun, 27 Oct 2024 09:00:32 +0000",
    "image": "https://www.thehistoryreader.com/wp-content/uploads/2024/10/Winfield-Scott-Schley-and-Rescuers-300x230.jpg",
    "source": "https://www.thehistoryreader.com/feed/",
    "categories": [
      "Historical Figures",
      "Military History",
      "Buddy Levy",
      "Commander Winfield Scott Schley",
      "Greely Expedition",
      "Lady Franklin Bay Expedition",
      "Realm of Ice and Sky",
      "US Navy"
    ]
  },
  {
    "id": "5d982491-dd0f-432c-a9ff-63f32debc4c9",
    "title": "Sir Barnes Neville Wallis: The Visionary Scientist Who Played a Key Role in World War 2",
    "link": "http://www.historyisnowmagazine.com/blog/2024/11/6/sir-barnes-neville-wallis-the-visionary-scientist-who-played-a-key-role-in-world-war-2",
    "description": "Sir Barnes Neville Wallis, CBE, FRS, RDI, FRAeS, born on Septembe, 26, 1887 in Ripley, Derbyshire, is often remembered for his role in the development of the famous \"bouncing bomb\" during the Second World War. However, his contributions to science, engineering, and aeronautics extend far beyond this iconic invention. A visionary in the truest sense, Wallis's legacy includes groundbreaking work in airship design, aircraft development, and advanced weaponry, in addition to, shaping the course of 20th-century technology.Terry Bailey explains. Barnes Neville Wallis.Early life and educationWallis's early life provided the foundation for his eventual career in engineering. His father, Charles Wallis, was a doctor, but young Barnes developed an early fascination with mechanical objects, much to his father's frustration. After attending Christ's Hospital school in Sussex, where he displayed a knack for mathematics and science, Wallis pursued an apprenticeship at Thames Engineering Works. However, he subsequently changed his apprenticeship to J. Samuel White's, the shipbuilder based at Cowes on the Isle of Wight originally training as a marine engineer, he took a degree in engineering via the University of London external program. Contributions to Airship designWallis's early career saw him make significant contributions to the development of airships. In 1913, he joined Vickers, a company heavily involved in aeronautics, where he began working on lighter-than-air vehicles. He played a pivotal role in the design of the R100, a large British airship intended for long-range passenger travel.The R100 project was part of a competition with the government-sponsored R101, which ultimately ended in disaster with the crash of R101, a craft of a different design to the R100. While the R101's failure effectively ended the British airship program, the R100 itself was a technical success, in large part due to Wallis's innovative structural design, which utilized a geodesic framework. This design became a hallmark of Wallis's work.The geodesic framework was notable for its strength and lightweight properties. This design not only enhanced the airship's durability but also reduced its overall weight, making it more fuel-efficient. The R100's successful transatlantic flight to Canada in 1930 was a testament to the efficacy of Wallis's design, even though the airship program was ultimately scrapped after the R101 disaster. Transition to aircraft designAfter the decline of airship development, Wallis turned his attention to aircraft design. His expertise in geodesic structures led him to work on the Vickers Wellington bomber, which was used extensively by the Royal Air Force, (RAF) during the Second World War. The Wellington's geodesic structure made it incredibly resilient to damage. Unlike conventional aircraft, the Wellington could sustain considerable battle damage yet continue flying due to its ability to retain structural integrity even after losing large sections of the skin or framework.This durability made it a valuable asset during the war, particularly during the early bombing campaigns. Wallis's work on the Wellington showcased his ability to apply innovative design principles to aircraft, extending the operational capabilities and survivability of warplanes. The Wellington aircraft became one of the most produced British bombers of the war, with more than 11,000 units built, attesting to the practical success of Wallis's engineering philosophy. The Bouncing Bomb and the Dam Busters RaidWallis is perhaps most famous and remembered for his invention of the bouncing bomb, which was used in the Dam Busters Raid (Operation Chastise) in 1943. This operation targeted key dams in Germany's industrial Ruhr region, aiming to disrupt water supplies and manufacturing processes critical to the Nazi war effort. The bouncing bomb, officially known as \"Upkeep,\" was an ingenious device that skimmed across the surface of the water before striking the dam and sinking to the optimal depth, then detonated when a hydrostatic pistol fired. In addition to, upkeep two smaller versions were also developed, High-ball and Base-ball.The design of the bomb required not only advanced physics and mathematics but also extensive practical testing. Wallis conducted numerous experiments with scaled-down prototypes to perfect the bomb's trajectory and spin, ensuring it could bypass underwater defenses and inflict maximum damage, before conducting half and full-scale tests of the bomb. The Dam Busters Raid, though not as strategically decisive as hoped, was a major tactical and propaganda victory that demonstrated the effectiveness of precision engineering in warfare. It also solidified Wallis's reputation as one of Britain's foremost wartime inventors, and designers. Beyond the Bouncing Bomb: The Tallboy and Grand SlamWhile the bouncing bomb is Wallis's most well-known design, his development of the \"Tallboy\" and \"Grand Slam\" bombs was arguably more impactful. These were so-called \"earthquake bombs,\" designed to penetrate deeply into the ground or fortifications before exploding, causing immense structural damage. The Tallboy, weighing 12,000 pounds, was used effectively against hardened targets such as U-boat pens, railway bridges, and even the German battleship Tirpitz, which was sunk by RAF bombers in 1944.The Grand Slam, a 22,000-pound bomb, was the largest non-nuclear bomb deployed during the war. Its sheer destructive power was unparalleled, and it played a crucial role in the final stages of the conflict, helping to obliterate reinforced German bunkers and infrastructure. Wallis's work on these bombs demonstrated his understanding of the evolving nature of warfare, where the destruction of heavily fortified targets became a priority. Post-War Contributions: Advancements in supersonic flightAfter the war, Wallis continued to push the boundaries of engineering, particularly in the field of supersonic flight. He began working on designs for supersonic aircraft, foreseeing the need for faster travel in both military and civilian aviation. His proposed aircraft designs included the \"Swallow\" which was a supersonic development of Wild Goose, designed in the mid-1950s and was a tailless aircraft controlled entirely by wing movement with no separate control surfaces.The design intended to use laminar flow and could have been developed for either military or civil applications, both Wild Goose and Swallow were flight-tested as large (30 ft span) flying scale models. However, despite promising wind tunnel and model work, these designs were not adopted. Government funding for Wild Goose and Swallow was cancelled due to defense cuts.Although Wallis's supersonic aircraft designs were never fully realized during his lifetime, they laid the groundwork for later advancements in high-speed flight. The variable-sweep wing technology he envisioned was later incorporated into aircraft such as the F-111 Aardvark and concepts of supersonic flight in the iconic Concorde, the world's first supersonic passenger airliner. Wallis's vision of supersonic travel outlined his enduring ability to anticipate technological trends. Marine engineering and submersible craftWallis's inventive spirit was not confined to aeronautics. In the post-war years, he became involved in marine engineering, focusing on the development of submersible craft and weaponry. One of his notable projects was the development of an experimental rocket-propelled torpedo codenamed HEYDAY. It was powered by compressed air and hydrogen peroxide that had an unusual streamlined shape designed to maintain laminar flow over much of its length.Additionally, Wallis also explored the development of deep-sea submersibles. His work on underwater craft highlighted his interest in new forms of exploration and transportation, aligning with the burgeoning post-war interest in oceanography and underwater research. As part of this exploration of underwater craft, he proposed large cargo and passenger-carrying submarines, that would reduce transportation costs drastically, however, nothing came of these designs which probably would have transformed ocean-going transportation.Due to Wallis's experience in geodesic engineering, he was engaged to consult on the Parkes Radio Telescope in Australia. Some of the ideas he suggested are the same as or closely related to the final design, including the idea of supporting the dish at its center, the geodetic structure of the dish and the master equatorial control system. Later life and recognitionThroughout his life, Wallis maintained a strong commitment to education and mentorship. He was an advocate for the advancement of engineering as a discipline and frequently gave lectures to students and professionals alike. Wallis became a Fellow of the Royal Society in 1945, was knighted in 1968, and received an Honorary Doctorate from Heriot-Watt University in 1969 in recognition of his outstanding engineering achievements. Additionally, he was awarded the Royal Society's prestigious Rumford Medal in 1971 for his work in aerodynamics.Even in his later years, Wallis remained active in engineering, particularly in exploring the future potential of space travel. His forward-thinking ideas on rocket propulsion and spacecraft design, though largely theoretical at the time, hinted at the emerging field of space exploration, which would become a global endeavor in the following decades.Wallis passed away on October, 30, 1979, leaving behind a legacy of innovation that continues to inspire engineers and inventors worldwide. His impact on both military and civilian technologies is a testament to his brilliance and determination to push the boundaries of what he knew was possible but others often did not. LegacySir Barnes Neville Wallis, CBE, FRS, RDI, FRAeS, was a true polymath whose influence extended across multiple disciplines. While he is best known for his wartime contributions, particularly the bouncing bomb, his legacy goes far beyond a single invention.From the geodesic structures of airships and bombers to supersonic aircraft concepts and deep-sea exploration vehicles, in addition to, his innovative ideas on ocean and space exploration and travel. Wallis's career spanned an astonishing range of technological advancements. His ability to marry theoretical physics with practical engineering solutions made him a giant of 20th-century science and technology.Wallis's story is not just one of wartime ingenuity but of a lifetime spent striving to solve complex problems with creativity and persistence. His contributions continue to resonate today, reminding us that the spirit of innovation is timeless. The site has been offering a wide variety of high-quality, free history content since 2012. If you’d like to say ‘thank you’ and help us with site running costs, please consider donating here.",
    "author": "George Levrier-Jones",
    "published": "Wed, 06 Nov 2024 22:27:13 +0000",
    "image": "https://images.squarespace-cdn.com/content/v1/50adfa2ae4b0cc1d786569eb/a0ee6083-785c-474c-bca1-366eb4280e23/20241106+512px-Barnes_Wallis_%28RNV%29.jpg?format=1000w",
    "source": "https://www.historyisnowmagazine.com/blog?format=RSS",
    "categories": [
      "20th century",
      "Blog Post"
    ]
  },
  {
    "id": "3dab94f0-541f-4e53-a368-63936777cff6",
    "title": "What are the Old Hill Figures Dotted Around Britain?",
    "link": "http://www.historyisnowmagazine.com/blog/2024/11/3/what-are-the-old-hill-figures-dotted-around-britain",
    "description": "Britain possesses over sixty hill figures of varying size and design that are carved into her hillsides. They invite both admiration and curiosity. Most are laid out on hillsides that have underlying chalk foundations. These figures are so huge that that they can be viewed from miles around and are especially visually effective on bright summer days. Most of these figures are made up of white horses, but amongst the others there are two giants (one in a naked depiction), a multitude of crosses, various military commemorations, a stag, a lion, a panda, a kiwi, and a kangaroo.Steve Prout explains. The Uffington White Horse. Source: World Wind, available here.The description of this activity has been termed “leucippotomy” for the carving of horses and “gigantotomy” for giants (there are currently four of this kind in Britain). Whether these adopted terms are intended to be applied seriously is debatable since they do not appear in the dictionary. The name usually attached to such figures are geoglyphs. This peculiarity has been a phenomenon that has continued from the 1700s into modern times, one of the latest being a horse that was created in 1999 in Devizes, Wiltshire but there have been subsequent ones. Wiltshire is home to most of Britain’s hill figures but there are others in Scotland, Wales, and the North of England - but their presence is few and far between,  for example only two figures are to be found in Scotland. Only a handful are considered to have authentically ancient uncertain origins and of the others few pose any mystery and only minor ones if any. Those that were created in the twentieth century are the easiest to explain and can be traced to a specific event. Perhaps these reasons for the more modern examples offer the answer to some of the earlier and unexplained figures. Some created in the 1800s continues to present minor puzzles simply because their creation was unrecorded due to simply being forgotten, confused, or dismissed as frivolous acts - examples of this are the first Westbury Horse and the Rockley Down or the Broad Town Horses. Wartime CommemorationsThe early twentieth century saw a variety of new figures appear on numerous hillsides in Britain to join the plethora of white horses. Many of these hill figures were inspired by the events from the First World War. At the end of the war people needed an outlet to grieve, remember and honor the sacrifices they suffered. It was something that needed to match the gravity and sheer size of the tragedy and sacrifice. Every village in England had lost friends, relatives and loved ones and few families were unaffected from the war. Shoreham, a town in Kent, was one of the villages that between May and September 1920, entrenched a thirty-meter chalk Christian style cross into a nearby hillside for this purpose. As it lays solitary in quiet pastures its presence resonates in that quiet serene countryside hill. Its creator was a Samuel Cheeseman, whose motivation emanated from the tragic loss of his two sons in the First World War. The memorial is also dedicated to a further forty-eight inhabitants of the village who also perished alongside them.A similar style cross was carved at a village in Lenham for the same reasons. Lenham is in that same county of Kent, twenty-three miles away from its earlier counterpart at Shoreham. It is similar in design and is double the size of the Shoreham Cross. It was created a year later by a certain Mr G H Groom who was the local Headmaster.  In Wiltshire, a variety of military inspired figures appeared across the landscape that was previously dominated by a multitude of white horses until the early twentieth century. The post war period was a frustrating time for soldiers that were awaiting demobilization. The sheer size of the task to administer the demobilization process was a slow and frustrating process for the men waiting and for those who were challenged with making this monumental task happen. Most of these men were not regular soldiers, only conscripted for the duration of the war and they quite understandably wanted to return home quickly now the fighting was over. It led to the problem of finding ways to keep these soldiers occupied.The soldiers from New Zealand based at Bulford, Wiltshire set about carving a giant Kiwi into the hillside above their camp. They clearly took their inspiration from the Regimental Badges of Fovant Down that were created two years previously. The kiwi was designed in 1918 by a Captain H Clarke who was an engineer. It is quite incongruous compared to some of the other figures present in Wiltshire as the Kiwi is not native to Britain. It is interesting to note that as time passes on, its significance and the one-time presence of its New Zealand creators will be forgotten - and the very existence of a kiwi will puzzle some heads. It covers over four hundred feet or one and a half acres of land. For the present the Bulford Kiwi still serves as a lasting reminder to the presence of the soldiers of New Zealand that fought on the side of Great Britain.The First World War also inspired the creation of the Regimental badges of Fovant Down, the best and most obvious example. Before the crosses of Shoreham, Lenham and the Bulford Kiwi, various regiments from the Dominions and the British Army gathered in 1916 for the purpose of carving fourteen individual badges onto the hills at Fovant Down, Wiltshire. Again, the main reason was to occupy the soldiers from the horrors that were being reported from the various fronts, alleviate the feeling of homesickness, and provide a release from the relentless grind of military training. Today those badges that remain still serve to remind us of those sacrifices made by those men, but sadly a number have now long overgrown or have been lost beyond any hope of restoration due to a lack of maintenance. The badges included an outline map of Australia, a badge representing the Royal Army Medical Core, City of London Rifles, a rising sun for the Australian Commonwealth Forces, a Kangaroo, the Devon Regiment, Royal Fusiliers, and The Royal Warwickshire Regiment. Others were added after World War Two. Royal connectionsBritain’s incoming Kings and Queens also appear to have inspired the creation of other hill figures. The Hackpen White Horse in Wiltshire and the First White Horse in Littlington, Sussex were carved in 1838 to celebrate the ascent of Queen Victoria to the throne. Other monarchs were also celebrated in similar fashion. The White Horse in Osmington, just outside the coastal resort of Weymouth, is one the largest white horse hill figures in Britain. It is unique in the fact that it is the only figure to feature a rider who represents King George III. From 1789 King George held Weymouth under Royal Patronage and even visited the town on numerous occasions. In 1815 a group of army engineers are believed to have carved this figure into the hillside to occupy their time whilst they waited and prepared for an invasion by Napoleonic forces from the continent. This never materialized and the figure remains today. A different hillside representation to a monarch is the Wye Crown, in the county of Kent. This was carved in 1902 by a local Agricultural College to celebrate the coronation of King Edward VII. Antique follies and examples of strange indulgences There were other reasons for such a myriad of hill figures. The southern part of Britain, in particular Wiltshire, are abundant in White Horse hill figures. Only one horse in Uffington is of genuine antiquity and its origins remain unknown. The rest originate from the 1700s and 1800s. Most of these hill figures pose no mystery as to their origins and for those that do, mostly the mysteries are very minor ones. Some hill figures were not inspired by history - some are recorded as being the product of whimsical and frivolous acts on the part their wealthy and indulged landowners. Examples of this are the First and Second Horse at Westbury, one of the most famous and well known of all hill figures of England.The first Westbury figure is believed, according to investigations in the 1700s, to have been an antique folly. This very bizarre behavior was contagious amongst certain wealthy landowners in the 1700s. These landowners made claim to possess or discover various objects of antiquity on their land. In some cases, a cairn, burial mound or hill figure would suddenly be “discovered” as was the case at Westbury. Many of these claims would at the time go unchallenged since local tenants would not want to upset their wealthy and influential landlords. It may have been for the simple fact that the more rational thinkers of the population saw it for what it was and that it was a frivolous act that occupied much valuable land. An investigation in 1742 with local people put the creation of the first horse around 1700 or as the investigation quoted “wrought within memory of persons still living or recently dead”. The fact was that this “antique horse” 1778 was willingly destroyed in 1778 on the orders of the landowner and was quickly remodeled by a certain Mr Gee. Perhaps this proves that maybe they knew more of the horse’s origin and that its claims to be of an older age were untrue.The case of the nearby Cherill Horse (alternatively known as the Oldbury Horse due to its proximity to the nearby castle of the same name) in Wiltshire is another example of this strange behavior. It can be seen with the naked eye from the top of the hill above the Westbury Horse. It was designed by a Dr Alsop two years after the restoration of its relation in Westbury. This restoration allegedly gave him his inspiration, most probably combined with puerile jealousy “of that landowner has one got one, then I want one too.”  To sum up the witnesses at the time Alsop was referred to by local townsfolk as “the mad doctor,” due to the unnatural preoccupation of carving a giant white horse on a Wiltshire slope whilst shouting instructions and directions to his workers from a megaphone!Many more in Wiltshire were to follow, most of which are accompanied by various conflicting accounts. Perhaps the act of turf cutting was becoming tiresome as others were appearing at Pewsey, Alton Barnes and Broad Town, and few people may not have the sense of urgency or importance to produce a correct account of these events. Many perhaps naturally thought that these figures were unlikely to remain permanent features as land after all was a valuable resource. In the latter case they were mistaken because many of these varying models prevail today.Another example of whimsicality in a completely different location, is the Kilburn Horse of Yorkshire, one of only a few hill figures present in the North of England. It was carved under the whim of a travelling businessperson called Thomas Taylor. He was inspired, after being present and witnessing the festivities during the scouring and maintenance of the Uffington Horse, to carve a White Horse in his own home county and in 1857 he did just this. The horse can still be seen today in Yorkshire in the Hambleton Hills, Thirsk.There are two modern examples of surprising appearances on our hillsides. One happened in the 1980s and that is the case of the Luzley Horse near Manchester. It is now lost after being allowed to be overgrown by vegetation, but its origins can be easily researched, and its story found in local paper archives. It was carved by a retired railway worker William Rawsthorne. He hid his work as he gradually worked on his figure over a period then surprised the local inhabitants by unveiling it one night to surprise them as a new day greeted them. It received a mixed reaction and it is now lost. Another example is the case of the Laverstock Panda that has all but disappeared. It appeared in the early hours of January 1969 as part of a student prank known as “rag week” by the undergraduates of North Wales College at Bangor. All kinds of explanations were offered such as this Panda served as a homing device for Soviet Satellites and that it was a celebration of East-West co-operation over the London Panda called Chi-Chi (by the London and Moscow Zoo) who brought the two Pandas together for mating purposes. This is normal in studying the history of hill figures - in the absence of any solid facts the most outlandish explanations appear over time or almost immediately to fill the void, while often dismissing the more prosaic and usually correct explanations. ConclusionThere is very little mystery about Britain’s hill figures that trouble historians’ or archaeologists’ heads. There are some that do lack any solid explanation; however, does that really create a mystery? Morris Marples, who was the leading authority on the subject, aptly summed up the overarching motive for their origins, their continued existence and creation. While he was discussing the Uffington Horse he stated that “man has always like to commemorate his achievements by the erection of some distinct monument and this is assuredly a very effective monument as later imitators realized.”  This is certainly true of many of the hill side artworks we know about, especially those made in the twentieth century.Aside from the focus of the English monarchy and the Great War there exist further examples with further motives such as the Dover Castle Aeroplane of 1909 that celebrated Louis Bleriot’s first crossing of the English Channel and the second White Horse in Devises, Wiltshire carved in 1999 that marked the coming of the millennium. Marples was right in that man does enjoy celebrating and always seeks to leave a lasting imprint showing his efforts, sacrifices, and achievements in expressive and grandiose ways - so there is no reason to assume that our ancestors were any different. We just do not have the benefit of history being recorded.Hill figures are no different in purpose from say a cenotaph, a plaque, a stone cross, monument, or even a specific building being named in honor of a person or event. Therefore, for those few that pose us minor mysteries we can at best only be satisfied with a close approximation of the truth. We should as Marples said accept the “simplest answer as it is usually the correct one.”The art of hill cutting continues today but less frequently and with a more muted response. Like our ancestors we also have day to day things that pre-occupy us while these activities are undertaken. In Leicester, a procession of galloping white horses is cut into a main roundabout, and in a school in Devises a smaller copy of the town’s famous horse has been cut into the school playing fields. Whatever the motive there is no argument that these figures make the landscape of Britain more intriguing and a pleasure to view. Furthermore, by diligently maintaining them we will continue to remember their significance in our history. The site has been offering a wide variety of high-quality, free history content since 2012. If you’d like to say ‘thank you’ and help us with site running costs, please consider donating here.  SourcesDiscovering Hill Figures – Kate Bergamar – 1997 – Shire PublicationsWhite Horses and other Hill Figures – Morris Marples – 1981 – Alan Sutton PublishingLost Gods of Albion - Paul Newman - 1998 – Sutton Publishing LtdThe Hill figure Homepage.co.uk – Dr Mark Howes",
    "author": "George Levrier-Jones",
    "published": "Sun, 03 Nov 2024 22:15:41 +0000",
    "image": "https://images.squarespace-cdn.com/content/v1/50adfa2ae4b0cc1d786569eb/3618035e-a16f-4ba7-9a8c-010004b3457f/20241102+Uffington-White-Horse-sat.jpg?format=1000w",
    "source": "https://www.historyisnowmagazine.com/blog?format=RSS",
    "categories": [
      "Blog Post"
    ]
  },
  {
    "id": "08a8c58b-51c5-497c-b4d9-7969e56a9e4e",
    "title": "A History of Settlements",
    "link": "https://www.npr.org/2024/10/31/1210938589/throughline-a-history-of-settlements",
    "description": "The question of settlements has loomed over the Israeli-Palestinian conflict for decades, and has only intensified in the past year. According to a UN report, since October 7, 2023, there has been a record surge in settlement activities and increased settler violence against Palestinians. Today on the show: how the settlement movement grew from a small religious mission to one of the central tenets of the current Israeli government. It's a story that intersects with other topics we've covered in our series relating to this conflict – the history of Hamas, the rise of the Israeli right wing, Hezbollah, and Zionism.To access bonus episodes and listen to Throughline sponsor-free, subscribe to Throughline+ via Apple Podcasts or at plus.npr.org/throughline.Learn more about sponsor message choices: podcastchoices.com/adchoicesNPR Privacy Policy",
    "author": "",
    "published": "Thu, 31 Oct 2024 07:00:59 +0000",
    "image": "https://chrt.fm/track/138C95/prfx.byspotify.com/e/play.podtrac.com/npr-510333/traffic.megaphone.fm/NPR6435726156.mp3?d=3246\u0026size=51946981\u0026e=1210938589\u0026t=podcast\u0026p=510333",
    "source": "https://feeds.npr.org/510333/podcast.xml",
    "categories": null
  },
  {
    "id": "8e6d2259-6d76-4a08-a4a3-accf4c59bd5d",
    "title": "The Swing State Power Brokers",
    "link": "https://www.npr.org/2024/10/24/1210938360/throughline-swing-state-power-brokers",
    "description": "Today on the show, two stories of building power in swing states: from the top down, and the bottom up.First, how a future Supreme Court justice helped launch a program to challenge voters at the Arizona polls in the early 1960s, in a county that's become a hotbed for election conspiracies in the decades since. Then, how a 1973 labor strike led by Arab Americans in a Michigan factory town sparked a political movement that could play a major role in the 2024 election.This story is part of \"We, The Voters,\" NPR's election series reported from the seven swing states that will most likely decide the 2024 election.Learn more about sponsor message choices: podcastchoices.com/adchoicesNPR Privacy Policy",
    "author": "",
    "published": "Thu, 24 Oct 2024 07:00:59 +0000",
    "image": "https://chrt.fm/track/138C95/prfx.byspotify.com/e/play.podtrac.com/npr-510333/traffic.megaphone.fm/NPR8737859954.mp3?d=3044\u0026size=48717828\u0026e=1210938360\u0026t=podcast\u0026p=510333",
    "source": "https://feeds.npr.org/510333/podcast.xml",
    "categories": null
  }
]
