[
  {
    "id": "d0e119db-f90b-4750-a0c7-79c77cc8520d",
    "title": "Where the Crawdads Sing",
    "link": "https://wokeread.home.blog/2020/11/01/where-the-crawdads-sing/",
    "description": "Book Review Author :Delia Owens Genre: Historical Fiction Publisher : GP Putnam’s Sons Year of Publication: 2019 Number of Pages: 368 My Rating : 4 out of 5 I picked this up with a bit of hesitation. In spite of the great reviews that it got, I must say the title made me expect something … Continue reading Where the Crawdads Sing →",
    "author": "Wokeread",
    "published": "Sun, 01 Nov 2020 09:30:18 +0000",
    "image": "https://0.gravatar.com/avatar/932f6cd6556c64ac45f5167109f4cf52098129ff733ab35bc08a077ba14ab3f5?s=96\u0026d=identicon\u0026r=G",
    "source": "https://wokeread.home.blog/feed/",
    "categories": [
      "Blog",
      "Book Reviews# Crawdads# Delia Owens# Historical Fiction"
    ]
  },
  {
    "id": "ecd21175-daa7-47fd-9699-f9b1e03aa844",
    "title": "North and South",
    "link": "https://wokeread.home.blog/2020/06/07/north-and-south/",
    "description": "Classics Book Review Author : Elizabeth Gaskell Genre : Literary Classic Fiction Original Publisher : Chapman and Hall Year of Publication : 1854 Number of Pages : 396 My Rating : 5 out of 5 My most recent read is this gem of a book by Elizabeth Gaskell, based in Victorian England. Margaret Hale is … Continue reading North and South →",
    "author": "Wokeread",
    "published": "Sun, 07 Jun 2020 13:53:14 +0000",
    "image": "https://0.gravatar.com/avatar/932f6cd6556c64ac45f5167109f4cf52098129ff733ab35bc08a077ba14ab3f5?s=96\u0026d=identicon\u0026r=G",
    "source": "https://wokeread.home.blog/feed/",
    "categories": [
      "Blog",
      "Classics",
      "#book review",
      "#Classics Review",
      "#ClassicsClub",
      "#Elizabeth Gaskell",
      "#North and South"
    ]
  },
  {
    "id": "f055ed66-30db-47c8-90c2-be590efa64fd",
    "title": "Letter from Aestas",
    "link": "https://aestasbookblog.com/letter-from-aestas/",
    "description": "After a decade of reading and reviewing books, I’ve decided that it’s time for me to take a step back from blogging. Running this book blog has been such a huge and wonderful part of my life. I’ve written over 600 book reviews and loved the experience of getting to share my love of reading ...Read More  \u003e",
    "author": "Aestas",
    "published": "Thu, 09 Jun 2022 17:23:47 +0000",
    "image": "https://s.w.org/images/core/emoji/13.1.0/72x72/2764.png",
    "source": "https://aestasbookblog.com/feed/",
    "categories": [
      "Latest New Releases"
    ]
  },
  {
    "id": "4f97316d-3703-4512-9563-ecefb0e07070",
    "title": "Latest Book News — January 10, 2022",
    "link": "https://aestasbookblog.com/latest-book-news-january-10-2022/",
    "description": "BOOKWORM NEWS: Juniper Hill by Devney Perry is now live!! — “Memphis Ward arrives in Quincy, Montana, on the fifth worst day of her life. She needs a shower. She needs a snack. She needs some sanity. Because moving across the country with her newborn baby is by far the craziest thing she’s ever done. ...Read More  \u003e",
    "author": "Aestas",
    "published": "Tue, 11 Jan 2022 19:52:45 +0000",
    "image": "https://aestasbookblog.com/wp-content/uploads/2021/11/JUNIPER-HILL-sm.png",
    "source": "https://aestasbookblog.com/feed/",
    "categories": [
      "Latest New Releases"
    ]
  },
  {
    "id": "4d049a41-da0e-4e6f-b60c-8d4b9bbaad83",
    "title": "VALUING ONLY US",
    "link": "https://www.kirkusreviews.com/book-reviews/cory-desmond-wolfe/valuing-only-us/",
    "description": "When investment bank Kauffman Schwartz passes out innovator awards, wealth advisor Ted Sullivan goes home empty-handed. The plan had been for both Ted and his friend, investment banker Alec Young, to win in their respective divisions at the Arizona company; that would have been a great selling point for their future private equity firm, Sullivan Young, which has been their dream since they met six years earlier as KS interns. They’ve also been lovers for some time but have kept their romance a secret. (While Ted is openly gay, Alec hides his own sexuality from his conservative family, which includes an abusive father.) Complicating matters, Alec is also dating Emma Peterson, whom he’s using to get access to her “consulting titan” dad—this is another element of Ted and Alec’s long-term strategy to get investments for Sullivan Young. The two are fully aware that they may have to resort to cutthroat means, such as when handling Ted’s colleague, the “innovator” who wins and flaunts the award that Ted wants. Most of the people surrounding them are just as ruthlessly ambitious as they lie, deceive, and sometimes commit outright crimes. In many instances, when Ted and Alec feel as if everything is on track, something unexpected throws them off course. But when one particular event forces them to accelerate their plan, there’s no turning back; either their dream will become a reality or they’ll lose it all. Wolfe effectively develops two strong leads. They come from drastically different backgrounds: Ted grew up on an Oklahoma farm and Alec’s father runs a successful business selling industrial machinery. At times, they seem avaricious; Sullivan Young focuses on green energy not to benefit the environment but because “there is money to be made in alternative energy.” But these two, who clearly love one another, are more devious than malicious, and many of the sneaky things they do are in response to someone else’s arguably worse offense. (That, however, may change as they move closer to their goal.) While Alec has suffered hardships in his past, the portrayal of Ted feels more intimate, exemplified by his first-person narration alternating with Alec’s third-person perspective. (Ted is haunted by a dark secret that gradually comes to light, and he struggles to overcome self-esteem issues.) Although many of the characters are unsavory, especially in the latter half, two are welcome exceptions: Ted’s ever-sympathetic cousin Dana and Alec’s warmhearted younger sister Alice. The author rounds out the narrative with memorable visual descriptions, as when he equates relief with “witnessing the emergency helicopter swoosh in after being stranded on a mountaintop, inundated by spiteful snakes and cold-blooded reptiles.” This all leads to a final act and an ending that readers won’t likely forget anytime soon.",
    "author": "",
    "published": "",
    "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/408e36538e4f4dce97988165d1537d8f/684cc25bea1f45b39825e3c36cce5df5.jpeg.180x0_q85_autocrop.jpg",
    "source": "https://www.kirkusreviews.com/feeds/rss/",
    "categories": null
  },
  {
    "id": "d0a1012d-56b2-460f-a8e0-f60122727093",
    "title": "SUNDAY",
    "link": "https://www.kirkusreviews.com/book-reviews/marcelo-tolentino/sunday-2/",
    "description": "Every Sunday, Martin, his parents, and his dog, Maize, go to his grandparents’ house. Every visit is the same; bored one day, Martin decides to “[step] out into the unknown.” In detailed, action-packed double-page spreads in muted colors, Martin and Maize trek across several landscapes, from the “freezing cold of ice caps” to the “baking heat of lava flows.” Their epic adventures turn out to be a rousing game of make-believe; exhausted after a day of play, Martin eagerly anticipates filling his family members in on all his exploits. Eagle-eyed readers will realize that this is an imaginative journey, with several objects from around the house, seen in earlier spreads, ingeniously included in Martin’s daydreams. His mother’s Bundt cake becomes a volcano leaving hot lava trails, while the “arid desert” is his grandpa’s sleeping face. Cross-hatching and detailed shading give the tale a charmingly retro feel. Originally published in Brazil and translated into English, this tale uses clever wordplay in conjunction with the art to further call back to the previously seen items (at one point, we’re told that the boy and the canine are “within an arm’s length of sacred creatures”—a reference to Martin’s father’s dragon tattoo sleeve). Readers will eagerly return again and again to get lost in Tolentino's sumptuous landscapes. Martin and his family are light-skinned.",
    "author": "",
    "published": "",
    "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/47b92fbd05334250ab2660f464f2cf86/0a77443efaf74aa5805a134ba033e58f.jpg.180x0_q85_autocrop.jpg",
    "source": "https://www.kirkusreviews.com/feeds/rss/",
    "categories": null
  },
  {
    "id": "d2afcfe1-5423-4811-b4c3-2b0bd2f80d45",
    "title": "Book of the month: Kim Leine",
    "link": "https://ayearofreadingtheworld.com/2024/12/23/book-of-the-month-kim-leine/",
    "description": "This novel was a recommendation from leading English-Danish translator Signe Lyng. After we met at the Dublin Book Festival in November, she generously sent me a list of recent Danish-language novels that she admires, including Niviaq Korneliussen’s Last Night in Nuuk and Solvej Balle’s On the Calculation of Volume. One of Lyng’s suggestions stood out […]",
    "author": "Ann Morgan",
    "published": "Mon, 23 Dec 2024 12:40:26 +0000",
    "image": "https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2024/12/52695486065_e6dfcd5dc2_b.jpg?resize=550%2C413\u0026ssl=1",
    "source": "https://ayearofreadingtheworld.com/feed/",
    "categories": [
      "Book of the month",
      "Europe",
      "Post-world",
      "The stories",
      "book review",
      "books",
      "colonialism",
      "culture",
      "Danish",
      "Greenland",
      "history",
      "Kim Leine",
      "Martin Aitken",
      "translation"
    ]
  },
  {
    "id": "a57b4f77-cda1-4a45-a75f-c68db414d800",
    "title": "Book of the month: Angèle Rawiri",
    "link": "https://ayearofreadingtheworld.com/2024/11/26/book-of-the-month-angele-rawiri/",
    "description": "This was a recommendation from Suroor Alikhan, who kindly invited me to be part of the Hyderabad Literature Festival Online series earlier this year and wrote about our event on her blog. Suroor is an extremely widely read person, so I knew when she suggested Gabonese author Angèle Rawiri’s The Fury and Cries of Women, […]",
    "author": "Ann Morgan",
    "published": "Tue, 26 Nov 2024 16:30:12 +0000",
    "image": "https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2024/11/image.png?resize=300%2C464\u0026ssl=1",
    "source": "https://ayearofreadingtheworld.com/feed/",
    "categories": [
      "Africa",
      "Book of the month",
      "Angèle Rawiri",
      "book review",
      "books",
      "culture",
      "feminism",
      "Gabon",
      "infertility",
      "novel",
      "politics",
      "translation"
    ]
  },
  {
    "id": "8f0213ed-a823-4829-a533-35fd244530a1",
    "title": "RISE: The Annual Best Feminist Books for Children, Tweens, and Teens List Is Here",
    "link": "https://bookriot.com/rise-feminist-books-2025/",
    "description": "Every January, readers who love books for children, tweens, and teens get excited about the annual awards and “best of” ...",
    "author": "Community",
    "published": "Thu, 23 Jan 2025 18:12:18 +0000",
    "image": "https://s2982.pcdn.co/wp-content/uploads/2025/01/rise-logo.jpg.webp",
    "source": "https://bookriot.com/feed/",
    "categories": [
      "News"
    ]
  },
  {
    "id": "f62491f0-3fdd-4e75-9396-32ce99801f64",
    "title": "The National Book Critics Circle Award Finalists Announced",
    "link": "https://bookriot.com/the-national-book-critics-circle-award-finalists-announced/",
    "description": "Awards lists galore.",
    "author": "Jeff O'Neal",
    "published": "Thu, 23 Jan 2025 17:15:37 +0000",
    "image": "https://s2982.pcdn.co/wp-content/uploads/2025/01/Untitled-7.png.webp",
    "source": "https://bookriot.com/feed/",
    "categories": [
      "Today in Books"
    ]
  },
  {
    "id": "3263bf78-2892-4627-b086-7b4c16138e15",
    "title": "Interview with J.L. Hancock, Author of The Spear and the Sentinel",
    "link": "https://www.newinbooks.com/interview-with-j-l-hancock-author-of-the-spear-and-the-sentinel/",
    "description": "Sign up for our email and we’ll send you the best new books in your favorite genres weekly. The post Interview with J.L. Hancock, Author of The Spear and the Sentinel appeared first on NewInBooks.",
    "author": "meghan",
    "published": "Wed, 22 Jan 2025 17:06:26 +0000",
    "image": "",
    "source": "https://www.newinbooks.com/feed/",
    "categories": [
      "Author Interviews",
      "eBook",
      "News"
    ]
  },
  {
    "id": "83654c31-58f4-4f6c-9654-33a70f7ec8bc",
    "title": "Interview with Bruce Gardner, Author of The Rocket Man’s Daughter",
    "link": "https://www.newinbooks.com/interview-with-bruce-gardner-author-of-the-rocket-mans-daughter/",
    "description": "Sign up for our email and we’ll send you the best new books in your favorite genres weekly. The post Interview with Bruce Gardner, Author of The Rocket Man’s Daughter appeared first on NewInBooks.",
    "author": "meghan",
    "published": "Wed, 22 Jan 2025 16:15:39 +0000",
    "image": "",
    "source": "https://www.newinbooks.com/feed/",
    "categories": [
      "Author Interviews",
      "eBook",
      "News"
    ]
  }
]
