[
  {
    "id": "33f1f803-be8e-4a1d-a34c-d537a57b7275",
    "title": "Where the Crawdads Sing",
    "link": "https://wokeread.home.blog/2020/11/01/where-the-crawdads-sing/",
    "description": "Book Review Author :Delia Owens Genre: Historical Fiction Publisher : GP Putnam’s Sons Year of Publication: 2019 Number of Pages: 368 My Rating : 4 out of 5 I picked this up with a bit of hesitation. In spite of the great reviews that it got, I must say the title made me expect something … Continue reading Where the Crawdads Sing →",
    "author": "Wokeread",
    "published": "Sun, 01 Nov 2020 09:30:18 +0000",
    "image": "https://0.gravatar.com/avatar/932f6cd6556c64ac45f5167109f4cf52098129ff733ab35bc08a077ba14ab3f5?s=96\u0026d=identicon\u0026r=G",
    "source": "https://wokeread.home.blog/feed/",
    "categories": [
      "Blog",
      "Book Reviews# Crawdads# Delia Owens# Historical Fiction"
    ]
  },
  {
    "id": "9031fc43-c0d2-4f4e-b0cb-2dc75c658d0a",
    "title": "North and South",
    "link": "https://wokeread.home.blog/2020/06/07/north-and-south/",
    "description": "Classics Book Review Author : Elizabeth Gaskell Genre : Literary Classic Fiction Original Publisher : Chapman and Hall Year of Publication : 1854 Number of Pages : 396 My Rating : 5 out of 5 My most recent read is this gem of a book by Elizabeth Gaskell, based in Victorian England. Margaret Hale is … Continue reading North and South →",
    "author": "Wokeread",
    "published": "Sun, 07 Jun 2020 13:53:14 +0000",
    "image": "https://0.gravatar.com/avatar/932f6cd6556c64ac45f5167109f4cf52098129ff733ab35bc08a077ba14ab3f5?s=96\u0026d=identicon\u0026r=G",
    "source": "https://wokeread.home.blog/feed/",
    "categories": [
      "Blog",
      "Classics",
      "#book review",
      "#Classics Review",
      "#ClassicsClub",
      "#Elizabeth Gaskell",
      "#North and South"
    ]
  },
  {
    "id": "7a9d81d2-afb5-43d8-9d02-0ba8253df08c",
    "title": "The Biggest Bookish News We Covered This Week",
    "link": "https://bookriot.com/today-in-books-july-13-2025/",
    "description": "The bestselling books of the year so far, our best books of the year so far, anti-Prime days, an exciting new adaptation, and more.",
    "author": "S. Zainab Williams",
    "published": "Sun, 13 Jul 2025 15:00:00 +0000",
    "image": "https://s2982.pcdn.co/wp-content/uploads/2025/04/newspapers-in-loose-stack.jpg.webp",
    "source": "https://bookriot.com/feed/",
    "categories": [
      "Today in Books"
    ]
  },
  {
    "id": "416722db-9647-4a5d-827b-e9c0f6b8b5b3",
    "title": "Book Riot’s Deals of the Day for July 13, 2025",
    "link": "https://bookriot.com/book-riots-deals-of-the-day-for-july-13-2025/",
    "description": "A journey through African American culinary history, dodging a matchmaking scheme, a battle for survival on a terraformed planet, and more of today's best book deals",
    "author": "Deals",
    "published": "Sun, 13 Jul 2025 11:30:00 +0000",
    "image": "https://s2982.pcdn.co/wp-content/uploads/2025/07/deals-71325.jpg.webp",
    "source": "https://bookriot.com/feed/",
    "categories": [
      "Book Deals"
    ]
  },
  {
    "id": "b80dad0c-9a8e-4749-b344-dae2e18cc3e9",
    "title": "Letter from Aestas",
    "link": "https://aestasbookblog.com/letter-from-aestas/",
    "description": "After a decade of reading and reviewing books, I’ve decided that it’s time for me to take a step back from blogging. Running this book blog has been such a huge and wonderful part of my life. I’ve written over 600 book reviews and loved the experience of getting to share my love of reading ...Read More  \u003e",
    "author": "Aestas",
    "published": "Thu, 09 Jun 2022 17:23:47 +0000",
    "image": "https://s.w.org/images/core/emoji/13.1.0/72x72/2764.png",
    "source": "https://aestasbookblog.com/feed/",
    "categories": [
      "Latest New Releases"
    ]
  },
  {
    "id": "710ff0f6-6bf7-4d72-881a-aa599c9dc16e",
    "title": "Latest Book News — January 10, 2022",
    "link": "https://aestasbookblog.com/latest-book-news-january-10-2022/",
    "description": "BOOKWORM NEWS: Juniper Hill by Devney Perry is now live!! — “Memphis Ward arrives in Quincy, Montana, on the fifth worst day of her life. She needs a shower. She needs a snack. She needs some sanity. Because moving across the country with her newborn baby is by far the craziest thing she’s ever done. ...Read More  \u003e",
    "author": "Aestas",
    "published": "Tue, 11 Jan 2022 19:52:45 +0000",
    "image": "https://aestasbookblog.com/wp-content/uploads/2021/11/JUNIPER-HILL-sm.png",
    "source": "https://aestasbookblog.com/feed/",
    "categories": [
      "Latest New Releases"
    ]
  },
  {
    "id": "240cbfb2-12b5-4237-b3f8-e89cae5862f1",
    "title": "What is the future of English studies?",
    "link": "https://ayearofreadingtheworld.com/2025/07/07/whats-is-the-future-of-english-studies/",
    "description": "Last Thursday, I had the unusual experience of giving a paper at an academic conference. The event was about the future of English studies, and I was there because of a call for papers put out in association with Wasafiri magazine, a British publication championing international contemporary writing. I suggested that I might speak about […]",
    "author": "Ann Morgan",
    "published": "Mon, 07 Jul 2025 13:45:42 +0000",
    "image": "https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2025/07/49919941938_bbd54ebc1c_k.jpg?resize=550%2C367\u0026ssl=1",
    "source": "https://ayearofreadingtheworld.com/feed/",
    "categories": [
      "The stories",
      "books",
      "conference",
      "culture",
      "English studies",
      "literature",
      "reading",
      "translation",
      "university",
      "world literature"
    ]
  },
  {
    "id": "dfa8bce7-261a-46d9-b539-10a1bd4465dc",
    "title": "Book of the month: Tahir Hamut Izgil",
    "link": "https://ayearofreadingtheworld.com/2025/06/30/book-of-the-month-tahir-hamut-izgil/",
    "description": "‘I’ve got a book I think you’d like,’ said bookseller Erin when I wandered into my local bookshop, The Folkestone Bookshop, a few weeks back. They were right. Waiting to Be Arrested at Night, translated by Joshua L. Freeman, is a memoir by Tahir Hamut Izgil, one of the leading contemporary Uyghur poets. It tells […]",
    "author": "Ann Morgan",
    "published": "Mon, 30 Jun 2025 10:17:47 +0000",
    "image": "https://i0.wp.com/ayearofreadingtheworld.com/wp-content/uploads/2025/06/IMG_8252.jpg?resize=550%2C576\u0026ssl=1",
    "source": "https://ayearofreadingtheworld.com/feed/",
    "categories": [
      "Asia",
      "Book of the month",
      "The stories",
      "book review",
      "books",
      "China",
      "culture",
      "memoir",
      "refugee",
      "Tahir Hamut Izgil",
      "translation",
      "Uyghur"
    ]
  },
  {
    "id": "98c7cc50-8021-486e-bcc5-fdeae4de14b8",
    "title": "The Future Isn’t Ready: Must-Read Fantasy \u0026 Sci-Fi Books",
    "link": "https://www.newinbooks.com/the-future-isnt-ready-for-you-must-read-fantasy-sci-fi-books/",
    "description": "The Future Isn’t Ready for You: Must-Read Fantasy \u0026 Sci-Fi Books The future is closer than you think. These sci-fi reads explore genetic breakthroughs, rogue AI, and fractured societies on the edge of collapse. Smart, intense, and deeply human, they’ll leave you questioning what’s next. Augury of Blood (Legacy of... Read More The post The Future Isn’t Ready: Must-Read Fantasy \u0026 Sci-Fi Books appeared first on NewInBooks.",
    "author": "zaida",
    "published": "Fri, 11 Jul 2025 14:44:46 +0000",
    "image": "",
    "source": "https://www.newinbooks.com/feed/",
    "categories": [
      "Books to Read if You Like...",
      "eBook",
      "Fantasy \u0026 Science Fiction",
      "News"
    ]
  },
  {
    "id": "c7c067cb-a0d8-4cee-9763-b45af87f0d9c",
    "title": "Becoming Who You Are: Young Adult Books That Hit Deep",
    "link": "https://www.newinbooks.com/becoming-who-you-are-young-adult-books-that-hit-deep/",
    "description": "Becoming Who You Are: Young Adult Books That Hit Deep From identity crises to quiet revolutions, these stories are about teens becoming their truest selves. Some fight the system, others fight their own fears, but all come out braver on the other side. The ADHD Advantage by Yvonne Joseph Release... Read More The post Becoming Who You Are: Young Adult Books That Hit Deep appeared first on NewInBooks.",
    "author": "zaida",
    "published": "Fri, 11 Jul 2025 13:37:50 +0000",
    "image": "",
    "source": "https://www.newinbooks.com/feed/",
    "categories": [
      "Books to Read if You Like...",
      "eBook",
      "News",
      "Young Adult"
    ]
  },
  {
    "id": "69347a1d-b9c8-4907-a2ce-29b6e5acd585",
    "title": "Misfit’s Magic: Twisting in Time",
    "link": "https://www.kirkusreviews.com/book-reviews/fred-gracely-1/misfits-magic-twisting-in-time/",
    "description": "Fourteen-year-old Goff, having faced off against a dark wizard, is ready to enjoy his days at a boarding school. Elsewhere, his “magical friends from past adventures,” Bones and Maxim, find and inadvertently activate a Time Lock. Around the campus, Goff, his romantic interest, and his best friends all vanish with a “pop.” The story then moves to a past era—the kingdom of Slaathwick, in which Goffren works in the Royal Kitchen. When he delivers food to a royal, the result is unexpectedly lethal, and reputed murderer Goffren lands in the dungeon. Luckily, his friends, from performer assistant Lydianna to potions apprentice Halstrohm, help him escape and prove his innocence. That entails making their way to an eerie castle on an even spookier island. They also stumble on someone’s diabolical plan to overthrow the kingdom, which they can thwart by warning the royal family—preferably without getting tossed in the dungeon, or worse. Gracely practically sprints through the present-day opening, and readers unfamiliar with the earlier installments will likely get confused. But once in Slaathwick, the similarly named characters (for example, Lydia becomes Lydianna) are essentially brand new, with their own backstories. This lengthy (over 370 pages) but well-written adventure is consistently thrilling. Goffren, Lydianna, and Halstrohm pass through a dark forest, deal with gargoyles and various other creatures, and experience heaps of magic. The magic even involves Goffren. He’s secretly a magic-capable Verlokken—a being who, according to a minstrel’s song, should be feared. In addition, recurring scenes with Bones, who’s an actual skeleton, and Maxim, a cat, are fun. The two watch everything unfold via the Time Lock, and Maxim must insist that Bones not help their friends in peril. The benevolent action could “cause a breach in the time continuum that turns everything on its head.” While the final act offers some resolution, it’s aimed more at setting up another installment.",
    "author": "",
    "published": "",
    "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/c5222dd03fd14d26bafffa8659e543f7/a3f333f0883842849606c98931d66363.jpeg.180x0_q85_autocrop.webp",
    "source": "https://www.kirkusreviews.com/feeds/rss/",
    "categories": null
  },
  {
    "id": "87ea97b1-11ff-4073-ae78-fa00302f9b5c",
    "title": "JOURNEY BEYOND THE YELLOW BRICK ROAD",
    "link": "https://www.kirkusreviews.com/book-reviews/eboni-ivory-green/journey-beyond-the-yellow-brick-road-finding-your-emotional-home-as-a-caregiver/",
    "description": "The Wizard of Oz and its adaptation, The Wiz, are employed as metaphors for the caregiving experience in this self-help book. The author is a registered nurse and tells us that much like landing in Oz, assuming a caregiving role involves “all sorts of new customs, expectations, relationship dynamics, challenges, and personal insecurities to navigate. And it can feel like everyone knows the landscape but you.” The book is meant to evoke the proverbial yellow brick road, leading readers “home” in a sense. Divided into six sections, the book covers how to map a path forward, cultivate self-love and compassion, embrace acceptance, harness the power of intuition, adapt in the face of change, and find joy amid challenges. Green recommends delegating tasks based on one’s strengths and drafting a personal mission statement to create achievable goals. To foster a positive mindset, the author advises treating yourself like a friend and emphasizes the importance of working through grief, anger, trauma, and anxiety. Green offers strategies for overcoming human and circumstantial roadblocks, such as pausing for reflection or connecting with those facing similar challenges. Asking for what you want, like Dorothy did with the wizard, is among Green’s pithy Oz-referencing communication tips. Green also explores the symptoms of resilience fatigue and strategies to overcome it and concludes with encouragement for finding inner joy. This comprehensive book combines anecdotes, reflection exercises, goal-setting prompts, and practical strategies to help readers create a personalized roadmap toward authentic and healthy caregiving. Readers seeking increased self-awareness will appreciate the ample opportunities for written reflection. The book’s design, including charts, section dividers, and shaded text boxes, makes for an engaging reading experience. The Wizard of Oz metaphor is appropriate for the most part but doesn’t strengthen the author’s often generic advice, like taking up shopworn self-help activities like journaling and mindfulness. High-gloss AI-generated images of glamorous people feel jarringly out of sync with the vintage Hollywood aesthetic and a caregiving audience.",
    "author": "",
    "published": "",
    "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/9f84b727fd3648a5a20c31750f5f16af/4a3d633c34d443b4b85508374c2237db.jpeg.180x0_q85_autocrop.webp",
    "source": "https://www.kirkusreviews.com/feeds/rss/",
    "categories": null
  }
]
