{
  "id": "0489b0d8-d995-40e4-8c68-3367199a171b",
  "title": "A FRIEND OF DOROTHY'S",
  "link": "https://www.kirkusreviews.com/book-reviews/richard-willett/a-friend-of-dorothys/",
  "description": "Willett’s novel unfolds in Manhattan circa 1986, where 27-year-old bookstore supervisor Eric Summerfield feels himself a failure as a gay man: He dresses unstylishly, stays home watching TV with his cat at night because he finds socializing an ordeal, and is so awkward during sex that he’s been celibate for four years. Bookstore clerk Dale Corcoran, a flamboyant social butterfly, is Eric’s only friend, but he undermines Eric so consistently—he invites him to a party, then greets him at the door with “you look a little haggard”—that Eric starts avoiding him, too. But when Dale contracts AIDS and is abandoned by friends and estranged from his family, he calls Eric for help in dealing with the ravages of the illness. Fighting his urge to flee, Eric nurses Dale through vomiting and diarrhea, hospitalizations, progressive blindness, creeping dementia, and relentless wasting—and finds that the burden fitfully drags him out of his isolation and reinvests him in life. (Further perking him up is Dale’s replacement, a gorgeous young man who is ostensibly straight but seems to hint at other proclivities.) Willett depicts Dale’s illness in unflinching detail but avoids maudlin sentimentality—almost until the end, Dale remains a spirited, bitchy, shrewd, and charismatic man, and his and Eric’s recollections paint a vibrant portrait of gay life in the late 1970s. Writing with a hangdog wit (“was it maybe true that the only way Eric could feel relaxed at a party was if the host had a terminal illness?”), Willett manages the difficult task of making an AIDS story funny; then, through a skillful accretion of matter-of-fact details, he vividly conveys the pathos of Dale’s decline and Eric’s fumbling, tender response. Readers will be laughing through their tears.",
  "author": "",
  "published": "",
  "source": "https://www.kirkusreviews.com/feeds/rss/",
  "categories": null,
  "byline": "by Alison Espach",
  "length": 4890,
  "excerpt": "A gay man gets roped into taking care of an obstreperous, AIDS-stricken co-worker and finds the drudgery unexpectedly fulfilling in this mordantly funny coming-of-age novel.",
  "siteName": "Kirkus Reviews",
  "favicon": "",
  "text": "THE WEDDING PEOPLE by Alison Espach ‧ RELEASE DATE: July 30, 2024 Uneven but fitfully amusing. Awards \u0026 Accolades Likes 121 Our Verdict GET IT New York Times Bestseller Betrayed by her husband, a severely depressed young woman gets drawn into the over-the-top festivities at a lavish wedding. Phoebe Stone, who teaches English literature at a St. Louis college, is plotting her own demise. Her husband, Matt, has left her for another woman, and Phoebe is taking it hard. Indeed, she's determined just where and how she will end it all: at an oceanfront hotel in Newport, where she will lie on a king-sized canopy bed and take a bottle of her cat’s painkillers. At the hotel, Phoebe meets bride-to-be Lila, a headstrong rich girl presiding over her own extravagant six-day wedding celebration. Lila thought she had booked every room in the hotel, and learning of Phoebe's suicidal intentions, she forbids this stray guest from disrupting the nuptials: “No. You definitely can’t kill yourself. This is my wedding week.” After the punchy opening, a grim flashback to the meltdown of Phoebe's marriage temporarily darkens the mood, but things pick up when spoiled Lila interrupts Phoebe's preparations and sweeps her up in the wedding juggernaut. The slide from earnest drama to broad farce is somewhat jarring, but from this point on, Espach crafts an enjoyable—if overstuffed—comedy of manners. When the original maid of honor drops out, Phoebe is persuaded, against her better judgment, to take her place. There’s some fun to be had here: The wedding party—including groom-to-be Gary, a widower, and his 11-year-old daughter—takes surfing lessons; the women in the group have a session with a Sex Woman. But it all goes on too long, and the humor can seem forced, reaching a low point when someone has sex with the vintage wedding car (you don’t want to know the details). Later, when two characters have a meet-cute in a hot tub, readers will guess exactly how the marriage plot resolves. Uneven but fitfully amusing. Pub Date: July 30, 2024 ISBN: 9781250899576 Page Count: 384 Publisher: Henry Holt Review Posted Online: Sept. 13, 2024",
  "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/659d2f5b6f354cdba854acb5be240e64/28f68e276936421c877091238ae7d169.jpeg.300x0_q85_autocrop.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n                                \u003ch2\u003eTHE WEDDING PEOPLE\u003c/h2\u003e\n                                \n                                \n                                \u003cp\u003e\n                                    by\n                        \u003ca href=\"https://www.kirkusreviews.com/author/alison-espach/\"\u003e\n                            Alison Espach\n                        \u003c/a\u003e\n\n                                    \u003cspan\u003e ‧\u003c/span\u003e\n                                    \u003cspan\u003eRELEASE DATE: July 30, 2024\u003c/span\u003e\n                                \u003c/p\u003e\n\n                                \u003cp\u003e\n                                    Uneven but fitfully amusing.\n                                \u003c/p\u003e\n\n                                \n\n                                \n\n                                \n                                    \n                                        \n                                            \u003cdiv data-id=\"2000259235\" data-meta-len=\"3\"\u003e\n            \u003cp\u003eAwards \u0026amp; Accolades\u003c/p\u003e\n            \n                \n                    \u003cdiv\u003e\n                            \u003cp\u003eLikes\u003c/p\u003e\n                            \u003cul\u003e\n                                \u003cli\u003e\n                                    \u003cimg src=\"https://d1fd687oe6a92y.cloudfront.net/img/kir_images/icons/like.png\" alt=\"Readers Vote\"/\u003e\n                                \u003c/li\u003e\n                                \u003cli\u003e\n                                    \u003cp id=\"2000259235-total-likes\"\u003e121\u003c/p\u003e\n                                \u003c/li\u003e\n                            \u003c/ul\u003e\n                        \u003c/div\u003e\n                \n\n                \n                    \u003chr/\u003e\n                \n            \n                \n                    \u003cdiv\u003e\n                            \u003cp\u003eOur Verdict\u003c/p\u003e\n                            \u003cul\u003e\n                                \u003cli\u003e\n                                    \u003cimg src=\"https://d1fd687oe6a92y.cloudfront.net/img/kir_images/icons/check-ok.png\" alt=\"Our Verdict\"/\u003e\n                                \u003c/li\u003e\n                                \u003cli\u003e\n                                    \u003cp\u003eGET IT\u003c/p\u003e\n                                \u003c/li\u003e\n                            \u003c/ul\u003e\n                        \u003c/div\u003e\n                \n\n                \n                    \u003chr/\u003e\n                \n            \n                \n                    \u003cdiv\u003e\n                            \u003cul\u003e\n                                \u003cli\u003e\n                                    \u003cp\u003eNew York Times Bestseller\u003c/p\u003e\n                                \u003c/li\u003e\n                            \u003c/ul\u003e\n                        \u003c/div\u003e\n                \n\n                \n            \n        \u003c/div\u003e\n                                        \n                                    \n                                \n\n                                \u003cdiv\u003e\n                                    \n                                        \u003cp\u003eBetrayed by her husband, a severely depressed young woman gets drawn into the over-the-top festivities at a lavish wedding. \u003c/p\u003e\n                                        \u003cp\u003ePhoebe Stone, who teaches English literature at a St. Louis college, is plotting her own demise. Her husband, Matt, has left her for another woman, and Phoebe is taking it hard. Indeed, she\u0026#39;s determined just where and how she will end it all: at an oceanfront hotel in Newport, where she will lie on a king-sized canopy bed and take a bottle of her cat’s painkillers. At the hotel, Phoebe meets bride-to-be Lila, a headstrong rich girl presiding over her own extravagant six-day wedding celebration. Lila thought she had booked every room in the hotel, and learning of Phoebe\u0026#39;s suicidal intentions, she forbids this stray guest from disrupting the nuptials: “No. You definitely can’t kill yourself. This is my \u003ci\u003ewedding \u003c/i\u003eweek.” After the punchy opening, a grim flashback to the meltdown of Phoebe\u0026#39;s marriage temporarily darkens the mood, but things pick up when spoiled Lila interrupts Phoebe\u0026#39;s preparations and sweeps her up in the wedding juggernaut. The slide from earnest drama to broad farce is somewhat jarring, but from this point on, Espach crafts an enjoyable—if overstuffed—comedy of manners. When the original maid of honor drops out, Phoebe is persuaded, against her better judgment, to take her place. There’s some fun to be had here: The wedding party—including groom-to-be Gary, a widower, and his 11-year-old daughter—takes surfing lessons; the women in the group have a session with a Sex Woman. But it all goes on too long, and the humor can seem forced, reaching a low point when someone has sex with the vintage wedding car (you don’t want to know the details). Later, when two characters have a meet-cute in a hot tub, readers will guess exactly how the marriage plot resolves.\u003c/p\u003e\u003cp\u003e\n                                        Uneven but fitfully amusing.\n                                        \n                                        \n                                    \n                                \u003c/p\u003e\u003c/div\u003e\n\n                                \n    \n        \n    \n\n\n                                \n\n                                \u003cdiv\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePub Date:\u003c/b\u003e July 30, 2024\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003eISBN:\u003c/b\u003e 9781250899576\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePage Count:\u003c/b\u003e 384\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003ePublisher:\u003c/b\u003e Henry Holt\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cp\u003e\u003cb\u003eReview Posted Online:\u003c/b\u003e Sept. 13, 2024\u003c/p\u003e\n                                \u003c/div\u003e\n\n                                \n\n                                \n\n\n\n\n                                \n                                    \n                                        \n                                    \n                                \n                                \n                                    \n                                    \n                                    \n                                \n                            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
