{
  "id": "198b86f5-c5a4-4ce0-b710-868addfa25bc",
  "title": "The 30 Best Nonfiction Books of the Last 3 Decades",
  "link": "https://bookriot.com/best-nonfiction-books-of-the-last-3-decades/",
  "description": "The L.A. Times' best nonfiction books of the last 30 years, a Pizza Hut! BOOK IT! grift that will melt your heart, and more.",
  "author": "S. Zainab Williams",
  "published": "Tue, 22 Apr 2025 15:30:00 +0000",
  "source": "https://bookriot.com/feed/",
  "categories": [
    "Today in Books"
  ],
  "byline": "S. Zainab Williams",
  "length": 5275,
  "excerpt": "The L.A. Times' best nonfiction books of the last 30 years, a Pizza Hut! BOOK IT! grift that will melt your heart, and more.",
  "siteName": "BOOK RIOT",
  "favicon": "https://s2982.pcdn.co/wp-content/themes/bookriot/assets/images/favicons/BookRiot_Logo_192.png.webp",
  "text": "This content contains affiliate links. When you buy through these links, we may earn an affiliate commission. S. Zainab would like to think she bleeds ink but the very idea makes her feel faint. She writes fantasy and horror, and is currently clutching a manuscript while groping in the dark. Find her on Twitter: @szainabwilliams. View All posts by S. Zainab Williams Welcome to Today in Books, our daily round-up of literary headlines at the intersection of politics, culture, media, and more. In Case You’re More of a Nonfiction Girly Yesterday, I shared about the L.A. Times list of the 30 best fiction books of the last 30 years, and today we’re taking a look at their matching list of best nonfiction reads. I read far more fiction than nonfiction, so I was initially surprised by how many of these books I’ve read, but then it occurred to me that the nonfiction books I pick up tend to be heavily vetted specifically because it takes more to get me to engage with true stories. The books on this list were hugely popular and/or big critical successes, picking up awards left and right, when they hit shelves and their significance endures. I mean, David Sedaris is one of our great living satirists and it felt like everyone was reading Me Talk Pretty One Day (#30 on the list) when it published. We’ve got another living legend–this time of both fiction and nonfiction writing–in award-winning author Jesmyn Ward whose powerful and deep memoir, Men We Reaped, placed 13th. At the top of the list, Isabel Wilkerson beat out Joan Didion for 1st place with The Warmth of Other Suns: The Epic Story of America’s Great Migration, which I really really need to get to reading because an expertly told history of a huge movement isn’t something to skip past, even if you’re more of a fiction girly. I’m Not Mad at This Pizza Hut BOOK IT! Scam I have always wondered how many people cheated Pizza Hut’s BOOK IT! program encouraging childhood literacy with kid-sized personal pizzas, but I didn’t anticipate someone actually owning up to the manipulation of such a wholesome setup. The very idea of confessing to scamming a program that holds such a pure and nostalgic place in the hearts of Millennials seemed unlikely until I read Kim Kelly’s story over at Food \u0026 Wine. She did the thing. If you’re already feeling offense creep into your heart, just read this tidbit from the piece: First stop was the county library to load up on books, since the Bookmobile only came to my village once a week and they rarely restocked the selection. After a few hours in the stacks, we’d seal the deal with a personal pan pizza for me and a salad for her. It was magical. As much as we loved the grift, it also meant that we spent a lot of quality time together and that my reading level was stratospheric for a little girl from an underprivileged nowheresville without a library or a post office. Grift away, kids. Grift away. Fight the Algorithm! Diversify Your TikTok Feed Publishing and readers are enamored with BookTok, and TikTok can be a fun and interesting space, but I hope we all understand the real and serious issues with social media and algorithm-driven content as a whole. Algorithms are not celestial creations unblemished by the biases and machinations of mankind. If you read Careless People (I’m reading it now and it is horrifying, eye-opening, and such a page-turner–go read it!) or you’re any amount of online, you know this is far from the truth. And if you spend time scrolling BookTok, it will quickly become obvious that if you don’t take direct action to make your feed inclusive, white creators promoting white authors will dominate. Publishing understands the power of BookTok and how books that go viral there amount to big money, and so we end up with a boom in books (like those romantasy books we keep talking about) largely written by white authors, with similarly big marketing money going toward those books. Algorithms are racist, and TikTok is particularly algorithm-driven in terms of the content it shows you. Already, we’re seeing declines in the number of diverse books acquired by romance publishers in the past few years, at least partially driven by BookTok’s dominance in breaking new titles. That’s from Romancing the Phone‘s Alyssa Morris, who offers a guide to breaking the cycle in your own feed by diversifying your TikTok, including general tips and some great bookish content creators to follow on that platform. Check out the post and then look at your feed with fresh eyes and a plan if you find there’s need to shake things up. American Library Association Sues Trump The ALA has announced that they’re suing the Trump administration, including Trump himself. The lawsuit is arguing that the actions against the Institute for Museum and Library Services were illegal and unconstitutional. Read more about how libraries are using the judicial system to fight for funding. Today In Books Sign up to Today In Books to receive daily news and miscellany from the world of books. The comments section is moderated according to our community guidelines. Please check them out so we can maintain a safe and supportive community of readers!",
  "image": "https://s2982.pcdn.co/wp-content/uploads/2025/04/open-book-on-top-of-books-in-a-row-with-spines-faced-away-and-pink-gradient-overlay.jpg.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"post-area\"\u003e\n\n\t\t\n\t\t\t\t\t\n\n\t\t\u003carticle\u003e\n\n\t\t\t\u003cdiv itemprop=\"mainEntityOfPage\"\u003e\n\n\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg width=\"620\" height=\"332\" src=\"https://s2982.pcdn.co/wp-content/uploads/2025/04/open-book-on-top-of-books-in-a-row-with-spines-faced-away-and-pink-gradient-overlay.jpg.webp\" alt=\"open book on top of books in a row with spines faced away and pink gradient overlay\" fetchpriority=\"high\" loading=\"eager\" decoding=\"async\" srcset=\"https://s2982.pcdn.co/wp-content/uploads/2025/04/open-book-on-top-of-books-in-a-row-with-spines-faced-away-and-pink-gradient-overlay.jpg.webp 700w, https://s2982.pcdn.co/wp-content/uploads/2025/04/open-book-on-top-of-books-in-a-row-with-spines-faced-away-and-pink-gradient-overlay-300x161.jpg.webp 300w\" sizes=\"(max-width: 620px) 100vw, 620px\"/\u003e\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\u003cp\u003eThis content contains affiliate links. When you buy through these links, we may earn an affiliate commission.\u003c/p\u003e\n\t\t\t\t\u003cdiv itemprop=\"articleBody\" class=\"post-594816 post type-post status-publish format-standard has-post-thumbnail hentry category-today-in-books pmpro-has-access\"\u003e\n\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\u003cp\u003e\u003cspan\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eS. Zainab would like to think she bleeds ink but the very idea makes her feel faint. She writes fantasy and horror, and is currently clutching a manuscript while groping in the dark. Find her on Twitter: \u003ca href=\"http://www.twitter.com/szainabwilliams\"\u003e@szainabwilliams\u003c/a\u003e.\u003c/p\u003e\n\t\t\t\t\u003cp\u003e\u003ca href=\"https://bookriot.com/author/s-zainab-williams/\"\u003eView All posts by S. Zainab Williams\u003c/a\u003e\u003c/p\u003e\n\t\t\t\u003c/span\u003e\n\t\t\u003c/p\u003e\n\t\t\u003cdiv\u003e\n\u003cp\u003e\u003cem\u003eWelcome to Today in Books, our daily round-up of literary headlines at the intersection of politics, culture, media, and more.\u003c/em\u003e\u003c/p\u003e\n\n\u003cdiv\u003e\n\u003ch2\u003eIn Case You’re More of a Nonfiction Girly\u003c/h2\u003e\n\n\n\n\u003cp\u003eYesterday, I shared about the \u003cem\u003eL.A. Times\u003c/em\u003e list of the \u003ca href=\"https://www.latimes.com/entertainment-arts/books/story/2025-04-14/the-30-best-fiction-books-of-the-last-30-years\"\u003e30 best fiction books of the last 30 years\u003c/a\u003e, and today we’re taking a look at their matching list of \u003ca href=\"https://www.latimes.com/entertainment-arts/books/story/2025-04-14/the-30-best-nonfiction-books-of-the-last-30-years\"\u003ebest nonfiction reads\u003c/a\u003e. I read far more fiction than nonfiction, so I was initially surprised by how many of these books I’ve read, but then it occurred to me that the nonfiction books I pick up tend to be heavily vetted specifically because it takes more to get me to engage with true stories. The books on this list were hugely popular and/or big critical successes, picking up awards left and right, when they hit shelves and their significance endures. I mean, David Sedaris is one of our great living satirists and it felt like everyone was reading \u003ca title=\"Buy from Amazon\" product-id=\"0316776963\" href=\"https://www.amazon.com/gp/product/0316776963/ref=as_li_tf_il?ie=UTF8\u0026amp;tag=boorio-20\u0026amp;linkCode=as2\u0026amp;camp=217145\u0026amp;creative=399349\u0026amp;creativeASIN=0316776963\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Me Talk Pretty One Day\" data-publisher=\"Back Bay Books\" data-releasedate=\"2001-06-05\" data-author=\"Sedaris, David\" data-ean=\"9780316776967\" data-asin=\"0316776963\" rel=\"noopener\"\u003eMe Talk Pretty One Day\u003c/a\u003e (#30 on the list) when it published. We’ve got another living legend–this time of both fiction and nonfiction writing–in award-winning author Jesmyn Ward whose powerful and deep memoir, \u003ca title=\"Buy from Amazon\" product-id=\"1608197654\" href=\"https://www.amazon.com/gp/product/1608197654/ref=as_li_tf_il?ie=UTF8\u0026amp;tag=boorio-20\u0026amp;linkCode=as2\u0026amp;camp=217145\u0026amp;creative=399349\u0026amp;creativeASIN=1608197654\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Men We Reaped: A Memoir\" data-publisher=\"Bloomsbury USA\" data-releasedate=\"2014-09-16\" data-author=\"Ward, Jesmyn\" data-ean=\"9781608197651\" data-asin=\"1608197654\" rel=\"noopener\"\u003eMen We Reaped\u003c/a\u003e, placed 13th. At the top of the list, Isabel Wilkerson beat out Joan Didion for 1st place with \u003ca title=\"Buy from Amazon\" product-id=\"0679763880\" href=\"https://www.amazon.com/gp/product/0679763880/ref=as_li_tf_il?ie=UTF8\u0026amp;tag=boorio-20\u0026amp;linkCode=as2\u0026amp;camp=217145\u0026amp;creative=399349\u0026amp;creativeASIN=0679763880\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"The Warmth of Other Suns: The Epic Story of America\u0026#39;s Great Migration\" data-publisher=\"Vintage\" data-releasedate=\"2011-10-04\" data-author=\"Wilkerson, Isabel\" data-ean=\"9780679763888\" data-asin=\"0679763880\" rel=\"noopener\"\u003eThe Warmth of Other Suns: The Epic Story of America’s Great Migration\u003c/a\u003e, which I really \u003cem\u003ereally\u003c/em\u003e need to get to reading because an expertly told history of a huge movement isn’t something to skip past, even if you’re more of a fiction girly.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\u003cdiv\u003e\n\u003ch2\u003eI’m Not Mad at This Pizza Hut BOOK IT! Scam\u003c/h2\u003e\n\n\n\n\u003cp\u003eI have always wondered how many people cheated Pizza Hut’s BOOK IT! program encouraging childhood literacy with kid-sized personal pizzas, but I didn’t anticipate someone actually owning up to the manipulation of such a wholesome setup. The very idea of confessing to scamming a program that holds such a pure and nostalgic place in the hearts of Millennials seemed unlikely until I read \u003ca href=\"https://www.foodandwine.com/pizza-hut-book-it-scam-6405471\"\u003eKim Kelly’s story over at \u003cem\u003eFood \u0026amp; Wine\u003c/em\u003e\u003c/a\u003e. \u003cem\u003eShe did the thing.\u003c/em\u003e If you’re already feeling offense creep into your heart, just read this tidbit from the piece:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eFirst stop was the county library to load up on books, since the Bookmobile only came to my village once a week and they rarely restocked the selection. After a few hours in the stacks, we’d seal the deal with a personal pan pizza for me and a salad for her. It was magical. As much as we loved the grift, it also meant that we spent a lot of quality time together and that my reading level was stratospheric for a little girl from an underprivileged nowheresville without a library or a post office.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eGrift away, kids. Grift away.\u003c/p\u003e\n\u003c/div\u003e\n\n\u003cdiv\u003e\n\u003ch2\u003eFight the Algorithm! Diversify Your TikTok Feed\u003c/h2\u003e\n\n\n\n\u003cp\u003ePublishing and readers are enamored with BookTok, and TikTok can be a fun and interesting space, but I hope we all understand the real and serious issues with social media and algorithm-driven content as a whole. Algorithms are not celestial creations unblemished by the biases and machinations of mankind. If you read \u003ca title=\"Buy from Amazon\" product-id=\"1250391237\" href=\"https://www.amazon.com/gp/product/1250391237/ref=as_li_tf_il?ie=UTF8\u0026amp;tag=boorio-20\u0026amp;linkCode=as2\u0026amp;camp=217145\u0026amp;creative=399349\u0026amp;creativeASIN=1250391237\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Careless People: A Cautionary Tale of Power, Greed, and Lost Idealism\" data-publisher=\"Flatiron Books\" data-releasedate=\"2025-03-11\" data-author=\"Wynn-Williams, Sarah\" data-ean=\"9781250391230\" data-asin=\"1250391237\" rel=\"noopener\"\u003eCareless People\u003c/a\u003e (I’m reading it now and it is horrifying, eye-opening, and \u003cem\u003esuch\u003c/em\u003e a page-turner–go read it!) or you’re any amount of online, you know this is far from the truth. And if you spend time scrolling BookTok, it will quickly become obvious that if you don’t take direct action to make your feed inclusive, white creators promoting white authors will dominate. Publishing understands the power of BookTok and how books that go viral there amount to big money, and so we end up with a boom in books (like those romantasy books we keep talking about) largely written by white authors, with similarly big marketing money going toward those books. \u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e\u003ca href=\"https://www.vox.com/recode/2020/2/18/21121286/algorithms-bias-discrimination-facial-recognition-transparency\"\u003eAlgorithms are racist\u003c/a\u003e, and TikTok is particularly algorithm-driven in terms of the content it shows you. Already, we’re seeing \u003ca href=\"https://www.therippedbodice.com/state-racial-diversity-romance-publishing-report\"\u003edeclines in the number of diverse books acquired by romance publishers\u003c/a\u003e in the past few years, at least partially driven by BookTok’s dominance in breaking new titles.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eThat’s from \u003cem\u003eRomancing the Phone\u003c/em\u003e‘s Alyssa Morris, who offers \u003ca href=\"https://romancingthephone.substack.com/p/how-to-diversify-your-tiktok-feed\"\u003ea guide to breaking the cycle in your own feed\u003c/a\u003e by diversifying your TikTok, including general tips and some great bookish content creators to follow on that platform. Check out the post and then look at your feed with fresh eyes and a plan if you find there’s need to shake things up.\u003c/p\u003e\n\u003c/div\u003e\n\n\u003cdiv\u003e\n\u003ch2\u003eAmerican Library Association Sues Trump\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe ALA has announced that they’re suing the Trump administration, including Trump himself. The lawsuit is arguing that the actions against the Institute for Museum and Library Services were illegal and unconstitutional. Read more about \u003ca href=\"https://bookriot.com/american-library-association-sues-trump/\"\u003ehow libraries are using the judicial system to fight for funding\u003c/a\u003e.\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\t\t\t\t\u003cp\u003eToday In Books\u003c/p\u003e\n\t\t\t\t\u003cp\u003eSign up to Today In Books to receive daily news and miscellany from the world of books.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\n\u003c/div\u003e\u003cp\u003e\u003cem\u003eThe comments section is moderated according to our \u003ca href=\"https://bookriot.com/about/community-guidelines/\"\u003ecommunity guidelines\u003c/a\u003e. Please check them out so we can maintain a safe and supportive community of readers!\u003c/em\u003e\u003c/p\u003e\n\t\n\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/div\u003e\n\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\t\t\n\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-04-22T15:30:00Z",
  "modifiedTime": null
}
