{
  "id": "1e5d91c3-9a9e-4c82-bd67-9e60f6f01dd7",
  "title": "EXPLORING IS NOT FOR ME!",
  "link": "https://www.kirkusreviews.com/book-reviews/nancy-jean/exploring-is-not-for-me/",
  "description": "George and his sister Gemma are going on adventure with their Mumzie, a human child with blond hair and fair skin, to the local campground. The only problem? George says, “Exploring is NOT for me!” He has no interest in roughing it (he’s frustrated by his uncomfortable camp bed), even when all his canine friends join in. He declines to join Gemma’s team for a treasure hunt, but when she leaves her special spy glasses behind, he braves the outdoors to return them to her. While outside, he spots an eider duck and gets an idea for finding one of the last treasures Gemma needs. He strikes out on his own, overcoming obstacles like freezing cold water by concentrating on Gemma and the hunt’s prize: a tent full of treats. Jean’s debut picture book is an entertaining narrative about stepping out of familiar routines to help others. Gemma’s excitement and the many treats are their own reward; the way things come full circle with George’s improved bed at the story’s end is the icing on top. Shin’s illustrations are colorful, expressive, and contain hidden letters of the alphabet that add to the re-readability of this delightful text.",
  "author": "",
  "published": "",
  "source": "https://www.kirkusreviews.com/feeds/rss/",
  "categories": null,
  "byline": "",
  "length": 3590,
  "excerpt": "George the dog steps out of his comfort zone while camping with his friends in Jean’s picture book.",
  "siteName": "Kirkus Reviews",
  "favicon": "https://d1fd687oe6a92y.cloudfront.net/img/kir_images/header/apple-icon.png",
  "text": "PETE THE CAT'S 12 GROOVY DAYS OF CHRISTMAS by James Dean ; illustrated by James Dean ‧ RELEASE DATE: Sept. 18, 2018 Pete’s fans might find it groovy; anyone else has plenty of other “12 Days of Christmas” variants to choose among Pete, the cat who couldn’t care less, celebrates Christmas with his inimitable lassitude. If it weren’t part of the title and repeated on every other page, readers unfamiliar with Pete’s shtick might have a hard time arriving at “groovy” to describe his Christmas celebration, as the expressionless cat displays not a hint of groove in Dean’s now-trademark illustrations. Nor does Pete have a great sense of scansion: “On the first day of Christmas, / Pete gave to me… / A road trip to the sea. / GROOVY!” The cat is shown at the wheel of a yellow microbus strung with garland and lights and with a star-topped tree tied to its roof. On the second day of Christmas Pete gives “me” (here depicted as a gray squirrel who gets on the bus) “2 fuzzy gloves, and a road trip to the sea. / GROOVY!” On the third day, he gives “me” (now a white cat who joins Pete and the squirrel) “3 yummy cupcakes,” etc. The “me” mentioned in the lyrics changes from day to day and gift to gift, with “4 far-out surfboards” (a frog), “5 onion rings” (crocodile), and “6 skateboards rolling” (a yellow bird that shares its skateboards with the white cat, the squirrel, the frog, and the crocodile while Pete drives on). Gifts and animals pile on until the microbus finally arrives at the seaside and readers are told yet again that it’s all “GROOVY!” Pete’s fans might find it groovy; anyone else has plenty of other “12 Days of Christmas” variants to choose among . (Picture book. 4-8) Pub Date: Sept. 18, 2018 ISBN: 978-0-06-267527-9 Page Count: 48 Publisher: Harper/HarperCollins Review Posted Online: Aug. 19, 2018 Kirkus Reviews Issue: Sept. 1, 2018",
  "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/197a374483f8438c9499b285e1a29d81/f8a03980eae4440d9138378970733a74.jpeg.300x0_q85_autocrop.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n                                \u003ch2\u003ePETE THE CAT\u0026#39;S 12 GROOVY DAYS OF CHRISTMAS\u003c/h2\u003e\n                                \n                                \n                                \u003cp\u003e\n                                    by\n                        \u003ca href=\"https://www.kirkusreviews.com/author/james-dean-1/\"\u003e\n                            James Dean\n                        \u003c/a\u003e\n                \n            \n                \n                    ; \n                    illustrated by\n                        \u003ca href=\"https://www.kirkusreviews.com/author/james-dean-1/\"\u003e\n                            James Dean\n                        \u003c/a\u003e\n\n                                    \u003cspan\u003e ‧\u003c/span\u003e\n                                    \u003cspan\u003eRELEASE DATE: Sept. 18, 2018\u003c/span\u003e\n                                \u003c/p\u003e\n\n                                \u003cp\u003e\n                                    Pete’s fans might find it groovy; anyone else has plenty of other “12 Days of Christmas” variants to choose among\n                                \u003c/p\u003e\n\n                                \n\n                                \n\n                                \n                                    \n                                        \n                                    \n                                \n\n                                \u003cdiv\u003e\n                                    \n                                        \u003cp\u003ePete, the cat who couldn’t care less, celebrates Christmas with his inimitable lassitude.\u003c/p\u003e\n                                        \u003cp\u003eIf it weren’t part of the title and repeated on every other page, readers unfamiliar with Pete’s shtick might have a hard time arriving at “groovy” to describe his Christmas celebration, as the expressionless cat displays not a hint of groove in Dean’s now-trademark illustrations. Nor does Pete have a great sense of scansion: “On the first day of Christmas, / Pete gave to me… / A road trip to the sea. / GROOVY!” The cat is shown at the wheel of a yellow microbus strung with garland and lights and with a star-topped tree tied to its roof. On the second day of Christmas Pete gives “me” (here depicted as a gray squirrel who gets on the bus) “2 fuzzy gloves, and a road trip to the sea. / GROOVY!” On the third day, he gives “me” (now a white cat who joins Pete and the squirrel) “3 yummy cupcakes,” etc. The “me” mentioned in the lyrics changes from day to day and gift to gift, with “4 far-out surfboards” (a frog), “5 onion rings” (crocodile), and “6 skateboards rolling” (a yellow bird that shares its skateboards with the white cat, the squirrel, the frog, and the crocodile while Pete drives on). Gifts and animals pile on until the microbus finally arrives at the seaside and readers are told yet again that it’s all “GROOVY!”\u003c/p\u003e\u003cp\u003e\n                                        Pete’s fans might find it groovy; anyone else has plenty of other “12 Days of Christmas” variants to choose among\n                                        \n                                        .\u003ci\u003e (Picture book. 4-8)\u003c/i\u003e\n                                    \n                                \u003c/p\u003e\u003c/div\u003e\n\n                                \n    \n        \n    \n\n\n                                \n\n                                \u003cdiv\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePub Date:\u003c/b\u003e Sept. 18, 2018\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003eISBN:\u003c/b\u003e 978-0-06-267527-9\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePage Count:\u003c/b\u003e 48\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003ePublisher:\u003c/b\u003e Harper/HarperCollins\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003eReview Posted Online:\u003c/b\u003e Aug. 19, 2018\u003c/p\u003e\n                                         \u003cp\u003e\u003cb\u003eKirkus Reviews Issue:\u003c/b\u003e Sept. 1, 2018\u003c/p\u003e\n                                    \u003c/div\u003e\n                                \u003c/div\u003e\n\n                                \n\n                                \n\n\n\n\n                                \n                                    \n                                        \n                                    \n                                \n                                \n                                    \n                                    \n                                    \n                                \n                            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
