{
  "id": "476bfeb2-ed5d-4268-a925-bd3fb866cb17",
  "title": "My Father's Name Is War: Collected Transmissions",
  "link": "https://www.kirkusreviews.com/book-reviews/bauder/my-fathers-name-is-war-collected-transmissions/",
  "description": "Bauder sets these nine stories in a variety of wartime settings, from Korea to Afghanistan to imaginary realms, but the core narrative of the collection is born out of what’s referred to here as the Global War on Terror, spanning roughly from 2001 to 2021. “Appealing to emotion or ethics may be a less-than-perfect medium for communicating the nature of an entire era,” he writes. “Even so, it remains a sufficient platform from which to announce a call to action.” The various stories underscore the surrealism of war from the viewpoints of the ordinary people caught up in it—the author states that, among his other reasons for publishing this collection, he intends it to be “an attack on the pious fetishization of sacrifice.” There are SF elements running through the most effective stories in this collection, as in “That It Was Good,” in which a tech developer in Korea is on the brink of implementing an all-encompassing AI called the Ninth Column—it’s prone to creepy AI supervillain pronouncements like “We are best suited to the creation and employment of simulacra, of which we regulate a distinct collection numbering in the billions.” Bauder is present in his own voice throughout, providing endnotes to the stories for which explanations or clarifications can be offered (“It should be noted that veteran status does not confer immunity from a basic tenet of analysis: Consider the source”). These annotations interrupt the flow of the collection, as does the author’s decision to include very rough first-draft material as part of the book’s “journey.” But in his finished work, Bauder’s talent for pacing and ear for sharp twists in dialogue will carry the reader into the weird realities of conflict, particularly the uncertainty, as voiced by a character in “Private Passenger”: “Sometimes I wonder if we send the wrong people to war.”",
  "author": "",
  "published": "",
  "source": "https://www.kirkusreviews.com/feeds/rss/",
  "categories": null,
  "byline": "by Tim O’Brien",
  "length": 3855,
  "excerpt": "A debut short story collection examines the many faces of war.",
  "siteName": "Kirkus Reviews",
  "favicon": "https://d1fd687oe6a92y.cloudfront.net/img/kir_images/header/apple-icon.png",
  "text": "THE AWKWARD BLACK MAN by Walter Mosley ‧ RELEASE DATE: Sept. 15, 2020 The range and virtuosity of these stories make this Mosley’s most adventurous and, maybe, best book. A grandmaster of the hard-boiled crime genre shifts gears to spin bittersweet and, at times, bizarre tales about bruised, sensitive souls in love and trouble. In one of the 17 stories that make up this collection, a supporting character says: “People are so afraid of dying that they don’t even live the little bit of life they have.” She casually drops this gnomic observation as a way of breaking down a lead character’s resistance to smoking a cigarette. But her aphorism could apply to almost all the eponymous awkward Black men examined with dry wit and deep empathy by the versatile and prolific Mosley, who takes one of his occasional departures from detective fiction to illuminate the many ways Black men confound society’s expectations and even perplex themselves. There is, for instance, Rufus Coombs, the mailroom messenger in “Pet Fly,” who connects more easily with household pests than he does with the women who work in his building. Or Albert Roundhouse, of “Almost Alyce,” who loses the love of his life and falls into a welter of alcohol, vagrancy, and, ultimately, enlightenment. Perhaps most alienated of all is Michael Trey in “Between Storms,” who locks himself in his New York City apartment after being traumatized by a major storm and finds himself taken by the outside world as a prophet—not of doom, but, maybe, peace? Not all these awkward types are hapless or benign: The short, shy surgeon in “Cut, Cut, Cut” turns out to be something like a mad scientist out of H.G. Wells while “Showdown on the Hudson” is a saga about an authentic Black cowboy from Texas who’s not exactly a perfect fit for New York City but is soon compelled to do the right thing, Western-style. The tough-minded and tenderly observant Mosley style remains constant throughout these stories even as they display varied approaches from the gothic to the surreal. The range and virtuosity of these stories make this Mosley’s most adventurous and, maybe, best book. Pub Date: Sept. 15, 2020 ISBN: 978-0-8021-4956-5 Page Count: 336 Publisher: Grove Review Posted Online: Sept. 1, 2020 Kirkus Reviews Issue: Sept. 15, 2020",
  "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/b8b2d924a2b845509e2e2230c219afb2/9709f665007d4225bd85b84f1ba6523c.jpeg.300x0_q85_autocrop.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n                                \u003ch2\u003eTHE AWKWARD BLACK MAN\u003c/h2\u003e\n                                \n                                \n                                \u003cp\u003e\n                                    by\n                        \u003ca href=\"https://www.kirkusreviews.com/author/walter-mosley/\"\u003e\n                            Walter Mosley\n                        \u003c/a\u003e\n\n                                    \u003cspan\u003e ‧\u003c/span\u003e\n                                    \u003cspan\u003eRELEASE DATE: Sept. 15, 2020\u003c/span\u003e\n                                \u003c/p\u003e\n\n                                \u003cp\u003e\n                                    The range and virtuosity of these stories make this Mosley’s most adventurous and, maybe, best book.\n                                \u003c/p\u003e\n\n                                \n\n                                \n\n                                \n                                    \n                                        \n                                    \n                                \n\n                                \u003cdiv\u003e\n                                    \n                                        \u003cp\u003eA grandmaster of the hard-boiled crime genre shifts gears to spin bittersweet and, at times, bizarre tales about bruised, sensitive souls in love and trouble.\u003c/p\u003e\n                                        \u003cp\u003eIn one of the 17 stories that make up this collection, a supporting character says: “People are so afraid of dying that they don’t even live the little bit of life they have.” She casually drops this gnomic observation as a way of breaking down a lead character’s resistance to smoking a cigarette. But her aphorism could apply to almost all the eponymous awkward Black men examined with dry wit and deep empathy by the versatile and prolific Mosley, who takes one of his occasional departures from detective fiction to illuminate the many ways Black men confound society’s expectations and even perplex themselves. There is, for instance, Rufus Coombs, the mailroom messenger in “Pet Fly,” who connects more easily with household pests than he does with the women who work in his building. Or Albert Roundhouse, of “Almost Alyce,” who loses the love of his life and falls into a welter of alcohol, vagrancy, and, ultimately, enlightenment. Perhaps most alienated of all is Michael Trey in “Between Storms,” who locks himself in his New York City apartment after being traumatized by a major storm and finds himself taken by the outside world as a prophet—not of doom, but, maybe, peace? Not all these awkward types are hapless or benign: The short, shy surgeon in “Cut, Cut, Cut” turns out to be something like a mad scientist out of H.G. Wells while “Showdown on the Hudson” is a saga about an authentic Black cowboy from Texas who’s not exactly a perfect fit for New York City but is soon compelled to do the right thing, Western-style. The tough-minded and tenderly observant Mosley style remains constant throughout these stories even as they display varied approaches from the gothic to the surreal.\u003c/p\u003e\u003cp\u003e\n                                        The range and virtuosity of these stories make this Mosley’s most adventurous and, maybe, best book.\n                                        \n                                        \n                                    \n                                \u003c/p\u003e\u003c/div\u003e\n\n                                \n    \n        \n    \n\n\n                                \n\n                                \u003cdiv\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePub Date:\u003c/b\u003e Sept. 15, 2020\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003eISBN:\u003c/b\u003e 978-0-8021-4956-5\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePage Count:\u003c/b\u003e 336\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003ePublisher:\u003c/b\u003e Grove\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003eReview Posted Online:\u003c/b\u003e Sept. 1, 2020\u003c/p\u003e\n                                         \u003cp\u003e\u003cb\u003eKirkus Reviews Issue:\u003c/b\u003e Sept. 15, 2020\u003c/p\u003e\n                                    \u003c/div\u003e\n                                \u003c/div\u003e\n\n                                \n\n                                \n\n\n\n\n                                \n                                    \n                                        \n                                    \n                                \n                                \n                                    \n                                    \n                                    \n                                \n                            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
