{
  "id": "5025c786-fb9a-4581-913a-b147de34708d",
  "title": "The New York Times Picks Its 10 Best Books of 2024",
  "link": "https://bookriot.com/the-new-york-times-picks-its-10-best-books-of-2024/",
  "description": "The New York Times picks the 10 best of 2024, Oprah launches a podcast, Costco carrying fewer books and more of the day's book news.",
  "author": "Jeff O'Neal",
  "published": "Tue, 03 Dec 2024 19:31:35 +0000",
  "source": "https://bookriot.com/feed/",
  "categories": [
    "Today in Books"
  ],
  "byline": "Jeff O'Neal",
  "length": 3542,
  "excerpt": "The New York Times picks the 10 best of 2024, Oprah launches a podcast, Costco carrying fewer books and more of the day's book news.",
  "siteName": "BOOK RIOT",
  "favicon": "https://s2982.pcdn.co/wp-content/themes/bookriot/assets/images/favicons/BookRiot_Logo_196.png.webp",
  "text": "This content contains affiliate links. When you buy through these links, we may earn an affiliate commission. Welcome to Today in Books, our daily round-up of literary headlines at the intersection of politics, culture, media, and more.If there is a list you want to be on at the end of the year as an author, it is this one. Less expansive than the 100 Notable books lists, which is arguably more interesting just for the range, the 10 best list is the NYT’s real stamp of approval. It can sometimes in the course of reading the NYT’s book reviews to have a sense of how good the reviewer themselves thinks the book is, but this list leaves no doubt. Quite humorously, or maddeningly depending on your angle, the list includes a couple of books we confessed to not loving on the Book Riot podcast (All Fours and Good Material), but taste is subjective of course. And I think if there were a single, last-work standing award, it goes to James. Why not go the extra mile, NYT? Oprah is Launching a Podcast “Anchored” By Author Interviews First thing in my inbox this morning was a press release announcing The Oprah Podcast, which frankly is surprising didn’t already exist. Here is what it will be, according to the release: “Oprah will welcome today’s foremost thought leaders, global newsmakers, best-selling authors, visionaries and cultural changemakers to explore timely themes including happiness, resilience, consciousness and connection to help listeners on their journey to lead their best life.” The show will be “anchored” by monthly interviews with authors of Oprah Book Club selections, and the whole shebang is sponsored by Starbucks. Seems like the most obvious thing in the world to me. This is not the sort of thing you throw together in a month (or is it?), but if you were going to draft a “Joe Rogan podcast for the left,” this feels pretty ready to wear. Costco to end book sales in hundreds of stores starting next yearWe first heard rumblings of this earlier in the year, but it looks like Costco’s plan to reduce dramatically the real estate it gives to books is upon us. Though, it is not quite as dire as the worst reports made it seem: a hundred or so stores will keep year-round book tables and the rest of the stores will have them in prime holiday season. If you didn’t follow this story the first time around, it was interesting to note that it wasn’t the sales so much that caused Costco to look at this move, but the logistics. Books have to be unpacked one at a time, are bought one at a time, and get switched out all the time. If sales were AMAZING, I am sure they would have kept things as is, but Costco has long favored simplicity. Would be fascinated to know what the actual difference in the gross sales of books Costco sees on the whole. Might be less than you might think. Today In Books Newsletter Sign up to Today In Books to receive daily news and miscellany from the world of books. Thank you for signing up! Keep an eye on your inbox. These are the Most Read Books of the 2024 Goodreads Reading ChallengeThe sort of people who participate in the Goodreads Reading Challenge are somewhat different than the general book buyer. And so it is that the most read books for Goodreads’ Annual Reading Challenge lean a little more literary/indie bookstore than what we will see on the NPD BookScan list for the year. The comments section is moderated according to our community guidelines. Please check them out so we can maintain a safe and supportive community of readers!",
  "image": "https://s2982.pcdn.co/wp-content/uploads/2024/12/Untitled-1.png.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"post-area\"\u003e\n\n\t\t\n\t\t\t\t\t\n\n\t\t\u003carticle\u003e\n\n\t\t\t\u003cdiv itemprop=\"mainEntityOfPage\"\u003e\n\n\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg width=\"620\" height=\"332\" src=\"https://s2982.pcdn.co/wp-content/uploads/2024/12/Untitled-1.png.webp\" alt=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://s2982.pcdn.co/wp-content/uploads/2024/12/Untitled-1.png.webp 700w, https://s2982.pcdn.co/wp-content/uploads/2024/12/Untitled-1-300x161.png.webp 300w\" sizes=\"(max-width: 620px) 100vw, 620px\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%20620%20332\u0026#39;%3E%3C/svg%3E\" data-lazy-srcset=\"https://s2982.pcdn.co/wp-content/uploads/2024/12/Untitled-1.png.webp 700w, https://s2982.pcdn.co/wp-content/uploads/2024/12/Untitled-1-300x161.png.webp 300w\" data-lazy-src=\"https://s2982.pcdn.co/wp-content/uploads/2024/12/Untitled-1.png.webp\"/\u003e\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\u003cp\u003eThis content contains affiliate links. When you buy through these links, we may earn an affiliate commission.\u003c/p\u003e\n\t\t\t\t\u003cdiv itemprop=\"articleBody\" class=\"post-585514 post type-post status-publish format-standard has-post-thumbnail hentry category-today-in-books pmpro-has-access\"\u003e\n\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\n\t\t\u003cdiv\u003e\u003cp\u003e\u003cem\u003eWelcome to Today in Books, our daily round-up of literary headlines at the intersection of politics, culture, media, and more.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eIf there is a list you want to be on at the end of the year as an author, it is this one. Less expansive than the 100 Notable books lists, which is arguably more interesting just for the range,\u003ca href=\"https://www.nytimes.com/2024/12/03/books/best-books-2024.html?unlocked_article_code=1.ek4.UATN.3as9Mz3DQErm\"\u003e the 10 best list is the NYT’s real stamp of approval\u003c/a\u003e. It can sometimes in the course of reading the NYT’s book reviews to have a sense of how good the reviewer themselves thinks the book is, but this list leaves no doubt. Quite humorously, or maddeningly depending on your angle, the list includes a couple of books we confessed to not loving on the Book Riot podcast (\u003ca product-id=\"059380130X\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fgood-material-a-novel_dolly-alderton%2F39793238%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" title=\"Buy from Thriftbooks\" data-title=\"Good Material: A novel\" data-publisher=\"Knopf\" data-releasedate=\"2024-01-30\" data-ean=\"9780593801307\" data-asin=\"059380130X\" data-author=\"Alderton, Dolly\" rel=\"noopener\"\u003eAll Fours and Good Material\u003c/a\u003e), but taste is subjective of course. And I think if there were a single, last-work standing award, it goes to \u003ca product-id=\"0385550367\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fjames-a-novel_percival-everett%2F39326310%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" title=\"Buy from Thriftbooks\" data-title=\"James: A Novel\" data-publisher=\"Doubleday\" data-releasedate=\"2024-03-19\" data-ean=\"9780385550369\" data-asin=\"0385550367\" data-author=\"Everett, Percival\" rel=\"noopener\"\u003eJames\u003c/a\u003e. Why not go the extra mile, NYT?\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\n\u003ch2\u003eOprah is Launching a Podcast “Anchored” By Author Interviews\u003c/h2\u003e\n\u003cp\u003eFirst thing in my inbox this morning was a press release\u003ca href=\"https://www.instagram.com/p/DDHjIYVJakK/?igsh=MWVobmh3aHRqbXA0ag%3D%3D\"\u003e announcing The Oprah Podcast\u003c/a\u003e, which frankly is surprising didn’t already exist. Here is what it will be, according to the release: “Oprah will welcome today’s foremost thought leaders, global newsmakers, best-selling authors, visionaries and cultural changemakers to explore timely themes including happiness, resilience, consciousness and connection to help listeners on their journey to lead their best life.” The show will be “anchored” by monthly interviews with authors of Oprah Book Club selections, and the whole shebang is sponsored by Starbucks. Seems like the most obvious thing in the world to me. This is not the sort of thing you throw together in a month (or is it?), but if you were going to draft a “Joe Rogan podcast for the left,” this feels pretty ready to wear.\u003c/p\u003e\n\u003c/div\u003e\u003ch2\u003eCostco to end book sales in hundreds of stores starting next year\u003c/h2\u003e\u003cp\u003eWe first heard rumblings of this earlier in the year, but it looks like \u003ca href=\"https://www.usatoday.com/story/money/2024/12/01/costco-book-sales/76689057007/\"\u003eCostco’s plan to reduce dramatically the real estate it gives to books is upon us\u003c/a\u003e. Though, it is not quite as dire as the worst reports made it seem: a hundred or so stores will keep year-round book tables and the rest of the stores will have them in prime holiday season. If you didn’t follow this story the first time around, it was interesting to note that it wasn’t the sales so much that caused Costco to look at this move, but the logistics. Books have to be unpacked one at a time, are bought one at a time, and get switched out all the time. If sales were AMAZING, I am sure they would have kept things as is, but Costco has long favored simplicity. Would be fascinated to know what the actual difference in the gross sales of books Costco sees on the whole. Might be less than you might think.\u003c/p\u003e\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cp\u003eToday In Books Newsletter\u003c/p\u003e\n\u003cp\u003eSign up to Today In Books to receive daily news and miscellany from the world of books.\u003c/p\u003e\n\u003c/div\u003e\n\n\n\u003cp\u003eThank you for signing up! Keep an eye on your inbox.\u003c/p\u003e\n\n\u003c/div\u003e\u003ch2\u003eThese are the Most Read Books of the 2024 Goodreads Reading Challenge\u003c/h2\u003e\u003cp\u003eThe sort of people who participate in the Goodreads Reading Challenge are somewhat different than the general book buyer. And so it is that \u003ca href=\"https://These%20are%20the%20Most%20Read%20Books%20of%20the%202024%20Goodreads%20Reading%20Challenge\"\u003ethe most read books for Goodreads’ Annual Reading Challenge\u003c/a\u003e lean a little more literary/indie bookstore than what we will see on the NPD BookScan list for the year. \u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cem\u003eThe comments section is moderated according to our \u003ca href=\"https://bookriot.com/about/community-guidelines/\"\u003ecommunity guidelines\u003c/a\u003e. Please check them out so we can maintain a safe and supportive community of readers!\u003c/em\u003e\u003c/p\u003e\n\t\n\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/div\u003e\n\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\t\t\n\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-03T19:31:35Z",
  "modifiedTime": "2024-12-03T20:13:07Z"
}
