{
  "id": "941efa06-412d-48bb-b4b4-9e8468f75d65",
  "title": "Interview with Sarah A. Denzil, Author of The Woman in Coach D",
  "link": "https://www.newinbooks.com/interview-with-sarah-a-denzil-author-of-the-woman-in-coach-d/",
  "description": "Sign up for our email and we’ll send you the best new books in your favorite genres weekly. The post Interview with Sarah A. Denzil, Author of The Woman in Coach D appeared first on NewInBooks.",
  "author": "meghan",
  "published": "Thu, 17 Oct 2024 14:26:51 +0000",
  "source": "https://www.newinbooks.com/feed/",
  "categories": [
    "Author Interviews",
    "eBook",
    "News"
  ],
  "byline": "meghan",
  "length": 3004,
  "excerpt": "Sign up for our email and we’ll send you the best new books in your favorite genres weekly. Share this:Click to email this to a friend (Opens in new window)Click to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on Pinterest... Read More",
  "siteName": "NewInBooks",
  "favicon": "",
  "text": "What’s the story behind the story? What inspired you to write The Woman in Coach D? Just after the quarantines were lifted during the pandemic, I had my first train ride for quite a long time. As an anxious traveller, I felt even more nervous than usual. I realised a lot of us were probably feeling quite anxious about public transport. I wanted to explore those feelings through my next psychological thriller. Jenny begins the book anxious about her train journey, then the appearance of someone from her past amplifies those feelings. The rest of the novel is a rollercoaster of twists and turns. If you had to pick theme songs for the main characters of The Woman in Coach D, what would they be? “Jump” The Girls Aloud version because Jenny was a teen in the early 2000s. In order to find her missing friend, Jenny has to jump through hoops (literally at times) facing her fears as she completes the dares Susie asks of her. What’s your favorite genre to read? Is it the same as your favorite genre to write? I’m a mood reader. I love suspense but I will also dip into literary and fantasy fiction. What books are on your TBR pile right now? I’m very guilty of buying books that sit on the shelves waiting to be read. Only for me to then buy a new book to read instead. I’ve been reading Stephen King recently. I’m just finishing Apt Pupil. But after I finish it, I’ll probably buy yet another new book rather than read my TBR! What scene in your book was your favorite to write? After Jenny thinks she sees her best friend on the train, she receives pages of her teenage diary along with dares and challenges that she has to complete. There are two dares that I loved writing. In one she has to walk through the woods at night with the eerie sounds of her and Susie’s childhood casette tapes playing over a loud speaker. And in another challenge, Jenny has to swim underneath ice. Do you have any quirky writing habits? (lucky mugs, cats on laps, etc.) Nothing too quirky. But I end up in different parts of the house. I never seem to actually write in my office. It’s usually on the sofa or the dining table. Do you have a motto, quote, or philosophy you live by? Always stay gracious, best revenge is your paper, from “Formation” by Beyonce. Every time I have an unpleasant experience in this industry, I use those feelings of disappointment and anger to fuel me on to work even harder. If you could choose one thing for readers to remember after reading your book, what would it be? From this specific book – not to let fear rule your life. Fear can be healthy at times, but it can soon become toxic. The main character in The Woman in Coach D has been allowing fear to rule her life for too long. While I’m not suggesting you swim under ice or walk through the woods at night, there are healthy ways to stand up to fear. I hope this book sparks a little bit of motivation to do that from time to time. Sign up for our email and we’ll send you the best new books in your favorite genres weekly.",
  "image": "https://www.newinbooks.com/wp-content/uploads/sites/9/2024/10/Denzil.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003e\u003cstrong\u003eWhat’s the story behind the story? What inspired you to write \u003cstrong\u003e\u003ca href=\"https://www.amazon.com/dp/B0DDJHXYKD?tag=newinbooks-20\"\u003eThe Woman in Coach D\u003c/a\u003e?\u003c/strong\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eJust after the quarantines were lifted during the pandemic, I had my first train ride for quite a long time. As an anxious traveller, I felt even more nervous than usual. I realised a lot of us were probably feeling quite anxious about public transport. I wanted to explore those feelings through my next psychological thriller. Jenny begins the book anxious about her train journey, then the appearance of someone from her past amplifies those feelings. The rest of the novel is a rollercoaster of twists and turns.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIf you had to pick theme songs for the main characters of \u003cstrong\u003e\u003ca href=\"https://www.amazon.com/dp/B0DDJHXYKD?tag=newinbooks-20\"\u003eThe Woman in Coach D\u003c/a\u003e, what would they be?\u003c/strong\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“Jump” The Girls Aloud version because Jenny was a teen in the early 2000s. In order to find her missing friend, Jenny has to jump through hoops (literally at times) facing her fears as she completes the dares Susie asks of her.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat’s your favorite genre to read? Is it the same as your favorite genre to write?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eI’m a mood reader. I love suspense but I will also dip into literary and fantasy fiction.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat books are on your TBR pile right now?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eI’m very guilty of buying books that sit on the shelves waiting to be read. Only for me to then buy a new book to read instead. I’ve been reading Stephen King recently. I’m just finishing Apt Pupil. But after I finish it, I’ll probably buy yet another new book rather than read my TBR!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat scene in your book was your favorite to write?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAfter Jenny thinks she sees her best friend on the train, she receives pages of her teenage diary along with dares and challenges that she has to complete. There are two dares that I loved writing. In one she has to walk through the woods at night with the eerie sounds of her and Susie’s childhood casette tapes playing over a loud speaker. And in another challenge, Jenny has to swim underneath ice.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDo you have any quirky writing habits? (lucky mugs, cats on laps, etc.)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eNothing too quirky. But I end up in different parts of the house. I never seem to actually write in my office. It’s usually on the sofa or the dining table.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDo you have a motto, quote, or philosophy you live by?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAlways stay gracious, best revenge is your paper, from “Formation” by Beyonce. Every time I have an unpleasant experience in this industry, I use those feelings of disappointment and anger to fuel me on to work even harder.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIf you could choose one thing for readers to remember after reading your book, what would it be?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFrom this specific book – not to let fear rule your life. Fear can be healthy at times, but it can soon become toxic. The main character in The Woman in Coach D has been allowing fear to rule her life for too long. While I’m not suggesting you swim under ice or walk through the woods at night, there are healthy ways to stand up to fear. I hope this book sparks a little bit of motivation to do that from time to time.\u003c/p\u003e\n\n\u003c/div\u003e\u003cp\u003e\u003ca href=\"https://www.newinbooks.com/email-signup-2/\"\u003e\u003ci\u003e\u003cspan\u003eSign up for our email\u003c/span\u003e\u003c/i\u003e\u003c/a\u003e\u003ci\u003e\u003cspan\u003e and we’ll send you the best new books in your favorite genres weekly.\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-17T10:26:51-04:00",
  "modifiedTime": "2024-10-17T14:26:51Z"
}
