{
  "id": "a0314cb5-77bd-4c7e-b41b-e2097c5560f7",
  "title": "“Amazon doesn’t help independent bookstores. Period.”",
  "link": "https://bookriot.com/amazon-doesnt-help-independent-bookstores-period/",
  "description": "Amazon's lackluster response to scheduling its book sale around Independent Bookstore Day, Broadway is making big bucks, and more.",
  "author": "S. Zainab Williams",
  "published": "Thu, 08 May 2025 15:45:00 +0000",
  "source": "https://bookriot.com/feed/",
  "categories": [
    "Today in Books"
  ],
  "byline": "S. Zainab Williams",
  "length": 4580,
  "excerpt": "Amazon's lackluster response to scheduling its book sale around Independent Bookstore Day, Broadway is making big bucks, and more.",
  "siteName": "BOOK RIOT",
  "favicon": "https://s2982.pcdn.co/wp-content/themes/bookriot/assets/images/favicons/BookRiot_Logo_192.png.webp",
  "text": "This content contains affiliate links. When you buy through these links, we may earn an affiliate commission. S. Zainab would like to think she bleeds ink but the very idea makes her feel faint. She writes fantasy and horror, and is currently clutching a manuscript while groping in the dark. Find her on Twitter: @szainabwilliams. View All posts by S. Zainab Williams Welcome to Today in Books, our daily round-up of literary headlines at the intersection of politics, culture, media, and more. Amazon’s Clash With Independent Bookstore Day Might Repeat The we-could-care-less vibes were strong in Amazon’s response to Retail Brew when asked whether they would avoid scheduling their big book sale week around Independent Bookstore Day. This year, Amazon’s second annual Book Sale ran from April 23–28 and Independent Bookstore Day, which has not shifted its schedule for the past 12 years, was held on April 26. This did not go unnoticed and while Amazon, when asked by various media outlets who picked up the story, has maintained that the overlap was unintentional, they did not offer Retail Brew an answer about whether they’d do it again, even when asked explicitly. Indie bookstores are a beloved institution and the optics are bad for Amazon, but I’d guess Amazon is counting on a lack of awareness or perhaps even apathy from its cost-conscious, convenience-seeking user base–if they deigned to think about this at all while planning their book sale. While the question of whether Amazon inadvertently helped Independent Bookstore Day since those sales were up 77% over the previous year came up, the chief communications officer of the American Booksellers Association wasn’t having it. “Amazon doesn’t help independent bookstores. Period,” said Ray T. Daniels. Plays Starring Celebs Rake in the Green George Clooney and Grant Heslov’s play, Good Night, and Good Luck, grossed $4 million in one week. The play, based on the film of the same name and written by the same authors, broke records and is the highest-grossing production in the history of the Shubert Organization on top of receiving five Tony Award nominations. Here’s a quote about Good Night, and Good Luck that you might appreciate, as I did: “The play chronicles a time in American history when truth and journalistic integrity stood up to fearmongering and disinformation—and won.” Meanwhile, Othello, starring Denzel Washington and Jake Gyllenhaal, has grossed $3 million. Looking at the gains plays have made in this monied progress report from Deadline is staggering. Between Tony Award nominations and great attendance, Broadway is getting butts in seats with celebrated and star-studded shows. Break Out Your Best Stevie Nicks Shawls Fall 2026 will serve PSLs, wool fits, and witchery–Practical Magic 2 is hitting screens next year. Multiple people attached to the original 1998 film, based on Alice Hoffman’s Practical Magic, will return for the second installment: Sandra Bullock, Nicole Kidman, and Akiva Goldsman who co-wrote the original. Oscar award-winning filmmaker Susanne Bier, who worked with Bullock on the Bird Box adaptation, will direct. I have to believe that the sequel will be based on the concluding book in the series, The Book of Magic, but that’s just a theory for now. I still listen to the soundtrack from the OG film and while I doubt Stevie Nicks will return for the sequel, a girl can dream. Can we also get aunties Stockard Channing and Dianne Wiest back, while I’m asking? Introducing: Reading and Resistance—And How Literature Has Always Been Tied to American Freedom We have a new series you won’t want to miss, especially if you’re activist-minded. Hear it from Reading and Resistance captain, Erica Ezefeidi, and get your introduction: That’s what this new series is: by looking at the history of resistance through reading, we can become fortified in our current fight. Through articles, interviews, podcasts, and more, we’ll both revisit the past to see how people made it through worse times, and highlight what people are doing now. We will explore all the ways that not only Black people have resisted oppression through literacy, but also how non-Black, queer, Latine, and other groups have as well. Today In Books Sign up to Today In Books to receive daily news and miscellany from the world of books. The comments section is moderated according to our community guidelines. Please check them out so we can maintain a safe and supportive community of readers!",
  "image": "https://s2982.pcdn.co/wp-content/uploads/2025/01/a-light-brown-skinned-woman-with-dark-hair-reaching-for-a-book-in-a-used-bookstore.jpg.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"post-area\"\u003e\n\n\t\t\n\t\t\t\t\t\n\n\t\t\u003carticle\u003e\n\n\t\t\t\u003cdiv itemprop=\"mainEntityOfPage\"\u003e\n\n\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg width=\"620\" height=\"332\" src=\"https://s2982.pcdn.co/wp-content/uploads/2025/01/a-light-brown-skinned-woman-with-dark-hair-reaching-for-a-book-in-a-used-bookstore.jpg.webp\" alt=\"a light brown-skinned woman with dark hair reaching for a book in a used bookstore\" fetchpriority=\"high\" loading=\"eager\" decoding=\"async\" srcset=\"https://s2982.pcdn.co/wp-content/uploads/2025/01/a-light-brown-skinned-woman-with-dark-hair-reaching-for-a-book-in-a-used-bookstore.jpg.webp 700w, https://s2982.pcdn.co/wp-content/uploads/2025/01/a-light-brown-skinned-woman-with-dark-hair-reaching-for-a-book-in-a-used-bookstore-300x161.jpg.webp 300w\" sizes=\"(max-width: 620px) 100vw, 620px\"/\u003e\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\u003cp\u003eThis content contains affiliate links. When you buy through these links, we may earn an affiliate commission.\u003c/p\u003e\n\t\t\t\t\u003cdiv itemprop=\"articleBody\" class=\"post-595828 post type-post status-publish format-standard has-post-thumbnail hentry category-today-in-books pmpro-has-access\"\u003e\n\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\u003cp\u003e\u003cspan\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eS. Zainab would like to think she bleeds ink but the very idea makes her feel faint. She writes fantasy and horror, and is currently clutching a manuscript while groping in the dark. Find her on Twitter: \u003ca href=\"http://www.twitter.com/szainabwilliams\"\u003e@szainabwilliams\u003c/a\u003e.\u003c/p\u003e\n\t\t\t\t\u003cp\u003e\u003ca href=\"https://bookriot.com/author/s-zainab-williams/\"\u003eView All posts by S. Zainab Williams\u003c/a\u003e\u003c/p\u003e\n\t\t\t\u003c/span\u003e\n\t\t\u003c/p\u003e\n\t\t\u003cdiv\u003e\n\u003cp\u003e\u003cem\u003eWelcome to Today in Books, our daily round-up of literary headlines at the intersection of politics, culture, media, and more.\u003c/em\u003e\u003c/p\u003e\n\n\u003cdiv\u003e\n\u003ch2\u003eAmazon’s Clash With Independent Bookstore Day Might Repeat \u003c/h2\u003e\n\n\n\n\u003cp\u003eThe we-could-care-less vibes were strong in \u003ca href=\"https://www.retailbrew.com/stories/2025/05/07/exclusive-amazon-won-t-promise-not-to-undercut-independent-bookstore-day-again\"\u003eAmazon’s response to Retail Brew\u003c/a\u003e when asked whether they would avoid scheduling their big book sale week around Independent Bookstore Day. This year, Amazon’s second annual Book Sale ran from April 23–28 and Independent Bookstore Day, which has not shifted its schedule for the past 12 years, was held on April 26. This did not go unnoticed and while Amazon, when asked by various media outlets who picked up the story, has maintained that the overlap was unintentional, they did not offer Retail Brew an answer about whether they’d do it again, even when asked explicitly. Indie bookstores are a beloved institution and the optics are bad for Amazon, but I’d guess Amazon is counting on a lack of awareness or perhaps even apathy from its cost-conscious, convenience-seeking user base–\u003cem\u003eif\u003c/em\u003e they deigned to think about this at all while planning their book sale. While the question of whether Amazon inadvertently helped Independent Bookstore Day since those sales were up 77% over the previous year came up, the chief communications officer of the American Booksellers Association wasn’t having it. “Amazon doesn’t help independent bookstores. Period,” said Ray T. Daniels.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\u003cdiv\u003e\n\u003ch2\u003ePlays Starring Celebs Rake in the Green\u003c/h2\u003e\n\n\n\n\u003cp\u003eGeorge Clooney and Grant Heslov’s play, \u003cem\u003eGood Night, and Good Luck\u003c/em\u003e, grossed $4 million in \u003cem\u003eone\u003c/em\u003e week. The play, based on the film of the same name and written by the same authors, broke records and is the highest-grossing production in the history of the Shubert Organization on top of receiving five Tony Award nominations. Here’s a quote about \u003cem\u003eGood Night, and Good Luck\u003c/em\u003e that you might appreciate, as I did: “The play chronicles a time in American history when truth and journalistic integrity stood up to fearmongering and disinformation—and won.” Meanwhile, \u003ca title=\"Buy from Thriftbooks\" product-id=\"1501146297\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fshakespeare-othello%2F1007814%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Othello (Folger Shakespeare Library)\" data-publisher=\"Simon \u0026amp; Schuster\" data-releasedate=\"2017-06-13\" data-author=\"Shakespeare, William\" data-ean=\"9781501146299\" data-asin=\"1501146297\" rel=\"noopener\"\u003eOthello\u003c/a\u003e, starring Denzel Washington and Jake Gyllenhaal, has grossed $3 million. Looking at the gains plays have made in \u003ca href=\"https://deadline.com/2025/05/george-clooney-good-night-and-good-luck-broadway-record-1236386839/\"\u003ethis monied progress report from \u003cem\u003eDeadline\u003c/em\u003e\u003c/a\u003e is staggering. Between Tony Award nominations and great attendance, Broadway is getting butts in seats with celebrated and star-studded shows.\u003c/p\u003e\n\u003c/div\u003e\n\n\u003cdiv\u003e\n\u003ch2\u003eBreak Out Your Best Stevie Nicks Shawls\u003c/h2\u003e\n\n\n\n\u003cp\u003eFall 2026 will serve PSLs, wool fits, and witchery–\u003ca href=\"https://deadline.com/2025/05/practical-magic-2-release-date-1236387064/\"\u003e\u003cem\u003ePractical Magic 2\u003c/em\u003e is hitting screens next year\u003c/a\u003e. Multiple people attached to the original 1998 film, based on Alice Hoffman’s \u003ca title=\"Buy from Thriftbooks\" product-id=\"0425190374\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fpractical-magic-by-alice-hoffman%2F252416%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Practical Magic: 25th Anniversary Edition (The Practical Magic Series)\" data-publisher=\"Berkley\" data-releasedate=\"2003-08-05\" data-author=\"Hoffman, Alice\" data-ean=\"9780425190371\" data-asin=\"0425190374\" rel=\"noopener\"\u003ePractical Magic\u003c/a\u003e, will return for the second installment: Sandra Bullock, Nicole Kidman, and Akiva Goldsman who co-wrote the original. Oscar award-winning filmmaker Susanne Bier, who worked with Bullock on the \u003ca title=\"Buy from Thriftbooks\" product-id=\"0062259660\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fbird-box_josh-malerman%2F3246067%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Bird Box: A Novel\" data-publisher=\"Ecco\" data-releasedate=\"2015-02-10\" data-author=\"Malerman, Josh\" data-ean=\"9780062259660\" data-asin=\"0062259660\" rel=\"noopener\"\u003eBird Box\u003c/a\u003e adaptation, will direct. I have to believe that the sequel will be based on the concluding book in the series, \u003ca title=\"Buy from Thriftbooks\" product-id=\"1982151498\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fthe-book-of-magic_alice-hoffman%2F28646258%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"The Book of Magic: A Novel (4) (The Practical Magic Series)\" data-publisher=\"Atria Books\" data-releasedate=\"2022-10-18\" data-author=\"Hoffman, Alice\" data-ean=\"9781982151492\" data-asin=\"1982151498\" rel=\"noopener\"\u003eThe Book of Magic\u003c/a\u003e, but that’s just a theory for now. I still listen to the soundtrack from the OG film and while I doubt Stevie Nicks will return for the sequel, a girl can dream. Can we also get aunties Stockard Channing and Dianne Wiest back, while I’m asking? \u003c/p\u003e\n\u003c/div\u003e\n\n\u003cdiv\u003e\n\u003ch2\u003eIntroducing: Reading and Resistance—And How Literature Has Always Been Tied to American Freedom\u003c/h2\u003e\n\n\n\n\u003cp\u003eWe have a new series you won’t want to miss, especially if you’re activist-minded. Hear it from Reading and Resistance captain, Erica Ezefeidi, \u003ca href=\"https://bookriot.com/introducing-reading-and-resistance-and-how-literature-has-always-been-tied-to-american-freedom/\"\u003eand get your introduction\u003c/a\u003e:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eThat’s what this new series is: by looking at the history of resistance through reading, we can become fortified in our current fight. Through articles, interviews, podcasts, and more, we’ll both revisit the past to see how people made it through worse times, and highlight what people are doing now. We will explore all the ways that not only Black people have resisted oppression through literacy, but also how non-Black, queer, Latine, and other groups have as well.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\t\t\t\t\u003cp\u003eToday In Books\u003c/p\u003e\n\t\t\t\t\u003cp\u003eSign up to Today In Books to receive daily news and miscellany from the world of books.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\n\n\n\n\n\n\n\n\n\t\n\u003c/div\u003e\u003cp\u003e\u003cem\u003eThe comments section is moderated according to our \u003ca href=\"https://bookriot.com/about/community-guidelines/\"\u003ecommunity guidelines\u003c/a\u003e. Please check them out so we can maintain a safe and supportive community of readers!\u003c/em\u003e\u003c/p\u003e\n\t\n\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/div\u003e\n\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\t\t\n\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-05-08T15:45:00Z",
  "modifiedTime": null
}
