{
  "id": "b43190bd-7aae-409e-968e-bec7986a5c66",
  "title": "CRASH LANDING",
  "link": "https://www.kirkusreviews.com/book-reviews/annie-mcquaid/crash-landing-3/",
  "description": "A cancelled flight has jeopardized Piper Adams’ maid of honor responsibilities. Instead of being on a plane to her best friend Allie’s bachelorette party and wedding at an all-inclusive resort in the Bahamas, she’s stuck at the Atlanta airport. Fortunately, a knight in shining armor comes to her rescue, but unfortunately, he’s Wyatt Brooks, the man who broke her heart. As luck would have it, he’s attending the same wedding, and a former Army connection has offered him the use of a small plane to get him there. What should have been a two-hour flight ends in disaster, though, as Piper and Wyatt barely survive a plane crash on an unknown island. When Piper finally comes to, after having been unconscious for almost a day, her first thought is that she’s missed her friend’s bachelorette and may very well miss the wedding. Strange priorities for someone recovering from a plane crash. The story jumps between “Now,” with Piper and Wyatt on the island, and “Then,” when they first met as teenagers, and those flashbacks to a standard romance aren’t as compelling as the current situation, with the pair having to navigate a harsh environment while fighting old feelings. Piper doesn’t make a great impression on the reader, coming across as immature when faced with difficult experiences. She whines to a gate attendant just trying to do her job to get an entire plane full of irate passengers rebooked. She gets angry with Allie for inviting Wyatt to her wedding even though he’s her cousin. Being stranded softens her a bit, but it’s hard to be on her side. The deserted island setting adds some tension to the story, but Piper’s self-centered behavior and decision to hold a grudge against Wyatt for his earlier relationship insecurities make it a challenge to reach a compelling happily-ever-after.",
  "author": "",
  "published": "",
  "source": "https://www.kirkusreviews.com/feeds/rss/",
  "categories": null,
  "byline": "by Ali Hazelwood",
  "length": 3913,
  "excerpt": "Two exes on the way to the same wedding find themselves stranded on a deserted island in this debut romance.",
  "siteName": "Kirkus Reviews",
  "favicon": "https://d1fd687oe6a92y.cloudfront.net/img/kir_images/header/apple-icon.png",
  "text": "BLOOD MOON by Sandra Brown ‧ RELEASE DATE: March 4, 2025 A satisfying crime novel with a side order of romance. A TV producer and a detective try to stop a strange pattern of young women disappearing. In “Auclair, Loooziana,” disillusioned detective John Bowie reluctantly meets in a bar with Beth Collins, producer for the true crime show Crisis Point. She needs to interview him about the disastrous case of the missing Crissy Mellin, but he refuses. The teenager disappeared three years ago on the night of a blood moon and hasn’t been found, but a suspect hanged himself in jail after signing a confession. Case closed, says John’s boss. But John is convinced that their prisoner could not have been guilty, and he’s deeply upset at his failure. “The Mellin case messed up your life,” Beth tells him. She persuades John that Crissy’s disappearance is the latest of a series that happen on the night of a blood moon, the colloquial term for a total lunar eclipse. “It’s going to happen again,” she predicts. And wouldn’t you know, another blood moon is coming in four days. Tick, tick, tick. Beth’s boss at Crisis Point insists on airing an update on the case, but Beth knows the show is going to get it wrong, and its reputation will be ruined. Meanwhile, there’s an electric sexual tension between Beth and John that the author toys with nicely—do they, or don’t they? The answer plays out in detail more than once. The characters are fun if easy to pigeonhole: the detective angry at his failure, the honest (and beautiful) outsider eager to do her job but susceptible to love, the hero’s corrupt (to say the least) boss, and the ogre who carries out said boss’s dirtiest deeds. Even John’s dog, Mutt, plays a small but vital role. When John found him, he’d been “a flea-bitten hide wrapped around a skeleton that whimpered.” Little plot devices are easy to spot, like the phone that rings at a crucial moment, or the handgun that John places in Beth’s hand for her protection. Does Chekhov’s guideline apply here? The romantic angle leavens the dark theme, and readers will have plenty of incentives to turn the pages. A satisfying crime novel with a side order of romance. Pub Date: March 4, 2025 ISBN: 9781538742983 Page Count: 448 Publisher: Grand Central Publishing Review Posted Online: Feb. 15, 2025 Kirkus Reviews Issue: March 15, 2025",
  "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/c5bafecdbdba4170bd3e8c260120bc63/7a81d143a9be4c54b35bd8754bbdd6e9.jpg.300x0_q85_autocrop.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n                                \u003ch2\u003eBLOOD MOON\u003c/h2\u003e\n                                \n                                \n                                \u003cp\u003e\n                                    by\n                        \u003ca href=\"https://www.kirkusreviews.com/author/sandra-brown/\"\u003e\n                            Sandra Brown\n                        \u003c/a\u003e\n\n                                    \u003cspan\u003e ‧\u003c/span\u003e\n                                    \u003cspan\u003eRELEASE DATE: March 4, 2025\u003c/span\u003e\n                                \u003c/p\u003e\n\n                                \u003cp\u003e\n                                    A satisfying crime novel with a side order of romance.\n                                \u003c/p\u003e\n\n                                \n\n                                \n\n                                \n                                    \n                                        \n                                    \n                                \n\n                                \u003cdiv\u003e\n                                    \n                                        \u003cp\u003eA TV producer and a detective try to stop a strange pattern of young women disappearing.\u003c/p\u003e\n                                        \u003cp\u003eIn “Auclair, Loooziana,” disillusioned detective John Bowie reluctantly meets in a bar with Beth Collins, producer for the true crime show \u003ci\u003eCrisis Point\u003c/i\u003e. She needs to interview him about the disastrous case of the missing Crissy Mellin, but he refuses. The teenager disappeared three years ago on the night of a blood moon and hasn’t been found, but a suspect hanged himself in jail after signing a confession. Case closed, says John’s boss. But John is convinced that their prisoner could not have been guilty, and he’s deeply upset at his failure. “The Mellin case messed up your life,” Beth tells him. She persuades John that Crissy’s disappearance is the latest of a series that happen on the night of a blood moon, the colloquial term for a total lunar eclipse. “It’s going to happen again,” she predicts. And wouldn’t you know, another blood moon is coming in four days. \u003ci\u003eTick, tick, tick\u003c/i\u003e. Beth’s boss at \u003ci\u003eCrisis Point \u003c/i\u003einsists on airing an update on the case, but Beth knows the show is going to get it wrong, and its reputation will be ruined. Meanwhile, there’s an electric sexual tension between Beth and John that the author toys with nicely—do they, or don’t they? The answer plays out in detail more than once. The characters are fun if easy to pigeonhole: the detective angry at his failure, the honest (and beautiful) outsider eager to do her job but susceptible to love, the hero’s corrupt (to say the least) boss, and the ogre who carries out said boss’s dirtiest deeds. Even John’s dog, Mutt, plays a small but vital role. When John found him, he’d been “a flea-bitten hide wrapped around a skeleton that whimpered.” Little plot devices are easy to spot, like the phone that rings at a crucial moment, or the handgun that John places in Beth’s hand for her protection. Does Chekhov’s guideline apply here? The romantic angle leavens the dark theme, and readers will have plenty of incentives to turn the pages.\u003c/p\u003e\u003cp\u003e\n                                        A satisfying crime novel with a side order of romance.\n                                        \n                                        \n                                    \n                                \u003c/p\u003e\u003c/div\u003e\n\n                                \n    \n        \n    \n\n\n                                \n\n                                \u003cdiv\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePub Date:\u003c/b\u003e March 4, 2025\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003eISBN:\u003c/b\u003e 9781538742983\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePage Count:\u003c/b\u003e 448\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003ePublisher:\u003c/b\u003e Grand Central Publishing\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003eReview Posted Online:\u003c/b\u003e Feb. 15, 2025\u003c/p\u003e\n                                         \u003cp\u003e\u003cb\u003eKirkus Reviews Issue:\u003c/b\u003e March 15, 2025\u003c/p\u003e\n                                    \u003c/div\u003e\n                                \u003c/div\u003e\n\n                                \n\n                                \n\n\n\n\n                                \n                                    \n                                        \n                                    \n                                \n                                \n                                    \n                                    \n                                    \n                                \n                            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
