{
  "id": "d1a8af61-51f1-44ec-bf72-3461c2d3562b",
  "title": "South Carolina Postpones Vote on Banning 10 Books Statewide",
  "link": "https://bookriot.com/south-carolina-postpones-vote-on-banning-10-books-statewide/",
  "description": "South Carolina State Board of Education members question the mechanisms giving one person power to ban books state wide and table the decision to remove 10 more titles from schools.",
  "author": "Kelly Jensen",
  "published": "Tue, 01 Apr 2025 19:40:00 +0000",
  "source": "https://bookriot.com/feed/",
  "categories": [
    "Literary Activism",
    "News"
  ],
  "byline": "Kelly Jensen",
  "length": 8553,
  "excerpt": "South Carolina State Board of Education members question the mechanisms giving one person power to ban books state wide and table the decision to remove 10 more titles from schools.",
  "siteName": "BOOK RIOT",
  "favicon": "https://s2982.pcdn.co/wp-content/themes/bookriot/assets/images/favicons/BookRiot_Logo_192.png.webp",
  "text": "This content contains affiliate links. When you buy through these links, we may earn an affiliate commission. Kelly is a former librarian and a long-time blogger at STACKED. She's the editor/author of (DON'T) CALL ME CRAZY: 33 VOICES START THE CONVERSATION ABOUT MENTAL HEALTH and the editor/author of HERE WE ARE: FEMINISM FOR THE REAL WORLD. Her next book, BODY TALK, will publish in Fall 2020. Follow her on Instagram @heykellyjensen. View All posts by Kelly Jensen Whether or not public school students will continue to have fewer diverse choices in their reading life across South Carolina was the topic of today’s State Department of Education meeting. Ten books were on the table for statewide removal following committee input, but a robust discussion about the unintended consequences of such decisions–and the abuse of the process that has imbued one parent in one county with outsized power to ban books across the state–led to a motion to table the decisions for another month. The books under consideration at the April 1, 2025 meeting included: Collateral by Ellen Hopkins Last Night at the Telegraph Club by Malinda Lo Empire of Storms by Sarah J. Maas Half of a Yellow Sun by Chimamanda Ngozi Adichie Hopeless by Colleen Hoover Identical by Ellen Hopkins Kingdom of Ash by Sarah J. Maas Living Dead Girl by Elizabeth Scott Lucky by Alice Sebold Tricks by Ellen Hopkins Due to Regulation 43-170 (R-43-170), decisions over content in school libraries is in the hands of the South Carolina Department of Education. Materials deemed to have “descriptions of sexual content” are inappropriate for schools and must be removed. What that phrase means is intentionally vague, allowing for the opinions of a small number of individuals within the state to decide on behalf of all students and parents statewide. The South Carolina Department of Education, headed by Ellen Weaver–who used taxpayer money to hire a lawyer to lobby in support of this school book banning bill–set up an Instructional Materials Review Committee (IMRC), where any parent in the state can submit complaints. This has allowed individuals to exert significant power in what’s available not only in their public schools but in schools statewide. The IMRC reviews complaints and elects whether or not to advance the complaints to the Department of Education for a final decision. Decisions are made not on reading the entire book and assessing whether or not it rises to the definition of obscenity per the Miller Test. They’re made based on excerpts provided by the person bringing about the complaints. Literary Activism Newsletter News you can use plus tips and tools for the fight against censorship and other bookish activism! Thank you for signing up! Keep an eye on your inbox. The IMRC recommended that 10 new books be added to the state-sponsored banned list. Those decisions were passed on to the Department of Education who voted to table the decision making for a future meeting. This was in no small part thanks to the voices of several board members. Among them was Dr. O’Shield. He spoke at length about how all of the books banned so far–as well as the 10 on the docket for the day–were coming from one single county out of a state with more than 40 counties. As an educator, he had not seen problems with any of the books in his own school and put in the effort to see how many of the 10 titles were available where he taught, when they were purchased, and how frequently they’d been borrowed. O’Shield also questioned why there could not be restrictions applied to books, rather than outright bans. He mentioned that there are plenty of 18 year olds in high school who shouldn’t be restricted from accessing so-called “adult” materials. The IMRC explained that this option is one among many the committee can recommend and has in the past. Ellen Hopkins’s book Crank, for example, is only available with parental permissions. This restriction option, however, is not available to books that meet the state’s criminal code definition of depictions of “sexual content.” That’s why the 10 books at hand could not be given that recommendation and why Crank could. Crank‘s content did not meet that threshold. Reverend Tony Vincent, a newcomer to the state education board, talked about how reading passages out of context–as is how the decisions have been made in the state–is a deep disservice. While he may not wish his own children to read the books, he acknowledged that not only are there young people who would benefit from the books but also that his duty in his role on the board (and elsewhere) was to make decisions out of love for other people. Banning books statewide over a small selection of passages would be the opposite of acting in love. Board member Maya Slaughter spoke, pointing out that now that the Board has been through this review process, it seemed as though they may now be able to identify potential abuses of the process. She suggested more time to review the process before making any decisions on the slate of books. That would ultimately be granted. South Carolina banned its first round of books for all public schools on Election Day when people were otherwise occupied. Seven made the initial list. In the weeks following the ban of those books, listed below, further action was taken in deciding to not ban Crank by Ellen Hopkins but to restrict its access to parents who grant opt-in permission. In early February 2025, the State Department of Education voted to ban four more books. Those titles were The Perks of Being a Wallflower by Stephen Chbosky, All Boys Aren’t Blue by George M. Johnson, Flamer by Mike Curato, and Push by Sapphire. Two additional books brought before them at that meeting were retained, meaning they could remain in public schools: Bronx Masquerade by Nikki Grimes and The House on Mango Street by Sandra Cisneros. Those two titles were part of a series of challenges by one parent in the Fort Mill School District; that parent unsuccessfully challenged a third title, too, an introduction to literature for 8th graders textbook. All 10 of the books brought before the South Carolina Department of Education today were challenged by one individual, Elizabeth Szalai. Szalai was behind the demands to remove nearly 100 titles challenged in Beaufort County Schools, the bulk of which were returned to shelves. With South Carolina’s new law, she and others like her now have the opportunity to take their complaints beyond their own school district and potentially have books pulled from all public schools in the state. Szalai was behind the complaints that led to the state banning four books in February. One single parent has had outsized power to have books banned across an entire state. Complaints over each of the books, both banned and retained, are available the South Carolina Department of Education’s website (here is where final decisions and associated documents live and here is where pending decisions and associated documents live). Take the time to read them and understand these decisions are being made on conspiracy theories and cherry picked passages being distributed by Moms For Liberty and similar groups. One member of the board in today’s meeting suggested that some of the titles in question could be used by older students or librarians to “indoctrinate” younger people. For all the arguments about “local control,” the power given to the State Board of Education to remove books statewide is the precise opposite. The South Carolina Department of Education is the arbiter of what is and is not accessible to students in public institutions across the state, not those who live or work in those communities. Today’s decision suggests that many have come to realize the consequences associated with that power. This is a positive motion. The full list of books banned in every public school in South Carolina is currently as follows: Damsel by Elana K. Arnold Ugly Love by Colleen Hoover A Court of Frost and Starlight by Sarah J. Maas A Court of Mist and Fury by Sarah J. Maas A Court of Thorns and Roses by Sarah J. Maas A Court of Wings and Ruin by Sarah J. Maas Normal People by Sally Rooney The Perks of Being a Wallflower by Stephen Chbosky All Boys Aren’t Blue by George M. Johnson Flamer by Mike Curato Push by Sapphire Three states have legal mechanisms that allow for statewide book bans, though only South Carolina and Utah have used them so far. The other state is Tennessee.",
  "image": "https://s2982.pcdn.co/wp-content/uploads/2025/04/sc-banned-books-4125-1.jpg.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"post-area\"\u003e\n\n\t\t\n\t\t\t\t\t\n\n\t\t\u003carticle\u003e\n\n\t\t\t\u003cdiv itemprop=\"mainEntityOfPage\"\u003e\n\n\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg width=\"620\" height=\"332\" src=\"https://s2982.pcdn.co/wp-content/uploads/2025/04/sc-banned-books-4125-1.jpg.webp\" alt=\"collage of books up for discussion to be banned in south carolina on april 1\" fetchpriority=\"high\" loading=\"eager\" decoding=\"async\" srcset=\"https://s2982.pcdn.co/wp-content/uploads/2025/04/sc-banned-books-4125-1.jpg.webp 700w, https://s2982.pcdn.co/wp-content/uploads/2025/04/sc-banned-books-4125-1-300x161.jpg.webp 300w\" sizes=\"(max-width: 620px) 100vw, 620px\"/\u003e\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t\u003cp\u003eThis content contains affiliate links. When you buy through these links, we may earn an affiliate commission.\u003c/p\u003e\n\t\t\t\t\u003cdiv itemprop=\"articleBody\" class=\"post-593572 post type-post status-publish format-standard has-post-thumbnail hentry category-literary-activism category-news pmpro-has-access\"\u003e\n\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\u003cp\u003e\u003cspan\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eKelly is a former librarian and a long-time blogger at STACKED. She\u0026#39;s the editor/author of (DON\u0026#39;T) CALL ME CRAZY: 33 VOICES START THE CONVERSATION ABOUT MENTAL HEALTH and the editor/author of HERE WE ARE: FEMINISM FOR THE REAL WORLD. Her next book, BODY TALK, will publish in Fall 2020. Follow her on Instagram \u003ca href=\"http://instagram.com/heykellyjensen\"\u003e@heykellyjensen\u003c/a\u003e.\u003c/p\u003e\n\t\t\t\t\u003cp\u003e\u003ca href=\"https://bookriot.com/author/kellyjensen/\"\u003eView All posts by Kelly Jensen\u003c/a\u003e\u003c/p\u003e\n\t\t\t\u003c/span\u003e\n\t\t\u003c/p\u003e\n\t\t\u003cdiv\u003e\u003cp\u003eWhether or not public school students will continue to have fewer diverse choices in their reading life across South Carolina was the topic of today’s State Department of Education meeting. Ten books were on the table for statewide removal following committee input, but a robust discussion about the unintended consequences of such decisions–and the abuse of the process that has imbued one parent in one county with outsized power to ban books across the state–led to a motion to table the decisions for another month.  \u003c/p\u003e\n\u003cp\u003eThe books under consideration at the April 1, 2025 meeting included: \u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ca product-id=\"145162638X\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fcollateral_ellen-hopkins%2F363068%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" title=\"Buy from Thriftbooks\" data-title=\"Collateral: A Novel\" data-publisher=\"Atria Books\" data-releasedate=\"2013-07-23\" data-ean=\"9781451626384\" data-asin=\"145162638X\" data-author=\"Hopkins, Ellen\" rel=\"noopener\"\u003eCollateral\u003c/a\u003e by Ellen Hopkins\u003c/li\u003e\n\u003cli\u003e\u003ca product-id=\"0525555277\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Flast-night-at-the-telegraph-club_malinda-lo%2F26522922%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" title=\"Buy from Thriftbooks\" data-title=\"Last Night at the Telegraph Club\" data-publisher=\"Dutton Books for Young Readers\" data-releasedate=\"2021-12-28\" data-ean=\"9780525555278\" data-asin=\"0525555277\" data-author=\"Lo, Malinda\" rel=\"noopener\"\u003eLast Night at the Telegraph Club\u003c/a\u003e by Malinda Lo\u003c/li\u003e\n\u003cli\u003e\u003ca product-id=\"1639731032\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fempire-of-storms_sarah-j-maas%2F11593804%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" title=\"Buy from Thriftbooks\" data-title=\"Empire of Storms (Throne of Glass, 5)\" data-publisher=\"Bloomsbury Publishing\" data-releasedate=\"2023-02-14\" data-ean=\"9781639731039\" data-asin=\"1639731032\" data-author=\"Maas, Sarah J.\" rel=\"noopener\"\u003eEmpire of Storms\u003c/a\u003e by Sarah J. Maas\u003c/li\u003e\n\u003cli\u003e\u003ca product-id=\"1400095204\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fhalf-of-a-yellow-sun_chimamanda-ngozi-adichie%2F251020%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" title=\"Buy from Thriftbooks\" data-title=\"Half of a Yellow Sun\" data-publisher=\"Vintage\" data-releasedate=\"2007-09-04\" data-ean=\"9781400095209\" data-asin=\"1400095204\" data-author=\"Adichie, Chimamanda Ngozi\" rel=\"noopener\"\u003eHalf of a Yellow Sun\u003c/a\u003e by Chimamanda Ngozi Adichie\u003c/li\u003e\n\u003cli\u003e\u003ca product-id=\"1728297044\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fhopeless-special-edition%2F51000418%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" title=\"Buy from Thriftbooks\" data-title=\"Hopeless (Chestnut Springs, 5)\" data-publisher=\"Bloom Books\" data-releasedate=\"2024-01-30\" data-ean=\"9781728297040\" data-asin=\"1728297044\" data-author=\"Silver, Elsie\" rel=\"noopener\"\u003eHopeless\u003c/a\u003e by Colleen Hoover\u003c/li\u003e\n\u003cli\u003e\u003ca product-id=\"B001GIBLSU\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fidentical-by-ellen-hopkins%2F253377%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" title=\"Buy from Thriftbooks\" data-title=\"Identical\" data-publisher=\"HighBridge, a division of Recorded Books\" data-releasedate=\"2008-09-19\" data-ean=\"\" data-asin=\"B001GIBLSU\" data-author=\"Ellen Hopkins\" rel=\"noopener\"\u003eIdentical\u003c/a\u003e by Ellen Hopkins\u003c/li\u003e\n\u003cli\u003e\u003ca product-id=\"1639731075\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fthe-vampire-gift-2-kingdom-of-ash%2F19452056%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" title=\"Buy from Thriftbooks\" data-title=\"Kingdom of Ash (Throne of Glass, 7)\" data-publisher=\"Bloomsbury Publishing\" data-releasedate=\"2023-02-14\" data-ean=\"9781639731077\" data-asin=\"1639731075\" data-author=\"Maas, Sarah J.\" rel=\"noopener\"\u003eKingdom of Ash\u003c/a\u003e by Sarah J. Maas\u003c/li\u003e\n\u003cli\u003e\u003ca product-id=\"1416960600\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fliving-dead-girl_elizabeth-scott%2F277843%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" title=\"Buy from Thriftbooks\" data-title=\"Living Dead Girl\" data-publisher=\"Simon \u0026amp; Schuster Books for Young Readers\" data-releasedate=\"2009-09-08\" data-ean=\"9781416960607\" data-asin=\"1416960600\" data-author=\"Scott, Elizabeth\" rel=\"noopener\"\u003eLiving Dead Girl\u003c/a\u003e by Elizabeth Scott\u003c/li\u003e\n\u003cli\u003e\u003ca product-id=\"1509873937\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Flucky_alice-sebold%2F252735%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" title=\"Buy from Thriftbooks\" data-title=\"Lucky (Picador Classic)\" data-publisher=\"Picador\" data-releasedate=\"2019-03-07\" data-ean=\"9781509873937\" data-asin=\"1509873937\" data-author=\"Alice Sebold\" rel=\"noopener\"\u003eLucky\u003c/a\u003e by Alice Sebold\u003c/li\u003e\n\u003cli\u003e\u003ca product-id=\"148149824X\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Ftricks_ellen-hopkins%2F254738%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" title=\"Buy from Thriftbooks\" data-title=\"Tricks\" data-publisher=\"Margaret K. McElderry Books\" data-releasedate=\"2017-01-24\" data-ean=\"9781481498241\" data-asin=\"148149824X\" data-author=\"Hopkins, Ellen\" rel=\"noopener\"\u003eTricks\u003c/a\u003e by Ellen Hopkins\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDue to \u003ca href=\"https://www.aclusc.org/sites/default/files/field_documents/240410book-ban-regulation-amended.pdf?utm_source=wellsourced\u0026amp;utm_medium=email\u0026amp;utm_campaign=on-election-day-south-carolina-banned\"\u003eRegulation 43-170\u003c/a\u003e (R-43-170), decisions over content in school libraries is in the hands of the South Carolina Department of Education. Materials deemed to have “descriptions of sexual content” are inappropriate for schools and must be removed. What that phrase means is intentionally vague, allowing for the opinions of a small number of individuals within the state to decide on behalf of all students and parents statewide. \u003c/p\u003e\n\u003cp\u003eThe South Carolina Department of Education, headed by Ellen Weaver–who \u003ca href=\"https://bookriot.com/two-vague-and-dangerous-book-ban-bills-in-south-carolina-target-public-and-school-libraries/\"\u003eused taxpayer money to hire a lawyer\u003c/a\u003e to lobby in support of this school book banning bill–set up an Instructional Materials Review Committee (IMRC), where any parent in the state can submit complaints. This has allowed individuals to exert significant power in what’s available not only in their public schools but in schools statewide.\u003c/p\u003e\n\n\u003cp\u003eThe IMRC reviews complaints and elects whether or not to advance the complaints to the Department of Education for a final decision. Decisions are made not on reading the entire book and assessing whether or not it rises to the definition of obscenity per the Miller Test. They’re made based on excerpts provided by the person bringing about the complaints.\u003c/p\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cp\u003eLiterary Activism Newsletter\u003c/p\u003e\n\u003cp\u003e\nNews you can use plus tips and tools for the fight against censorship and other bookish activism!\n\u003c/p\u003e\n\u003c/div\u003e\n\n\n\u003cp\u003eThank you for signing up! Keep an eye on your inbox.\u003c/p\u003e\n\n\u003c/div\u003e\n\u003cp\u003eThe IMRC recommended that 10 new books be added to the state-sponsored banned list. Those decisions were passed on to the Department of Education who voted to table the decision making for a future meeting. This was in no small part thanks to the voices of several board members.  \u003c/p\u003e\n\u003cp\u003eAmong them was Dr. O’Shield. He spoke at length about how all of the books banned so far–as well as the 10 on the docket for the day–were coming from one single county out of a state with more than 40 counties. As an educator, he had not seen problems with any of the books in his own school and put in the effort to see how many of the 10 titles were available where he taught, when they were purchased, and how frequently they’d been borrowed. \u003c/p\u003e\n\n\n\n\n\u003cp\u003eO’Shield also questioned why there could not be restrictions applied to books, rather than outright bans. He mentioned that there are plenty of 18 year olds in high school who shouldn’t be restricted from accessing so-called “adult” materials. The IMRC explained that this option is one among many the committee can recommend and has in the past. Ellen Hopkins’s book \u003cem\u003e\u003ca product-id=\"B001E8O12A\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fcrank_ellen-hopkins%2F251348%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" title=\"Buy from Thriftbooks\" data-title=\"Crank\" data-publisher=\"HighBridge, a division of Recorded Books\" data-releasedate=\"2008-08-13\" data-ean=\"\" data-asin=\"B001E8O12A\" data-author=\"Ellen Hopkins\" rel=\"noopener\"\u003eCrank\u003c/a\u003e\u003c/em\u003e, for example, is only available with parental permissions. \u003c/p\u003e\n\u003cp\u003eThis restriction option, however, is not available to books that meet the state’s criminal code definition of depictions of “sexual content.” That’s why the 10 books at hand could not be given that recommendation and why \u003cem\u003eCrank \u003c/em\u003ecould. \u003cem\u003eCrank\u003c/em\u003e‘s content did not meet that threshold. \u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\u003cp\u003eReverend Tony Vincent, a newcomer to the state education board, talked about how reading passages out of context–as is how the decisions have been made in the state–is a deep disservice. While he may not wish his own children to read the books, he acknowledged that not only are there young people who would benefit from the books but also that his duty in his role on the board (and elsewhere) was to make decisions out of love for other people. Banning books statewide over a small selection of passages would be the opposite of acting in love. \u003c/p\u003e\n\u003cp\u003eBoard member Maya Slaughter spoke, pointing out that now that the Board has been through this review process, it seemed as though they may now be able to identify potential abuses of the process. She suggested more time to review the process before making any decisions on the slate of books. \u003c/p\u003e\n\n\u003cp\u003eThat would ultimately be granted. \u003c/p\u003e\n\u003cp\u003eSouth Carolina banned its first round of books for all public schools \u003ca href=\"https://buttondown.com/wellsourced/archive/on-election-day-south-carolina-banned/\"\u003eon Election Day\u003c/a\u003e when people were otherwise occupied. Seven made the initial list. In the weeks following the ban of those books, listed below, further action was taken in deciding to not ban \u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fcrank_ellen-hopkins%2F251348%2F\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eCrank\u003c/a\u003e by Ellen Hopkins but to restrict its access to parents who grant opt-in permission.\u003c/p\u003e\n\u003cp\u003eIn early February 2025, the State Department of Education voted to ban four more books. Those titles were \u003cem\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"1451696191\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fthe-perks-of-being-a-wallflower-by-stephen-chbosky%2F249844%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"The Perks of Being a Wallflower\" data-publisher=\"MTV Books\" data-releasedate=\"2012-08-14\" data-author=\"Chbosky, Stephen\" data-ean=\"8601234622277\" data-asin=\"1451696191\"\u003eThe Perks of Being a Wallflower\u003c/a\u003e \u003c/em\u003eby Stephen Chbosky, \u003cem\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"1250895561\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fall-boys-arent-blue-a-memoir-manifesto_george-m-johnson%2F22379733%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"All Boys Aren\u0026#39;t Blue: A Memoir-Manifesto\" data-publisher=\"Square Fish\" data-releasedate=\"2024-01-16\" data-author=\"Johnson, George M.\" data-ean=\"9781250895561\" data-asin=\"1250895561\"\u003eAll Boys Aren’t Blue \u003c/a\u003e\u003c/em\u003eby George M. Johnson, \u003cem\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"1250756146\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fflamer_mike-curato%2F24511538%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Flamer\" data-publisher=\"Henry Holt and Co. BYR Paperbacks\" data-releasedate=\"2020-09-01\" data-author=\"Curato, Mike\" data-ean=\"9781250756145\" data-asin=\"1250756146\"\u003eFlamer\u003c/a\u003e \u003c/em\u003eby Mike Curato, and \u003cem\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"0593314603\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fpush-by-sapphire%2F251582%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Push (Revised) (Vintage Contemporaries)\" data-publisher=\"Vintage\" data-releasedate=\"2021-06-22\" data-author=\"Sapphire\" data-ean=\"9780593314609\" data-asin=\"0593314603\"\u003ePush\u003c/a\u003e\u003c/em\u003e by Sapphire. Two additional books brought before them at that meeting were retained, meaning they could remain in public schools: \u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fbronx-masquerade_nikki-grimes%2F248481%2F\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBronx Masquerade\u003c/a\u003e by Nikki Grimes and \u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fthe-house-on-mango-street-by-sandra-cisneros%2F245791%2F\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eThe House on Mango Street\u003c/a\u003e by Sandra Cisneros. Those two titles were part of a series of challenges by \u003ca href=\"https://buttondown.com/wellsourced/archive/the-next-books-targeted-in-south/\"\u003eone parent in the Fort Mill School District\u003c/a\u003e; that parent unsuccessfully challenged a third title, too, an introduction to literature for 8th graders textbook.\u003c/p\u003e\n\u003cp\u003eAll 10 of the books brought before the South Carolina Department of Education today were challenged by one individual, Elizabeth Szalai. Szalai was behind the demands \u003ca href=\"https://www.cbsnews.com/news/beaufort-south-carolina-schools-return-most-books-to-shelves-after-attempt-to-ban-97-60-minutes-transcript/\"\u003eto remove nearly 100 titles challenged in Beaufort County Schools\u003c/a\u003e, the bulk of which were returned to shelves. With South Carolina’s new law, she and others like her now have the opportunity to take their complaints beyond their own school district and potentially have books pulled from \u003cem\u003eall \u003c/em\u003epublic schools in the state. Szalai was behind the complaints that led to the state banning four books in February.\u003c/p\u003e\n\u003cp\u003eOne single parent has had outsized power to have books banned across an entire state. \u003c/p\u003e\n\u003cp\u003eComplaints over each of the books, both banned and retained, are available the South Carolina Department of Education’s website (\u003ca href=\"https://ed.sc.gov/state-board/state-board-of-education/library-regulation/instructional-material-reviewed/\"\u003ehere is where final decisions\u003c/a\u003e and associated documents live and \u003ca href=\"https://ed.sc.gov/state-board/state-board-of-education/library-regulation/instructional-material-under-review/\"\u003ehere is where pending decisions \u003c/a\u003eand associated documents live). Take the time to read them and understand these decisions are being made on conspiracy theories and cherry picked passages being distributed by Moms For Liberty and similar groups. One member of  the board in today’s meeting suggested that some of the titles in question could be used by older students or librarians to “indoctrinate” younger people. \u003c/p\u003e\n\u003cp\u003eFor all the arguments about “local control,” the power given to the State Board of Education to remove books statewide is the precise opposite. The South Carolina Department of Education is the arbiter of what is and is not accessible to students in public institutions across the state, not those who live or work in those communities. \u003c/p\u003e\n\u003cp\u003eToday’s decision suggests that many have come to realize the consequences associated with that power. This is a \u003cem\u003epositive \u003c/em\u003emotion. \u003c/p\u003e\n\u003cp\u003eThe full list of books banned in every public school in South Carolina is currently as follows:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fdamsel_elana-k-arnold%2F18594892%2F\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eDamsel\u003c/em\u003e\u003c/a\u003e by Elana K. Arnold\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fugly-love_colleen-hoover%2F3263317%2F\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eUgly Love\u003c/em\u003e\u003c/a\u003e by Colleen Hoover\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fa-court-of-frost-and-starlight_sarah-j-maas%2F18677294%2F\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eA Court of Frost and Starlight\u003c/em\u003e\u003c/a\u003e by Sarah J. Maas\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fa-court-of-mist-and-fury_sarah-j-maas%2F9939222%2F\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eA Court of Mist and Fury\u003c/em\u003e\u003c/a\u003e by Sarah J. Maas\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fa-court-of-thorns-and-roses%2F9280355%2F\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eA Court of Thorns and Roses\u003c/em\u003e\u003c/a\u003e by Sarah J. Maas\u003c/li\u003e\n\u003cli\u003e\u003cem\u003e\u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fa-court-of-wings-and-ruin_sarah-j-maas%2F13538460%2F\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eA Court of Wings and Ruin\u003c/a\u003e \u003c/em\u003eby Sarah J. Maas\u003c/li\u003e\n\u003cli\u003e\u003cem\u003e\u003ca href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fnormal-people_sally-rooney%2F19514700%2F\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eNormal People\u003c/a\u003e \u003c/em\u003eby Sally Rooney\u003c/li\u003e\n\u003cli\u003e\u003cem\u003e\u003ca title=\"Buy from Thriftbooks\" product-id=\"1451696191\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fthe-perks-of-being-a-wallflower-by-stephen-chbosky%2F249844%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"The Perks of Being a Wallflower\" data-publisher=\"MTV Books\" data-releasedate=\"2012-08-14\" data-author=\"Chbosky, Stephen\" data-ean=\"8601234622277\" data-asin=\"1451696191\" rel=\"noopener\"\u003eThe Perks of Being a Wallflower\u003c/a\u003e \u003c/em\u003eby Stephen Chbosky\u003c/li\u003e\n\u003cli\u003e\u003cem\u003e\u003ca title=\"Buy from Thriftbooks\" product-id=\"1250895561\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fall-boys-arent-blue-a-memoir-manifesto_george-m-johnson%2F22379733%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"All Boys Aren\u0026#39;t Blue: A Memoir-Manifesto\" data-publisher=\"Square Fish\" data-releasedate=\"2024-01-16\" data-author=\"Johnson, George M.\" data-ean=\"9781250895561\" data-asin=\"1250895561\" rel=\"noopener\"\u003eAll Boys Aren’t Blue \u003c/a\u003e\u003c/em\u003eby George M. Johnson\u003c/li\u003e\n\u003cli\u003e\u003cem\u003e\u003ca title=\"Buy from Thriftbooks\" product-id=\"1250756146\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fflamer_mike-curato%2F24511538%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Flamer\" data-publisher=\"Henry Holt and Co. BYR Paperbacks\" data-releasedate=\"2020-09-01\" data-author=\"Curato, Mike\" data-ean=\"9781250756145\" data-asin=\"1250756146\" rel=\"noopener\"\u003eFlamer\u003c/a\u003e \u003c/em\u003eby Mike Curato\u003c/li\u003e\n\u003cli\u003e\u003cem\u003e\u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"0593314603\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fpush-by-sapphire%2F251582%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"Push (Revised) (Vintage Contemporaries)\" data-publisher=\"Vintage\" data-releasedate=\"2021-06-22\" data-author=\"Sapphire\" data-ean=\"9780593314609\" data-asin=\"0593314603\"\u003ePush\u003c/a\u003e\u003c/em\u003e by Sapphire\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThree states have legal mechanisms that allow for statewide book bans, though only South Carolina and \u003ca href=\"https://bookriot.com/utah-bans-17th-book-from-public-schools-statewide/\"\u003eUtah\u003c/a\u003e have used them so far. The other state is Tennessee. \u003c/p\u003e\n\u003c/div\u003e\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/div\u003e\n\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\t\t\n\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-04-01T19:40:00Z",
  "modifiedTime": null
}
