{
  "id": "db47af76-f634-44c0-baba-63037fa73425",
  "title": "PROJECT HAIL MARY Looks Like a Slam Dunk",
  "link": "https://bookriot.com/project-hail-mary-looks-like-a-slam-dunk/",
  "description": "The PROJECT HAIL MARY trailer, the ramifcations of Mahmoud v. Taylor, and more of the day's book news.",
  "author": "Jeff O'Neal",
  "published": "Mon, 30 Jun 2025 17:04:41 +0000",
  "source": "https://bookriot.com/feed/",
  "categories": [
    "Today in Books"
  ],
  "byline": "Jeff O'Neal",
  "length": 3253,
  "excerpt": "The PROJECT HAIL MARY trailer, the ramifcations of Mahmoud v. Taylor, and more of the day's book news.",
  "siteName": "BOOK RIOT",
  "favicon": "https://s2982.pcdn.co/wp-content/themes/bookriot/assets/images/favicons/BookRiot_Logo_192.png.webp",
  "text": "This content contains affiliate links. When you buy through these links, we may earn an affiliate commission. Welcome to Today in Books, our daily round-up of literary headlines at the intersection of politics, culture, media, and more. First Trailer for Adaptation of Project Hail Mary by Andy Weir I heard that footage shown earlier this year to movie-theater owners was awesome. The book is awesome. Lord \u0026 Miller made the Spider-verse movies, which are are awesome. Drew Goddard is back to write the screenplay after nailing The Martian, which was awesome. And so it comes as no surprise that the trailer for Project Hail Mary (releasing March 20th, 2026) is awesome. Does it feel a lot like The Martian meets ET? Why yes. And that is awesome. Supreme Court Says Parents Can “Opt Out” Of Positively-Affirming LGBTQ+ Public School Lessons I’ve been waiting for our own Kelly Jensen’s breakdown of the Mahmoud v. Taylor decision that dropped on Friday, and she did not disappoint. Through a strange quirk, I was walking by the actual Supreme Court building when the Friday decision-drop happened. This has no bearing on anything, but I felt like it was too bizarre a coincidence to omit). The key quote she pulls is as galling as you might expect: “very real threat of undermining the religious beliefs and practices the parents wish to instill.” And what is this very real threat? Affirming portrayals of LGBTQ+ folks in books. Because it gets in the way of their religion’s homophobia. This is a mundus inversus reading of the old separation of church and state that I felt like I understood pretty well all the way back in 8th grade. Here’s Kelly on why it feels like that: “It is important to understand that for the religious right, the Establishment Clause is interpreted differently than it is for the general population. Where most read the separation of church and state to mean that religious doctrine cannot be infused in government operations–i.e., public schools cannot require prayer–for the religious right, the Clause is interpreted the opposite. The state cannot impede on where or how their beliefs are applied–i.e., public schools cannot provide positively-affirming lessons on LGBTQ+ people because it counteracts their individual beliefs on the matter.” A disheartening, bend-back-the-arc-of-justice, moment that will not be undone anytime soon. George RR Martin Wants You To Read Joe Abercrombie I would guess that Martin would be absolutely thrilled to turn some of his fans onto to something other than Song of Ice and Fire Watch, which is now going on 15 years. I wondered a few weeks ago if James Cameron’s decision to adapt The Devils would get the Abercrombie as a Known Author ball rolling, and while I cannot draw a line between Cameron’s praise and Martin’s recco, it probably doesn’t matter. This feels like it happening. Heck, I, an avowed and practicing reading coward, am considering giving it ago. Last Day: Enter to Win $250 to Spend at Powell’s Books You can spend it online. You could even just keep it forever in your email, knowing you have it. But to win this $250 to spend at Powell’s, you have to enter. And you can do that by clicking here, or the beautiful image below.",
  "image": "https://s2982.pcdn.co/wp-content/uploads/2025/06/Untitled-10.jpg.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eThis content contains affiliate links. When you buy through these links, we may earn an affiliate commission.\u003c/p\u003e\u003cdiv itemprop=\"articleBody\"\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cem\u003eWelcome to Today in Books, our daily round-up of literary headlines at the intersection of politics, culture, media, and more.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003ch2\u003eFirst Trailer for Adaptation of \u003cem\u003eProject Hail Mary\u003c/em\u003e by Andy Weir\u003c/h2\u003e\n\n\n\n\u003cp\u003eI heard that footage shown earlier this year to movie-theater owners was awesome. The book is awesome. Lord \u0026amp; Miller made the Spider-verse movies, which are are awesome. Drew Goddard is back to write the screenplay after nailing The Martian, which was awesome. And so it comes as no surprise that \u003ca href=\"https://www.youtube.com/watch?v=m08TxIsFTRI\"\u003ethe trailer for \u003cem\u003eProject Hail Mary\u003c/em\u003e (releasing March 20th, 2026) is awesome\u003c/a\u003e. Does it feel a lot like \u003cem\u003eThe Martian\u003c/em\u003e meets \u003cem\u003eET\u003c/em\u003e? Why yes. And that is awesome. \u003c/p\u003e\n\n\n\n\u003ch2\u003eSupreme Court Says Parents Can “Opt Out” Of Positively-Affirming LGBTQ+ Public School Lessons\u003c/h2\u003e\n\n\n\n\u003cp\u003eI’ve been waiting for our own \u003ca href=\"https://bookriot.com/supreme-court-opinion-in-mahmoud-v-taylor/\"\u003eKelly Jensen’s breakdown of the Mahmoud v. Taylor decision that dropped on Friday\u003c/a\u003e, and she did not disappoint. Through a strange quirk, I was walking by the actual Supreme Court building when the Friday decision-drop happened. This has no bearing on anything, but I felt like it was too bizarre a coincidence to omit). The key quote she pulls is as galling as you might expect: “very real threat of undermining the religious beliefs and practices the parents wish to instill.” And what is this very real threat? Affirming portrayals of LGBTQ+ folks in books. Because it gets in the way of their religion’s homophobia.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis is \u003cem\u003ea mundus inversus\u003c/em\u003e reading of the old separation of church and state that I felt like I understood pretty well all the way back in 8th grade. Here’s Kelly on why it feels like that:\u003c/p\u003e\n\n\n\n\u003cp\u003e“It is important to understand that for the religious right, the Establishment Clause is interpreted differently than it is for the general population. Where most read the separation of church and state to mean that religious doctrine cannot be infused in government operations–i.e., public schools cannot require prayer–for the religious right, the Clause is interpreted the opposite. The state cannot impede on where or how their beliefs are applied–i.e., public schools cannot provide positively-affirming lessons on LGBTQ+ people because it counteracts their individual beliefs on the matter.”\u003c/p\u003e\n\n\n\n\u003cp\u003eA disheartening, bend-back-the-arc-of-justice, moment that will not be undone anytime soon. \u003c/p\u003e\n\u003c/div\u003e\n\n\u003cdiv\u003e\n\u003ch2\u003eGeorge RR Martin Wants You To Read Joe Abercrombie\u003c/h2\u003e\n\n\n\n\u003cp\u003eI would guess that Martin would be absolutely thrilled\u003ca href=\"https://winteriscoming.net/george-r-r-martin-wants-you-to-read-joe-abercrombie-s-fantasy-books\"\u003e to turn some of his fans onto to something other than Song of Ice and Fire Watch\u003c/a\u003e, which is now going on 15 years. I wondered a few weeks ago if James Cameron’s decision to adapt \u003ca title=\"Buy from Thriftbooks\" rel=\"noopener\" product-id=\"125088005X\" href=\"https://prf.hn/click/camref:1101lkCeo/destination:https%3A%2F%2Fwww.thriftbooks.com%2Fw%2Fthe-devils_joe-abercrombie%2F52915379%2F\" target=\"_blank\" butter=\"butter\" nofollow=\"nofollow\" data-title=\"The Devils (Devils, 1)\" data-publisher=\"Tor Books\" data-releasedate=\"2025-05-13\" data-author=\"Abercrombie, Joe\" data-ean=\"9781250880055\" data-asin=\"125088005X\"\u003eThe Devils\u003c/a\u003e would get the Abercrombie as a Known Author ball rolling, and while I cannot draw a line between Cameron’s praise and Martin’s recco, it probably doesn’t matter. This feels like it happening. Heck, I, an avowed and practicing reading coward, am considering giving it ago.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003ca href=\"https://bit.ly/3I00C7E\"\u003eLast Day: Enter to Win $250 to Spend at Powell’s Books\u003c/a\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eYou can spend it online. You could even just keep it forever in your email, knowing you have it. But to win this $250 to spend at Powell’s, you have to enter. And you can do that by \u003ca href=\"https://bookriot.com/giveaways/enter-to-win-200-to-books-a-million-2/\"\u003eclicking here\u003c/a\u003e, or the beautiful image below. \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003ca href=\"https://bit.ly/3I00C7E\"\u003e\u003cimg decoding=\"async\" width=\"600\" height=\"221\" src=\"https://s2982.pcdn.co/wp-content/uploads/2025/06/powells-books-1.jpg.webp\" alt=\"\" srcset=\"https://s2982.pcdn.co/wp-content/uploads/2025/06/powells-books-1.jpg.webp 600w, https://s2982.pcdn.co/wp-content/uploads/2025/06/powells-books-1-300x111.jpg.webp 300w\" sizes=\"(max-width: 600px) 100vw, 600px\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%20600%20221\u0026#39;%3E%3C/svg%3E\" data-lazy-srcset=\"https://s2982.pcdn.co/wp-content/uploads/2025/06/powells-books-1.jpg.webp 600w, https://s2982.pcdn.co/wp-content/uploads/2025/06/powells-books-1-300x111.jpg.webp 300w\" data-lazy-src=\"https://s2982.pcdn.co/wp-content/uploads/2025/06/powells-books-1.jpg.webp\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\u003c/div\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-30T17:04:41Z",
  "modifiedTime": "2025-06-30T17:47:37Z"
}
