{
  "id": "f50a061c-ce5b-4be0-8b90-d63235cbfec6",
  "title": "DEENA UNDONE",
  "link": "https://www.kirkusreviews.com/book-reviews/debra-k-every/deena-undone/",
  "description": "Deena Bartlett cares for her dying, elderly Aunt Agatha at Wilshire Rehab Center. She has long had a tumultuous relationship with her cantankerous aunt, but Deena—partly fueled by the facts that her own parents were both dead by the time she was 25 and that Agatha is the only living relative she has left— attempts to do her part. When Wilshire’s mysterious old cleaning woman, Jadwiga, warns her to “take care…She is coming for you,” Deena soon finds herself facing a nightmarish set of attacks seemingly designed to take out her five senses, one by one: “The hum rose higher in pitch, piercing the stale, hot air. Deena threw her hands over her ears hoping to block it out—which was when she discovered it wasn’t coming from the room. It was coming from inside her head, growing louder and higher, throbbing against her temples, pressing against her eyes until it felt as if they would burst from their sockets.” Deena seeks help from Jadwiga, who reveals that Agatha made a deal with the Sensu, an ancient creature who feeds off Deena’s senses in exchange for curing Agatha. After each attack, Deena is left with a mark somewhere on her body for five days before the Sensu moves on to the next sense. When Deena is branded with the last Tactu (touch) mark, her life will end. To stop the relentless attacks, Deena must discover the truth behind her aunt’s bargain before it’s too late.Every has crafted a genuinely spooky tale that relies less on body horror and more on the slow and patient buildup of moody suspense—an approach that fans of Grady Hendrix and Stephen King will surely welcome. The gore is never gratuitous as the tension slowly mounts and Deena uncovers the family secrets that have made her a marked woman. That’s not to say the book doesn’t have some absolutely stomach-churning moments, especially when it comes to the twisted old Agatha: “With a satisfying sense of release she pulls off her fingers, one by one, and drops them into the lake, watching the blood turn the water black. As each finger sinks it expands, becoming a formless, irregular mass floating just below the surface. She gazes at them as a mother would her children, her need for a legacy finally satisfied.” The dialogue mostly feels natural, with only a few missteps—such as the repeated appearances throughout the novel of a disembodied voice intoning “I’ve got you now,” a catchphrase that tends to come across as more “campy Wicked Witch” than legitimately creepy. The author manages to infuse her solid horror story with larger themes—including motherhood, grief, youth, and death—that lend Deena an added layer of depth while raising the stakes of her emotional and physical journey. The novel’s eerie, open-ended conclusion is reminiscent of classic horror novels and movies that manage to satisfy even as they unsettle.",
  "author": "",
  "published": "",
  "source": "https://www.kirkusreviews.com/feeds/rss/",
  "categories": null,
  "byline": "by Liane Moriarty",
  "length": 5175,
  "excerpt": "A woman must uncover the truth behind the horrifying bargain that strips her of her senses, one by one, in Every’s horror novel.",
  "siteName": "Kirkus Reviews",
  "favicon": "https://d1fd687oe6a92y.cloudfront.net/img/kir_images/header/apple-icon.png",
  "text": "HERE ONE MOMENT by Liane Moriarty ‧ RELEASE DATE: Sept. 10, 2024 A fresh, funny, ambitious, and nuanced take on some of our oldest existential questions. Cannot wait for the TV series. Awards \u0026 Accolades Likes 10 Our Verdict GET IT New York Times Bestseller What would you do if you knew when you were going to die? In the first page and a half of her latest page-turner, bestselling Australian author Moriarty introduces a large cast of fascinating characters, all seated on a flight to Sydney that’s delayed on the tarmac. There’s the “bespectacled hipster” with his arm in a cast; a very pregnant woman; a young mom with a screaming infant and a sweaty toddler; a bride and groom, still in their wedding clothes; a surly 6-year-old forced to miss a laser-tag party; a darling elderly couple; a chatty tourist pair; several others. No one even notices the woman who will later become a household name as the “Death Lady” until she hops up from her seat and begins to deliver predictions to each of them about the age they’ll be when they die and the cause of their deaths. Age 30, assault, for the hipster. Age 7, drowning, for the baby in arms. Age 43, workplace accident, for a 42-year-old civil engineer. Self-harm, age 28, for the lovely flight attendant, who is that day celebrating her 28th birthday. Over the next 126 chapters (some just a paragraph), you will get to know all these people, and their reactions to the news of their demise, very well. Best of all, you will get to know Cherry Lockwood, the Death Lady, and the life that brought her to this day. Is it true, as she repeatedly intones on the plane, that “fate won’t be fought”? Does this novel support the idea that clairvoyance is real? Does it find a means to logically dismiss the whole thing? Or is it some complex amalgam of these possibilities? Sorry, you won’t find that out here, and in fact not until you’ve turned all 500-plus pages. The story is a brilliant, charming, and invigorating illustration of its closing quote from Elisabeth Kübler-Ross (we’re not going to spill that either). A fresh, funny, ambitious, and nuanced take on some of our oldest existential questions. Cannot wait for the TV series. Pub Date: Sept. 10, 2024 ISBN: 9780593798607 Page Count: 512 Publisher: Crown Review Posted Online: June 15, 2024 Kirkus Reviews Issue: July 15, 2024",
  "image": "https://d1fd687oe6a92y.cloudfront.net/img/user-media/titles/title/cover/4c406950ba114e48ae09cd207c2a6958/9781960456137.jpg.300x0_q85_autocrop.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n                                \u003ch2\u003eHERE ONE MOMENT\u003c/h2\u003e\n                                \n                                \n                                \u003cp\u003e\n                                    by\n                        \u003ca href=\"https://www.kirkusreviews.com/author/liane-moriarty/\"\u003e\n                            Liane Moriarty\n                        \u003c/a\u003e\n\n                                    \u003cspan\u003e ‧\u003c/span\u003e\n                                    \u003cspan\u003eRELEASE DATE: Sept. 10, 2024\u003c/span\u003e\n                                \u003c/p\u003e\n\n                                \u003cp\u003e\n                                    A fresh, funny, ambitious, and nuanced take on some of our oldest existential questions. Cannot wait for the TV series.\n                                \u003c/p\u003e\n\n                                \n\n                                \n\n                                \n                                    \n                                        \n                                            \u003cdiv data-id=\"2000265264\" data-meta-len=\"3\"\u003e\n            \u003cp\u003eAwards \u0026amp; Accolades\u003c/p\u003e\n            \n                \n                    \u003cdiv\u003e\n                            \u003cp\u003eLikes\u003c/p\u003e\n                            \u003cul\u003e\n                                \u003cli\u003e\n                                    \u003cimg src=\"https://d1fd687oe6a92y.cloudfront.net/img/kir_images/icons/like.png\" alt=\"Readers Vote\"/\u003e\n                                \u003c/li\u003e\n                                \u003cli\u003e\n                                    \u003cp id=\"2000265264-total-likes\"\u003e10\u003c/p\u003e\n                                \u003c/li\u003e\n                            \u003c/ul\u003e\n                        \u003c/div\u003e\n                \n\n                \n                    \u003chr/\u003e\n                \n            \n                \n                    \u003cdiv\u003e\n                            \u003cp\u003eOur Verdict\u003c/p\u003e\n                            \u003cul\u003e\n                                \u003cli\u003e\n                                    \u003cimg src=\"https://d1fd687oe6a92y.cloudfront.net/img/kir_images/icons/check-ok.png\" alt=\"Our Verdict\"/\u003e\n                                \u003c/li\u003e\n                                \u003cli\u003e\n                                    \u003cp\u003eGET IT\u003c/p\u003e\n                                \u003c/li\u003e\n                            \u003c/ul\u003e\n                        \u003c/div\u003e\n                \n\n                \n                    \u003chr/\u003e\n                \n            \n                \n                    \u003cdiv\u003e\n                            \u003cul\u003e\n                                \u003cli\u003e\n                                    \u003cp\u003eNew York Times Bestseller\u003c/p\u003e\n                                \u003c/li\u003e\n                            \u003c/ul\u003e\n                        \u003c/div\u003e\n                \n\n                \n            \n        \u003c/div\u003e\n                                        \n                                    \n                                \n\n                                \u003cdiv\u003e\n                                    \n                                        \u003cp\u003eWhat would you do if you knew when you were going to die?\u003c/p\u003e\n                                        \u003cp\u003eIn the first page and a half of her latest page-turner, bestselling Australian author Moriarty introduces a large cast of fascinating characters, all seated on a flight to Sydney that’s delayed on the tarmac. There’s the “bespectacled hipster” with his arm in a cast; a very pregnant woman; a young mom with a screaming infant and a sweaty toddler; a bride and groom, still in their wedding clothes; a surly 6-year-old forced to miss a laser-tag party; a darling elderly couple; a chatty tourist pair; several others. No one even notices the woman who will later become a household name as the “Death Lady” until she hops up from her seat and begins to deliver predictions to each of them about the age they’ll be when they die and the cause of their deaths. Age 30, assault, for the hipster. Age 7, drowning, for the baby in arms. Age 43, workplace accident, for a 42-year-old civil engineer. Self-harm, age 28, for the lovely flight attendant, who is that day celebrating her 28th birthday. Over the next 126 chapters (some just a paragraph), you will get to know all these people, and their reactions to the news of their demise, very well. Best of all, you will get to know Cherry Lockwood, the Death Lady, and the life that brought her to this day. Is it true, as she repeatedly intones on the plane, that “fate won’t be fought”? Does this novel support the idea that clairvoyance is real? Does it find a means to logically dismiss the whole thing? Or is it some complex amalgam of these possibilities? Sorry, you won’t find that out here, and in fact not until you’ve turned all 500-plus pages. The story is a brilliant, charming, and invigorating illustration of its closing quote from Elisabeth Kübler-Ross (we’re not going to spill that either).\u003c/p\u003e\u003cp\u003e\n                                        A fresh, funny, ambitious, and nuanced take on some of our oldest existential questions. Cannot wait for the TV series.\n                                        \n                                        \n                                    \n                                \u003c/p\u003e\u003c/div\u003e\n\n                                \n    \n        \n    \n\n\n                                \n\n                                \u003cdiv\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePub Date:\u003c/b\u003e Sept. 10, 2024\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003eISBN:\u003c/b\u003e 9780593798607\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003ePage Count:\u003c/b\u003e 512\u003c/p\u003e\n                                        \u003cp\u003e\u003cb\u003ePublisher:\u003c/b\u003e Crown\u003c/p\u003e\n                                    \u003c/div\u003e\n                                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003cb\u003eReview Posted Online:\u003c/b\u003e June 15, 2024\u003c/p\u003e\n                                         \u003cp\u003e\u003cb\u003eKirkus Reviews Issue:\u003c/b\u003e July 15, 2024\u003c/p\u003e\n                                    \u003c/div\u003e\n                                \u003c/div\u003e\n\n                                \n\n                                \n\n\n\n\n                                \n                                    \n                                        \n                                    \n                                \n                                \n                                    \n                                    \n                                    \n                                \n                            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
