[
  {
    "id": "7f7943ce-ce9c-43fb-ab7f-1dd07dc4f62b",
    "title": "1967 Ferrari 330 GT 2+2 Series II",
    "link": "https://bringatrailer.com/listing/1967-ferrari-330gt-22-7/",
    "description": "This 1967 Ferrari 330 GT 2+2 is one of 455 Series II examples produced between 1965 and 1967. Chassis 9129 underwent a refurbishment that was performed by The Vintage Connection of Oklahoma City between 2002 and 2015, and was purchased by the current owner later that year. The car is finished in silver over blue leather upholstery, and power comes from a 4.0-liter Colombo V12 paired with a five-speed manual gearbox. Equipment includes triple Weber carburetors, a limited-slip differential, an ANSA quad-exit exhaust, power steering, servo-assisted four-wheel disc brakes, 15” Borrani wire wheels, power windows, and a Becker AM/FM radio. Maintenance performed in April 2025 included the removal and adjustment of the transmission, a rebuild of a power window switch, and a fluid service. This 330 GT is now offered on dealer consignment with copies of build documents, factory literature, tools, spare parts, refurbishment photos and records, and a clean California title.",
    "author": "bringatrailer",
    "published": "Tue, 24 Jun 2025 00:01:02 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2025/06/1967_ferrari_330gt-22_250519-330gt-22-00-57595.jpg?fit=940%2C626",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "7f80c130-de2c-45c4-98d9-670673c66e09",
    "title": "34-Mile 2024 Porsche 911 S/T",
    "link": "https://bringatrailer.com/listing/2024-porsche-911-s-t-2/",
    "description": "This 2024 Porsche 911 S/T is #489 of 1,963 produced and was specified with the Heritage Design package, a $20k option. The car was acquired new by the seller from Porsche of Rockford, Illinois, and it now has 34 miles. Finished in Shore Blue Metallic over Classic Cognac leather, it is powered by a 4.0-liter flat-six that drives the rear wheels through a six-speed manual transaxle. Features include 20″ and 21″ center-lock wheels, carbon-ceramic brakes, a front-axle lift system, LED-Matrix Design headlights with PDLS+, an extended-range fuel tank, rear ParkAssist sensors, carbon-fiber bucket seats, the Chrono Package, Porsche Communication Management, a Bose surround sound system, automatic climate control, and cruise control. This 992 S/T is now offered with a window sticker, a car cover, manufacturer’s literature, a clean Carfax report, and a clean Illinois title in the seller’s name, listing it as a 911 GT3 RS.",
    "author": "bringatrailer",
    "published": "Mon, 23 Jun 2025 23:45:19 +0000",
    "image": "https://bringatrailer.com/wp-content/uploads/2025/05/2024_porsche_911-st_2024-porsche-911-s-t-5-38329.jpg?fit=940%2C626",
    "source": "https://bringatrailer.com/feed/",
    "categories": null
  },
  {
    "id": "835af03c-47d1-4042-acbc-30c8aa08027e",
    "title": "Will California Still Offer EV Rebates in the Future?",
    "link": "https://www.autoblog.com/news/will-california-still-offer-ev-rebates-in-the-future",
    "description": "If the current administration's plans come to fruition, federal EV tax credits could be eliminated as early as mid‑2025 under proposed legislation. Not only would this hurt the future of EV adoption, but some automakers might backtrack on their EV transition plans and harm the progress made thus ...",
    "author": "Nathan Adlen",
    "published": "Tue, 24 Jun 2025 01:00:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/MjA5MTc3MDEyOTUwMDE3NjQ4/chevy-spark-ev-plug.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "News",
      "Electric"
    ]
  },
  {
    "id": "8b288c37-d41d-4720-a40f-6363a7f4c65e",
    "title": "How Does the Chevy Corvette ZR1X Perform vs. Lamborghini and Ferrari Hybrids?",
    "link": "https://www.autoblog.com/news/chevy-corvette-zr1x-vs-lamborghini-and-ferrari-hybrids",
    "description": "The Corvette ZR1X is huge news. Its immediate predecessor, the ZR1, had already drawn comparisons to high-dollar and high-performance models from the likes of Ferrari and Lamborghini. But with the ZR1X, Corvette encroaches even further into the Italians’ territory, pairing a 1,064-horsepower V8 ...",
    "author": "Steven Paul",
    "published": "Tue, 24 Jun 2025 00:00:00 GMT",
    "image": "https://www.autoblog.com/.image/c_fit%2Ch_800%2Cw_1200/NzowMDAwMDAwMDAwOTA5MDE1/2026-corvette-zr1x-blade-silver-metallic-hood-top-view.jpg",
    "source": "https://www.autoblog.com/rss.xml",
    "categories": [
      "Hybrid",
      "corvette",
      "Coupe",
      "Ferrari",
      "c8 corvette",
      "Chevrolet",
      "Performance",
      "Lamborghini",
      "News"
    ]
  },
  {
    "id": "6622e20b-ddb1-4075-8a9d-d74c81eda5e7",
    "title": "Land Rover Defender Octa",
    "link": "https://www.autocar.co.uk/car-review/land-rover/defender-octa",
    "description": "Gaydon goes very large indeed on both performance and 4x4 capability for its very first ultimate Defender How does one begin to succinctly define a vehicle as multi-faceted as Land Rover’s Defender Octa?One thing’s certain: the process takes you down numerous paths. Is the 626bhp Octa the most ambitious product the company has launched since the original Range Rover? In many ways, from engineering to sales, yes, it absolutely is. No Land Rover has ever been conceived with such scope in respect to its all-terrain ability and drivability. Or price.Could the Octa also be said to have a genetic make-up achievable by blending DNA from the sensational BMW M5 CS with one of McLaren’s supercars and a T1+ Dakar rally-raider, of the sort you’ll have seen competing in the Dakar Rally? Incredible as it sounds, that isn’t far from the truth.More broadly, is this carbon-adorned Defender for everyday use, family trips away or weekends doing specialised off-road activities? Incredibly, hardware suggest it’s all three.As for what it is not? At £148,000 even before you get to the limited-release Edition 1 car tested here, the Octa is not an inexpensive car. In terms of price, in the broader Defender line-up it is very much positioned as the Porsche 911 GT3 RS or Lamborghini Huracán STO and is aimed at a similar clientele.Neither is this car going to be free from quirks in normal driving. One reason why the Octa can happily fire itself down dusty back roads at frightening speeds is because of its new suspension, which makes for tracks 68mm wider than those on the standard and hardly slimline Defender. No matter how expert the chassis tuning, the Octa will need handling with care in a way something humdrum like, say, a Porsche Cayenne Turbo wouldn’t.Which brings us to one last point on the subject of what the Octa is and is not. Is it necessary? Unless you see yourself needing to escape from the bad guys by travelling at speed over rough and varied terrain, and you need to do it in comfort and a reasonable level of luxury, then no, of course this car isn’t necessary. And we dare say it will be easier to find chances to explore the full potential of the aforementioned supercars at track days than it will this extra-special Defender, unless you happen to own half the county.But when did necessity concern cars made with imagination? And it’s this, above all else, that most neatly defines the Defender Octa.",
    "author": "",
    "published": "Wed, 25 Jun 2025 00:00:01 +0100",
    "image": "https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/land-rover-defender-octa-rt-2025-front-action-46.jpg?itok=yfri4SLd",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "Car review"
    ]
  },
  {
    "id": "66559f52-915b-4f64-9675-32499546f789",
    "title": "Bentley Continental GT",
    "link": "https://www.autocar.co.uk/car-review/bentley/continental-gt",
    "description": "'Entry-level' version of big luxury coupé now has a 671bhp V8-engined plug-in hybrid powertrain For this, the latest Bentley Continental GT, Crewe broke with convention and got things going with a bang.In the past, we’ve had to wait a short while for the excesses of the Speed derivative, but for the Mk4 car it was the first one out of the factory and into showrooms. Here’s the new 208mph Conti GT, they said. It will out-drag a Ferrari Enzo yet cruise more quietly than the latest Mercedes-AMG S63. Satisfied?If the goal was to make a statement, job done. We can now move onto the model most owners will opt for: the ‘regular’ Continental GT, which is of course nothing of the sort, becuase the entry-level car is mechanically closer to the Speed than ever before.For one thing, both cars use the same V8 hybrid powertrain (detuned from 771bhp in the ‘Ultra Performance Hybrid’ Speed to merely 671bhp in ‘High Performance Hybrid’, as this lesser powertrain is known).Both also have the same Porsche-developed dual-clutch gearbox, the same two-chamber air suspension, active anti-roll bars, rear-steering and electronically controlled limited-slip differential, which plays a pivotal role in controlling the amount of torque each side of the car gets.This hardware overlap is confirmed by the homologated weights: exactly 2384kg for each car. Of course, in terms of their calibration, all these systems are also tuned for less ‘attack’ than in the Speed.You can read all about the Speed here, courtesy of a full, instrumented road test in the UK. The regular Continental GT will soon undergo the same treatment and we will record a formal verdict, but for now, these impressions are from a brief blast at an event in the US.",
    "author": "",
    "published": "Tue, 24 Jun 2025 00:01:04 +0100",
    "image": "https://images.cdn.autocar.co.uk/sites/autocar.co.uk/files/styles/car_review_image_190/public/bentley-continentl-gt-review-2025-01-front-tracking.jpg?itok=UNvJTMRL",
    "source": "https://www.autocar.co.uk/rss",
    "categories": [
      "Car review"
    ]
  },
  {
    "id": "3bd7d21f-40e1-4716-bba6-2f950949de22",
    "title": "BMW Terms Explained: What Every Enthusiast Should Know",
    "link": "https://www.bmwblog.com/2025/06/23/bmw-glossary-terms-explained/",
    "description": "BMW, like all other carmakers, uses various terms, acronyms and abbreviations to differentiate its brand and highlight its technological features. However, understanding these can often be confusing due to their sheer volume. Therefore, in this... First published by https://www.bmwblog.com",
    "author": "Surya Solanki",
    "published": "Mon, 23 Jun 2025 15:21:55 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2012-detroit-auto-show-bmw-07-750x496.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "Car Tips",
      "BMW History",
      "BMW Terms"
    ]
  },
  {
    "id": "d0bee0e4-725c-41c4-9c00-5417cf8405e0",
    "title": "BMW Dealer Commissioned A 1800 TI Pickup You Can Now Buy",
    "link": "https://www.bmwblog.com/2025/06/23/bmw-1800ti-pickup-for-sale/",
    "description": "BMW’s reluctance toward pickups is understandable. Luxury trucks are mainly limited to the U.S. market, and since the Munich-based automaker doesn’t have a dedicated platform for a workhorse, developing a pickup from scratch to serve... First published by https://www.bmwblog.com",
    "author": "Adrian Padeanu",
    "published": "Mon, 23 Jun 2025 14:56:17 +0000",
    "image": "https://cdn.bmwblog.com/wp-content/uploads/2024/11/bmw-1800-ti-sa-03-830x553.jpg",
    "source": "https://feeds.feedburner.com/BmwBlog",
    "categories": [
      "News",
      "1800 TI",
      "Neue Klasse"
    ]
  },
  {
    "id": "ee2f7d39-f65f-4ec6-9a3e-f2e8d8594798",
    "title": "June Power Rankings: Top 5 Bike EXIF Custom Motorcycles",
    "link": "https://www.bikeexif.com/june-power-rankings-top-5-bikeexif-custom-motorcycles",
    "description": "June brought some serious heat to Bike EXIF, with standout Harley, BMW and Ducati builds along with a unique lifestyle piece on knives that captured the attention of motorcycle enthusiasts around the globe. These are the top five Bike EXIF articles from June 2025 based on reader engagement, visual impact and social shareability. #1 – Noise Cycles’ Harley-Davidson 120R WR Replica Leading this month’s lineup is a jaw-dropping WR replica from Noise Cycles, based on a Screamin’ Eagle Harley-Davidson 120R crate motor. This machine channels the spirit of vintage board track racing with a stripped-down silhouette, hand-crafted components and a big-twin powerplant that demands respect. It’s a showcase of how heritage and high performance can meet in a raw, mechanical masterpiece.…",
    "author": "Alfonso Paca",
    "published": "Mon, 23 Jun 2025 17:13:47 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/06/noise-cycle-harley-5-copy-745x497.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Custom Motorcycles",
      "BMW R80",
      "Ducati Scrambler",
      "Noise Cycles",
      "Panhead"
    ]
  },
  {
    "id": "a64f174f-acd2-4151-bab5-94e35458c46a",
    "title": "Magnum Opus: A Masterclass Porsche 911 from Los Angeles",
    "link": "https://www.bikeexif.com/1972-porsche-911-str",
    "description": "In downtown Los Angeles, just blocks from where photographer Sean Klingelhoefer is standing, resides the Walt Disney Concert Hall. Renowned architect Frank Gehry designed the megalith of curvaceous and angular raw steel to create an expanse described as “near acoustic perfection”. Down the street it stands, permanent and complacent, a viewing curiosity for passersby, waiting to be filled with sound. Today’s subject for Klingelhoefer, however, is a moving one – one he had doubts of ever seeing finished. Tearing through lower Grand Avenue, it is alive, exuding acoustic bliss to its sidewalk audience; an equally visual experience for those spry enough to catch a glimpse. It is Magnus Walker’s 1972 Porsche 911 ‘STR,’ a masterpiece of sound and design. By 1972, Porsche had long cemented a place for themselves within the automotive world, largely due to the success of the first Porsche 356 (built in the late ’40s), and in the ‘50s with their race-proven 550 Spyder.…",
    "author": "Iron and Air",
    "published": "Mon, 23 Jun 2025 16:59:56 +0000",
    "image": "https://kickstart.bikeexif.com/wp-content/uploads/2025/06/magnus-porsche-911-2-copy.jpg",
    "source": "https://www.bikeexif.com/feed",
    "categories": [
      "Featured Lifestyle",
      "Iron \u0026 Air"
    ]
  },
  {
    "id": "9ed18b70-1af5-4e70-8e47-1cad7f4825f6",
    "title": "Toyota To Hike Prices Again But Won’t Say What Everyone’s Thinking",
    "link": "https://www.carscoops.com/2025/06/toyota-and-lexus-price-hikes-coming-in-july/",
    "description": "If you act quickly, you can save hundreds of dollars on a new Toyota or Lexus before prices increase",
    "author": "Michael Gauthier",
    "published": "Tue, 24 Jun 2025 01:03:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/06/2026-Toyota-Camry-copy-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Lexus",
      "Prices",
      "Reports",
      "Tariffs",
      "Toyota"
    ]
  },
  {
    "id": "432d3dd0-f0fe-4b48-acb2-6db8aa1356b6",
    "title": "The Surprising Reason Israel Feared A Port Full Of EVs",
    "link": "https://www.carscoops.com/2025/06/the-surprising-reason-israel-feared-a-port-full-of-evs/",
    "description": "With Israel under attack, authorities are reportedly concerned about electric cars parked at ports and other infrastructure",
    "author": "Michael Gauthier",
    "published": "Tue, 24 Jun 2025 00:21:00 +0000",
    "image": "https://www.carscoops.com/wp-content/uploads/2025/06/grfsdegrewgreg-1024x576.jpg",
    "source": "https://www.carscoops.com/feed/",
    "categories": [
      "news",
      "Electric Vehicles",
      "Iran",
      "Israel",
      "Reports"
    ]
  },
  {
    "id": "efaadc8d-e6f1-455b-a06d-b714869014fb",
    "title": "KTM 390 Duke vs Aprilia Tuono 457 comparison review",
    "link": "https://www.autocarindia.com/bike-comparison-reviews/ktm-390-duke-vs-aprilia-tuono-457-comparison-review-435767#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Explosive performance at an accessible price – these words instantly bring a certain orange machine to mind. Since 2013, the KTM 390 Duke has dominated its class, and every single rival that has gone up against the Duke has retreated with its tail tucked between its legs. But today, the Duke will have to deal with its toughest challenge yet posed by the Aprilia Tuono 457. KTM 390 Duke vs Aprilia Tuono 457 design and ergonomics Both have sharp designs and can feel tight for taller folks With some bikes, just a glance is enough to tell you what they are meant to do, and the designs of these two machines are true to their function. Neither is classically good-looking, and both are aggressively styled, although in its latest avatar, the 390 might be too aggressive for some.  The rider’s triangle is the first difference you’ll notice, and while both are reasonably comfortable, on the Aprilia, there is a bit of a forward reach to the handlebar, whereas you’re almost bolt upright on the KTM. Over bad roads, this will be felt in the lower back. With their 800mm perches, these bikes will be welcoming for shorter riders but feel cramped for taller ones.  Both bikes are a little tight for larger and heavier riders. At 5’11”, I just about fit on both these machines, but taller riders should look elsewhere. The Duke can be had with an accessory tall seat, raising its perch to 820mm, which will liberate some knee room for taller riders. The optional comfort seat on the Tuono keeps the same height as the stock unit. Neither is geared toward all-out comfort, and that’s par for the course.  KTM 390 Duke vs Aprilia Tuono 457 quality and features Duke has larger number of useful features and better quality all across Modern-day KTMs have made huge strides when it comes to the quality front, and that is clearly visible here. The Tuono 457, with its aluminium chassis, looks great, but crucial areas, such as the cheap-feeling key, the more basic levers and an ugly misaligned panel on the headlight surround, just feel like a step down from the KTM. Fun fact: the adjustable brake lever on the Tuono is a Rs 5,500 accessory (!) and appears to be the exact same unit as the one on the Gen 2 390 Duke that sells for under Rs 1,000. The 390 Duke now also gets cruise control. Another facet where the Duke is ahead of the Tuono is the features (and bragging rights) department. Its suspension has damping adjustability, the bidirectional quickshifter is standard, it comes with a cornering anti-lock braking system (ABS) and traction control (TC), and the latest model even has cruise control. The Tuono, with its three riding modes, switchable ABS and TC and preload-adjustable front suspension, has a good level of kit, unlike the contender from the tuning fork brand. As for the Aprilia’s bidirectional quickshifter? A cool Rs 20,000 for that.  KTM 390 Duke vs Aprilia Tuono 457 handling Both are superb handlers and will put a big smile on your face However, you don’t ride a bike’s build quality or features, so I’ll stop rambling about that and start raving about how these things behave on the road. Both take very different approaches to their chassis – the KTM uses a steel trellis, while the Aprilia has an aluminium perimeter frame (the only one in this class to do so). Predictably, their behaviour on the side of the tyre is markedly different, but both are almost equally fast in the real world.  Both machines are fast, but they go about their business quite differently. It might sound cliché, but the Duke feels a lot like a supermoto, and the Tuono feels a lot like a sportbike with a taller handlebar in the corners. They handle with a different feeling: the Duke prioritises lightness and reactivity, while the Aprilia feels agile but also beautifully composed. That said, both handle very well, and you’ll have a great time on either machine, whether on road or track.  Key specificationsAprilia Tuono 457KTM 390 DukeKerb Weight175kg168.3kgSeat height800mm800mmGround clearance 150mm170mmFuel tank capacity12.7 litres15 litresWheelbase1360mm1357mm KTM 390 Duke vs Aprilia Tuono 457 ride comfort Duke's suspension more pliant; Tuono's brake fade issue an annoyance While chasing twisty ribbons of tarmac is what owners will dream of doing with these bikes, the reality is they will be used for commuting more often. Mumbai’s lumpy roads are a proper test of a bike’s suspension, and here, the Duke’s sophisticated setup will be worth its weight in gold. The bike feels a lot more absorptive while going over bumps, without sacrificing poise when you turn up the wick.   Both have taut suspension setups but KTM feels much more pliant than the Aprilia. In comparison, the Tuono’s suspension system, carried over unchanged from the RS 457, feels much stiffer, and you will feel more of the bumps. The brake-fade issue under repeated hard use on the 457s is another sore point, and while it isn’t a very difficult fix, Aprilia should’ve ironed it out by now. Especially since customers have shared that certain dealerships say warranties will be cancelled when brake master cylinders are upgraded.  EngineAprilia Tuono 457KTM 390 DukeEngine457cc, twin-cyl, liquid-cooled399cc, single-cyl, liquid-cooledPower47.6hp at 9,400rpm46hp at 8,500rpmPower-to-weight ratio272hp/tonne273.33hp/tonneTorque43.5Nm at 6,400rpm39Nm at 6,400rpm KTM 390 Duke vs Aprilia Tuono 457 engine and performance Aprilia's engine is the star of the show, KTM is quick but not as characterful So far, it’s neck and neck, but one area where the Tuono scores a massive victory is the engine. The twin-cylinder mill is smooth, brimming with character, and makes all the right sounds. Its strong low-end and mid-range also mean you needn’t frantically work the gearbox, and it also pops nice power wheelies. In outright performance, the Tuono is quicker in the 0-100kph sprint by just 0.3 seconds, but its engine’s effortless grunt is more apparent in the roll-on acceleration tests.  The Tuono’s engine is a peach. Hopping onto the KTM after the Aprilia will make you realise you need to work the gearbox more and give the engine revs to make quick progress. You’ll also feel a more pronounced buzz, especially in the handlebar. However, the Duke’s refinement levels are respectable for a single-cylinder engine of this size with this level of performance. That said, the excitable hooligan nature of the KTM is great fun, if that’s the riding experience you’re after.  PerformanceAprilia Tuono 457KTM 390 DukeAcceleration 0-60kph2.17s2.21s0-100kph4.88s5.21sRoll-on acceleration20-50kph1.73s1.87s30-70kph2.83s3.19s50-80kph2.68s3.22sBraking60-0kph (in metres)16.3516.52 KTM 390 Duke vs Aprilia Tuono 457 price and verdict Tuono is an impressive machine let down by pressing issues PriceAprilia Tuono 457KTM 390 DukePrice (ex-showroom, Delhi)Rs 3.95 lakhRs 2.97 lakh All that back and forth now means I need to tell you which bike is the winner. The Tuono 457 feels very special to ride, but it’s nearly Rs 1.50 lakh more (on-road, Mumbai) with the accessory quickshifter installed. The engine and sublime handling are two very big factors to get one, and this motorcycle won’t be as common a sight on our roads as the Duke. There are buyers out there for whom the extra Rs 1.5 lakh will be justified because the Tuono feels like a scaled-down big bike, which is a very special feeling.  Brake-fade issue continues on Aprilia 457s. However, in the last couple of months, several customers have reported varied and significant engine reliability issues. Aprilia India recently attributed these issues to unauthorised modifications and/or irregular service and says that it has addressed the few genuine cases. Whether the issues are fully addressed is something only time can tell.  Beyond that, there is no escaping the fact that the 390 Duke has a much more accessible price, more features and better ride comfort, and it can be nearly as fast as the Tuono. There were some isolated engine incidents at the beginning, but Bajaj swiftly addressed them, and the bike has been around for long enough that there are no significant reliability concerns. All this is why the KTM 390 Duke will continue to reign in this segment. Also See: KTM 390 Duke vs Aprilia Tuono 457 comparison video",
    "author": "Dinshaw Magol",
    "published": "Sun, 22 Jun 2025 08:00:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250618034048_KTM 390 Duke and Aprilia Tuono 457 front static in field.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "dc47d50e-72fd-4e76-a14d-d4c3c06bb0d5",
    "title": "Suzuki GSX8R review: the subtle sportsbike",
    "link": "https://www.autocarindia.com/bike-reviews/suzuki-gsx8r-review-the-subtle-sportsbike-435781#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Bike+Reviews+feed",
    "description": "Some motorcycles have a tendency to slip under the average buyer’s radar, and the Suzuki GSX-8R is a fine example. It probably won’t be the first pick when you ask someone to think of a middleweight sportbike, and that’s fair because this bike packs a parallel-twin engine in a segment with more powerful inline-3 and 4-cylinder motors. But unassuming things can often surprise you with how good they can be, and that’s exactly what the 8R did at our annual track day a couple of months back. Not only did it set the quickest lap time (to be fair, it was also the most powerful bike there), but it also proved to be surprisingly sweet and engaging to ride. Suzuki GSX8R engine sound and performance - 8/10 Twin-cyl motor is torquey and smooth but isn't the most exciting nor the best sounding in its class As it turns out, this character translates beautifully to the street as well. While the 776cc parallel twin produces the least power in this segment, the torque figure is actually the highest. Its 78Nm is, in fact, much closer to the Triumph Street Triple 765 RS than it is to the Daytona 660, which is this bike’s immediate rival. That results in a wonderfully strong pull from as low as 3,000rpm, and effortless performance is the name of the game.   The 776cc parallel twin is a good engine, but it lacks the sound and top-end excitement you’ll find with rivals that have 3- or 4-cylinder motors. Switching between the three riding modes lets you experience a very mellow throttle response in C mode or a sharp, quick-throttle feel in A mode, where the torque hit arrives with a solid kick. I found that B mode offers a nice middle ground between the two, but regardless of which you choose, the 8R will propel you to triple-digit speeds with complete ease and no need for dramatic high revs.  That’s not to say that this is a slow motorcycle, and with 82hp, it will blast past 150kph the way most quick Indian bikes would get to 100. But there’s also no discounting the fact that it has sacrificed some of the exciting, zingy top-end performance of its multi-cylinder rivals in exchange for the low-end usability. However, the bigger loss for many enthusiasts will be the sound or relative lack of it. It doesn't sound as nice nor has the same top-end rush as its multi-cylindered rivals. This is a 270-degree parallel twin, and it does have that typically deep and rumbling sound, but it’s also quite muted and not very exciting. For reference, Aprilia’s new 457 parallel twin sounds a lot louder and more thrilling, as we discovered when the Suzuki and the Tuono 457 were parked side by side on our track day. If you’re someone who wants a loud and flashy sportbike, this won’t be for you. EngineSuzuki GSX-8REngine776cc, twin-cylinder, liquid-cooledPower82hp at 8500rpm Torque78Nm at 6800rpmGearbox 6-speed Suzuki GSX8R ride and handling - 8/10  It is poised when going through a corner yet comfortable over broken roads But a subtle nature doesn’t mean an unimpressive one because this bike is surprisingly good fun to ride. On the track, it proved to be easy, unintimidating and thoroughly well-behaved, responding obediently to your every request. This clearly isn’t a bike made for the racetrack, but it performed there far better than most would expect. The only limiting factors for Rajini when he was pushing for a fast lap were that the footpegs were scraping and that the ABS was too intrusive. Comfort is aided by a wide and accommodating rider seat. On the street, neither of those ended up being an issue, but the bike retained that sweet and friendly feel. At 205kg, the 8R is in the ballpark for the segment, and you will feel the weight if you plan to go attacking some very tight and twisty interior roads. But give the bike some breathing room on a wider road, and you’ll discover a rewarding handler that settles into a wonderful flow with the road.  Tall clip-on bars result in a reasonably comfy riding position. The 8R feels settled on its suspension and encourages you to push to quite a high pace. Part of this deep-seated sense of confidence comes through the tubular steel chassis and the non-adjustable but well-set Showa suspension. It’s not excessively plush like the Daytona 660, which means it isn’t as comfy on badly made concrete roads (although it really isn’t bad and is far from punishing), but you reap the rewards when the pace is raised on a good stretch of tarmac.  Key SpecsSuzuki GSX-8RKerb Weight205kgSeat Height810mmFuel Capacity14 litresGround Clearance145mmWheelbase1465mm Suzuki GSX8R comfort, build quality and features - 8/10 Well-built, comfortable and has everything you need, can drink fuel quite quickly if you ride it hard   On the other hand, the riding position is committed enough to remind you that you’re on a fair, sporty motorcycle but also relatively kind on the wrists, hips and knees. It’s a similar story with the brakes. The initial bite is almost disappointing, but once you start using them for a while, you realise there’s sufficient power and feel, and it matches the nature of the bike. Brakes feel dull at first but work well. I also like how Suzuki has given its 5-inch TFT display a simple, easy-to-use layout. You almost never have to enter any menus. All the functions you’d need, like changing the ride modes, the TC levels (four, including off), or just switching between trip information, can be done from the main home screen display. Overall quality levels are also very nice, and like most imported Japanese bikes, everything feels solid and has a pleasing, built-to-last feel. TFT display has a clean layout and is very easy to use. There aren’t many outright negatives, and the few complaints are that the bike gets quite hot in heavy traffic – there are no nasty hot air blasts, but there is quite a bit of radiated heat that you need to deal with. What I found to be more of an issue was that it seems to empty its 14-litre tank quite quickly, and you won’t go much further than 150-170km on a tankful if you have a throttle-happy right wrist.   A subtle nature doesn’t mean an unimpressive one, and the 8R is surprisingly good fun. Suzuki GSX8R price and verdict - 8/10 It is the most affordable and least flashy machine in its class At Rs 9.25 lakh, ex-showroom, the GSX-8R costs about Rs 50,000 less than the Daytona and Rs 75,000 less than Honda’s revered CBR650R. The price savings are nice but not big enough to be a reason to pick this bike over those two. For that, I’d say that this is the thinking person’s middleweight sportbike – the bike for someone who likes flying under the radar.  The 8R is a lovely but understated machine, which won't make it stand out in its class. And with that in mind, Suzuki may have a bit of a tough time on their hands. That’s because this is the segment where someone is typically buying their first sportbike, and subtlety is usually not at the top of the wish list. But for those who want that more understated experience, the GSX-8R is a great choice.  Also See: Suzuki GSX8R video review",
    "author": "Rishaad Mody",
    "published": "Sat, 21 Jun 2025 08:00:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250619122053_Suzuki GSX8R corner shot.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_bikes",
    "categories": null
  },
  {
    "id": "1c2f1b4d-4698-4ec0-8303-583f84f21322",
    "title": "Hyundai Creta N Line long term review, 10,000km report",
    "link": "https://www.autocarindia.com/car-long-termer/hyundai-creta-n-line-long-term-review-10000km-report-435803#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Dear reader, I’m overjoyed to announce I’ve recently become a dad. Life has changed in so many ways (I’ve never valued a power nap as much as I do now!), and to an extent, so has the way I look at cars. I have become ever more mindful of the smallest of things that could make my little one’s car rides comfier. ISOFIX child seat anchors are a bit tough to find underneath the seat cushioning. Of course, step one was to get the child seat in order. The Hyundai Creta N Line I’ve been using gets ISOFIX child seat anchors to lock the seat firmly in place, but they’re tucked behind the cushioning and need a bit of poking around to locate. This is not a biggie for an average user who’d keep the seat in place for months at a stretch, but I have to keep removing and re-attaching the seat whenever there’s a new car I have to test. Thankfully, my daughter has taken well to the car seat and, as my wife reports from the back seat, enjoys her drives. Option to pre-cool the Creta using the phone app put to full use over the summer. We’ve had a baking summer in Mumbai, and my kiddo, understandably, hates being strapped onto her seat in a hot car. The solution has come in the form of remote pre-cooling. To be honest, I’d never used connected car features beyond a review evaluation, but today, setting up the car in advance with the tap of a few buttons on my phone screen is part of my SOP. The option to remotely start the vehicle and have the air conditioning run has been an absolute boon. Hyundai’s BlueLink app is easy to use, and I’ve not had challenges with the network, which is known to be an issue with many eSIM-based connected services. Our kiddo loves looking through the panoramic sunroof. Of course, we’ve had our share of crying spells on the go. Bumper-to-bumper traffic with an irate baby is not fun, I can tell you that. On one such drive, retracting the cover for the panoramic sunroof proved to be an Eureka moment. The newfound view of the world above immediately distracted my daughter, making the remainder of the journey a lot, well, calmer. Something tells me kids will love the Mahindra BE 6 and XEV 9e’s trippy, colour-changing roof lighting. The Creta N Line, in general, has proved to be good transport for the family, but I do wish there was more luggage room. I never realised a stroller occupied so much space! Fuel economy figure firmly in the single digits in chock-a-block city driving. More efficiency would be welcome, too. Fuel economy has been in the 7-8kpl range, but to be fair, my bumper-to-bumper slog never gives cars a chance to breathe free. Of the other things, there’s an irritating plasticky creak from the centre console every time a driver’s leg presses against it. This is something we experienced on our Creta IVT, too. Centre console lets out creaks whenever the driver’s leg rests on it. I have ambitious plans for a road trip over the monsoons. It’ll be a full house with my wife, baby, doggo and myself in the car. Time to dig deeper into the Creta’s box of tricks! Hyundai Creta N Line N10 DCT test dataOdometer10,091kmPrice (ex-showroom, India)Rs 20.49 lakhEconomy7.8kplMaintenance costNoneFaultsNonePrevious reportsFeb 2025, Nov 2024 Also see: Hyundai Exter long term review, 23,000km report Mercedes EQS SUV 450 long term review, 1,200km report",
    "author": "Nikhil Bhatia",
    "published": "Sun, 22 Jun 2025 09:00:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250620070850_Hyundai Creta N Line LT.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "401494be-8263-47f5-87b6-dedac778b429",
    "title": "Range Rover Sport and Porsche Cayenne comparison video",
    "link": "https://www.autocarindia.com/car-video-reviews/range-rover-sport-and-porsche-cayenne-comparison-video-435810#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+All+Car+Reviews+feed",
    "description": "Also See: Porsche Macan Turbo Electric video review",
    "author": "Gavin D'Souza",
    "published": "Fri, 20 Jun 2025 20:27:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250620082715_Cayenne vs Range Rover.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=all_cars",
    "categories": null
  },
  {
    "id": "d6bc1668-0f39-47ad-84b0-11e53d003564",
    "title": "Tata Harrier EV RWD price ranges between Rs 21.49 lakh and Rs 27.49 lakh",
    "link": "https://www.autocarindia.com/car-news/tata-harrier-ev-price-range-starts-at-rs-2149-lakh-435572#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "Having revealed the introductory starting price of the Harrier EV earlier this month, Tata Motors has now announced the full price list of the RWD variants. The Harrier EV RWD price ranges between Rs 21.49 lakh and Rs 27.49 lakh (ex-showroom, India). Not only does the Harrier EV sit at the pinnacle of Tata’s all-electric line-up, but it’s also the carmaker’s first model with an all-wheel-drive layout since the Safari Storme was discontinued over five years ago. Bookings for the Harrier EV are slated to open on July 2, 2025. Tata Harrier EV launched in India at Rs 21.49 lakh (introductory) Electric SUV sports minor design tweaks over current Harrier  Gets 65kWh and 75kWh battery pack options; maximum output is 313hp and 504Nm Here's a look at the full price list of the Harrier EV RWD: Tata Harrier EV RWD priceAdventure 65 Rs 21.49 lakh Adventure S 65 Rs 21.99 lakh Fearless+ 65Rs 23.99 lakh Fearless+ 75Rs 24.99 lakh Empowered 75Rs 27.49 lakh Do note, an AC fast charger and its installation cost will be levied additionally; price of top-spec Empowered AWD variant is still yet to be announced.  Tata Harrier EV exterior design Mostly identical to ICE-powered Harrier On the outside, the Harrier EV’s styling largely echoes the facelifted Harrier that’s been on sale here since 2023. However, Tata has brought it in line with other EVs in its line-up. Up front, the Harrier EV gets a new closed-off grille, underneath which sits a revised bumper with a line-based design. Over to the side, the Harrier EV comes with a set of new 19-inch, aero-optimised alloy wheels and ‘EV’ badging on the front doors. The only change at the rear is the ‘Harrier.EV’ lettering on the tailgate. The Harrier EV is 2mm longer and 22mm taller than the standard Harrier, though their wheelbases are the same – 2,741mm. All-black Stealth Edition on offer Four colour options will be available with the Harrier EV at launch: Empowered Oxide, Nainital Nocturne, Pristine White, and Pure Grey. Alongside these, Tata will also sell a Stealth Edition of the Harrier EV, which features blacked-out design elements inside and out – in line with the carmaker's Dark Edition models. Tata Harrier EV interior and features Infotainment screen is a Samsung QLED panel Much like the outside, the Harrier EV’s cabin doesn’t stray far from its ICE-powered counterpart. However, the 14.53-inch infotainment screen that sits atop the dual-tone dashboard is a world-first Samsung Neo QLED display, which should make for crisper image quality. There's a 10.25-inch digital driver’s display and a four-spoke steering wheel with an illuminated Tata logo. Boot space stands at 502 litres (999 litres with second row folded down), and a frunk is available too. Harrier EV feature list is loaded The centre console has a touch-based HVAC control panel, and moving further down reveals a rotary selector for the six terrain modes - Normal, Snow/Grass, Mud-Ruts, Sand, Rock Crawl, Custom - and electronic parking brake. Other notable features on the Harrier EV include a panoramic sunroof, ambient lighting, ventilated and powered front seats, powered Boss mode for the second row, 10-speaker JBL sound system with Dolby Atmos 5.1, powered tailgate, vehicle-to-load (V2L) and vehicle-to-vehicle (V2V) functionality, four drive modes (Eco, City, Sport, and Boost), all-digital inside rearview mirror, auto park assist, and more. With the Harrier EV, Tata has also debuted a new electrical architecture termed TiDAL (Tata Intelligent Digital Architecture Layer) that powers the SUV's connected car features, such as over-the-air (OTA) updates, voice commands, etc. Additionally, the Harrier EV gets a 540-degree surround camera view that alerts the driver if any of the wheels comes too close to a kerb, and there's a new DrivePay feature that eliminates the need for a mobile device for FASTag and EV charging point payments. Coming to safety, the Harrier EV comes equipped with six airbags as standard (seven in higher trims), a 360-degree camera, built-in dashcam, blind spot monitor, electronic stability control (ESC), and more. Level 2 ADAS is also part of the Harrier EV's safety suite, and Tata claims that it has been fine-tuned for Indian road conditions. Moreover, the system can provide a live feed stitched from all the cameras around the Harrier EV, which can be quite helpful while off-roading and is a segment-first addition. Tata Harrier EV battery and range Generates up to 504Nm of torque The Harrier EV leverages an enhanced iteration of Tata’s Acti.ev platform, which debuted last year with the Punch EV and is also utilised by the Curvv EV. Entry-level trims of the Harrier EV come equipped with a 65kWh LFP battery pack that powers a single motor on the rear axle that sends 238hp to the rear wheels. In higher trim levels, the Harrier EV gets a 75kWh LFP battery and dual motors – one for each axle – that develop a combined 313hp and a whopping 504Nm. This variant can sprint from 0-100kph in just 6.3 seconds with the Boost mode enabled. 75kWh Harrier EV delivers up to 627km range As far as range goes, the Harrier EV's RWD 75kWh and AWD 75kWh variants can travel up to an MIDC-certified 627km and 622km on a single charge. When subjected to Tata’s internal testing cycle – dubbed C75 – the RWD 75kWh version returned a real-world range of 480-505km, easily surpassing other EVs from the carmaker. When it comes to charging, a 7.2kW AC charger can replenish the Harrier EV from 10-100 percent in 10.7 hours, while a 120kW DC fast charger will juice up the SUV’s battery from 20-80 percent in 25 minutes. Notably, the Harrier EV incorporates a new 'Ultra Glide' multi-link suspension setup at the rear with frequency-dependent dampers for better off-road drivability. To that end, Tata has included an 'Off-road Assist' function - essentially a low-speed cruise control that can be set as low as 5kph -  and a 'Transparent' mode that projects an image of what's underneath the Harrier EV on the infotainment screen. There's a four-level regenerative braking system on offer with the Harrier EV too, as well as a summon mode that can extract the SUV from tight spaces autonomously. For more spirited drivers, Tata offers a Drift mode in the Harrier EV, which likely dials down the traction control. Tata Harrier EV price, variants and rivals Lifetime battery warranty Tata will sell the Harrier EV in three trims: Adventure, Fearless+, and Empowered. The 65kWh battery has been available on the Adventure and Fearless+ trims, while the larger 75kWh battery comes on the Fearless+ and Empowered trims; AWD is likely to be reserved for the top Empowered trim only. Tata has also confirmed that all Harrier EV buyers will get a lifetime warranty for the battery. Higher starting price than BE 6, but undercuts XEV 9e and Atto 3 At this price point, the Harrier EV lands squarely against the Mahindra’s latest EV duo – the XEV 9e and BE 6 – and the BYD Atto 3. Tata Harrier EV price comparison with rivalsHarrier EVBE 6XEV 9eAtto 3Price (Rs, lakh)21.49-27.4918.90-26.9021.90-30.5024.99-33.99 All prices ex-showroom, India. Also see: Upcoming car launches in June 2025 Tata Punch facelift expected to borrow heavily from Punch EV",
    "author": "Viraaj Bhatnagar",
    "published": "Mon, 23 Jun 2025 18:22:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250623062155_Tata Harrier.ev RWD Prices Launch.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "a90f0ccf-29a2-49d9-99b3-88f6f1d87467",
    "title": "Rolls-Royce Spectre Black Badge launched at Rs 9.5 crore",
    "link": "https://www.autocarindia.com/car-news/rolls-royce-spectre-black-badge-launched-at-rs-95-crore-435832#utm_source=feed\u0026utm_medium=rss\u0026utm_campaign=Autocar+India+News+feed",
    "description": "The Rolls-Royce Spectre Black Badge has launched in India, priced at Rs 9.5 crore (before options), with bookings now open at the brand’s Chennai and New Delhi showrooms. Revealed in February this year for international markets, the Spectre Black Badge is the most powerful Rolls-Royce yet; this EV delivers a total output of 659hm and 1,075Nm of peak torque. Spectre Black Badge costs almost Rs 2 crore more than the standard EV Claimed 0-100kph time of 4.1 seconds Gets interior and exterior changes, along with 44,000 colour options Rolls-Royce Spectre Black Badge price Black Badge priced Rs 1.88 crore higher than Spectre Rolls-Royce India revealed the price of the standard Spectre EV in January, which was set at Rs 7.62 crore. This means the Spectre EV costs Rs 1.88 crore less than the Black Badge version, priced at Rs 9.5 crore. It should be noted that both prices are ex-showroom India, before any customisation or personalisation. Rolls-Royce Spectre Black Badge power and performance 74hp and 175Nm more than the standard Spectre Compared to the standard Spectre’s total output of 585hp and 900Nm of torque, the Black Badge’s dual-motor setup has combined figures of 659hp and 1,075Nm, an increase of 74hp and 175Nm. The additional power helps the Spectre Black Badge shave 0.4 seconds off the standard EV’s claimed 0-100kph time of 4.5 seconds. However, the Spectre Black Badge has the same 102kWh battery, with the same WLTP range of up to 530km. The British marque has also tweaked the chassis, steering and roll stabilisation system to handle the Black Badge’s extra output while maintaining ride comfort. Rolls-Royce Spectre Black Badge exterior changes Gets blacked-out elements on the grille, door handles, badges and hood ornament As we reported when the Spectre Black Badge made its debut, the Black Badge gets different 23-inch forged aluminium wheels, along with a new Vapour Violet paint; Rolls-Royce offers a whopping 44,000 exterior colour options, though a bespoke colour can be opted for – via the Rolls-Royce Bespoke division – for a price. As is usually the case with the brand’s Black Badge models, the Spirit of Ecstasy hood ornament, front grille, door handles and badges are among the blacked-out elements. The Spectre Black Badge can also be opted for with an illuminated front grille and door sills, which have four colours – Tailored Purple, Charles Blue, Chartreuse and Forge Yellow. Rolls-Royce Spectre Black Badge interior changes Driver’s display gets 5 colour themes Unique features of the Black Badge over the standard Spectre EV include what the brand calls an Illuminated Fascia, which comprises over 5,500 ‘stars’ of varying proportions and intensity, set in a piano black dashboard. Additionally, there are 5 colour themes for the driver’s display – Vivid Grellow, Neon Nights, Cyan Fire, Ultraviolet and Synth Wave – and plenty of cabin bits are finished in either carbon fibre or metal. Also see: Rolls-Royce Spectre review: Silent grandeur Rolls Royce Spectre walkaround video New Rolls Royce EV to debut in 2025",
    "author": "Rivan RS",
    "published": "Mon, 23 Jun 2025 16:24:00 +1000",
    "image": "https://img.autocarindia.com/ExtraImages/20250623042311_Rolls_Royce_Spectre_Black_Badge_front_head_on.jpg",
    "source": "https://www.autocarindia.com/RSS/rss.ashx?type=News",
    "categories": null
  },
  {
    "id": "3bc08544-0aa7-4fda-987c-b847eb7b752f",
    "title": "Trump's War With Iran Could Send Gas Prices Through The Roof",
    "link": "https://www.jalopnik.com/1893558/trump-war-with-iran-could-send-gas-prices-through-the-roof/",
    "description": "If Iran were to close the Strait of Hormuz, it would disrupt the flow of oil out of the Middle East and raise the price of oil worldwide.",
    "author": "Collin Woodard",
    "published": "Mon, 23 Jun 2025 21:25:00 +0000",
    "image": "https://www.jalopnik.com/img/gallery/trumps-war-with-iran-could-send-gas-prices-through-the-roof/l-intro-1750701401.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "News"
    ]
  },
  {
    "id": "03d7bd94-df96-4a9f-a07f-83d01ce762fb",
    "title": "Amsterdam's Parking Situation Is On A Whole Other Level",
    "link": "https://www.jalopnik.com/1893650/amsterdam-cars-in-canals-parking-viral-video/",
    "description": "While a minority of people own cars, bikes actually outnumber the population of Amsterdam.",
    "author": "Erin Marquis",
    "published": "Mon, 23 Jun 2025 19:25:00 +0000",
    "image": "https://www.jalopnik.com/img/gallery/amsterdams-parking-situation-is-on-a-whole-other-level/l-intro-1750704106.jpg",
    "source": "https://jalopnik.com/rss",
    "categories": [
      "News",
      "Transportation"
    ]
  },
  {
    "id": "5e062aa8-d16e-4f18-b1f2-02b2c7687dce",
    "title": "A How-To Guide To ITBs With Project NSX",
    "link": "https://www.speedhunters.com/2025/04/guide-itbs-project-nsx/",
    "description": "What do we love so much about naturally aspirated engines? Perhaps the musicality, or the responsiveness, or the combination of both that creates an emotionally rewarding experience with every stab at the throttle pedal. Well, whatever underpins that appeal, I can say for sure that nothing turns it up to 11 quite like a set of […] The post A How-To Guide To ITBs With Project NSX appeared first on Speedhunters.",
    "author": "Blake Jones",
    "published": "Tue, 08 Apr 2025 23:31:04 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "Australia",
      "honda",
      "individual throttle bodies",
      "ITB",
      "ITBs",
      "NA1",
      "NSX",
      "project car",
      "Project Cars",
      "Project NSX",
      "Speedhunters Project Car"
    ]
  },
  {
    "id": "4ff103c3-74e7-4756-8b55-25502a72dafb",
    "title": "3 Days At The World’s Most Luxurious Race Track",
    "link": "https://www.speedhunters.com/2025/04/3-days-worlds-luxurious-race-track/",
    "description": "That’s what Cornes \u0026 Co did here in Japan, and with that, we’re left with The Magarigawa Club. The Magarigawa Club is not hot off the press news, it’s actually been open for a little over 18 months now, but since it’s doors have opened, I had yet to have the chance to visit and see what […] The post 3 Days At The World’s Most Luxurious Race Track appeared first on Speedhunters.",
    "author": "Alec Pender",
    "published": "Sat, 05 Apr 2025 04:39:05 +0000",
    "image": "",
    "source": "http://feeds.feedburner.com/speedhunters",
    "categories": [
      "Content",
      "Special Feature",
      "Speedhunters Crew",
      "Circuit",
      "honda",
      "japan",
      "Manthey",
      "Porsche"
    ]
  },
  {
    "id": "215af250-6a53-4b5f-9d4d-e6eadf891958",
    "title": "View Exterior Photos of the 2025 Bentley Continental GT/GTC",
    "link": "https://www.caranddriver.com/photos/g65125148/2025-bentley-continental-gt-gtc-exterior-gallery/",
    "description": "See the exterior of the new 2025 Bentley Continental GT/GTC from every angle.",
    "author": "",
    "published": "Mon, 23 Jun 2025 23:01:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "4d74160c-7ce6-44c7-b732-ff891959223a",
    "title": "2025 Bentley Continental GT Drive: Not-So-Junior Varsity",
    "link": "https://www.caranddriver.com/reviews/a65157316/2025-bentley-continental-gt-drive/",
    "description": "The Continental GT's core and Azure trims may not be the most powerful Contis on the lot, but they're still Bentleys.",
    "author": "",
    "published": "Mon, 23 Jun 2025 23:01:00 +0000",
    "image": "",
    "source": "https://www.caranddriver.com/rss/all.xml/",
    "categories": null
  },
  {
    "id": "05836376-128a-4df5-8ab4-65bf6571e4f2",
    "title": "Chery New Journeo Concept",
    "link": "https://www.carbodydesign.com/2025/03/chery-new-journeo-concept/",
    "description": "The Chery New Journeo Concept is a futuristic multi-purpose vehicle developed at the Chery Advanced Design Center Europe in Raunheim, Germany and presented at the 2024 Guangzhou Motor Show.",
    "author": "Car Body Design",
    "published": "Tue, 04 Mar 2025 14:25:20 +0000",
    "image": "http://www.carbodydesign.com/media/2025/03/Chery-New-Journeo-Fulwin-Jinyun-SMPV-Concept-Design-Sketch-Render-13-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Concept Cars",
      "Cover Stories",
      "Chery",
      "Chery New Journeo Concept"
    ]
  },
  {
    "id": "b23cddd5-72a7-4590-b9bf-05019af745a9",
    "title": "MG announces MGS5 new EV SUV",
    "link": "https://www.carbodydesign.com/2025/03/mg-announces-mgs5-new-ev-suv/",
    "description": "MG Motor UK has confirmed the MGS5 EV, an all-electric SUV debuting this Spring. Built on the modular scalable platform (MSP), it will focus on performance, efficiency, and interior space.",
    "author": "Car Body Design",
    "published": "Mon, 03 Mar 2025 17:26:28 +0000",
    "image": "http://www.carbodydesign.com/media/2025/03/MG-MGS5-EV-SUV-Preview-01-180x135.jpg",
    "source": "https://www.carbodydesign.com/feed/",
    "categories": [
      "Production Cars",
      "MG"
    ]
  },
  {
    "id": "7d95441c-c89d-46e8-b853-004d137a7973",
    "title": "The New Mail Truck Situation Keeps Getting Dumber",
    "link": "https://www.thetruthaboutcars.com/cars/news-blog/the-new-mail-truck-situation-keeps-getting-dumber-44514805?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "Senate Republicans are attempting to scrap the U.S. Postal Service (USPS) ongoing transition to all-electric vehicles on the grounds that the program is financially irresponsible. They want to scrap a large portion of the money put aside for EV programs in the new tax and budget omnibus bill. However, Senate Parliamentarian Elizabeth MacDonough has said the plan doesn’t constitute proper legislative procedure.",
    "author": "Matt Posky",
    "published": "Mon, 23 Jun 2025 20:00:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/06/23/15291/post.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "News Blog"
    ]
  },
  {
    "id": "aea56e50-31c6-492e-82ad-a977c9f7da7e",
    "title": "Used Car of the Day: 1990 Isuzu Trooper",
    "link": "https://www.thetruthaboutcars.com/cars/used-car-of-the-day/used-car-of-the-day-1990-isuzu-trooper-44514802?utm_medium=auto\u0026utm_source=rss\u0026utm_campaign=all_full",
    "description": "Today we have a 1990 Isuzu Trooper that is ready for an LS swap.",
    "author": "Tim Healey",
    "published": "Mon, 23 Jun 2025 18:00:00 +0000",
    "image": "https://cdn-fastly.thetruthaboutcars.com/media/2025/06/23/13521/post.jpg?size=720x845\u0026nocrop=1",
    "source": "https://www.thetruthaboutcars.com/feed/",
    "categories": [
      "Used Car of the Day"
    ]
  }
]
