[
  {
    "id": "f758a502-bc3c-472e-a1b3-24b8be319a4d",
    "title": "The Alcaraz-Sinner rivalry is one for the ages",
    "link": "https://www.espn.com/tennis/story/_/id/45732133/wimbledon-2025-title-men-title-carlos-alcaraz-jannik-sinner-rivalry",
    "description": "On Sunday, Sinner defeated Alcaraz for the Wimbledon title -- the latest in a back-and-forth rivalry that will continue to entertain.",
    "author": "Simon Cambers",
    "published": "Sun, 13 Jul 2025 15:30:00 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "fb093d09-6ee8-4bab-812d-a0cbdd017d73",
    "title": "Sinner wins Wimbledon and bet with coach Cahill",
    "link": "https://www.espn.com/tennis/story/_/id/45734850/jannik-sinner-wimbledon-title-wins-bet-darren-cahill-keep-coaching-him",
    "description": "Jannik Sinner's Wimbledon title might mean he'll be able to keep Darren Cahill around as one of his coaches beyond this season -- by winning the friendly wager they made before Sunday's final at the All England Club.",
    "author": "",
    "published": "Sun, 13 Jul 2025 18:14:00 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "752d407a-5676-4054-b3f2-9885aac56b4d",
    "title": "Unlock the Perfect Slice Serve - Essential Tennis Podcast #415",
    "link": "https://essentialtennis.podbean.com/e/unlock-the-perfect-slice-serve-essential-tennis-podcast-415/",
    "description": "The wide slice serve is a CRITICAL tool to have in your tool box. It pulls opponents out of position, opens the court up for you to hit into, exposes their usually weaker backhand side, and forces them to run twice as far for the next shot - if they even get it at all. Let’s take a deep dive into how YOU can develop this powerful weapon, step by step in this special episode of the Essential Tennis Podcast.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 15 Nov 2024 18:50:51 -0500",
    "image": "https://mcdn.podbean.com/mf/web/6gbi7n6nxzku6ztz/Podcast415.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "98e30ef8-ce04-4a12-a96e-b01f41c91488",
    "title": "3 Djokovic Secrets To Winning More Matches - Essential Tennis Podcast #414",
    "link": "https://essentialtennis.podbean.com/e/3-djokovic-secrets-to-winning-more-matches-essential-tennis-podcast-414/",
    "description": "In this special episode of the Essential Tennis Podcast, you're going to learn the top 3 tactical secrets of Novak Djokovic that you can apply in your very next match. Use these tools to gain precision, consistency, and offense to make your opponents more uncomfortable, win more points, and win more matches.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 08 Nov 2024 14:45:36 -0500",
    "image": "https://mcdn.podbean.com/mf/web/r7nwpsg3kzhjcns5/Podcast414.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "d5c088ec-20e7-4a73-9172-d68b41fd90f0",
    "title": "Will Alcaraz or Sinner complete Career Grand Slam first?",
    "link": "https://www.atptour.com/en/news/alcaraz-sinner-wimbledon-2025-career-grand-slam-chase",
    "description": "When Jannik Sinner won the Wimbledon title Sunday with a four-set victory against two-time defending champion Carlos Alcaraz, the Italian added another wrinkle to their Lexus ATP Head2Head rivalry. Both superstars are now only one major title from completing the Career Grand Slam. Sinner is only missing a Roland Garros trophy and Alcaraz needs an Australian Open crown. Only five men in the Open Era have achieved the feat: Rod Laver, Andre Agassi, Roger Federer, Rafael Nadal and Novak Djokovic. Nadal was the youngest, doing so at the 2010 US Open aged 24. Men Who Have Completed Career Grand Slam (Open Era)  Player  Tournament Completed  Age  Rod Laver  1969 US Open  31*  Andre Agassi  1999 Roland Garros  29  Roger Federer   2009 Roland Garros  27  Rafael Nadal  2010 US Open  24  Novak Djokovic  2016 Roland Garros  29 *Laver competed before the Open Era began If Alcaraz, currently 22, wins one of the next two editions of the Australian Open, he will own all four Grand Slam trophies at a younger age than any other man in the Open Era. If Sinner triumphs at Roland Garros next year, he will be 24, but older than Nadal was when the Spaniard completed his Career Grand Slam. Sinner held three championship points in the Roland Garros final against Alcaraz before falling short in a memorable five-set classic. Had he claimed the Coupe des Mousquetaires, the Italian would have been halfway to winning all four majors in the same season. Laver is the only man in the Open Era to do that, having swept the quartet of titles in 1969. Sinner and Alcaraz have won the past seven major trophies dating back to the 2024 Australian Open. If one of them triumphs at the US Open, it will be the first time two men have claimed all four Slams in two consecutive calendar years since Roger Federer and Rafael Nadal in 2006 and 2007. Federer and Nadal are the only duo to accomplish the feat in the Open Era. [NEWSLETTER FORM]",
    "author": "",
    "published": "Sun, 13 Jul 2025 23:14:00 Z",
    "image": "/-/media/images/news/2025/01/07/03/30/it-all-adds-up-banner.jpg?w=100%25\u0026hash=31EE1C2D1B04C8D5532DFFA763CBA0FF",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Player Features",
      "Jannik Sinner",
      "Carlos Alcaraz",
      "2025",
      "Wimbledon"
    ]
  },
  {
    "id": "c99a6ab3-2e6e-4481-a05e-37211ca703d8",
    "title": "Cahill, Vagnozzi on Sinner’s ‘rare quality’ that powered his Wimbledon triumph",
    "link": "https://www.atptour.com/en/news/cahill-vagnozzi-wimbledon-2025-final-reaction",
    "description": "Could Jannik Sinner’s Wimbledon title run have been kick-started by the power to forget? Coaches Darren Cahill and Simone Vagnozzi certainly believe that the first big step for their charge in the run-up to the grass-court major was him showcasing the ability to quickly move past his Roland Garros disappointment. Sinner held a two-set lead and later three championship points against Carlos Alcaraz in Paris before falling to a heartbreaking defeat, but the No. 1 in the PIF ATP Rankings swiftly banished that memory with a title triumph five weeks later at SW19. “After Paris it was tough, but we spoke a lot,” said Vagnozzi after Sinner downed Alcaraz in four sets on Sunday to clinch his maiden Wimbledon crown. “We spoke that we were really proud what he did in Paris. We came here with all the purpose to have a good tournament. It started really well. He had really good week of practice the week before, so we were really confident that he was able to play a good tournament here. “But for sure his mental strength is really strong. We are lucky to work with a guy like this that every day is going on the court with a right mentality, with a good attitude. So we are really proud of him.” Let’s hear it for the Champion! 🙌@janniksin | @Wimbledon | #Wimbledon pic.twitter.com/EhhhbGFrmK — ATP Tour (@atptour) July 13, 2025 Cahill not only cited Sinner’s ability to move on from Roland Garros as evidence of his charge’s mental strength. The Australian also praised the way his charge had responded after a tough fourth-round outing against Grigor Dimitrov at the All England Club: After Sinner fell and hurt his elbow in the first game of the match, Dimitrov took a two-set lead before being forced to retire after injuring his pectoral muscle. “We in the box always had faith that he was going to get himself out of that match, but yes, he caught a break,” said Cahill. “We kept reiterating to him that Grand Slams, in men's tennis, it's seven matches, it's best-of-five. Nobody goes through a tournament without a hiccup, whether it be an injury or a little bit of luck or you get yourself out of an early round problem. Everybody has a story in a Grand Slam. Maybe this was going to be his story. “So take it for what it is, put it to one side, and his main job was to concentrate on his next opponent. If you beat the next opponent, then you move on, and you make the most of it. He does that. It's the same way he approached his loss at Roland Garros. He saw it for what it was, understood that he played an incredible match at Roland Garros. He was beaten in the end by a better player. “He never played a better clay-court match than what he played there. So he knew he was improving as a tennis player, and he was able to put it to one side and just focus on the next day. That's a pretty rare quality to have.” It All Adds Up For Jannik Sinner At Wimbledon 2025: With his championship-match victory on Centre Court, Sinner snapped a five-match losing streak against his friend and rival Alcaraz, whom he now trails 5-8 in the pair’s Lexus ATP Head2Head series. Cahill recognised the significance of his charge registering his first tour-level win against the Spaniard since a semi-final triumph in Beijing in October 2023. “Today was important for many, many reasons,” said Cahill. “Carlos has had the wood over him for the last five matches. They've played amazing matches, and Jannik has had chances in maybe four of the five matches they've played to beat him. He hasn't been able to get the victory. ”So today was important not just because it was a Grand Slam final, not just because it was Wimbledon, and not just because Carlos had won the last five matches against him. He needed that win today. So he knew the importance of closing this one out when he had the opportunities.” [NEWSLETTER FORM]",
    "author": "",
    "published": "Sun, 13 Jul 2025 21:24:00 Z",
    "image": "",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Wimbledon",
      "Coaches Corner",
      "2025",
      "Jannik Sinner",
      "Darren Cahill",
      "Simone Vagnozzi",
      "Match Reaction"
    ]
  },
  {
    "id": "10773403-288e-4095-8e17-a85f32d1a20b",
    "title": "'Everything except easy' - how Sinner bounced back to win Wimbledon",
    "link": "https://www.bbc.com/sport/tennis/articles/cx20dxyd5plo",
    "description": "Thirty-five days after a devastating French Open final loss, Jannik Sinner is the Wimbledon champion. Here is how he did it.",
    "author": "",
    "published": "Sun, 13 Jul 2025 22:24:02 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "3bea6a5f-a366-4f1c-a388-a46cbc6809ef",
    "title": "Why 'happy' Alcaraz still smiled after Wimbledon loss",
    "link": "https://www.bbc.com/sport/tennis/articles/cedgepq4gwqo",
    "description": "Carlos Alcaraz lost the Wimbledon final to Jannik Sinner but says he can hold his head high.",
    "author": "",
    "published": "Sun, 13 Jul 2025 21:55:01 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "05c4d705-66cf-4ab1-ad2e-b1efca4cc43b",
    "title": "Wimbledon 2025 Day Twelve Recap",
    "link": "https://www.perfect-tennis.com/wimbledon-2025-day-twelve-recap/",
    "description": "Wimbledon’s final weekend is set, and it’s the showdown everyone hoped for. Jannik Sinner and Carlos Alcaraz will meet in the 2025 men’s final after both came through their semi-finals on Day Twelve, though in very different ways. Sinner produced a near-flawless performance to dispatch a hampered Novak Djokovic in straight sets, reaching his first …",
    "author": "Jonathan",
    "published": "Fri, 11 Jul 2025 20:18:21 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "Grand Slams",
      "Tennis News",
      "Wimbledon"
    ]
  },
  {
    "id": "68445155-b8e6-47d5-804c-251ac61daff9",
    "title": "Wimbledon 2025 Day Ten Recap",
    "link": "https://www.perfect-tennis.com/wimbledon-2025-day-ten-recap/",
    "description": "The top half of the Wimbledon men’s draw held firm on Wednesday, as Jannik Sinner and Novak Djokovic both booked their places in the semi-final, though not without some questions. Sinner, who fluked his way into the last eight, showed no signs of discomfort as he dispatched Ben Shelton in straight sets, extending his head-to-head …",
    "author": "Jonathan",
    "published": "Wed, 09 Jul 2025 19:02:01 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "Grand Slams",
      "Tennis News",
      "Wimbledon"
    ]
  }
]
