[
  {
    "id": "b16b42d6-21aa-4f2a-b8a4-8abb0a80f8c8",
    "title": "Takeaways from Indian Wells -- and what they mean for Miami Open",
    "link": "https://www.espn.com/tennis/story/_/id/44294809/bnp-paribas-indian-wells-miami-open-preview-mirra-andreeva-jack-draper-novak-djokovic",
    "description": "Will Djokovic and Swiatek turn their season around? Can Andreeva continue her incredible run? The biggest questions as the Miami Open begins.",
    "author": "D'Arcy Maine",
    "published": "Tue, 18 Mar 2025 10:13:29 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "2a3e386b-e35f-47de-8bdb-d26682bde9d2",
    "title": "'I guess I have to think of some new goals now': Inside Mirra Andreeva's meteoric rise in 2025",
    "link": "https://www.espn.com/tennis/story/_/id/44224479/mirra-andreeva-bnp-paribas-indian-wells-elina-svitolina-quarterfinals",
    "description": "Mirra Andreeva predicted she'd win her first 1000-level tournament this year. In February she did it -- and since then she's surpassed all expectations.",
    "author": "D'Arcy Maine",
    "published": "Wed, 12 Mar 2025 19:10:12 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "7b8981f1-c50a-431f-841c-b7d055ca1681",
    "title": "Unlock the Perfect Slice Serve - Essential Tennis Podcast #415",
    "link": "https://essentialtennis.podbean.com/e/unlock-the-perfect-slice-serve-essential-tennis-podcast-415/",
    "description": "The wide slice serve is a CRITICAL tool to have in your tool box. It pulls opponents out of position, opens the court up for you to hit into, exposes their usually weaker backhand side, and forces them to run twice as far for the next shot - if they even get it at all. Let’s take a deep dive into how YOU can develop this powerful weapon, step by step in this special episode of the Essential Tennis Podcast.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 15 Nov 2024 18:50:51 -0500",
    "image": "https://mcdn.podbean.com/mf/web/6gbi7n6nxzku6ztz/Podcast415.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "8ac68c3b-aac3-48e1-899c-58111fb5b722",
    "title": "3 Djokovic Secrets To Winning More Matches - Essential Tennis Podcast #414",
    "link": "https://essentialtennis.podbean.com/e/3-djokovic-secrets-to-winning-more-matches-essential-tennis-podcast-414/",
    "description": "In this special episode of the Essential Tennis Podcast, you're going to learn the top 3 tactical secrets of Novak Djokovic that you can apply in your very next match. Use these tools to gain precision, consistency, and offense to make your opponents more uncomfortable, win more points, and win more matches.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 08 Nov 2024 14:45:36 -0500",
    "image": "https://mcdn.podbean.com/mf/web/r7nwpsg3kzhjcns5/Podcast414.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "59d1bdb2-8823-410a-ab21-8e472793feaa",
    "title": "'So surreal' - teenager Eala stuns out-of-sorts Swiatek",
    "link": "https://www.bbc.com/sport/tennis/articles/c9847gd2qjzo",
    "description": "Second seed Iga Swiatek suffers a monumental shock as Filipino teenager Alexandra Eala continues her dream run to reach the Miami Open semi-finals.",
    "author": "",
    "published": "Wed, 26 Mar 2025 23:12:08 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "266edb13-0b05-460b-9984-11e860f3e695",
    "title": "Swiatek abused by 'aggressive' fan in Miami incident",
    "link": "https://www.bbc.com/sport/tennis/articles/ckg1dlje2ndo",
    "description": "Five-time major champion Iga Swiatek is being protected by increased security after being verbally abused during a practice session.",
    "author": "",
    "published": "Wed, 26 Mar 2025 12:50:20 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "d9c2d494-e53e-49a2-a8e6-793916229226",
    "title": "Dimitrov saves MP, survives Cerundolo after nearly 3 hours",
    "link": "https://www.atptour.com/en/news/cerundolo-dimitrov-miami-2025-qfs",
    "description": "Grigor Dimitrov saved a match point to survive Francisco Cerundolo on Wednesday at the Miami Open presented by Itau, where the Bulgarian claimed a gritty 150th match win at ATP Masters 1000 level and advanced to the semi-finals. Gasping for air at times in the latter stages of the match, last year’s finalist Dimitrov found enough energy to fight off Cerundolo 6-7(6), 6-4, 7-6(3) after two hours, 48 minutes. Cerundolo will rue his missed backhand return while holding match point at 6-5 in the decider.GRIGOR DIMITROV!!! HOW HAVE YOU DONE THAT?! 🤯🤯🤯@MiamiOpen | #MiamiOpen | @GrigorDimitrov pic.twitter.com/vaVptitPcr— ATP Tour (@atptour) March 27, 2025 Dimitrov had his own missed opportunities in the beginning stages, letting slip seven set points in the opener, one of which he missed by dumping a routine backhand volley in the net. But that did not discourage Dimitrov from moving forward, instead only fuelling his determination. He took a more aggressive baseline position in the second set and converted all eight of his net points. Playing with great variety by mixing backhand slices with his trademark one-hander, Dimitrov began to dictate rallies. He did not drop a point behind in his first serve (11/11) in the second set, according to Infosys ATP Stats. Trailing 0-3 in the decider, Dimitrov mounted another comeback to become the fifth man to reach multiple Miami semi-finals after turning 30 (Andre Agassi, Jimmy Connors, Roger Federer, John Isner). He improved to 12-1 in deciding-set matches at the ATP Masters 1000 event in south Florida. Up next for the 14th seed will be six-time champion Novak Djokovic or American Sebastian Korda.Having arrived in Miami defending his finalist showing from last year, Dimitrov’s run to the last four has him No. 18 the PIF ATP Live Rankings. [NEWSLETTER FORM]",
    "author": "",
    "published": "Thu, 27 Mar 2025 00:34:00 Z",
    "image": "",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Miami",
      "Match Report",
      "2025",
      "Grigor Dimitrov"
    ]
  },
  {
    "id": "e951717f-c92e-4378-a982-0549e819bdf8",
    "title": "Jakub Mensik: How it all adds up for #NextGenATP Czech star",
    "link": "https://www.atptour.com/en/news/mensik-it-all-adds-up-2025",
    "description": "Jakub Mensik is only 19 years old, but has already proven a force on the ATP Tour. Everything is adding up for the Czech #NextGenATP star, who will face Arthur Fils in the quarter-finals of the Miami Open presented by Itau. ATPTour.com caught up with the teen about his favourite rivalry, the goal he is chasing, his greatest success and more. Who is your greatest rival? What makes them so tough? [I don't have one] yet, because, I played just a couple of guys more than once. I know there are plenty of guys my age, little bit older, but yeah, for now, I, I don't have any rivalry [like] let's say, I don't know, Sinner and Alcaraz. What is your favourite tennis rivalry and why? For now, it's obviously Jannik and Carlos, because they are just three years older. Actually, Jannik is four years. But for the future, I can play with them plenty of matches. So of course, them, because I [am] close to them [in age], my game style is also very close.   What has been the most unique moment in your career? Probably playing the quarter-finals against my idol Novak Djokovic in Shanghai.... Once I was beating the good players, Andrey [Rublev] , Grigor [Dimitrov], and moving there, and I was like, 'Okay, well, if I win this match, I can play against him'. It happened. So, after that, when I had the day off, I was super nervous, but very excited. It is different when you're watching him and when you're playing against him. Everything [went] not like in my expectations. What is the biggest number or accomplishment you have been chasing and how long have you been pursuing it? If we are talking about this season, I would like to reach the Top 30. I think it's just a good goal — a good set goal — because last year it was Top 200, Top 80. I reached Top 50. But then it's very tough to go higher and higher. So I think if I will be in the Top 30, Top 25 at the end of this year, it's pretty good. I like the way of my game and my improvement. What has been your greatest success? Biggest success so far, I don't know, being on ATP Tour for one year, to be stable there, and to play against the best players in the world, and to beat them. Of course, I have plenty of good results in the tournaments — Shanghai, Grand Slams. So obviously, my level of improving is there, and that's the success and I'm still always improving. What is the greatest difficulty you have had to overcome? Struggling with the injury last year with my elbow. What is your favourite tournament to play and why? Indian Wells. It’s super nice. There you receive a car, you can play golf there. Of course [I play golf], I do actually, since two years ago. And I’m playing only [at] the tournaments. What has been the coolest off-court experience you have been able to enjoy because you are a professional tennis player? During the Next Gen in Jeddah, we had a party on the boat from the ATP... In Jeddah, we were having fun together, which was kind of out of topic and something different. [NEWSLETTER FORM]",
    "author": "",
    "published": "Thu, 27 Mar 2025 00:16:00 Z",
    "image": "/-/media/2024-images/news/2025/01/07/03/30/it-all-adds-up-banner.jpg?w=100%25\u0026hash=B020DA612BE0D0A67145854EF774A25A",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "It All Adds Up",
      "Player Features",
      "2025",
      "Miami",
      "Jakub Mensik"
    ]
  },
  {
    "id": "e756f4d2-b631-4aee-abce-79044cd233db",
    "title": "Miami Open 2025 Day 7 Recap",
    "link": "https://www.perfect-tennis.com/miami-open-2025-day-7-recap/",
    "description": "Day 7 at the 2025 Miami Open saw Novak Djokovic deliver a 6-2, 6-2 masterclass over Lorenzo Musetti to reach the quarter-finals, while Francisco Cerundolo exacted revenge on Casper Ruud with a 6-4, 6-2 upset despite a three-and-a-half-hour rain delay. The weather also forced the cancellation of Alexander Zverev’s clash with Arthur Fils, leaving their …",
    "author": "Jonathan",
    "published": "Wed, 26 Mar 2025 08:17:22 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "ATP Masters 1000",
      "Miami Open",
      "Tennis News"
    ]
  },
  {
    "id": "cb25fefb-0834-44be-bbc2-84b762e6771a",
    "title": "Miami Open 2025 Day 6 Recap",
    "link": "https://www.perfect-tennis.com/miami-open-2025-day-6-recap/",
    "description": "Day 6 of the 2025 Miami Open concluded the Round of 32 at the Hard Rock Stadium, and it didn’t disappoint. Monday’s matches featured strong performances from top seeds like Alexander Zverev and Taylor Fritz, alongside a gritty comeback from Alex de Minaur against a lively crowd favourite, Joao Fonseca. Below is how the day …",
    "author": "Jonathan",
    "published": "Tue, 25 Mar 2025 07:56:31 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "ATP Masters 1000",
      "Miami Open",
      "Tennis News"
    ]
  }
]
