[
  {
    "id": "a03df0fe-f413-46c8-b0ab-0a161e1abc8a",
    "title": "'I'm a different person when I play': The unexpected impact of pickleball on prison life",
    "link": "https://www.espn.com/tennis/story/_/id/43027601/pickleball-league-prison-macdougall-walker-joey-losgar-picl",
    "description": "Last year, a pickleball league was launched at New England's largest prison. Now, more than 40 facilities have adopted the sport -- and inmates say it has changed their lives.",
    "author": "D'Arcy Maine",
    "published": "Fri, 20 Dec 2024 10:32:21 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "6e599968-f2dc-49d3-80cb-5842e012da72",
    "title": "The top tennis players, and moments, of 2024",
    "link": "https://www.espn.com/tennis/story/_/id/42607435/jannik-sinner-aryna-sabalenka-coco-gauff-djokovic-espn-players-year-nadal",
    "description": "Sinner and Sabalenka each won two Grand Slams and ended up No. 1 -- but 2024 was full of memorable moments.",
    "author": "D'Arcy Maine",
    "published": "Tue, 26 Nov 2024 12:09:56 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "ec8e4f5c-62ed-475e-8f15-ff7ee93e3ec7",
    "title": "Wimbledon winner Purcell admits anti-doping breach",
    "link": "https://www.bbc.com/sport/tennis/articles/cgq1zpe8p00o",
    "description": "Two-time doubles Grand Slam champion Max Purcell takes voluntary suspension after admitting anti-doping breach.",
    "author": "",
    "published": "Mon, 23 Dec 2024 09:41:48 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "0beda4f7-846b-426a-8b6c-52398d3a5e1e",
    "title": "Boulter and De Minaur announce engagement",
    "link": "https://www.bbc.com/sport/tennis/articles/ce3lw4vrvdvo",
    "description": "British number one Katie Boulter announces her engagement to Australian world number nine Alex de Minaur.",
    "author": "",
    "published": "Mon, 23 Dec 2024 11:32:59 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "22e61ec0-3205-48d2-b594-afe0ed0de8c8",
    "title": "Unlock the Perfect Slice Serve - Essential Tennis Podcast #415",
    "link": "https://essentialtennis.podbean.com/e/unlock-the-perfect-slice-serve-essential-tennis-podcast-415/",
    "description": "The wide slice serve is a CRITICAL tool to have in your tool box. It pulls opponents out of position, opens the court up for you to hit into, exposes their usually weaker backhand side, and forces them to run twice as far for the next shot - if they even get it at all. Let’s take a deep dive into how YOU can develop this powerful weapon, step by step in this special episode of the Essential Tennis Podcast.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 15 Nov 2024 18:50:51 -0500",
    "image": "https://mcdn.podbean.com/mf/web/6gbi7n6nxzku6ztz/Podcast415.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "d53e0e80-e8e0-4a69-9d1a-7f6d58ee469f",
    "title": "3 Djokovic Secrets To Winning More Matches - Essential Tennis Podcast #414",
    "link": "https://essentialtennis.podbean.com/e/3-djokovic-secrets-to-winning-more-matches-essential-tennis-podcast-414/",
    "description": "In this special episode of the Essential Tennis Podcast, you're going to learn the top 3 tactical secrets of Novak Djokovic that you can apply in your very next match. Use these tools to gain precision, consistency, and offense to make your opponents more uncomfortable, win more points, and win more matches.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 08 Nov 2024 14:45:36 -0500",
    "image": "https://mcdn.podbean.com/mf/web/r7nwpsg3kzhjcns5/Podcast414.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "4b2d2f7e-b02c-4eaf-b74f-52150e9697c2",
    "title": "Alcaraz aiming for the record books, Fonseca leads #NextGenATP charge; What to watch for in 2025",
    "link": "https://www.atptour.com/en/news/what-to-watch-for-in-2025-part-2",
    "description": "Before the tennis season begins, ATPTour.com highlights key storylines to watch in 2025. Yesterday we looked at what to watch for Jannik Sinner and Novak Djokovic, and today in Part 2 we focus on stars including Carlos Alcaraz and Daniil Medvedev. Alcaraz’s aim for more history \u0026 continued rivalry with Sinner If Alcaraz lifts his maiden Australian Open title, the Spaniard will become the latest player to achieve a ‘Career Grand Slam’, claiming all four major titles in his career. At World No. 3 in the PIF ATP Rankings, the 21-year-old is aiming to return to the very top of the game. He will also seek a three-peat in Indian Wells and also at Wimbledon in 2025. This upcoming season is sure to provide more thrilling clashes between Alcaraz and his great rival Sinner. Alcaraz went 3-0 against the Italian in 2024, improving to 6-4 in his Lexus ATP Head2Head series with the Italian. They split the season’s four majors, with Alcaraz completing the rare Roland Garros-Wimbledon double. Alcaraz became the sixth man in the Open Era to complete the feat, joining Rod Laver, Bjorn Borg, Rafael Nadal, Roger Federer and Djokovic. With three consecutive top-three year-end finishes to his name, Alcaraz will begin the year ready to compete for the biggest titles. Fonseca headlines #NextGenATP stars seeking to make a splash One of the most thrilling aspects of each season is discovering the sport's next breakout stars. Just days ago, 18-year-old Joao Fonseca won the Next Gen ATP Finals presented by PIF. Alcaraz and Sinner are two other champions of the event who triumphed at the 20-and-under season finale aged 18.   Nineteen-year-old Jakub Mensik was named Newcomer of the Year following a season in which he reached his first tour-level final, finished inside the Top 50 of the PIF ATP Rankings and qualified for the Next Gen ATP Finals presented by PIF. Mensik will be aiming for a return trip to Jeddah in 2025. Other 20-and-under stars to keep an eye on include Shang Juncheng, Learner Tien, Nishesh Basavareddy and Martin Landaluce. Shang scored his first tour-level title in Chengdu this past season. Tien became the fourth American to win three ATP Challenger Tour titles before his 19th birthday, joining Taylor Fritz, Andy Roddick and Sam Querrey. The lefty also reached the championship match in Jeddah. Medvedev’s mission Medvedev has spoken tongue-in-cheek about his dislike for clay and since he won his first title on that surface — Rome in 2023 — he has been seeking a 21st tour-level trophy. The World No. 5 reached two finals in 2024 (Australian Open, Indian Wells) and now looks to go one step further to again leave a tournament as champion. Medvedev has reached the Australian Open championship match in three of the past four years. Is 2025 his time to finish on top in Melbourne and end his title drought in the first month of the year? Despite not lifting a trophy in 2024, Medvedev did enjoy a consistent season, qualifying the Nitto ATP Finals for the sixth consecutive year. [ATP APP] Major milestone? Top 10 stars Alexander Zverev, Taylor Fritz, and Casper Ruud have each come within one win of capturing a major title. As the new season unfolds, the prospect of turning those near-title finishes into career-defining triumphs looms large. Ruud has reached three major finals while Zverev has twice finished runner-up. Fritz was a finalist at his home Slam in 2024. Zverev, the No. 2 player in the PIF ATP Rankings, captured a career-best 69 tour-level match wins in 2024, second most behind Sinner. The German lifted the trophy at the ATP Masters 1000 events in Rome and Paris, marking his biggest triumphs since a severe ankle injury in 2022. Zverev’s previous two Slam final appearances (2020 US Open, 2024 Roland Garros) both ended with difficult five-set losses. Stars and stripes scattered throughout Top 25 and beyond The United States is asserting its dominance towards the top of the PIF ATP Rankings. Five Americans enter the season inside the Top 25, led by World No. 4 Fritz. Tommy Paul, Frances Tiafoe, Ben Shelton and Sebastian Korda (who has been sidelined since the US Open due to an elbow injury). Alex Michelsen, 20, is the youngest American inside the Top 50 and could be a name to watch alongside his fellow California natives Brandon Nakashima, the 2022 Next Gen ATP Finals presented by PIF champion and Tien, who reached the Jeddah final. Nineteen-year-old Nishesh Basavareddy also competed in Jeddah following a standout ATP Challenger Tour season in which he boasted a 41-13 match record and lifted two titles at that level. [NEWSLETTER FORM]",
    "author": "",
    "published": "Tue, 24 Dec 2024 14:22:00 Z",
    "image": "",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Carlos Alcaraz",
      "Daniil Medvedev"
    ]
  },
  {
    "id": "c5604a86-bdaf-4e2c-b270-393096bbc79d",
    "title": "United Cup 2025: Draws, Dates, History \u0026 All You Need To Know",
    "link": "https://www.atptour.com/en/news/united-cup-2025-history-draw-schedule",
    "description": "A host of top stars from both the ATP Tour and the Hologic WTA Tour will compete at the 2025 United Cup in Perth and Sydney, Australia. Team Germany, led by World No. 2 Alexander Zverev, will defend the crown it won at the mixed teams competition in 2024. United States, champion in 2023, boasts Top 5 players Taylor Fritz and Coco Gauff. Other marquee players competing include Iga Swiatek and Hubert Hurkacz for Poland, Stefanos Tsitsipas and Maria Sakkari for Greece, Jasmine Paolini (Italy), Elena Rybakina (Kazakhstan), Alex de Minaur (Australia), Beatriz Haddad Maia (Brazil), Casper Ruud (Norway) and Felix Auger-Aliassime (Canada). When is the United Cup? The 2025 United Cup will be held from 27 December, 2024 to 5 January, 2025. The outdoor hard-court event, established in 2023, will take place at the RAC Arena in Perth and the Sydney Olympic Park Tennis Centre. The tournament director is Stephen Farrow. What is the format at the 2025 United Cup? The event will see 18 teams placed into six groups of three. The group stages will consist of round robin ties where each team will play both other teams in their group. Each tie will consist of one ATP singles match, one WTA singles match and one mixed doubles match. The top team from each group will advance to the quarter-finals, with one quarter-final spot also awarded to the best runner-up team in both Perth and Sydney. When is the draw for the 2025 United Cup? The groups have been announced for the 2025 United Cup: PERTH Group A United States Canada Croatia Group C Greece Kazakhstan Spain Group E China Germany Brazil SYDNEY Group B Poland Czechia Norway Group D Italy France Switzerland Group F Great Britain Australia Argentina What is the schedule for the 2025 United Cup? The third edition of the United Cup will be played in Perth (from 27 December, 2024) and Sydney (from 28 December). The host cities will each stage group play and quarter-finals, with four teams advancing to the semi-finals (4 January, 2025) and final (5 January) in Sydney. The full schedule can be found here.  [ATP APP] What is the prize money for the 2025 United Cup? The 2025 United Cup will offer a minimum of US$10,250,000 in total prize money and participation fees, with a minimum of US$5,125,000 each for ATP and WTA players, respectively. The total prize money is split into three components: participation fee, per team wins and prize money. How can I watch the 2025 United Cup? A full list of broadcasters for the 2025 United Cup can be found here. How can I follow the United Cup? Hashtag: #UnitedCup Facebook: United Cup TikTok: @unitedcuptennis Twitter: @unitedcuptennis Instagram: @unitedcuptennis Who won the last edition of the United Cup in 2024? Germany won the second edition of the United Cup in 2024 with a 2-1 win against Poland in the championship match in Sydney. (Read \u0026 Watch). Alexander Zverev, Angelique Kerber, Tatjana Maria, Laura Siegemund, Maximilian Marterer competed for Germany across the event. [NEWSLETTER FORM]",
    "author": "",
    "published": "Tue, 24 Dec 2024 14:18:00 Z",
    "image": "",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "United Cup"
    ]
  },
  {
    "id": "cdfe3365-f858-43d0-a847-76b5513a9a73",
    "title": "Sinner Cruises to ATP Finals Victory",
    "link": "https://www.perfect-tennis.com/sinner-cruises-to-atp-finals-victory/",
    "description": "Jannik Sinner is the 2024 Nitto ATP finals champion after comfortably defeating Taylor Fritz 6-4 6-4 in Sunday’s final, becoming the first player from his country to win the tournament in its 55-year history. The Italian emerges as the undefeated champion (without even dropping a set) and wins $4,881,100 in prize money, making it a …",
    "author": "Jonathan",
    "published": "Sun, 17 Nov 2024 19:44:15 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "ATP Finals",
      "Tennis News"
    ]
  },
  {
    "id": "eec81be8-b976-4b80-8bf5-68be7e47a6be",
    "title": "ATP Finals 2024 Semi Finals Recap",
    "link": "https://www.perfect-tennis.com/atp-finals-2024-semi-finals-recap/",
    "description": "Jannik Sinner and Taylor Fritz will face off in Sunday’s 2024 ATP finals decider after the pair came through their sem-final matches at the Pala Alpitour in Turin. Fritz was the first man to book his spot. He defeated Alexander Zverev for the fourth time this season, battling to a 6-3 3-6 7-6(3) win. It …",
    "author": "Jonathan",
    "published": "Sat, 16 Nov 2024 21:21:12 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "ATP Finals",
      "Tennis News"
    ]
  }
]
