[
  {
    "id": "4202bf2f-8cb5-4342-b454-60e25ede7815",
    "title": "The Big Two? This Alcaraz-Sinner rivalry is epic",
    "link": "https://www.espn.com/tennis/story/_/id/45473582/2025-french-open-title-winner-men-alcaraz-sinner-big-2",
    "description": "Sinner and Alcaraz have combined to win the last six Grand Slams -- and are pushing each other to new heights in the sport.",
    "author": "D'Arcy Maine",
    "published": "Sun, 8 Jun 2025 17:16:00 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "5c4b1360-2a89-4390-97b8-a22e9eb3eab1",
    "title": "Nadal, Billie Jean King lead reactions to Carlos Alcaraz winning French Open title",
    "link": "https://www.espn.com/tennis/story/_/id/45474654/carlos-alcaraz-2025-french-open-final-social-media-reactions",
    "description": "Congratulations poured in for Carlos Alcaraz after he defeated Jannik Sinner in a classic French Open final.",
    "author": "ESPN staff",
    "published": "Sun, 8 Jun 2025 15:31:00 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "bd65a98a-d757-43b1-a9f9-cb1cbab92728",
    "title": "Unlock the Perfect Slice Serve - Essential Tennis Podcast #415",
    "link": "https://essentialtennis.podbean.com/e/unlock-the-perfect-slice-serve-essential-tennis-podcast-415/",
    "description": "The wide slice serve is a CRITICAL tool to have in your tool box. It pulls opponents out of position, opens the court up for you to hit into, exposes their usually weaker backhand side, and forces them to run twice as far for the next shot - if they even get it at all. Let’s take a deep dive into how YOU can develop this powerful weapon, step by step in this special episode of the Essential Tennis Podcast.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 15 Nov 2024 18:50:51 -0500",
    "image": "https://mcdn.podbean.com/mf/web/6gbi7n6nxzku6ztz/Podcast415.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "3bda6394-2a49-4c73-b53a-99d7536229e1",
    "title": "3 Djokovic Secrets To Winning More Matches - Essential Tennis Podcast #414",
    "link": "https://essentialtennis.podbean.com/e/3-djokovic-secrets-to-winning-more-matches-essential-tennis-podcast-414/",
    "description": "In this special episode of the Essential Tennis Podcast, you're going to learn the top 3 tactical secrets of Novak Djokovic that you can apply in your very next match. Use these tools to gain precision, consistency, and offense to make your opponents more uncomfortable, win more points, and win more matches.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 08 Nov 2024 14:45:36 -0500",
    "image": "https://mcdn.podbean.com/mf/web/r7nwpsg3kzhjcns5/Podcast414.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "026c71bc-9da2-41e9-92fe-886404f0b197",
    "title": "On This Day: Sinner becomes first Italian to rise to No. 1 in 2024",
    "link": "https://www.atptour.com/en/news/sinner-on-this-day-no-1-club",
    "description": "Jannik Sinner made history on 10 June 2024 when he became the first Italian to rise to No. 1 in the PIF ATP Rankings, following a standout run that started in August 2023. Under the guidance of Darren Cahill and Simone Vagnozzi, Sinner arrived at the ATP Masters 1000 event in Toronto in August 2023 as a Top 10 player and seven-time tour-level champion. While his potential was clear, it was the Italian's success in Canada that marked the start of his incredible run to No. 1. After winning his first ATP Masters 1000 title in Toronto, Sinner clinched further trophies at ATP 500 events in Beijing and Vienna and advanced to the title match at the Nitto ATP Finals in Turin, where he fell to Novak Djokovic after beating the Serbian legend during the round-robin stage. Arriving at the Australian Open in 2024, hype was high around Sinner, who had a new swagger after guiding Italy to Davis Cup glory in November. Sinner dispatched Djokovic in the semi-finals in Melbourne and then after falling two sets down, refused to surrender against Daniil Medvedev in the final. The Italian did not panic, trusted his game and turned the match around to clinch his first major title. Leaving Melbourne as the World No. 4, Sinner backed up his AO run by triumphing at the ATP 500 event in Rotterdam. His second ATP Masters 1000 trophy followed in Miami, leaving Sinner at No. 2 in the PIF ATP Rankings in April. It was now a matter of when, not if, Sinner would become World No. 1. The answer: Following Roland Garros in June. A semi-final showing coupled with a quarter-final exit for Djokovic ensured the Italian would become the 29th player to secure No. 1 status. Adversity, like defeats in the latter stages of majors, has drawn the best out of Sinner. The same way the Big Three drove one another to greater heights, Djokovic, Alcaraz and others have done the same to the Italian. Now at 53 weeks and counting, it will take a lot to knock the 23-year-old off his perch. Sinner is currently 2,030 points clear of Carlos Alcaraz, who beat the Italian in the longest Roland Garros final in history on Sunday. As the defending champion, Alcaraz will drop another 2,000 points at Wimbledon, likely leaving Sinner unchallenged at No. 1 until the US hard-court swing. [NEWSLETTER FORM]",
    "author": "",
    "published": "Tue, 10 Jun 2025 04:00:00 Z",
    "image": "/-/media/2024-images/news/2025/01/07/03/30/it-all-adds-up-banner.jpg?w=100%25\u0026hash=B020DA612BE0D0A67145854EF774A25A",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "On This Day",
      "No 1 Club",
      "Jannik Sinner",
      "2025"
    ]
  },
  {
    "id": "fb646f8e-c2ab-4b3b-9d3a-9b0f97e58f49",
    "title": "How Alcaraz is tracing the paths of Nadal, Federer",
    "link": "https://www.atptour.com/en/news/alcaraz-roland-garros-2025-title-one-day-after",
    "description": "If Carlos Alcaraz’s epic Roland Garros final victory were a blockbuster film, his triumph would be the jaw-dropping moment everyone remembers and talks about for years to come. Beyond the drama of a five-hour, 29-minute marathon — in which he saved three straight championship points to deny rival Jannik Sinner his first Roland Garros title — Alcaraz’s victory is rich with striking parallels and history-making significance. Following in Rafa’s footsteps Alcaraz lifted his fifth Slam trophy just one day older (22 years, 34 days) than his idol and countryman Rafael Nadal. Fittingly, Nadal’s fifth major also came in dramatic fashion. The lefty toppled Roger Federer in a legendary 2008 Wimbledon showdown, one of the most iconic battles in their 40-match Lexus ATP Head2Head rivalry. Now, fans will talk about Sunday’s thriller between Alcaraz and World No. 1 Sinner in the manner they talk about Nadal and Federer’s '08 Wimbledon classic, which the Spaniard won 9-7 in the fifth set, with daylight quickly fading. CARLOS TO-DO LIST 📝 Come back from two sets down: ✅ Save 3 championship points: ✅ Defend title ✅ SIMPLY. ON. ANOTHER. LEVEL. 🚀#rolandgarros #alcaraz pic.twitter.com/VxhxVUdDkR — ATP Tour (@atptour) June 8, 2025 Flawless in Slam finals Alcaraz extended his perfect record in major finals to 5-0, just two shy of matching Federer’s record of winning his first seven major finals. Federer, a 20-time major champion, won his first Slam at Wimbledon in 2003 and did not lose a major final until 2006 Roland Garros, where he fell to Nadal in four sets. Alcaraz earned his first major trophy at the 2022 US Open, which came with a double prize for the Spaniard. Not only was he crowned champion, Alcaraz also became the youngest No. 1 in PIF ATP Rankings history. Going for double glory The 22-year-old will chase another historic feat at Wimbledon. Alcaraz aims to become just the second player — alongside Bjorn Borg — to claim the Roland Garros-Wimbledon double in back-to-back seasons. Borg won the Roland Garros-Wimbledon double in 1978, '79 and '80. Alcaraz, who is first in the PIF ATP Live Race To Turin, has won the Wimbledon title the past two seasons, twice denying Novak Djokovic from a record-tying eighth trophy at the grass-court major. Read More About Alcaraz's Historic Triumph: How Alcaraz saved 3 championship points Alcaraz joins this list of players to rally from two sets down in a Grand Slam final... Rivalries: Alcaraz vs. Sinner [NEWSLETTER FORM]",
    "author": "",
    "published": "Mon, 09 Jun 2025 22:34:00 Z",
    "image": "",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Carlos Alcaraz",
      "Roland Garros",
      "2025"
    ]
  },
  {
    "id": "ffe1df26-f55b-4722-bc75-ecd870b3d1c6",
    "title": "Kartal wins and Raducanu \u0026 Boulter team up as women return to Queen's",
    "link": "https://www.bbc.com/sport/tennis/articles/c3wd0jzggx9o",
    "description": "Britain's Sonay Kartal secures the biggest win of her career as women's tennis returns to Queen's Club for the first time since 1973.",
    "author": "",
    "published": "Mon, 09 Jun 2025 18:23:18 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "07ee6d4f-e0cf-47ec-99bc-8c582eb5b616",
    "title": "Murray open to coaching return 'at some stage'",
    "link": "https://www.bbc.com/sport/tennis/articles/cdedw85ew42o",
    "description": "Andy Murray is open to a return to coaching \"at some stage\" but says he still has plenty to learn after his stint with Novak Djokovic.",
    "author": "",
    "published": "Mon, 09 Jun 2025 16:10:39 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "70b8ee5f-f868-4047-9f46-0efeb650bc09",
    "title": "Alcaraz Saves 3 Championships Points to Defend Roland Garros Title",
    "link": "https://www.perfect-tennis.com/alcaraz-saves-3-championships-points-to-defend-roland-garros-title/",
    "description": "Carlos Alcaraz clinched his fifth Grand Slam title in a thrilling five-set battle against Jannik Sinner at Roland Garros on Sunday, rallying from two sets down to win 4-6, 6-7(4), 6-4, 7-6(3), 7-6(10-2). The match, the longest Roland Garros final ever at 5 hours and 29 minutes, saw Alcaraz save three championship points in the …",
    "author": "Jonathan",
    "published": "Sun, 08 Jun 2025 20:09:15 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "French Open",
      "Grand Slams",
      "Tennis News"
    ]
  },
  {
    "id": "2fde51f5-a325-4802-b609-a9de97722c3e",
    "title": "French Open 2025 Semi Final Recap",
    "link": "https://www.perfect-tennis.com/french-open-2025-semi-final-recap/",
    "description": "Day Thirteen at Roland Garros delivered two very different semi-finals, but one clear outcome: the dream final is on. Carlos Alcaraz was the first to book his spot, recovering from a slow start to take control against Lorenzo Musetti, who was forced to retire early in the fourth set due to a leg injury. The …",
    "author": "Jonathan",
    "published": "Fri, 06 Jun 2025 21:23:23 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "French Open",
      "Grand Slams",
      "Tennis News"
    ]
  }
]
