[
  {
    "id": "1e140dc6-a86a-4404-a9e5-ad5e677d90e7",
    "title": "'I guess I have to think of some new goals now': Inside Mirra Andreeva's meteoric rise in 2025",
    "link": "https://www.espn.com/tennis/story/_/id/44224479/mirra-andreeva-bnp-paribas-indian-wells-elina-svitolina-quarterfinals",
    "description": "Mirra Andreeva predicted she'd win her first 1000-level tournament this year. In February she did it -- and since then she's surpassed all expectations.",
    "author": "D'Arcy Maine",
    "published": "Wed, 12 Mar 2025 19:10:12 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "29c0f453-23c5-4389-95ec-10d24e5b03dc",
    "title": "Agassi will be part of French Open TV coverage",
    "link": "https://www.espn.com/tennis/story/_/id/44505455/andre-agassi-tv-analyst-french-open-semis-finals",
    "description": "Andre Agassi, who won the French Open in 1999, will be a studio analyst during the semifinals and finals this year, TNT Sports announced Wednesday.",
    "author": "",
    "published": "Wed, 2 Apr 2025 12:10:42 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "d27322d4-a615-414e-ae57-837ad6b91a4c",
    "title": "Unlock the Perfect Slice Serve - Essential Tennis Podcast #415",
    "link": "https://essentialtennis.podbean.com/e/unlock-the-perfect-slice-serve-essential-tennis-podcast-415/",
    "description": "The wide slice serve is a CRITICAL tool to have in your tool box. It pulls opponents out of position, opens the court up for you to hit into, exposes their usually weaker backhand side, and forces them to run twice as far for the next shot - if they even get it at all. Let’s take a deep dive into how YOU can develop this powerful weapon, step by step in this special episode of the Essential Tennis Podcast.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 15 Nov 2024 18:50:51 -0500",
    "image": "https://mcdn.podbean.com/mf/web/6gbi7n6nxzku6ztz/Podcast415.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "72c20664-a441-4fe7-840b-f346a0deec60",
    "title": "3 Djokovic Secrets To Winning More Matches - Essential Tennis Podcast #414",
    "link": "https://essentialtennis.podbean.com/e/3-djokovic-secrets-to-winning-more-matches-essential-tennis-podcast-414/",
    "description": "In this special episode of the Essential Tennis Podcast, you're going to learn the top 3 tactical secrets of Novak Djokovic that you can apply in your very next match. Use these tools to gain precision, consistency, and offense to make your opponents more uncomfortable, win more points, and win more matches.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 08 Nov 2024 14:45:36 -0500",
    "image": "https://mcdn.podbean.com/mf/web/r7nwpsg3kzhjcns5/Podcast414.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "dd4ecf6b-baef-4151-b9c9-1233e7ea658b",
    "title": "Brooksby saves 3 MPs to reach Houston QFs",
    "link": "https://www.atptour.com/en/news/houston-2025-wednesday-report",
    "description": "Jenson Brooksby fended off three consecutive match points Wednesday to reach the quarter-finals of the Fayez Sarofim \u0026 Co. U.S. Men's Clay Court Championship. The American overcame third seed Alejandro Tabilo 3-6, 6-4, 7-6(6) after a two-hour, 49-minute battle in blustery conditions. On the brink of defeat at 3/6 in the deciding-set tie-break, World No. 507 Brooksby swung freely and tallied five consecutive points to become the lowest-ranked quarter-finalist in Houston tournament history.Making his mark in Houston 🙌Jenson Brooksby is quarter-final bound after an impressive 3-6 6-4 7-6(6) victory over Tabilo. @mensclaycourt | #USClay pic.twitter.com/08kuqOnBCU— ATP Tour (@atptour) April 2, 2025 Brooksby also saved a match point in his first-round qualifying match Saturday against Federico Agustin Gomez. Against Tabilo, the former World No. 33 in the PIF ATP Rankings held a match point on return at 6-5 but ultimately navigated a rollercoaster tie-break, converting his second match point to win his first Lexus ATP Head2Head meeting with the Chilean. “I’m still a little bit shocked,” Brooksby said in his on-court interview. “That was a lot of back and forth. I knew he was a great competitor and I knew it would be a battle out here. I think it kind of reminded me of my first match here. You can just never quit until it’s the last point.” Tabilo, who secured an early break in the final set, will rue a loose service game when serving for the match at 5-4. In the decider, Brooksby dropped just three points behind his first serve, according to Infosys ATP Stats. Brooksby, 24, will next face Aleksandar Kovacevic or Frenchman Corentin Denolly.Brooksby’s fellow American Colton Smith also advanced to the last eight. Smith, competing in just his second tour-level event, defeated Ethan Quinn 6-3, 6-4. Having advanced through qualifying, Smith has not dropped serve across four matches. The 22-year-old has saved all six break points he has faced, according to Infosys ATP Stats.A standout senior at the University of Arizona, Smith is up to No. 165 in the PIF ATP Live Rankings. [NEWSLETTER FORM]",
    "author": "",
    "published": "Wed, 02 Apr 2025 22:41:00 Z",
    "image": "",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Houston",
      "Match Report",
      "Jenson Brooksby",
      "2025"
    ]
  },
  {
    "id": "003fa648-ba87-47fd-b93d-a2a5c4e22192",
    "title": "Muller, former champ Carballes Baena advance to Marrakech QFs",
    "link": "https://www.atptour.com/en/news/muller-dellien-marrakech-2025-wednesday",
    "description": "Alexandre Muller’s 2025 surge shows little sign of stopping at the Grand Prix Hassan II. The third-seeded Frenchman on Wednesday overcame Hugo Dellien 6-7(5), 6-1, 6-4 in Marrakech to reach his third ATP Tour quarter-final of the season. Muller, who is competing this week at a career-high No. 41 in the PIF ATP Rankings, converted five of 13 break points he earned during his two-hour, 26-minute win, according to Infosys ATP Stats. “It was a little bit difficult to play today, it was really windy,” said Muller in his on-court interview. “I just tried to focus and to really want to win the match. That was the key today, so I’m happy to get the win. I think between the first half and the second half, I really focused on myself and did not focus on the conditions and everything. In the first set I was focused too much on it. By the end, I think I was playing quite well.” The 28-year-old Muller began 2025 by lifting his maiden ATP Tour trophy in Hong Kong, while in February he reached the biggest championship match of his career in Rio de Janeiro. Now 11-6 for the season, he will take on Kamil Majchrzak in the Marrakech quarter-finals. The Polish qualifier later defeated Jesper de Jong 7-6(3), 6-1. Also on Wednesday, the 2023 champion and 2024 finalist Roberto Carballes Baena improved on his stellar recent record in Marrakech by powering to a 6-4, 6-4 triumph against Otto Virtanen. The Spaniard earned two break of serve in each set to prevail in his maiden Lexus ATP Head2Head clash with Virtanen. He will meet Portugal's Nuno Borges in the quarter-finals. RCB 🤝 MarrakechThe Spaniard defeats Virtanen 4⃣ and 4⃣ to reach his 5th QFs in Morocco! #GrandPrixHasanII | @Robertocarba93 pic.twitter.com/5g9xvU3Bnm— ATP Tour (@atptour) April 2, 2025 The fourth seed Borges played a flawless deciding-set tie-break to overcome Belgian Raphael Collignon 6-2, 3-6, 7-6(0). The 28-year-old has won seven consecutive final-set tie-breaks at Tour level, dating back to May 2023. “I played an unbelievable tie-break, I think it was the best tie-break I’ve ever played,” Borges said, cracking a large smile. In first-round action, Luciano Darderi and Vit Kopriva kick-started their respective Marrakech campaigns. Seventh seed Darderi downed Tristan Boyer 6-4, 6-4 to set a meeting with Hugo Gaston, while Kopriva defeated Borna Gojo 2-6, 6-2, 6-4 to advance to face second seed Lorenzo Sonego. [NEWSLETTER FORM]",
    "author": "",
    "published": "Wed, 02 Apr 2025 18:39:00 Z",
    "image": "/-/media/2024-images/news/2025/01/07/03/30/it-all-adds-up-banner.jpg?w=100%25\u0026hash=B020DA612BE0D0A67145854EF774A25A",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Marrakech",
      "Match Report",
      "2025",
      "Alexandre Muller"
    ]
  },
  {
    "id": "46fa0c6f-7a61-49f3-8162-e24b61ea447a",
    "title": "Raducanu withdraws from GB squad to 'look after body'",
    "link": "https://www.bbc.com/sport/tennis/articles/cj45v29j92jo",
    "description": "Emma Raducanu withdraws from the Great Britain squad for next week's Billie Jean King Cup tie in the Netherlands to \"look after her body\".",
    "author": "",
    "published": "Wed, 02 Apr 2025 17:36:30 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "28c3d59f-c002-4767-9575-cd3da9ce89cb",
    "title": "Britain's Jones says heart 'worked a little too hard' after on-court collapse",
    "link": "https://www.bbc.com/sport/tennis/articles/c1lmg50vz1mo",
    "description": "Britain's Fran Jones says her heart \"worked a little too hard\" after she collapsed during a match in Colombia.",
    "author": "",
    "published": "Wed, 02 Apr 2025 15:58:41 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "3e602117-2835-4dd0-9131-71682171143d",
    "title": "Mensiks Downs Djokovic in Miami for Maiden Masters 1000 Title",
    "link": "https://www.perfect-tennis.com/miami-open-2025-day-12-final-recap/",
    "description": "Jakub Mensik is the 2025 Miami Open champion, overcoming a nearly six-hour rain delay and a history-chasing Novak Djokovic to win his first ATP Tour title with a 7-6(4), 7-6(4) upset over the six-time champion. At 19 years and six months, Mensik became the second-youngest titlist in Miami history behind Carlos Alcaraz (2022), and the …",
    "author": "Jonathan",
    "published": "Mon, 31 Mar 2025 07:35:15 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "ATP Masters 1000",
      "Miami Open",
      "Tennis News"
    ]
  },
  {
    "id": "8178b1d1-1ab2-4a0e-b838-afa37de1e320",
    "title": "Miami Open 2025 Day 10 Semi Final Recap",
    "link": "https://www.perfect-tennis.com/miami-open-2025-day-10-recap/",
    "description": "Day 10 at the 2025 Miami Open delivered two semi-finals at opposite ends of the age spectrum. 19-year-old Jakub Mensik thundered 25 aces to upset Taylor Fritz 7-6(4), 4-6, 7-6(4), while 37-year-old Novak Djokovic dispatched Grigor Dimitrov 6-2, 6-3 with a serving clinic, landing a career-high 87% of his first serves. Mensik, the third-lowest-ranked finalist …",
    "author": "Jonathan",
    "published": "Sat, 29 Mar 2025 09:13:58 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "ATP Masters 1000",
      "Miami Open",
      "Tennis News"
    ]
  }
]
