[
  {
    "id": "24daed06-de98-4a92-828a-178020ad5807",
    "title": "Unflappable to unstoppable? Pegula ready for WTA Finals challenge",
    "link": "https://www.espn.com/tennis/story/_/id/42093722/jessica-pegula-wta-finals-riyadh-aryna-sabalenka",
    "description": "After a roller-coaster season of injuries, coaching changes and a finals appearance at the US Open, Jessica Pegula has big goals for the WTA Finals.",
    "author": "D'Arcy Maine",
    "published": "Fri, 1 Nov 2024 09:52:53 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "5020b955-fc2e-4d2a-ae26-9de5f0132a59",
    "title": "The week in tennis: Zheng Qinwen and Jack Draper are on a roll",
    "link": "https://www.espn.com/tennis/story/_/id/42056015/zheng-qinwen-jack-draper-ben-shelton-maria-sharapova-hall-fame",
    "description": "The season is winding down, but Zheng Qinwen and Jack Draper are only getting better, while Maria Sharapova and the Bryan brothers enter the Hall of Fame.",
    "author": "D'Arcy Maine",
    "published": "Tue, 29 Oct 2024 13:06:29 EST",
    "image": "",
    "source": "https://www.espn.com/espn/rss/tennis/news",
    "categories": null
  },
  {
    "id": "2074c1f3-832a-44fb-9342-fc6cf7bb1bf8",
    "title": "13 Ways to DESTROY Your Tennis Competition (Legally) - Essential Tennis Podcast #413",
    "link": "https://essentialtennis.podbean.com/e/13-ways-to-destroy-your-tennis-competition-legally-essential-tennis-podcast-413/",
    "description": "If you love tennis and want to perform your best in competition so you can win many more matches than ever before, then this special episode of the Essential Tennis Podcast is exactly for you. You're about to learn the top 13 ways that you can instantly improve your competitive results through highly practical and actionable tips and tricks related to strategy, mindset, technique, and the mental game. Let’s start winning more tennis matches NOW!",
    "author": "Essential Tennis LLC",
    "published": "Wed, 30 Oct 2024 17:29:22 -0500",
    "image": "https://mcdn.podbean.com/mf/web/xmeyjt9w3h4s88z6/Podcast413.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "a32beef8-3392-4841-8ebe-37d00ea7b4ca",
    "title": "The Best Tennis Players Do These 3 Things - Essential Tennis Podcast #412",
    "link": "https://essentialtennis.podbean.com/e/the-best-tennis-players-do-these-3-things-essential-tennis-podcast-412/",
    "description": "If you want to be a great tennis player then you MUST do the three things revealed in this special episode of the Essential Tennis Podcast, PERIOD. The best players on your local courts do them and the weakest ones don’t, so don’t miss any of these insights because they’ll level up your game fast.",
    "author": "Essential Tennis LLC",
    "published": "Fri, 30 Aug 2024 22:53:48 -0500",
    "image": "https://mcdn.podbean.com/mf/web/enxkcvxwg2zukxa9/Podcast412.mp3",
    "source": "https://feed.podbean.com/essentialtennis/feed.xml",
    "categories": null
  },
  {
    "id": "be6ecdec-af19-4e22-8264-21c423b59ed6",
    "title": "Gasquet wins on final Metz appearance: 'It's where it all started'",
    "link": "https://www.atptour.com/en/news/gasquet-norrie-metz-2024-monday",
    "description": "It felt as if it was a full-circle moment for Richard Gasquet on Monday at the Moselle Open. The 38-year-old, who made the first of his 33 ATP Tour finals in Metz, secured a thrilling opening-round comeback against Thiago Monteiro to stay alive in his final campaign at the tournament. Gasquet saved a match point to prevail 4-6, 6-4, 7-6(6) and record his first tour-level win since May. “It’s important for me to play here, it’s the last time I’m playing in Metz, so I want to do well,” said Gasquet, who is retiring at the conclusion of Roland Garros 2025. “It’s a big honour for me [to receive a wild card]. “I am really happy with the way I played, the way I felt, so it’s a big win for me. Everything started here [in Metz]. It’s where I reached my first ATP Tour final. I have great memories playing here, so I am really happy with the way I played today.” Resilience personified 👏@richardgasquet1 completes a miraculous comeback, saving a MP, moving past Monteiro in a three-set thriller 4-6 6-4 7-6(6)! @MoselleOpen | #MoselleOpen pic.twitter.com/tMVDRarI7l — ATP Tour (@atptour) November 4, 2024 Gasquet, the former No. 7 in the PIF ATP Rankings, produced a clinical performance on serve throughout the match. The wild card, however, was particularly dialled in during the final set, during which he won 19 out of 20 points behind his first delivery, according to Infosys ATP Stats. After improving to 16-10 in Metz, Gasquet will face #NextGenATP star Alex Michelsen in the second round. Elsewhere, Cameron Norrie battled from the brink of defeat to record his first tour-level win since July. The 29-year-old trailed a break in the deciding set, but dug deep for a 3-6, 6-4, 6-3 win over Roberto Carballes Baena. “I was happy with the way I turned it around, it’s nice to get a win after my injury,” said Norrie who picked up a forearm injury that kept him out of the Olympics and the North American hard-court swing. “He fought really hard today, he’s a great competitor. I managed to get a little bit lucky in the third set, and I had some good support. It was nice to get over the line in the end.” Norrie, who is just the second British singles player in Metz tournament history (Andy Murray, 2007 \u0026 2021), will next face third seed Grigor Dimitrov. [ATP APP] On a day of French success, lucky loser Pierre-Hugues Herbert stood firm to defeat sixth seed Pedro Martinez 6-3, 3-6, 7-6(4). The 33-year-old's triumph in the pair’s maiden Lexus ATP Head2Head series was his first tour-level win since reaching the semi-finals in Metz as a wild card in 2023. Aiming to emulate that success, Herbert will next battle countryman Quentin Halys in the second round. Seventh seed Jan-Lennard Struff got his campaign underway with an inspired comeback triumph against Alexander Shevchenko. The German trailed by a set and 3-0, but dug deep for a 3-6, 6-4, 6-4 win, setting up a second-round clash with Corentin Moutet. [NEWSLETTER FORM]",
    "author": "",
    "published": "Mon, 04 Nov 2024 21:11:00 Z",
    "image": "",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Match Report",
      "Metz",
      "2024",
      "Richard Gasquet",
      "Jan-Lennard Struff",
      "Pierre-Hugues Herbert",
      "Cameron Norrie"
    ]
  },
  {
    "id": "b82e0973-a64c-41dc-b8fb-a2ec4addc15a",
    "title": "Cilic returns to winning ways in Belgrade, Lajovic triumphs at home",
    "link": "https://www.atptour.com/en/news/cilic-lajovic-shapovalov-belgrade-2024-monday",
    "description": "Marin Cilic returned to winning ways on the ATP Tour on Monday with an opening-round triumph at the Belgrade Open. The 36-year-old saved each of the two break points he faced in a clinical second set, according to Infosys ATP Stats, en route to a 7-6(2), 6-3 victory over Alexandre Muller. It was Cilic's first tour-level win of 2024, outside of his run to the title in Hangzhou in September.  “I felt good, but when you haven’t played for a while it’s [important] to find that intensity,” said Cilic, the former No. 3 in the PIF ATP Rankings. “I needed to find that balance today, and it took me a while to get used to the conditions and the balls. “After 30 minutes, I started to feel great on the court, hitting, moving, serving. From there until the end of the match was fantastic, I felt really nice on the court.” After powering past Muller, the World No. 68, and snapping his four-match losing streak, Cilic will face fourth seed Jiri Lehecka in the second round. [ATP APP] Elsewhere, Dusan Lajovic recorded his first tour-level win since reaching the quarter-finals in Umag in July. The 34-year-old, who has been recovering from an injury sustained at the Davis Cup, surged to a 6-0, 7-6(3) win to upset ninth seed Mariano Navone. “I didn’t expect this kind of first set,” said Lajovic. “I didn’t think I was going to play until the end of the season. I’m not 100% yet, but I’m good enough to compete. I’m getting my groove back so I am happy to win the match.” In the second round of his home tournament, the Serbian will take on Fabian Marozsan, who came from behind to defeat #NextGenATP star Shang Juncheng on Sunday. In a battle of two qualifiers, Denis Shapovalov rallied to move past Marton Fucsovics 6-7(6), 7-5, 6-1. After levelling the pair’s Lexus ATP Head2Head series at 2-2, the former World No. 10 has set up a second-round clash against fifth seed Nuno Borges. [NEWSLETTER FORM]",
    "author": "",
    "published": "Mon, 04 Nov 2024 18:05:00 Z",
    "image": "",
    "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
    "categories": [
      "Match Report",
      "Belgrade",
      "2024",
      "Marin Cilic",
      "Dusan Lajovic",
      "Denis Shapovalov"
    ]
  },
  {
    "id": "255c747b-8d4f-4b19-a5e4-85daf558e570",
    "title": "Sabalenka into WTA Finals last four but Rybakina out",
    "link": "https://www.bbc.com/sport/tennis/articles/ce8y2v6p9qpo",
    "description": "Aryna Sabalenka is the first player to secure a semi-final spot at the WTA Finals but her victory over Jasmine Paolini spells the end of the road for Elena Rybakina.",
    "author": "",
    "published": "Mon, 04 Nov 2024 19:42:50 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "c91ec92d-0a74-42aa-a3b2-7d49bd81fab0",
    "title": "Norrie secures first ATP Tour win since July",
    "link": "https://www.bbc.com/sport/tennis/articles/c789716w27xo",
    "description": "Cameron Norrie secures his first win on the ATP Tour since July with victory over Roberto Carballes Baena at the Moselle Open.",
    "author": "",
    "published": "Mon, 04 Nov 2024 22:41:07 GMT",
    "image": "",
    "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
    "categories": null
  },
  {
    "id": "33f0a167-7c6c-4cef-b75b-cbc827247271",
    "title": "Wilson RF 01 Playtest and Review",
    "link": "https://www.perfect-tennis.com/wilson-rf-01-review/",
    "description": "In this review, I explore the RF 01, a racket designed by Roger Federer to bring elements of his game to a broader audience. Wilson says it’s the line of rackets Federer would have used if he had successfully recovered from knee surgery in 2021. Sadly, we all know that never happened, so we can’t …",
    "author": "Martina",
    "published": "Mon, 04 Nov 2024 15:44:29 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "Reviews",
      "Tennis Rackets"
    ]
  },
  {
    "id": "e20d9d9a-7024-45e9-a62d-d66d52a57afb",
    "title": "Zverev Humbles Humbert with Paris Masters Victory",
    "link": "https://www.perfect-tennis.com/zverev-humbles-humbert-with-paris-masters-victory/",
    "description": "Alexander Zverev silenced the French crowd on Sunday, producing a clinical performance to defeat Ugo Humbert 6-2 6-2. Humbert was bidding to become the first homegrown Paris Masters winner since Jo-Wilfried Tsonga in 2008, but he never got close. Even though he likes to fist pump after winning the most trivial of points, he struggled …",
    "author": "Jonathan",
    "published": "Sun, 03 Nov 2024 16:23:14 +0000",
    "image": "",
    "source": "https://www.perfect-tennis.com/feed/",
    "categories": [
      "ATP Masters 1000",
      "Paris Masters",
      "Tennis News"
    ]
  }
]
