{
  "id": "0216b7cf-545c-4544-a3ac-7ea465f33f96",
  "title": "Nvidia’s $3 Trillion Rally Is On Edge, Wall Street Is Unfazed",
  "link": "https://finance.yahoo.com/news/nvidia-3-trillion-rally-edge-143823963.html",
  "description": "",
  "author": "",
  "published": "2025-01-15T14:38:23Z",
  "source": "https://finance.yahoo.com/news/rssindex",
  "categories": null,
  "byline": "Jeran Wittenstein",
  "length": 2602,
  "excerpt": "(Bloomberg) -- Nvidia Corp.’s $3 trillion run-up in market value in the two years since ChatGPT helped trigger an AI frenzy is bigger than any stock rally in...",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "(Bloomberg) -- Nvidia Corp.’s $3 trillion run-up in market value in the two years since ChatGPT helped trigger an AI frenzy is bigger than any stock rally in history in such a short time span. But the landscape is now changing for the chipmaker. Most Read from Bloomberg These Homes Withstood the LA Fires. Architects Explain Why NYC Commuters Get New Way to Dodge Traffic: $95 Helicopter Rides Chicago Agency Pitches $1.5 Billion Plan to Fix Transit Woes Will Americans Ever Lose Their Taste for Telework? Churches, Cinemas — and Moon Artifacts — Top List of Endangered Monuments Competitors and customers are stepping up efforts to take a bigger slice of the artificial intelligence chip market. The sector’s blistering revenue growth is slowing. The Biden White House is looking to limit the sale of Nvidia’s most-advanced chips abroad, although it’s unclear how President-elect Donald Trump’s incoming administration will handle that. Sounds scary? None of these risks are deterring investors from betting that Nvidia’s rally could add hundreds of billions of dollars more in market value in 2025 as the deluge of spending on AI computing keeps gaining steam. “I’m not concerned we’ve seen a peak in Nvidia,” said Kevin Mahn, chief investment officer at Hennion \u0026 Walsh Asset Management. “There’s more growth to be had, although we should also see more volatility. The AI revolution is going to be a long road with a lot of potholes.” That turbulence has been on display recently, with Nvidia shares slumping after a presentation by Chief Executive Officer Jensen Huang fell short of investors’ high expectations. The stock dropped for five-straight sessions, shedding 12% since hitting a record on Jan. 6, as of its Tuesday close. It rose 1.7% on Wednesday. Investors say these kinds of swings come with the territory. “Nvidia’s stock is always going to be way more volatile than the market,” said Joanne Feeney, portfolio manager and partner at Advisors Capital Management, which raised its price target on the shares earlier this week. “We see it as having multiple years of well-above average growth in earnings, and we do see that as explaining and sustaining the valuation.” Nvidia shares are projected to rise about 30% over the coming year, according to the average of analyst price targets compiled by Bloomberg. That would give the chipmaker a market value of more than $4 trillion, potentially dwarfing its closest peers Apple Inc. and Microsoft Corp. Its revenue is expected to hit $129 billion in its current fiscal year, which ends Jan. 30, up from $27 billion two years ago.",
  "image": "https://s.yimg.com/ny/api/res/1.2/viZ0179UO8plulR6W26HYg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MTA7Y2Y9d2VicA--/https://media.zenfs.com/en/bloomberg_technology_68/e6b4eae24243a0f7bf3d6d3515095322",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e    \u003cp\u003e(Bloomberg) -- Nvidia Corp.’s $3 trillion run-up in market value in the two years since ChatGPT helped trigger an AI frenzy is bigger than any stock rally in history in such a short time span. But the landscape is now changing for the chipmaker.\u003c/p\u003e \u003cp\u003eMost Read from Bloomberg\u003c/p\u003e \u003cul\u003e\u003cli\u003e \u003cp\u003e\u003ca href=\"https://www.bloomberg.com/news/articles/2025-01-13/los-angeles-wildfires-why-these-homes-didn-t-burn?utm_campaign=bn\u0026amp;utm_medium=distro\u0026amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:These Homes Withstood the LA Fires. Architects Explain Why;elm:context_link;itc:0;sec:content-canvas\"\u003eThese Homes Withstood the LA Fires. Architects Explain Why\u003c/a\u003e\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003e\u003ca href=\"https://www.bloomberg.com/news/articles/2025-01-16/nyc-commuters-get-new-way-to-dodge-traffic-95-helicopter-rides?utm_campaign=bn\u0026amp;utm_medium=distro\u0026amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:NYC Commuters Get New Way to Dodge Traffic: $95 Helicopter Rides;elm:context_link;itc:0;sec:content-canvas\"\u003eNYC Commuters Get New Way to Dodge Traffic: $95 Helicopter Rides\u003c/a\u003e\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003e\u003ca href=\"https://www.bloomberg.com/news/articles/2025-01-15/chicago-officials-pitch-1-5-billion-plan-to-fix-transit-woes?utm_campaign=bn\u0026amp;utm_medium=distro\u0026amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Chicago Agency Pitches $1.5 Billion Plan to Fix Transit Woes;elm:context_link;itc:0;sec:content-canvas\"\u003eChicago Agency Pitches $1.5 Billion Plan to Fix Transit Woes\u003c/a\u003e\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003e\u003ca href=\"https://www.bloomberg.com/news/articles/2025-01-16/as-remote-work-lingers-in-us-the-future-of-commuting-is-murky?utm_campaign=bn\u0026amp;utm_medium=distro\u0026amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Will Americans Ever Lose Their Taste for Telework?;elm:context_link;itc:0;sec:content-canvas\"\u003eWill Americans Ever Lose Their Taste for Telework?\u003c/a\u003e\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003e\u003ca href=\"https://www.bloomberg.com/news/features/2025-01-15/world-s-endangered-monuments-sorbonne-chapel-kyiv-teacher-s-house-the-moon?utm_campaign=bn\u0026amp;utm_medium=distro\u0026amp;utm_source=yahooUS\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Churches, Cinemas — and Moon Artifacts — Top List of Endangered Monuments;elm:context_link;itc:0;sec:content-canvas\"\u003eChurches, Cinemas — and Moon Artifacts — Top List of Endangered Monuments\u003c/a\u003e\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e  \u003cp\u003eCompetitors and customers are stepping up efforts to take a bigger slice of the artificial intelligence chip market. The sector’s blistering revenue growth is slowing. The Biden White House is looking to limit the sale of Nvidia’s most-advanced chips abroad, although it’s unclear how President-elect Donald Trump’s incoming administration will handle that.\u003c/p\u003e \u003cp\u003eSounds scary? None of these risks are deterring investors from betting that Nvidia’s rally could add hundreds of billions of dollars more in market value in 2025 as the deluge of spending on AI computing keeps gaining steam.\u003c/p\u003e \u003cp\u003e“I’m not concerned we’ve seen a peak in Nvidia,” said Kevin Mahn, chief investment officer at Hennion \u0026amp; Walsh Asset Management. “There’s more growth to be had, although we should also see more volatility. The AI revolution is going to be a long road with a lot of potholes.”\u003c/p\u003e \u003cp\u003eThat turbulence has been on display recently, with Nvidia shares slumping after a presentation by Chief Executive Officer Jensen Huang fell short of investors’ high expectations. The stock dropped for five-straight sessions, shedding 12% since hitting a record on Jan. 6, as of its Tuesday close. It rose 1.7% on Wednesday.\u003c/p\u003e  \u003cp\u003eInvestors say these kinds of swings come with the territory.\u003c/p\u003e \u003cp\u003e“Nvidia’s stock is always going to be way more volatile than the market,” said Joanne Feeney, portfolio manager and partner at Advisors Capital Management, which raised its price target on the shares earlier this week. “We see it as having multiple years of well-above average growth in earnings, and we do see that as explaining and sustaining the valuation.”\u003c/p\u003e \u003cp\u003eNvidia shares are projected to rise about 30% over the coming year, according to the average of analyst price targets compiled by Bloomberg. That would give the chipmaker a market value of more than $4 trillion, potentially dwarfing its closest peers Apple Inc. and Microsoft Corp. Its revenue is expected to hit $129 billion in its current fiscal year, which ends Jan. 30, up from $27 billion two years ago.\u003c/p\u003e        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-15T14:38:23Z",
  "modifiedTime": null
}
