{
  "id": "02cae475-8c61-4173-8f16-75a688b581ed",
  "title": "Resources connection sees Q4 revenue at $132M-$137M amid focus on operational efficiency and global growth",
  "link": "https://seekingalpha.com/news/4428262-resources-connection-sees-q4-revenue-at-132m-137m-amid-focus-on-operational-efficiency-and?utm_source=feed_news_all\u0026utm_medium=referral\u0026feed_item_type=news",
  "description": "",
  "author": "",
  "published": "Wed, 02 Apr 2025 20:55:50 -0400",
  "source": "https://seekingalpha.com/market_currents.xml",
  "categories": [
    "rgp"
  ],
  "byline": "SA Transcript Insights Editor",
  "length": 1096,
  "excerpt": "Earnings Call Insights: Learn how Resources Connection, Inc. (RGP) achieved Q3 2025 revenue of $129.4M while navigating macro uncertainties.",
  "siteName": "Seeking Alpha",
  "favicon": "https://seekingalpha.com/samw/static/images/favicon-192x192.png",
  "text": "Earnings Call Insights: Resources Connection, Inc. (RGP) Q3 2025 Management View CEO Kate Duchene highlighted the company achieved Q3 revenue of $129.4 million, aligning with expectations despite macroeconomic uncertainties, client budget constraints, and slower project ramp-ups. Gross margin and SG\u0026A expenses were favorable compared toSeeking Alpha's Disclaimer: The earnings call insights are compilations of earnings call transcripts and other content available on the Seeking Alpha website. The insights are generated by an AI tool and have not been curated or reviewed by editors. Due to inherent limitations in using AI-based tools, the accuracy, completeness, or timeliness of the earnings call insights cannot be guaranteed. Please see full earnings call transcripts here. The earnings call insights are intended for informational purposes only. Seeking Alpha does not take account of your objectives or your financial situation and does not offer any personalized investment advice. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank.",
  "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-test-id=\"card-container\"\u003e\u003cheader\u003e\u003c/header\u003e\u003cdiv data-test-id=\"content-container\"\u003e\u003cp\u003eEarnings Call Insights: Resources Connection, Inc. (RGP) Q3 2025\u003c/p\u003e \u003ch3\u003eManagement View\u003c/h3\u003e \u003cul\u003e\u003cli\u003e\u003cp\u003eCEO Kate Duchene highlighted the company achieved Q3 revenue of $129.4 million, aligning with expectations despite macroeconomic uncertainties, client budget constraints, and slower project ramp-ups. Gross margin and SG\u0026amp;A expenses were favorable compared to\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cstrong\u003eSeeking Alpha\u0026#39;s Disclaimer: \u003c/strong\u003eThe earnings call insights are compilations of earnings call transcripts and other content available on the Seeking Alpha website. The insights are generated by an AI tool and have not been curated or reviewed by editors. Due to inherent limitations in using AI-based tools, the accuracy, completeness, or timeliness of the earnings call insights cannot be guaranteed. Please see full earnings call transcripts \u003ca href=\"https://seekingalpha.com/symbol/RGP/earnings/transcripts\"\u003ehere\u003c/a\u003e. The earnings call insights are intended for informational purposes only. Seeking Alpha does not take account of your objectives or your financial situation and does not offer any personalized investment advice. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-04-03T00:55:50Z",
  "modifiedTime": null
}
