{
  "id": "0a6a1e72-9e25-4afd-bb29-2a117b0341c4",
  "title": "Elon Musk unveils Tesla’s Cybercab—no steering wheel, no pedals, $30K price tag",
  "link": "https://fortune.com/2024/10/10/elon-musk-cybertruck-robotaxi-robovan-optimus-robot/",
  "description": "Musk also revealed the Optimus robot, which can babysit and bartend.",
  "author": "Brooke Seipel",
  "published": "Fri, 11 Oct 2024 03:56:03 +0000",
  "source": "https://fortune.com/feed",
  "categories": [
    "Tech"
  ],
  "byline": "Brooke Seipel",
  "length": 4129,
  "excerpt": "Musk promised the car would go for $30,000.",
  "siteName": "Fortune",
  "favicon": "",
  "text": "Tesla CEO Elon Musk unveiled his new robo-taxi Thursday, and, in true Tesla fashion, the much-anticipated autonomous vehicle rolled in nearly an hour late—right on schedule for a product that’s been delayed time and time again. But fans didn’t mind, as Musk delivered not just the long-awaited vehicle but also an AI robot named Optimus that can bartend for you and a driverless robo-van that can shuttle sports teams to games. The robo-taxi debuted at Tesla’s “We, Robot” event Thursday, held at Warner Bros. Discovery’s movie studio in Burbank, California, and was also live-streamed on X. The event, which was scheduled to start at 7 p.m. Pacific time, didn’t begin until 7:53 p.m. The delay sparked speculation and jokes online, but Musk said the hold-up was caused by a medical emergency in the crowd. — Sawyer Merritt (@SawyerMerritt) October 11, 2024 Musk rolled up in the new Cybercab model, with an astronaut ushering him into the vehicle and aerial footage capturing his autonomous trip through the movie studio backlot and to the event stage. “There are no steering wheels or pedals in the car. So I hope this goes well, we’ll find out,” Musk said chuckling on stage after exiting the vehicle to begin his presentation. Musk has been teasing autonomous capabilities in Tesla vehicles for years, making one of his most dramatic promises in 2019, when he said the company was preparing an entire fleet of ride-sharing vehicles and predicted there would be “over a million robo-taxis on the road” by 2020. That didn’t happen. Then, in April of this year, Musk announced on X that the Tesla Robotaxi would finally be revealed on August 8. That was pushed back, due to “an important design change.” On Thursday, Tesla fans finally got what they have been waiting for, with the crowd cheering as Musk unveiled 20 cars and vowed owners could make money using their Cybercab as a rideshare vehicle when they’re not driving. “So the vast majority of the time, cars are just doing nothing. But if they’re autonomous they can be used, I don’t know five times more, maybe ten times more,” Musk told the crowd. “So, the same car would have five times as much value, maybe ten times as much value. “And you’ll be able to buy one,” he added. “We expect the cost to be under $30,000.” So, when will it hit the market? Musk threw out the date “before 2027,” noting: “I tend to be a little optimistic with time frames.” Musk also unveiled the new Tesla Robovan, which can seat up to 20 people, though no production date or price were mentioned for the product. Robovan seats 20 \u0026 can be adapted to commercial or personal use – school bus, RV, cargo pic.twitter.com/CtjEfcaoHI— Tesla (@Tesla) October 11, 2024 Finally, Musk revealed Optimus, a human-sized AI robot that “can babysit your kids” or help around the house. At the Thursday debut, the robots were seen wearing cowboy hats, serving drinks at the bar, dancing in sync on a stage and playing rock-paper-scissors with spectators. “Please be nice to the Optimus robots,” Musk said, “they’ll walk among you.” When Musk wrapped his presentation, guests were able to explore the new vehicle models and interact with Optimus robots. And the autonomous vehicles did a sort of fashion show, driving themselves down the street and past the crowds. Optimus playing rock paper scissors! pic.twitter.com/621DtAptdY— Nic Cruz Patane (@niccruzpatane) October 11, 2024 Now it’s a waiting game for the tech to officially become available. In the meantime, drivers can use Tesla’s Full Self Driving feature, the assisted-driving service that still requires a human driver to supervise at all times. Tesla has promised to launch the feature in China and Europe early next year, pending regulatory approvals. Musk’s vision of a driverless future may still be a ways off. But if there’s one thing Tesla fans have learned, it’s to expect the unexpected—and to bring snacks to wait for potential delays.Recommended newsletter Data Sheet: Stay on top of the business of tech with thoughtful analysis on the industry's biggest names. Sign up here.",
  "image": "https://fortune.com/img-assets/wp-content/uploads/2024/10/Screen-Shot-2024-10-10-at-8.02.53-PM.png?resize=1200,600",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003ca href=\"https://fortune.com/company/tesla/\" target=\"_blank\" aria-label=\"Go to https://fortune.com/company/tesla/\"\u003eTesla\u003c/a\u003e CEO Elon Musk unveiled his new robo-taxi Thursday, and, in true Tesla fashion, the much-anticipated autonomous vehicle rolled in nearly an hour late—right on schedule for a product that’s been delayed time and time again. But fans didn’t mind, as Musk delivered not just the long-awaited vehicle but also an AI robot named Optimus that can bartend for you and a driverless robo-van that can shuttle sports teams to games.\u003c/p\u003e\u003cdiv\u003e\n\n\n\n\u003cp\u003eThe robo-taxi debuted at Tesla’s “We, Robot” event Thursday, held at Warner Bros. Discovery’s movie studio in Burbank, California, and was also live-streamed on \u003ca href=\"https://fortune.com/company/twitter/\" target=\"_blank\" aria-label=\"Go to https://fortune.com/company/twitter/\"\u003eX\u003c/a\u003e. The event, which was scheduled to start at 7 p.m. Pacific time, didn’t begin until 7:53 p.m. The delay sparked \u003ca href=\"https://x.com/anshelsag/status/1844570554663350403\" target=\"_blank\" aria-label=\"Go to https://x.com/anshelsag/status/1844570554663350403\" rel=\"noopener\"\u003especulation\u003c/a\u003e and \u003ca href=\"https://x.com/Glitcheddd/status/1844565063086026840\" target=\"_blank\" aria-label=\"Go to https://x.com/Glitcheddd/status/1844565063086026840\" rel=\"noopener\"\u003ejokes\u003c/a\u003e \u003ca href=\"https://x.com/willabeans/status/1844566065453617385\" target=\"_blank\" aria-label=\"Go to https://x.com/willabeans/status/1844566065453617385\" rel=\"noopener\"\u003eonline\u003c/a\u003e, but Musk said the hold-up was caused by \u003ca href=\"https://x.com/elonmusk/status/1844564353330315460\" target=\"_blank\" aria-label=\"Go to https://x.com/elonmusk/status/1844564353330315460\" rel=\"noopener\"\u003ea medical emergency\u003c/a\u003e in the crowd.\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e— Sawyer Merritt (@SawyerMerritt) \u003ca href=\"https://twitter.com/SawyerMerritt/status/1844573243161837648?ref_src=twsrc%5Etfw\" target=\"_blank\" aria-label=\"Go to https://twitter.com/SawyerMerritt/status/1844573243161837648?ref_src=twsrc%5Etfw\" rel=\"noopener\"\u003eOctober 11, 2024\u003c/a\u003e\u003c/blockquote\u003e \n\n\n\n\u003cp\u003eMusk rolled up in the new Cybercab model, with an astronaut ushering him into the vehicle and aerial footage capturing his autonomous trip through the movie studio backlot and to the event stage.\u003c/p\u003e\n\n\n\n\u003cp\u003e“There are no steering wheels or pedals in the car. So I hope this goes well, we’ll find out,” Musk said chuckling on stage after exiting the vehicle to begin his presentation.\u003c/p\u003e\n\n\n\n\u003cp\u003eMusk has been teasing autonomous capabilities in Tesla vehicles for years, making one of his most dramatic promises in \u003ca href=\"https://techcrunch.com/2019/04/22/tesla-plans-to-launch-a-robotaxi-network-in-2020/\" target=\"_blank\" aria-label=\"Go to https://techcrunch.com/2019/04/22/tesla-plans-to-launch-a-robotaxi-network-in-2020/\" rel=\"noopener\"\u003e2019\u003c/a\u003e, when he said the company was preparing an entire fleet of ride-sharing vehicles and predicted there would be “over a million robo-taxis on the road” by 2020. That didn’t happen. Then, in April of this year, Musk announced on X that the Tesla Robotaxi would finally be revealed on August 8. That was \u003ca href=\"https://www.notateslaapp.com/news/2126/teslas-upcoming-robotaxi-event-in-august-delayed-according-to-bloomberg\" target=\"_blank\" aria-label=\"Go to https://www.notateslaapp.com/news/2126/teslas-upcoming-robotaxi-event-in-august-delayed-according-to-bloomberg\" rel=\"noopener\"\u003epushed back\u003c/a\u003e, due to “an important design change.”\u003c/p\u003e\n\n\n\n\u003cp\u003eOn Thursday, Tesla fans finally got what they have been waiting for, with the crowd cheering as Musk unveiled 20 cars and vowed owners could make money using their Cybercab as a rideshare vehicle when they’re not driving.\u003c/p\u003e\n\n\n\n\u003cp\u003e“So the vast majority of the time, cars are just doing nothing. But if they’re autonomous they can be used, I don’t know five times more, maybe ten times more,” Musk told the crowd. “So, the same car would have five times as much value, maybe ten times as much value.\u003c/p\u003e\n\n\n\n\u003cp\u003e“And you’ll be able to buy one,” he added. “We expect the cost to be under $30,000.”\u003c/p\u003e\n\n\n\n\u003cp\u003eSo, when will it hit the market? Musk threw out the date “before 2027,” noting: “I tend to be a little optimistic with time frames.”\u003c/p\u003e\n\n\n\n\u003cp\u003eMusk also unveiled the new Tesla Robovan, which can seat up to 20 people, though no production date or price were mentioned for the product. \u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\u003cp lang=\"en\" dir=\"ltr\"\u003eRobovan seats 20 \u0026amp; can be adapted to commercial or personal use – school bus, RV, cargo \u003ca href=\"https://t.co/CtjEfcaoHI\" target=\"_blank\" aria-label=\"Go to https://t.co/CtjEfcaoHI\" rel=\"noopener\"\u003epic.twitter.com/CtjEfcaoHI\u003c/a\u003e\u003c/p\u003e— Tesla (@Tesla) \u003ca href=\"https://twitter.com/Tesla/status/1844581432515006665?ref_src=twsrc%5Etfw\" target=\"_blank\" aria-label=\"Go to https://twitter.com/Tesla/status/1844581432515006665?ref_src=twsrc%5Etfw\" rel=\"noopener\"\u003eOctober 11, 2024\u003c/a\u003e\u003c/blockquote\u003e \n\n\n\n\u003cp\u003eFinally, Musk revealed Optimus, a human-sized AI robot that “can babysit your kids” or help around the house. At the Thursday debut, the robots were seen wearing cowboy hats, serving drinks at the bar, dancing in sync on a stage and playing rock-paper-scissors with spectators.\u003c/p\u003e\n\n\n\n\u003cp\u003e“Please be nice to the Optimus robots,” Musk said, “they’ll walk among you.”\u003c/p\u003e\n\n\n\n\u003cp\u003eWhen Musk wrapped his presentation, guests were able to explore the new vehicle models and interact with Optimus robots. And the autonomous vehicles did a sort of fashion show, driving themselves down the street and past the crowds.\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\u003cp lang=\"en\" dir=\"ltr\"\u003eOptimus playing rock paper scissors! \u003ca href=\"https://t.co/621DtAptdY\" target=\"_blank\" aria-label=\"Go to https://t.co/621DtAptdY\" rel=\"noopener\"\u003epic.twitter.com/621DtAptdY\u003c/a\u003e\u003c/p\u003e— Nic Cruz Patane (@niccruzpatane) \u003ca href=\"https://twitter.com/niccruzpatane/status/1844578693869600913?ref_src=twsrc%5Etfw\" target=\"_blank\" aria-label=\"Go to https://twitter.com/niccruzpatane/status/1844578693869600913?ref_src=twsrc%5Etfw\" rel=\"noopener\"\u003eOctober 11, 2024\u003c/a\u003e\u003c/blockquote\u003e \n\n\n\n\u003cp\u003eNow it’s a waiting game for the tech to officially become available. In the meantime, drivers can use Tesla’s Full Self Driving feature, the assisted-driving service that still requires a human driver to supervise at all times. Tesla has \u003ca href=\"https://www.bloomberg.com/news/articles/2024-09-05/tesla-plans-to-release-fsd-in-china-europe-early-next-year\" target=\"_blank\" aria-label=\"Go to https://www.bloomberg.com/news/articles/2024-09-05/tesla-plans-to-release-fsd-in-china-europe-early-next-year\" rel=\"noopener\"\u003epromised to launch\u003c/a\u003e the feature in China and Europe early next year, pending regulatory approvals.\u003c/p\u003e\n\n\n\n\u003cp\u003eMusk’s vision of a driverless future may still be a ways off. But if there’s one thing Tesla fans have learned, it’s to expect the unexpected—and to bring snacks to wait for potential delays.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-cy=\"subscriptionPlea\"\u003e\u003cp\u003e\u003cstrong\u003e\u003cu\u003eRecommended newsletter\u003c/u\u003e\u003c/strong\u003e\u003cbr/\u003e\n\u003cstrong\u003eData Sheet:\u003c/strong\u003e Stay on top of the business of tech with thoughtful analysis on the industry\u0026#39;s biggest names.\u003cbr/\u003e\n\u003ca href=\"https://fortune.com/newsletters/data-sheet?\u0026amp;itm_source=fortune\u0026amp;itm_medium=article_tout\u0026amp;itm_campaign=techsection\" target=\"_self\" aria-label=\"Go to https://fortune.com/newsletters/data-sheet?\u0026amp;itm_source=fortune\u0026amp;itm_medium=article_tout\u0026amp;itm_campaign=techsection\"\u003eSign up here.\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
