{
  "id": "28965d7f-bb6d-4799-ba7f-0fb69734767c",
  "title": "Trump chooses Bessent to be treasury secretary, Vought as budget chief, Chavez-DeRemer for Labor",
  "link": "https://fortune.com/2024/11/22/trump-chooses-bessent-to-be-treasury-secretary-vought-as-budget-chief-chavez-deremer-for-labor/",
  "description": "Bessent, 62, is the founder of hedge fund Key Square Capital Management, after having worked on-and-off for Soros Fund Management since 1991. If confirmed by the Senate, he would be the nation’s first openly gay treasury secretary.",
  "author": "Fatima Hussein, Chris Rugaber, The Associated Press",
  "published": "Sat, 23 Nov 2024 00:55:47 +0000",
  "source": "https://fortune.com/feed",
  "categories": [
    "Business"
  ],
  "byline": "Fatima Hussein,Chris Rugaber,The Associated Press",
  "length": 7128,
  "excerpt": "Bessent, 62, is the founder of hedge fund Key Square Capital Management, after having worked on-and-off for Soros Fund Management since 1991. If confirmed by the Senate, he would be the nation’s first openly gay treasury secretary.",
  "siteName": "Fortune",
  "favicon": "",
  "text": "Trump also said he would nominate Russel Vought to lead the Office of Management and Budget, a position Vought held during Trump’s first presidency. Vought was closely involved with Project 2025, a conservative blueprint for Trump’s second term that he tried to distance himself from during the campaign. The announcements Friday evening showed how Trump was fleshing out the financial side of his new administration. Although Bessent is closely aligned with Wall Street and could earn bipartisan support, Vought is known as a Republican hardliner. Trump said Bessent would “help me usher in a new Golden Age for the United States,” while Vought “knows exactly how to dismantle the Deep State and end Weaponized Government.” In a separate announcement, Trump said he had chosen Rep. Lori Chavez-DeRemer, an Oregon Republican, as his labor secretary. “I look forward to working with her to create tremendous opportunity for American Workers,” Trump said in a statement. Bessent, 62, is the founder of hedge fund Key Square Capital Management, after having worked on-and-off for Soros Fund Management since 1991. If confirmed by the Senate, he would be the nation’s first openly gay treasury secretary. He told Bloomberg in August that he decided to join Trump’s campaign in part to attack the mounting U.S. national debt. That would include slashing government programs and other spending. “This election cycle is the last chance for the U.S. to grow our way out of this mountain of debt without becoming a sort of European-style socialist democracy,” he said then. As of Nov. 8, the national debt stands at $35.94 trillion, with both the Trump and Biden administrations having added to it. Trump’s policies added $8.4 trillion to the national debt, while the Biden administration increased the national debt by $4.3 trillion, according to the Committee for a Responsible Federal Budget, a fiscal watchdog. Even as he pushes to lower the national debt by stopping spending, Bessent has backed extending provisions of the Tax Cuts and Jobs Act of 2017, which Trump signed into law in his first year in office. Estimates from various economic analyses of the costs of the various tax cuts range between nearly $6 trillion and $10 trillion over 10 years. Nearly all of the law’s provisions are set to expire at the end of 2025. Before becoming a Trump donor and adviser, Bessent donated to various Democratic causes in the early 2000s, notably Al Gore’s presidential run. He also worked for George Soros, a major supporter of Democrats. Bessent had an influential role in Soros’ London operations, including his famous 1992 bet against the pound, which generated huge profits on “Black Wednesday,” when the pound was de-linked from European currencies. Bessent’s selection wasn’t surprising; he had been among the names floated for the treasury secretary role. At an October Detroit Economic Club event, Trump called Bessent “one of the top analysts on Wall Street.” Bessent told Bloomberg in August that he views tariffs as a “one time price adjustment” and “not inflationary,” and tariffs imposed during a second Trump administration would be directed primarily at China. And he wrote in a Fox News op-ed this week that tariffs are “a useful tool for achieving the president’s foreign policy objectives. Whether it is getting allies to spend more on their own defense, opening foreign markets to U.S. exports, securing cooperation on ending illegal immigration and interdicting fentanyl trafficking, or deterring military aggression, tariffs can play a central role.” Bessent told Fox News earlier this month when asked if tariffs would pay for Trump’s large scale deportation operation that he had been working on a plan for what he called “financial deportations,” explaining he would restrict the flow of remittances to migrants’ home countries. Bessent has also floated ideas for how the Trump administration could put pressure on Federal Reserve Chair Jerome Powell, whose term expires in May 2026. Last month, Bessent suggested Trump could name a replacement chair early, and let that person function as a “shadow” chair, with the goal of essentially sidelining Powell. But after the election, Bessent reportedly backed away from that plan. Powell, for his part, has said he wouldn’t step down if Trump asked him to do so, and added that Trump, as president, doesn’t have the authority to fire him. Trump repeatedly attacked Powell during his first term as president for raising the Fed’s key rate in 2017 and 2018. During the 2024 campaign, he said that as president he should have a “say” in the central bank’s interest rate decisions. Presidents traditionally avoid commenting on the Fed’s policies. Bessent and his husband, former New York City prosecutor John Freeman, married in 2011 and have two children. Vought, 48, was the head of the Office of Management and Budget from mid-2020 to the end of Trump’s first term in 2021, having previously served as the acting director and deputy director. A graduate of Wheaton College and George Washington University Law School, he had a deep knowledge of government finances that has been paired with his own Christian faith. After Trump’s initial term ended, Vought founded the Center for Renewing America, a think tank that describes its mission as renewing “a consensus of America as a nation under God.” The Center for Renewing America released its own 2023 budget proposal entitled “A Commitment to End Work and Weaponized Government.” The proposal envisioned $11.3 trillion worth of spending reductions over 10 years and about $2 trillion in income tax cuts in order to bring the budget into surplus by 2032. “The immediate threat facing the nation is the fact that the people no longer govern the country; instead, the government itself is increasingly weaponized against the people it is meant to serve,” Vought wrote in the introduction. Vought has also previously worked as the executive and budget director for the Republican Study Committee, a caucus for conservative House Republicans. He also worked at Heritage Action, the political group tied to The Heritage Foundation, a conservative think tank. Vought’s proposed budget plan would cut spending on food aid through the Agriculture Department. There would be $3.3 trillion in spending reductions in the Health and Human Services Department in large part through how Medicaid and Medicare funds are distributed. It also contains about $642 billion in cuts to Affordable Care Act. The budgets for the Housing and Urban Development and Education departments would also be cut. Vought’s budget ideas were independent of Trump, who has not entirely spelled out the details of his economic plans, other than to campaign on income tax cuts and tariff hikes. __ Associated Press writer Josh Boak contributed to this report.How many degrees of separation are you from the globe's most powerful business leaders? Explore who made our brand-new list of the 100 Most Powerful People in Business. Plus, learn about the metrics we used to make it.",
  "image": "https://fortune.com/img-assets/wp-content/uploads/2024/11/AP24328022104039-e1732323184273.jpg?resize=1200,600",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\u003cp\u003eTrump also said he would nominate Russel Vought to lead the Office of Management and Budget, a position Vought held during Trump’s first presidency. Vought was closely involved with \u003ca href=\"https://apnews.com/article/project-2025-trump-american-revolution-6e02a297fb91b55de01ba7e86615bb08\" target=\"_blank\" aria-label=\"Go to https://apnews.com/article/project-2025-trump-american-revolution-6e02a297fb91b55de01ba7e86615bb08\" rel=\"noopener\"\u003eProject 2025\u003c/a\u003e, a conservative blueprint for Trump’s second term that he tried to distance himself from during the campaign.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe announcements Friday evening showed how Trump was fleshing out the financial side of his new administration. Although Bessent is closely aligned with Wall Street and could earn bipartisan support, Vought is known as a Republican hardliner.\u003c/p\u003e\n\n\n\n\u003cp\u003eTrump said Bessent would “help me usher in a new Golden Age for the United States,” while Vought “knows exactly how to dismantle the Deep State and end Weaponized Government.”\u003c/p\u003e\n\n\n\n\u003cp\u003eIn a separate announcement, Trump said he had chosen Rep. Lori Chavez-DeRemer, an Oregon Republican, as his labor secretary.\u003c/p\u003e\n\n\n\n\u003cp\u003e“I look forward to working with her to create tremendous opportunity for American Workers,” Trump said in a statement.\u003c/p\u003e\n\n\n\n\u003cp\u003eBessent, 62, is the founder of hedge fund Key Square Capital Management, after having worked on-and-off for Soros Fund Management since 1991. If confirmed by the Senate, he would be the nation’s first openly gay treasury secretary.\u003c/p\u003e\n\n\n\n\u003cp\u003eHe told Bloomberg in August that he decided to join Trump’s campaign in part to attack the mounting U.S. national debt. That would include slashing government programs and other spending.\u003c/p\u003e\n\n\n\n\u003cp\u003e“This election cycle is the last chance for the U.S. to grow our way out of this mountain of debt without becoming a sort of European-style socialist democracy,” he said then.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs of Nov. 8, \u003ca href=\"https://fiscaldata.treasury.gov/americas-finance-guide/national-debt/\" target=\"_blank\" aria-label=\"Go to https://fiscaldata.treasury.gov/americas-finance-guide/national-debt/\" rel=\"noopener\"\u003ethe national debt stands at $35.94 trillion\u003c/a\u003e, with both the Trump and Biden administrations having added to it. Trump’s policies added $8.4 trillion to the national debt, while the Biden administration increased the national debt by $4.3 trillion, according to the Committee for a Responsible Federal Budget, a fiscal watchdog.\u003c/p\u003e\n\n\n\n\u003cp\u003eEven as he pushes to lower the national debt by stopping spending, Bessent has backed extending provisions of the Tax Cuts and Jobs Act of 2017, which Trump signed into law in his first year in office. Estimates from various economic analyses of the costs of the various tax cuts range between nearly $6 trillion and $10 trillion over 10 years. Nearly all of the law’s provisions are set to expire at the end of 2025.\u003c/p\u003e\n\n\n\n\u003cp\u003eBefore becoming a Trump donor and adviser, Bessent donated to various Democratic causes in the early 2000s, notably Al Gore’s presidential run. He also worked for George Soros, a major supporter of Democrats. Bessent had an influential role in Soros’ London operations, including his famous 1992 bet against the pound, which generated huge profits on “Black Wednesday,” when the pound was de-linked from European currencies.\u003c/p\u003e\n\n\n\n\u003cp\u003eBessent’s selection wasn’t surprising; he had been among the names floated for the treasury secretary role. At an \u003ca href=\"https://apnews.com/article/trump-detroit-2382e6f01ea6d236e8a2b755ff150580\" target=\"_blank\" aria-label=\"Go to https://apnews.com/article/trump-detroit-2382e6f01ea6d236e8a2b755ff150580\" rel=\"noopener\"\u003eOctober Detroit Economic Club event,\u003c/a\u003e Trump called Bessent “one of the top analysts on Wall Street.”\u003c/p\u003e\n\n\n\n\u003cp\u003eBessent told Bloomberg in August that he views tariffs as a “one time price adjustment” and “not inflationary,” and tariffs imposed during a second Trump administration would be directed primarily at China. And he wrote in a \u003ca href=\"https://fortune.com/company/fox/\" target=\"_blank\" aria-label=\"Go to https://fortune.com/company/fox/\"\u003eFox\u003c/a\u003e News op-ed this week that tariffs are “a useful tool for achieving the president’s foreign policy objectives. Whether it is getting allies to spend more on their own defense, opening foreign markets to U.S. exports, securing cooperation on ending illegal immigration and interdicting fentanyl trafficking, or deterring military aggression, tariffs can play a central role.”\u003c/p\u003e\n\n\n\n\u003cp\u003eBessent told Fox News earlier this month when asked if tariffs would pay for Trump’s large scale deportation operation that he had been working on a plan for what he called “financial deportations,” explaining he would restrict the flow of remittances to migrants’ home countries.\u003c/p\u003e\n\n\n\n\u003cp\u003eBessent has also floated ideas for how the Trump administration could put pressure on Federal Reserve Chair Jerome Powell, whose term expires in May 2026. Last month, Bessent suggested Trump could name a replacement chair early, and let that person function as a “shadow” chair, with the goal of essentially sidelining Powell.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut after the election, Bessent reportedly backed away from that plan. Powell, for his part, \u003ca href=\"https://apnews.com/video/jerome-powell-federal-reserve-system-donald-trump-donald-trump-es-economy-e39ac78af6314c77a6a80e71b5212919\" target=\"_blank\" aria-label=\"Go to https://apnews.com/video/jerome-powell-federal-reserve-system-donald-trump-donald-trump-es-economy-e39ac78af6314c77a6a80e71b5212919\" rel=\"noopener\"\u003ehas said he wouldn’t step down\u003c/a\u003e if Trump asked him to do so, and added that Trump, as president, doesn’t have the authority to fire him.\u003c/p\u003e\n\n\n\n\u003cp\u003eTrump repeatedly attacked Powell during his first term as president for raising the Fed’s key rate in 2017 and 2018. During the 2024 campaign, he said that as president he should have a “say” in the central bank’s interest rate decisions. Presidents traditionally avoid commenting on the Fed’s policies.\u003c/p\u003e\n\n\n\n\u003cp\u003eBessent and his husband, former New York City prosecutor John Freeman, married in 2011 and have two children.\u003c/p\u003e\n\n\n\n\u003cp\u003eVought, 48, was the head of the Office of Management and Budget from mid-2020 to the end of Trump’s first term in 2021, having previously served as the acting director and deputy director. A graduate of Wheaton College and George Washington University Law School, he had a deep knowledge of government finances that has been paired with his own Christian faith.\u003c/p\u003e\n\n\n\n\u003cp\u003eAfter Trump’s initial term ended, Vought founded the Center for Renewing America, a think tank that describes its mission as renewing “a consensus of America as a nation under God.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThe Center for Renewing America released its own 2023 budget proposal entitled “A Commitment to End Work and Weaponized Government.” The proposal envisioned $11.3 trillion worth of spending reductions over 10 years and about $2 trillion in income tax cuts in order to bring the budget into surplus by 2032.\u003c/p\u003e\n\n\n\n\u003cp\u003e“The immediate threat facing the nation is the fact that the people no longer govern the country; instead, the government itself is increasingly weaponized against the people it is meant to serve,” Vought wrote in the introduction.\u003c/p\u003e\n\n\n\n\u003cp\u003eVought has also previously worked as the executive and budget director for the Republican Study Committee, a caucus for conservative House Republicans. He also worked at Heritage Action, the political group tied to The Heritage Foundation, a conservative think tank.\u003c/p\u003e\n\n\n\n\u003cp\u003eVought’s proposed budget plan would cut spending on food aid through the Agriculture Department. There would be $3.3 trillion in spending reductions in the Health and Human Services Department in large part through how Medicaid and Medicare funds are distributed. It also contains about $642 billion in cuts to Affordable Care Act. The budgets for the Housing and Urban Development and Education departments would also be cut.\u003c/p\u003e\n\n\n\n\u003cp\u003eVought’s budget ideas were independent of Trump, who has not entirely spelled out the details of his economic plans, other than to campaign on income tax cuts and tariff hikes. __\u003c/p\u003e\n\n\n\n\u003cp\u003eAssociated Press writer Josh Boak contributed to this report.\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cb\u003eHow many degrees of separation are you from the globe\u0026#39;s most powerful business leaders? \u003c/b\u003eExplore who made our brand-new list of the \u003ca href=\"https://fortune.com/ranking/most-powerful-people/?\u0026amp;itm_source=fortune\u0026amp;itm_medium=article_tout\" target=\"_self\" aria-label=\"Go to https://fortune.com/ranking/most-powerful-people/?\u0026amp;itm_source=fortune\u0026amp;itm_medium=article_tout\"\u003e100 Most Powerful People in Business\u003c/a\u003e. Plus, learn about the metrics we used to make it.\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": null,
  "modifiedTime": null
}
