{
  "id": "29e5355f-30d6-49b3-a500-5e9da4268da2",
  "title": "Here’s the net worth you need to be in the top 10% of Americans — why it’s a lot higher than you might think",
  "link": "https://finance.yahoo.com/news/net-worth-top-10-americans-195000304.html",
  "description": "",
  "author": "",
  "published": "2025-07-13T19:50:00Z",
  "source": "https://finance.yahoo.com/news/rssindex",
  "categories": null,
  "byline": "Vishesh Raisinghani",
  "length": 2683,
  "excerpt": "Think you’re doing well financially? Here’s how your net worth stacks up against America’s top 10%.",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "In This Article: One of the lesser-known rules of personal finance is that wealth is relative. A net worth of $500,000 might be a fortune in some countries and barely enough in others. That’s why tracking your net worth against the national average and different percentiles can give you a clearer picture of your progress toward financial freedom. I'm 49 years old and have nothing saved for retirement — what should I do? Don't panic. Here are 6 of the easiest ways you can catch up (and fast) Thanks to Jeff Bezos, you can now become a landlord for as little as $100 — and no, you don't have to deal with tenants or fix freezers. Here's how Want an extra $1,300,000 when you retire? Dave Ramsey says this 7-step plan ‘works every single time’ to kill debt, get rich in America — and that ‘anyone’ can do it With that in mind, here’s the latest available government data on how much wealth it takes to be in the top 10% of all Americans. The Federal Reserve is arguably the best source of data on national net worth. It has unmatched insight into how Americans earn, spend, save, invest and borrow. According to a Washington Post analysis of the Federal Reserve’s 2022 Survey of Consumer Finances, the median American family has a net worth of just $192,900. If your household has more than that, you’re doing better than half of the country. If your net worth is above $1,063,700, you’re wealthier than the average American. This number is much higher than the median number because it is skewed by ultra-wealthy individuals like Jeff Bezos and Mark Zuckerberg. Still, it’s a useful benchmark — being a millionaire or billionaire in America puts you ahead of most. To break into the top 10%, though, you’ll need a net worth of at least $2 million, according to the 2022 survey. That means only 1 in 10 American households has a net worth above that threshold. In other words, if you’re a multimillionaire, you can safely consider yourself among the affluent. Your family likely enjoys access to better housing, education than most. That said, 2022 was a while ago, and this data is likely outdated. If you’re trying to crack the top 10% in 2025 or beyond, you might need to aim a little higher than $2 million. Read more: Americans are ‘revenge saving’ to survive — but millions only get a measly 1% on their savings. Here’s how to quickly earn 280% more on your cash Every year, America’s wealthiest people tend to get even richer. At the same time, the cost of living keeps rising. Since 2022, the S\u0026P 500 has jumped roughly 64%, boosting the portfolios of many affluent families and potentially raising the bar for the top 10%.",
  "image": "https://media.zenfs.com/en/moneywise_327/93309cdc2f461c0ddc6ec203108432c4",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"nimbus-app\" tabindex=\"-1\"\u003e  \u003carticle\u003e \u003cdiv\u003e  \u003cdiv data-testid=\"article-content-wrapper\"\u003e\u003ch2\u003eIn This Article: \u003c/h2\u003e   \u003cdiv\u003e   \u003cp\u003eOne of the lesser-known rules of personal finance is that wealth is relative. A net worth of $500,000 might be a fortune in some countries and barely enough in others.\u003c/p\u003e   \u003cp\u003eThat’s why tracking your net worth against the national average and different percentiles can give you a clearer picture of your progress toward financial freedom.\u003c/p\u003e      \u003cul\u003e\u003cli\u003e \u003cp\u003eI\u0026#39;m 49 years old and have nothing saved for retirement — what should I do? Don\u0026#39;t panic. Here are \u003ca href=\"https://moneywise.com/retirement/retirement/hybrid-nothing-saved-for-retirement-catch-up?throw=DM1_yahoo\u0026amp;placement_syn=placement_1\u0026amp;utm_source=syn_oath_mon\u0026amp;utm_medium=BL\u0026amp;utm_campaign=112169\u0026amp;utm_content=syn_18404c0c-b3f8-4aa9-8bde-1eedd5d6e6b8\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:6 of the easiest ways you can catch up (and fast);elm:context_link;itc:0;sec:content-canvas\"\u003e6 of the easiest ways you can catch up (and fast)\u003c/a\u003e\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003eThanks to Jeff Bezos, you can now \u003ca href=\"https://moneywise.com/investing/real-estate/invest-vacation-rental-homes?throw=DM2_yahoo\u0026amp;placement_syn=placement_1\u0026amp;utm_source=syn_oath_mon\u0026amp;utm_medium=BL\u0026amp;utm_campaign=112169\u0026amp;utm_content=syn_62e8bdc9-61fb-4147-b235-4e4fd9f920b4\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:become a landlord for as little as $100;elm:context_link;itc:0;sec:content-canvas\"\u003ebecome a landlord for as little as $100\u003c/a\u003e — and no, you don\u0026#39;t have to deal with tenants or fix freezers. Here\u0026#39;s how\u003c/p\u003e \u003c/li\u003e\u003cli\u003e \u003cp\u003eWant an extra $1,300,000 when you retire? Dave Ramsey says \u003ca href=\"https://moneywise.com/managing-money/dave-ramsey-baby-steps?throw=DM3_yahoo\u0026amp;placement_syn=placement_1\u0026amp;utm_source=syn_oath_mon\u0026amp;utm_medium=BL\u0026amp;utm_campaign=112169\u0026amp;utm_content=syn_1f011e49-b4c2-4bc3-a5a1-8cfb67def44f\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:this 7-step plan ‘works every single time’ to kill debt, get rich in America;elm:context_link;itc:0;sec:content-canvas\"\u003ethis 7-step plan ‘works every single time’ to kill debt, get rich in America\u003c/a\u003e — and that ‘anyone’ can do it\u003c/p\u003e \u003c/li\u003e \u003c/ul\u003e   \u003cp\u003eWith that in mind, here’s the latest available government data on how much wealth it takes to be in the top 10% of all Americans.\u003c/p\u003e      \u003cp\u003eThe Federal Reserve is arguably the best source of data on national \u003ca href=\"https://moneywise.com/managing-money/budgeting/net-worth-trackers?utm_source=syn_oath_mon\u0026amp;utm_medium=WL\u0026amp;utm_campaign=112169\u0026amp;utm_content=syn_1427046b-9077-401e-bf9b-6f7a50e5ab1b\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:net worth;elm:context_link;itc:0;sec:content-canvas\"\u003enet worth\u003c/a\u003e. It has unmatched insight into how Americans earn, spend, save, invest and borrow.\u003c/p\u003e   \u003cp\u003eAccording to a \u003ca href=\"https://moneywise.com/go?tid=wa_hardregwall_auth\u0026amp;url=https%3A%2F%2Fwww.washingtonpost.com%2Fbusiness%2Finteractive%2F2024%2Fare-you-rich-american-wealth-net-worth%2F%3Ftid%3Dwa_hardregwall_auth\u0026amp;utm_medium=EL\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Washington Post;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cem\u003eWashington Post\u003c/em\u003e\u003c/a\u003e analysis of the Federal Reserve’s 2022 Survey of Consumer Finances, the median American family has a net worth of just $192,900. If your household has more than that, you’re doing better than half of the country.\u003c/p\u003e      \u003cp\u003eIf your net worth is above $1,063,700, you’re wealthier than the \u003cem\u003eaverage\u003c/em\u003e American. This number is much higher than the median number because it is skewed by ultra-wealthy individuals like Jeff Bezos and Mark Zuckerberg. Still, it’s a useful benchmark — being a millionaire or billionaire in America puts you ahead of most.\u003c/p\u003e   \u003cp\u003eTo break into the top 10%, though, you’ll need a net worth of at least $2 million, according to the 2022 survey. That means only 1 in 10 American households has a net worth above that threshold.\u003c/p\u003e      \u003cp\u003eIn other words, if you’re a multimillionaire, you can safely consider yourself among the affluent. Your family likely enjoys access to better housing, education than most.\u003c/p\u003e   \u003cp\u003eThat said, 2022 was a while ago, and this data is likely outdated. If you’re trying to crack the top 10% in 2025 or beyond, you might need to aim a little higher than $2 million.\u003c/p\u003e   \u003cp\u003e\u003cstrong\u003eRead more: Americans are ‘revenge saving’ to survive — but millions only get a measly 1% on their savings. \u003ca href=\"https://moneywise.com/managing-money/how-to-earn-money/where-to-stash-your-cash?throw=HALF_yahoo\u0026amp;placement_syn=placement_2\u0026amp;utm_source=syn_oath_mon\u0026amp;utm_medium=BL\u0026amp;utm_campaign=112169\u0026amp;utm_content=syn_19cfc9eb-0655-4a9b-bede-3c7285ad697e\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Here’s how to quickly earn 280% more on your cash;elm:context_link;itc:0;sec:content-canvas\"\u003eHere’s how to quickly earn 280% more on your cash\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e      \u003cp\u003eEvery year, America’s wealthiest people tend to get even richer. At the same time, the cost of living keeps rising.\u003c/p\u003e   \u003cp\u003eSince 2022, the S\u0026amp;P 500 has jumped roughly 64%, boosting the portfolios of many affluent families and potentially raising the bar for the top 10%.\u003c/p\u003e \u003c/div\u003e\u003c/div\u003e     \u003chr/\u003e \u003cul\u003e\u003cli data-testid=\"seamlessscroll-9b889d56-636d-3ad0-9568-15055570faf2\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-cdacab50-cb56-3bff-b5a1-8b7be26842e1\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-bb877437-d8fd-4b8c-8a8a-3fc8ecd577f0\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-c7cbf8e1-9cc6-3a11-9f45-69b106eb9095\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-da073da5-2f16-3d24-86d1-ff8450d41101\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-f2c89ebd-023b-3d4b-a04e-ac824dc7b62f\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-2dda8a72-6b70-3b3a-99dd-4d4a0bdcdcaa\"\u003e \u003c/li\u003e\u003c/ul\u003e \u003csection\u003e\u003cheader\u003e \u003c/header\u003e   \u003c/section\u003e\u003c/div\u003e\u003c/article\u003e \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-07-13T19:50:00Z",
  "modifiedTime": null
}
