{
  "id": "37b84bc2-cad7-465b-92ff-c0fc53a27f9a",
  "title": "Asia shares rally on US inflation relief",
  "link": "https://www.investing.com/news/economy-news/asia-shares-rally-on-us-inflation-relief-3786118",
  "description": "",
  "author": "Reuters",
  "published": "2024-12-23 00:30:33",
  "source": "https://www.investing.com/rss/news.rss",
  "categories": null,
  "byline": "Reuters",
  "length": 3070,
  "excerpt": "Asia shares rally on US inflation relief",
  "siteName": "Investing.com",
  "favicon": "",
  "text": "SYDNEY (Reuters) - Asian shares rallied on Monday after a benign reading on U.S. inflation restored some hope for further policy easing next year, while there was relief that Washington had averted a government shutdown. After the bonanza of recent central bank decisions, this week is much quieter with only the minutes of a few of those meetings due. There are no Federal Reserve speeches and U.S. data is of secondary importance. Otherwise the themes were largely the same, with the dollar underpinned by a relatively strong economy and higher bond yields, which in turn is a burden for commodities and gold. It is also a headache for emerging market countries, which are having to intervene to stop their currencies from falling too far and stoking domestic inflation. For now, the afterglow from the U.S. inflation report was enough to lift MSCI's broadest index of Asia-Pacific shares outside Japan rose 0.3%. gained 0.7% and South Korea firmed 0.9%. added 0.3%, while Nasdaq futures firmed 0.4%. The fell almost 2% last week and the Nasdaq 1.8%, though the latter is still up 30% for the year. Analysts at BofA noted the S\u0026P 500 was up 23% for the year, but if the 12 largest companies were excluded the gain was only 8%. They cautioned such extreme concentration was a vulnerability going into 2025. Wall Street had rallied on Friday when a key gauge of core U.S. inflation printed lower than expected at 0.11%, providing a partial antidote to the Fed's hawkishness earlier in the week. Fed funds futures rallied to imply a 53% chance of a rate cut in March and 62% for May, though they only have two quarter-point easings to 3.75-4.0% priced in for all of 2025. A few months ago, the market had hoped rates would bottom around 3.0%. The prospect of fewer cuts has combined with expectations of more debt-funding government spending to pressure bond markets, with 10-year yields surging almost 42 basis points in just two weeks for the biggest such increase since April 2022. \"The recent firming in core inflation has interacted with a rising threat of tariffs and immigration restrictions to temper the Fed's inflation optimism,\" noted JPMorgan economist Michael Feroli. \"Given our inflation and unemployment rate forecasts, we continue to look for 75bp of cuts next year with a hold in January and a quarterly cadence thereafter.\" In currency markets, the held near two-year highs at 107.970 having climbed 1.9% for the month so far. The euro looked vulnerable at $1.0432 having again tested support around $1.0331/43 last week. [USD/] The dollar was firm at 156.44, having gained 4.5% so far in December, but faces more threats of Japanese intervention should it challenge the 160.00 barrier. The strong dollar combined with high bond yields to weigh on gold, which stood at $2,624 an ounce after slipping 1% last week. [GOL/] The high dollar is also a burden for oil, already hampered by concerns over Chinese demand following dismal retail sales figures last week. [O/R] was up 4 cents at $73.00 a barrel, while gained 12 cents to $69.58 per barrel.",
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEKBM00B_M.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article\"\u003e \u003cp\u003eSYDNEY (Reuters) - Asian shares rallied on Monday after a benign reading on U.S. inflation restored some hope for further policy easing next year, while there was relief that Washington had averted a government shutdown.\u003c/p\u003e \u003cp\u003eAfter the bonanza of recent central bank decisions, this week is much quieter with only the minutes of a few of those meetings due. There are no Federal Reserve speeches and U.S. data is of secondary importance.\u003c/p\u003e \u003cp\u003eOtherwise the themes were largely the same, with the dollar underpinned by a relatively strong economy and higher bond yields, which in turn is a burden for commodities and gold.\u003c/p\u003e \u003cp\u003eIt is also a headache for emerging market countries, which are having to intervene to stop their currencies from falling too far and stoking domestic inflation.\u003c/p\u003e \u003cp\u003eFor now, the afterglow from the U.S. inflation report was enough to lift MSCI\u0026#39;s broadest index of Asia-Pacific shares outside Japan rose 0.3%.\u003c/p\u003e \u003cp\u003e gained 0.7% and South Korea firmed 0.9%.\u003c/p\u003e \u003cp\u003e added 0.3%, while Nasdaq futures firmed 0.4%. The  fell almost 2% last week and the Nasdaq 1.8%, though the latter is still up 30% for the year.\u003c/p\u003e \u003cp\u003eAnalysts at BofA noted the S\u0026amp;P 500 was up 23% for the year, but if the 12 largest companies were excluded the gain was only 8%. They cautioned such extreme concentration was a vulnerability going into 2025.\u003c/p\u003e \u003cp\u003eWall Street had rallied on Friday when a key gauge of core U.S. inflation printed lower than expected at 0.11%, providing a partial antidote to the Fed\u0026#39;s hawkishness earlier in the week.\u003c/p\u003e \u003cp\u003eFed funds futures rallied to imply a 53% chance of a rate cut in March and 62% for May, though they only have two quarter-point easings to 3.75-4.0% priced in for all of 2025. A few months ago, the market had hoped rates would bottom around 3.0%.\u003c/p\u003e \u003cp\u003eThe prospect of fewer cuts has combined with expectations of more debt-funding government spending to pressure bond markets, with 10-year yields surging almost 42 basis points in just two weeks for the biggest such increase since April 2022.\u003c/p\u003e \u003cp\u003e\u0026#34;The recent firming in core inflation has interacted with a rising threat of tariffs and immigration restrictions to temper the Fed\u0026#39;s inflation optimism,\u0026#34; noted JPMorgan economist Michael Feroli.\u003c/p\u003e \u003cp\u003e\u0026#34;Given our inflation and unemployment rate forecasts, we continue to look for 75bp of cuts next year with a hold in January and a quarterly cadence thereafter.\u0026#34;\u003c/p\u003e \u003cp\u003eIn currency markets, the  held near two-year highs at 107.970 having climbed 1.9% for the month so far. The euro looked vulnerable at $1.0432 having again tested support around $1.0331/43 last week. [USD/] \u003c/p\u003e \u003cp\u003eThe dollar was firm at 156.44, having gained 4.5% so far in December, but faces more threats of Japanese intervention should it challenge the 160.00 barrier.\u003c/p\u003e \u003cp\u003eThe strong dollar combined with high bond yields to weigh on gold, which stood at $2,624 an ounce after slipping 1% last week. [GOL/]\u003c/p\u003e \u003cp\u003e\u003cimg src=\"https://i-invdn-com.investing.com/trkd-images/LYNXMPEKBM00D_L.jpg\" title=\"© Reuters. FILE PHOTO: A passerby stands in front of an electric board displaying the Nikkei stock average outside a brokerage in Tokyo, Japan, September 30, 2024. REUTERS/Kim Kyung-Hoon/File Photo\" alt=\"© Reuters. FILE PHOTO: A passerby stands in front of an electric board displaying the Nikkei stock average outside a brokerage in Tokyo, Japan, September 30, 2024. REUTERS/Kim Kyung-Hoon/File Photo\" rel=\"external-image\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe high dollar is also a burden for oil, already hampered by concerns over Chinese demand following dismal retail sales figures last week. [O/R]\u003c/p\u003e \u003cp\u003e was up 4 cents at $73.00 a barrel, while  gained 12 cents to $69.58 per barrel. \u003c/p\u003e \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-23T00:22:42Z",
  "modifiedTime": null
}
