{
  "id": "4637a92c-d086-4550-9362-2612eb4b537c",
  "title": "Fed Governor Waller sees need for 'more caution' ahead when lowering interest rates",
  "link": "https://www.cnbc.com/2024/10/14/fed-governor-waller-sees-need-for-more-caution-ahead-when-lowering-interest-rates.html",
  "description": "Waller on Monday signaled that future interest rate cuts will be less aggressive than the big move in September.",
  "author": "",
  "published": "Mon, 14 Oct 2024 20:13:14 GMT",
  "source": "https://www.cnbc.com/id/100003114/device/rss/rss.html",
  "categories": null,
  "byline": "Jeff Cox",
  "length": 2333,
  "excerpt": "Waller on Monday signaled that future interest rate cuts will be less aggressive than the big move in September.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "Christopher Waller, a member of the Federal Reserve Board of Governors, during a Fed Listens event in Washington, D.C., on Sept. 23, 2022.Al Drago | Bloomberg | Getty ImagesFederal Reserve Governor Christopher Waller on Monday signaled that future interest rate cuts will be less aggressive than the big move in September as he expressed concern that the economy could still be running at a hotter-than-desired pace.Citing recent reports on employment, inflation, gross domestic product and income, the policymaker indicated that \"the data is signaling that the economy may not be slowing as much as desired.\"\"While we do not want to overreact to this data or look through it, I view the totality of the data as saying monetary policy should proceed with more caution on the pace of rate cuts than was needed at the September meeting,\" Waller said in prepared remarks for a conference at Stanford University.The Federal Open Market Committee at its September meeting took the unusual step of lowering its baseline interest rate by a half percentage point, or 50 basis points, to a target range of 4.75% to 5.00%. In the past, the Fed has only done that during times of crisis, as it prefers to move in increments of a quarter percentage point, or 25 basis points.Along with the cut, officials indicated the likelihood of another half point lopped off in the final two meetings of 2024, along with another full percentage point of cuts in 2025. However, Waller did not commit to a specific path ahead.\"Whatever happens in the near term, my baseline still calls for reducing the policy rate gradually over the next year,\" he said.Key data points for the Fed have been mixed in recent days. The labor market posted stronger numbers in September after weakening through the summer, the consumer price index inflation gauge was slightly higher than expected and GDP also has held strong.In the final revision for second-quarter growth, the Commerce Department also punched up the level of gross domestic income gain to 3.4%, an adjustment of 2.1 percentage points from the previous estimate and closer in line with GDP. The savings rate also was adjusted much higher, to 5.2%.\"These revisions suggest that the economy is much stronger than previously thought, with little indication of a major slowdown in economic activity,\" Waller said.",
  "image": "https://image.cnbcfm.com/api/v1/image/107191637-1693925229627-waller.jpg?v=1728936768\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-107191637\" data-test=\"InlineImage\"\u003e\u003cp\u003eChristopher Waller, a member of the Federal Reserve Board of Governors, during a Fed Listens event in Washington, D.C., on Sept. 23, 2022.\u003c/p\u003e\u003cp\u003eAl Drago | Bloomberg | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.cnbc.com/federal-reserve/\"\u003eFederal Reserve\u003c/a\u003e Governor Christopher Waller on Monday signaled that future interest rate cuts will be less aggressive than the big move in September as he expressed concern that the economy could still be running at a hotter-than-desired pace.\u003c/p\u003e\u003cp\u003eCiting recent reports on employment, inflation, gross domestic product and income, the policymaker indicated that \u0026#34;the data is signaling that the economy may not be slowing as much as desired.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;While we do not want to overreact to this data or look through it, I view the totality of the data as saying monetary policy should proceed with more caution on the pace of rate cuts than was needed at the September meeting,\u0026#34; Waller said in prepared remarks for a conference at Stanford University.\u003c/p\u003e\u003cp\u003eThe Federal Open Market Committee at its September meeting took the unusual step of \u003ca href=\"https://www.cnbc.com/2024/09/18/fed-cuts-rates-september-2024-.html\"\u003elowering its baseline interest rate\u003c/a\u003e by a half percentage point, or 50 basis points, to a target range of 4.75% to 5.00%. In the past, the Fed has only done that during times of crisis, as it prefers to move in increments of a quarter percentage point, or 25 basis points.\u003c/p\u003e\u003cp\u003eAlong with the cut, officials indicated the likelihood of another half point lopped off in the final two meetings of 2024, along with another full percentage point of cuts in 2025. However, Waller did not commit to a specific path ahead.\u003c/p\u003e\u003cp\u003e\u0026#34;Whatever happens in the near term, my baseline still calls for reducing the policy rate gradually over the next year,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eKey data points for the Fed have been mixed in recent days. The \u003ca href=\"https://www.cnbc.com/2024/10/04/september-2024-us-jobs-report.html\"\u003elabor market posted stronger numbers\u003c/a\u003e in September after weakening through the summer, the \u003ca href=\"https://www.cnbc.com/2024/10/10/cpi-inflation-september-2024.html\"\u003econsumer price index\u003c/a\u003e inflation gauge was slightly higher than expected and GDP also has held strong.\u003c/p\u003e\u003cp\u003eIn \u003ca href=\"https://www.bea.gov/news/2024/gross-domestic-product-third-estimate-corporate-profits-revised-estimate-and-gdp-0\" target=\"_blank\"\u003ethe final revision\u003c/a\u003e for second-quarter growth, the Commerce Department also punched up the level of gross domestic income gain to 3.4%, an adjustment of 2.1 percentage points from the previous estimate and closer in line with GDP. The savings rate also was adjusted much higher, to 5.2%.\u003c/p\u003e\u003cp\u003e\u0026#34;These revisions suggest that the economy is much stronger than previously thought, with little indication of a major slowdown in economic activity,\u0026#34; Waller said.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-14T19:02:23Z",
  "modifiedTime": "2024-10-14T20:13:14Z"
}
