{
  "id": "47392229-d2a7-4f4e-a471-837cf0e0ee45",
  "title": "No Booze, No Masturbating (NOBNOM) November Challenge",
  "link": "https://tim.blog/2024/11/01/no-booze-no-masturbating-nobnom-november-challenge/",
  "description": "I did this publicly once before in 2014, and someone recently messaged to say that it changed their life, so we’re doing it again! Your 30 days can start whenever you see this post, so don’t worry about missing the 1st. You know who you are, you filthy animals. Secret bookmarks to Pornhub (“Discount airfare” … Continue reading \"No Booze, No Masturbating (NOBNOM) November Challenge\" The post No Booze, No Masturbating (NOBNOM) November Challenge appeared first on The Blog of Author Tim Ferriss.",
  "author": "Tim Ferriss",
  "published": "Fri, 01 Nov 2024 18:50:10 +0000",
  "source": "https://tim.blog/feed/",
  "categories": [
    "30-Day Challenges",
    "NOBNOM"
  ],
  "byline": "Tim Ferriss",
  "length": 4285,
  "excerpt": "I did this publicly once before in 2014, and someone recently messaged to say that it changed their life, so we’re doing it again! Your 30 days can start whenever you see this post, so don’t worry about missing the 1st. You know who you are, you filthy animals. Secret bookmarks to Pornhub (“Discount airfare” … Continue reading \"No Booze, No Masturbating (NOBNOM) November Challenge\"",
  "siteName": "The Blog of Author Tim Ferriss",
  "favicon": "https://i0.wp.com/tim.blog/wp-content/uploads/2019/12/cropped-site-icon-tim-ferriss-2.png?fit=192%2C192\u0026ssl=1",
  "text": "Both of these things are very distracting. (Photo: Shawn Perez) I did this publicly once before in 2014, and someone recently messaged to say that it changed their life, so we’re doing it again! Your 30 days can start whenever you see this post, so don’t worry about missing the 1st. You know who you are, you filthy animals.Secret bookmarks to Pornhub (“Discount airfare” – Ha!), secret folders labeled “Tax Returns 2019” for when wifi fails, ExpressVPN for when you’re in countries that block your cherished videos…Oh, wait. Am I projecting again?Yes, I’ve admitted it before, and I’ll admit it again: dudes watch porn on the Internet. Shocker, I know. All those guys on the magazine covers? They do it, too.Less obvious, perhaps, is how dramatically your life can change if you quit porn and masturbation for a short period.I did this for 30 days recently, and—oddly enough—I found it much easier and more impactful to quit booze for the same 30 days. I highly recommend watching this short clip from The Drive by Peter Attia, MD, in which he interviews Anna Lembke, MD on a cannabis-using patient. Dr. Lembke discusses how to reset the brain’s reward system and joy set point to improve mental health. Often, four weeks of abstinence from compulsive behaviors is enough to dramatically reduce anxiety and depression without medication.Just a few of the specific benefits I experienced included… A dramatic surge in free testosterone and sex drive. Dozens of my seemingly healthy male friends, techies in particular, have approached me over the years about chronically low testosterone. There are many potential causes, including late-night blue light and laptop heat on the lap, but removing booze and porn appears to open the flood gates. Research (example, example) shows that alcohol reduces testosterone levels. So… should you be dating more? Trying a little harder instead of wanking, watching Netflix, and calling it a night? This will help motivate you. Increased ability to focus and cognitive endurance. This goes along with the increased “T” mentioned above. Getting a LOT more done. When you aren’t nursing hangovers, destroying your sleep with booze, or procrastinating with porn (you know who you are)—miracle of miracles—you get more done! A LOT more done. In my mind, this alone easily justifies a 30-day booze and porn fast. You’ll clear off that goddamn to-do list faster than the Flash. And remember: sex is still allowed. Join Me For Another 30 DaysGiven how transformative this was for me, I’m inviting you to join me for the month of November (30 days). I need it, too. After that, you can go back to your hedonistic ways. I enjoy porn, but I’ve concluded I can level up by taking breaks. I’ll refer to our 30-day challenge as NOBNOM (NO Booze, NO Masturbating), as the acronym itself sounds pornographic. We gotta make this sumnabitch memorable. If you don’t masturbate, or if you otherwise don’t watch enough porn to care about abstaining, here’s another option: NOBNOC — No Booze, No Complaining. For this version, please first read “Real Mind Control: The 21-Day No-Complaint Experiment.” Suggested resources Reddit communities  Quitting porn: r/NoFap — Porn Addiction and Compulsive Sexual Behavior Peer Support Forum r/pornfree — Overcoming porn addiction one day at a time r/NoNutNovember — Support and meme community for those attempting No Nut November, an internet challenge to abstain from sexual activity during the month of November Quitting alcohol: r/Sober — Getting sober and sober living  r//stopdrinking — A support group in your pocket! This subreddit is a place to motivate each other to control or stop drinking.  The Tim Ferriss Show — relevant episodes: Jason Portnoy — Porn Addiction, The Corrosiveness of Secrets, Healing Wounds, Escaping Shame Cycles, and Books to Change Your Life. The Tim Ferriss Show is one of the most popular podcasts in the world with more than one billion downloads. It has been selected for \"Best of Apple Podcasts\" three times, it is often the #1 interview podcast across all of Apple Podcasts, and it's been ranked #1 out of 400,000+ podcasts on many occasions. To listen to any of the past episodes for free, check out this page.",
  "image": "https://149346886.v2.pressablecdn.com/wp-content/uploads/2024/11/girl-NOBNOM.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-97820\"\u003e\n\t\t\n\n\t\u003cdiv\u003e\n\t\t\n\u003cfigure\u003e\u003cimg data-recalc-dims=\"1\" decoding=\"async\" width=\"500\" height=\"334\" src=\"https://i0.wp.com/tim.blog/wp-content/uploads/2024/11/girl-NOBNOM.jpg?resize=500%2C334\u0026amp;ssl=1\" alt=\"A female festival-goer in a bikini top side-eyes someone offscreen while sticking her tongue out.\" srcset=\"https://i0.wp.com/tim.blog/wp-content/uploads/2024/11/girl-NOBNOM.jpg?w=500\u0026amp;ssl=1 500w, https://i0.wp.com/tim.blog/wp-content/uploads/2024/11/girl-NOBNOM.jpg?resize=300%2C200\u0026amp;ssl=1 300w, https://i0.wp.com/tim.blog/wp-content/uploads/2024/11/girl-NOBNOM.jpg?resize=360%2C240\u0026amp;ssl=1 360w\" sizes=\"(max-width: 500px) 100vw, 500px\"/\u003e\u003cfigcaption\u003e\u003cstrong\u003eBoth of these things are very distracting. \u003c/strong\u003e\u003cem\u003e(Photo: \u003c/em\u003e\u003ca href=\"https://www.flickr.com/photos/stinkiepinkie_infinity/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eShawn Perez\u003c/a\u003e\u003cem\u003e)\u003c/em\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eI did this publicly once before in 2014, and someone recently messaged to say that it changed their life, so we’re doing it again!\u003c/p\u003e\n\n\n\n\u003cp\u003eYour 30 days can start whenever you see this post, so don’t worry about missing the 1st.\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\u003cp\u003eYou know who you are, you filthy animals.\u003c/p\u003e\u003cp\u003eSecret bookmarks to Pornhub (“Discount airfare” – Ha!), secret folders labeled “Tax Returns 2019” for when wifi fails, \u003ca target=\"_blank\" href=\"http://expressvpn.com/tim\"\u003eExpressVPN\u003c/a\u003e for when you’re in countries that block your cherished videos…\u003c/p\u003e\u003cp\u003eOh, wait. Am I projecting again?\u003c/p\u003e\u003cp\u003eYes, \u003ca target=\"_blank\" href=\"https://fourhourworkweek.com/2014/05/05/the-random-show-episode-24-porn-attacks-eating-insect-protein-tech-finds-and-more/\"\u003eI’ve admitted it before\u003c/a\u003e, and I’ll admit it again: dudes watch porn on the Internet. Shocker, I know. All those guys on the magazine covers? They do it, too.\u003c/p\u003e\u003cp\u003eLess obvious, perhaps, is how dramatically your life can change if you quit porn and masturbation for a short period.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eI did this for 30 days recently, and—oddly enough—I found it much easier and more impactful to quit booze for the same 30 days. \u003c/strong\u003e\u003cstrong\u003e\u003cbr/\u003e\u003c/strong\u003e\u003cstrong\u003e\u003cbr/\u003e\u003c/strong\u003eI highly recommend watching \u003ca target=\"_blank\" href=\"https://www.instagram.com/peterattiamd/reel/DBRJ_ysz-LU/?locale=es\u0026amp;hl=en\"\u003ethis short clip\u003c/a\u003e from \u003cem\u003eThe Drive\u003c/em\u003e by \u003ca href=\"https://tim.blog/2023/03/14/peter-attia-outlive/\"\u003ePeter Attia, MD\u003c/a\u003e, in which he interviews \u003ca target=\"_blank\" href=\"https://www.annalembke.com/\"\u003eAnna Lembke, MD\u003c/a\u003e on a cannabis-using patient. Dr. Lembke discusses how to reset the brain’s reward system and \u003cstrong\u003ejoy set point\u003c/strong\u003e to improve mental health. Often, four weeks of abstinence from compulsive behaviors is enough to dramatically reduce anxiety and depression without medication.\u003c/p\u003e\u003cp\u003eJust a few of the specific benefits I experienced included…\u003c/p\u003e\u003c/div\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eA dramatic surge in free testosterone and sex drive. \u003c/strong\u003eDozens of my seemingly healthy male friends, techies in particular, have approached me over the years about chronically low testosterone. There are many potential causes, including late-night blue light and laptop heat on the lap, but removing booze and porn appears to open the flood gates. Research (\u003ca target=\"_blank\" href=\"http://www.nejm.org/doi/pdf/10.1056/NEJM197610072951501\"\u003eexample\u003c/a\u003e, \u003ca target=\"_blank\" href=\"http://www.sciencedirect.com/science/article/pii/0039128X74900646\"\u003eexample\u003c/a\u003e) shows that alcohol reduces testosterone levels. So… should you be dating more? Trying a little harder instead of wanking, watching Netflix, and calling it a night? This will help motivate you.\u003cbr/\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eIncreased ability to focus and cognitive endurance.\u003c/strong\u003e This goes along with the increased “T” mentioned above.\u003cbr/\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eGetting a LOT more done. \u003c/strong\u003eWhen you aren’t nursing hangovers, destroying your sleep with booze, or procrastinating with porn (you know who you are)—miracle of miracles—you get more done! A LOT more done. In my mind, this alone easily justifies a 30-day booze and porn fast. You’ll clear off that goddamn to-do list faster than the Flash. And remember: sex is still allowed.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eJoin Me For Another 30 Days\u003c/strong\u003e\u003cstrong\u003e\u003cbr/\u003e\u003c/strong\u003e\u003cstrong\u003e\u003cbr/\u003e\u003c/strong\u003e\u003cstrong\u003eGiven how transformative this was for me, I’m inviting you to join me for the month of November (30 days).\u003c/strong\u003e I need it, too. After that, you can go back to your hedonistic ways. I enjoy porn, but I’ve concluded I can level up by taking breaks.\u003c/p\u003e\n\n\n\n\u003cp\u003eI’ll refer to our 30-day challenge as \u003cstrong\u003eNOBNOM (NO Booze, NO Masturbating)\u003c/strong\u003e, as the acronym itself sounds pornographic. We gotta make this sumnabitch memorable.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you don’t masturbate, or if you otherwise don’t watch enough porn to care about abstaining, here’s another option: \u003cstrong\u003eNOBNOC — No Booze, No Complaining\u003c/strong\u003e.\u003cstrong\u003e \u003c/strong\u003eFor this version, please first read “\u003ca target=\"_blank\" href=\"https://fourhourworkweek.com/2007/09/18/real-mind-control-the-21-day-no-complaint-experiment/#content\"\u003eReal Mind Control: The 21-Day No-Complaint Experiment\u003c/a\u003e.”\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eSuggested resources\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eReddit communities \u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eQuitting porn:\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca target=\"_blank\" href=\"https://www.reddit.com/r/NoFap/\"\u003er/NoFap\u003c/a\u003e — Porn Addiction and Compulsive Sexual Behavior Peer Support Forum\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca target=\"_blank\" href=\"https://www.reddit.com/r/pornfree/\"\u003er/pornfree\u003c/a\u003e — Overcoming porn addiction one day at a time\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca target=\"_blank\" href=\"https://www.reddit.com/r/nonutnovember/\"\u003er/NoNutNovember\u003c/a\u003e — Support and meme community for those attempting No Nut November, an internet challenge to abstain from sexual activity during the month of November\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eQuitting alcohol:\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca target=\"_blank\" href=\"https://www.reddit.com/r/Sober/\"\u003er/Sober \u003c/a\u003e— Getting sober and sober living \u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca target=\"_blank\" href=\"https://www.reddit.com/r/stopdrinking/\"\u003er//stopdrinking\u003c/a\u003e — A support group in your pocket! This subreddit is a place to motivate each other to control or stop drinking. \u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003e\u003cem\u003eThe Tim Ferriss Show — \u003c/em\u003erelevant episodes\u003c/strong\u003e:\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://tim.blog/2022/06/15/jason-portnoy/#content\"\u003eJason Portnoy — Porn Addiction, The Corrosiveness of Secrets, Healing Wounds, Escaping Shame Cycles, and Books to Change Your Life\u003c/a\u003e.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe data-placeholder-image=\"https://149346886.v2.pressablecdn.com/wp-content/uploads/complianz/placeholders/youtubeT8cSq_2wZRE-maxresdefault.webp\" data-category=\"marketing\" data-service=\"youtube\" data-cmplz-target=\"src\" data-src-cmplz=\"https://www.youtube.com/embed/T8cSq_2wZRE?feature=oembed\u0026amp;enablejsapi=1\u0026amp;origin=https://tim.blog\" title=\"How to Commit to the Path of Sobriety | Rich Roll\" width=\"600\" height=\"338\" src=\"about:blank\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\t\t\t\t\u003cp\u003e\u003cem\u003e\u003ca href=\"https://tim.blog/podcast\"\u003e\u003cstrong\u003eThe Tim Ferriss Show\u003c/strong\u003e\u003c/a\u003e \u003c/em\u003e\u003cspan\u003eis one \u003c/span\u003eof the most popular podcasts in the world with more than one billion downloads. It has been selected for \u0026#34;Best of Apple Podcasts\u0026#34; three times, it is often the #1 interview podcast across all of Apple Podcasts, and it\u0026#39;s been ranked #1 out of 400,000+ podcasts on many occasions. To listen to any of the past episodes for free, check out \u003cstrong\u003e\u003ca href=\"https://tim.blog/podcast\"\u003ethis page\u003c/a\u003e\u003c/strong\u003e.\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003c/div\u003e\n\t \n\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-11-01T18:50:10Z",
  "modifiedTime": "2024-11-05T01:15:17Z"
}
