{
  "id": "4fc40e25-25e9-4a2c-9858-67879a1b8952",
  "title": "Indus Towers Q4 results: Profit dips 4% to ₹1,779 cr despite revenue growth",
  "link": "https://www.business-standard.com/companies/quarterly-results/indus-towers-q4-results-profit-dips-4-to-1-779-cr-despite-revenue-growth-125043001669_1.html",
  "description": "The Q4 FY25 had a provision of Rs 226 crore for doubtful receivables, aided by collections against past overdue, the company said in a release",
  "author": "",
  "published": "Wed, 30 Apr 2025 23:06:52 +0530",
  "source": "https://www.business-standard.com/rss/home_page_top_stories.rss",
  "categories": null,
  "byline": "Press Trust of India",
  "length": 2490,
  "excerpt": "Telecom infrastructure company Indus Towers on Wednesday reported a net profit of Rs 1,779 crore for the March quarter, registering a decline of 4 per cent year-on-year.",
  "siteName": "Business Standard",
  "favicon": "https://www.business-standard.com/android-chrome-192x192.png",
  "text": "Telecom infrastructure company Indus Towers on Wednesday reported a net profit of Rs 1,779 crore for the March quarter, registering a decline of 4 per cent year-on-year. It said the industry developments during the year have only strengthened the outlook for the company and the sector. The company exuded confidence about maintaining the \"momentum\" by capitalising on customers' network expansion and available strategic opportunities. The revenue for the just-ended quarter came in at Rs 7,727 crore, up 7.4 per cent year-on-year. The Q4 FY25 had a provision of Rs 226 crore for doubtful receivables, aided by collections against past overdue, the company said in a release. \"During the quarter, the company acquired passive infrastructure assets from Bharti Airtel and accounted for the same as a common control transaction in accordance with Ind AS 103 which requires restatement of financial results of Indus Towers from the date on which common control was established i.e. Nov 19, 2024. Accordingly, Q4 FY25 financial results includes an accounting impact of Rs 183 crore for operating expenses and depreciation,\" the release said.Also Read For the full year ended March 2025, the consolidated revenues stood at Rs 30,123 crore, up 5.3 per cent. The consolidated profit after tax was Rs 9,932 crore, up 64.5 per cent. \"FY25 was another excellent year for us with an all-round performance. We delivered one of our highest ever tower and co-location additions as we continued to garner a major share of our customers' rollouts. Further supplementing our additions was the acquisition of an important tower portfolio, reflecting our agility for driving growth,\" Prachur Sah, Managing Director and CEO, Indus Towers Ltd, said. This, Sah said, has underpinned the company's robust financial performance, including healthy cash flow generation. \"I am also pleased to see that our continued engagement with a major customer ensured recovery of its overdues this year,\" he further said. Sah noted that industry developments during the year have only strengthened the outlook for the company and the sector. \"Given our inherent strengths and leadership position, we are confident of maintaining the momentum by capitalising on customers' network expansion and available strategic opportunities,\" he added.(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)",
  "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-05/10/thumb/fitandfill/1200X630/1715329052-5086.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"parent_top_div\"\u003e\u003cp\u003e\n\tTelecom infrastructure company Indus Towers on Wednesday reported a net profit of Rs 1,779 crore for the March quarter, registering a decline of 4 per cent year-on-year.\u003c/p\u003e\n\u003cp\u003e\n\tIt said the industry developments during the year have only strengthened the outlook for the company and the sector. The company exuded confidence about maintaining the \u0026#34;momentum\u0026#34; by capitalising on customers\u0026#39; network expansion and available strategic opportunities.\u003c/p\u003e\n\u003cp\u003e\n\tThe revenue for the just-ended quarter came in at Rs 7,727 crore, up 7.4 per cent year-on-year.\u003c/p\u003e\n\u003cp\u003e\n\tThe Q4 FY25 had a provision of Rs 226 crore for doubtful receivables, aided by collections against past overdue, the company said in a release.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;During the quarter, the company acquired passive infrastructure assets from Bharti Airtel and accounted for the same as a common control transaction in accordance with Ind AS 103 which requires restatement of financial results of Indus Towers from the date on which common control was established i.e. Nov 19, 2024. Accordingly, Q4 FY25 financial results includes an accounting impact of Rs 183 crore for operating expenses and depreciation,\u0026#34; the release said.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ch3\u003e\u003cspan\u003eAlso Read\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\n\tFor the full year ended March 2025, the consolidated revenues stood at Rs 30,123 crore, up 5.3 per cent. The consolidated profit after tax was Rs 9,932 crore, up 64.5 per cent.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;FY25 was another excellent year for us with an all-round performance. We delivered one of our highest ever tower and co-location additions as we continued to garner a major share of our customers\u0026#39; rollouts. Further supplementing our additions was the acquisition of an important tower portfolio, reflecting our agility for driving growth,\u0026#34; Prachur Sah, Managing Director and CEO, Indus Towers Ltd, said.\u003c/p\u003e\n\u003cp\u003e\n\tThis, Sah said, has underpinned the company\u0026#39;s robust financial performance, including healthy cash flow generation.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;I am also pleased to see that our continued engagement with a major customer ensured recovery of its overdues this year,\u0026#34; he further said.\u003c/p\u003e\n\u003cp\u003e\n\tSah noted that industry developments during the year have only strengthened the outlook for the company and the sector.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;Given our inherent strengths and leadership position, we are confident of maintaining the momentum by capitalising on customers\u0026#39; network expansion and available strategic opportunities,\u0026#34; he added.\u003c/p\u003e\u003c/div\u003e\u003cp id=\"auto_disclaimer\"\u003e(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-30T23:06:52+05:30",
  "modifiedTime": null
}
