{
  "id": "4fd31cfc-cbeb-4860-97d7-c00fbe393e39",
  "title": "CELH Equity Alert: Kessler Topaz Meltzer \u0026 Check, LLP Alerts Shareholders of Securities Fraud Class Action Lawsuit Filed against Celsius Holdings, Inc.",
  "link": "https://www.investing.com/news/press-releases/celh-equity-alert-kessler-topaz-meltzer--check-llp-alerts-shareholders-of-securities-fraud-class-action-lawsuit-filed-against-celsius-holdings-inc-93CH-3790291",
  "description": "",
  "author": "Investing.com",
  "published": "2024-12-28 00:52:03",
  "source": "https://www.investing.com/rss/news.rss",
  "categories": null,
  "byline": "Investing.com",
  "length": 3944,
  "excerpt": "CELH Equity Alert: Kessler Topaz Meltzer \u0026 Check, LLP Alerts Shareholders of Securities Fraud Class Action Lawsuit Filed against Celsius Holdings, Inc.",
  "siteName": "Investing.com",
  "favicon": "",
  "text": "Radnor, Pennsylvania--(Newsfile Corp. - December 27, 2024) - The law firm of Kessler Topaz Meltzer \u0026 Check, LLP (www.ktmc.com) informs investors that a securities class action lawsuit has been filed against Celsius Holdings (NASDAQ:), Inc. (\"Celsius\") (NASDAQ: CELH) on behalf of those who purchased or otherwise acquired Celsius common stock between February 29, 2024, and September 4, 2024, inclusive (the \"Class Period\"). The lead plaintiff deadline is January 21, 2025. CONTACT KESSLER TOPAZ MELTZER \u0026 CHECK, LLP:If you suffered Celsius losses, you may CLICK HERE or go to: https://www.ktmc.com/new-cases/celsius-holdings-inc?utm_source=PR\u0026utm_medium=link\u0026utm_campaign=celh\u0026mktm=r You can also contact attorney Jonathan Naji, Esq. by calling (484) 270-1453 or by email at info@ktmc.com. DEFENDANTS' ALLEGED MISCONDUCT:The complaint alleges that, throughout the Class Period, Defendants made false and/or misleading statements and/or failed to disclose that: (1) Celsius materially oversold inventory to Pepsi far in excess of demand, and faced a looming sales cliff during which Pepsi would significantly reduce its purchases of Celsius products; (2) as Pepsi drew down significant amounts of inventory overstock, Celsius' sales would materially decline in future periods, hurting Celsius' financial performance and outlook; (3) Celsius' sales rate to Pepsi was unsustainable and created a misleading impression of Celsius' financial performance and outlook; (4) as a result, Celsius' business metrics and financial prospects were not as strong as indicated in Defendants' Class Period statements; and (5) consequently, Defendants' statements regarding Celsius' outlook and expected financial performance were false and misleading at all relevant times. THE LEAD PLAINTIFF PROCESS:Celsius investors may, no later than January 21, 2025, seek to be appointed as a lead plaintiff representative of the class through Kessler Topaz Meltzer \u0026 Check, LLP or other counsel, or may choose to do nothing and remain an absent class member. A lead plaintiff is a representative party who acts on behalf of all class members in directing the litigation. The lead plaintiff is usually the investor or small group of investors who have the largest financial interest and who are also adequate and typical of the proposed class of investors. The lead plaintiff selects counsel to represent the lead plaintiff and the class and these attorneys, if approved by the court, are lead or class counsel. Your ability to share in any recovery is not affected by the decision of whether or not to serve as a lead plaintiff. Kessler Topaz Meltzer \u0026 Check, LLP encourages Celsius investors who have suffered significant losses to contact the firm directly to acquire more information. CLICK HERE TO SIGN UP FOR THE CASE OR GO TO: https://www.ktmc.com/new-cases/celsius-holdings-inc?utm_source=PR\u0026utm_medium=link\u0026utm_campaign=celh\u0026mktm=r ABOUT KESSLER TOPAZ MELTZER \u0026 CHECK, LLP: Kessler Topaz Meltzer \u0026 Check, LLP prosecutes class actions in state and federal courts throughout the country and around the world. The firm has developed a global reputation for excellence and has recovered billions of dollars for victims of fraud and other corporate misconduct. All of our work is driven by a common goal: to protect investors, consumers, employees and others from fraud, abuse, misconduct and negligence by businesses and fiduciaries. The complaint in this action was not filed by Kessler Topaz Meltzer \u0026 Check, LLP. For more information about Kessler Topaz Meltzer \u0026 Check, LLP please visit www.ktmc.com. CONTACT:Kessler Topaz Meltzer \u0026 Check, LLPJonathan Naji, Esq.(484) 270-1453280 King of Prussia RoadRadnor, PA 19087info@ktmc.com May be considered attorney advertising in certain jurisdictions. Past results do not guarantee future outcomes.To view the source version of this press release, please visit https://www.newsfilecorp.com/release/235278",
  "image": "https://i-invdn-com.investing.com/redesign/images/seo/investing_300X300.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article\"\u003e\u003cp\u003eRadnor, Pennsylvania--(Newsfile Corp. - December 27, 2024) - The law firm of Kessler Topaz Meltzer \u0026amp; Check, LLP (www.ktmc.com)  informs investors that a securities class action lawsuit has been filed against \u003cspan itemscope=\"\" itemtype=\"http://schema.org/Corporation\"\u003e\u003cspan itemprop=\"name\"\u003e Celsius Holdings \u003c/span\u003e\u003c/span\u003e (NASDAQ:), Inc. (\u0026#34;Celsius\u0026#34;) (NASDAQ: CELH) on behalf of those who purchased or otherwise acquired Celsius common stock between February 29, 2024, and September 4, 2024, inclusive (the \u0026#34;Class Period\u0026#34;). \u003cb\u003eThe lead plaintiff deadline is January 21, 2025.\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003cu\u003e\u003cb\u003eCONTACT KESSLER TOPAZ MELTZER \u0026amp; CHECK, LLP:\u003cbr/\u003e\u003c/b\u003e\u003c/u\u003e\u003cb\u003eIf you suffered Celsius losses, you may\u003c/b\u003e \u003cb\u003eCLICK HERE\u003c/b\u003e\u003cb\u003e or go to: \u003c/b\u003ehttps://www.ktmc.com/new-cases/celsius-holdings-inc?utm_source=PR\u0026amp;utm_medium=link\u0026amp;utm_campaign=celh\u0026amp;mktm=r\u003c/p\u003e\n\u003cp\u003e\u003cb\u003eYou can also contact attorney \u003c/b\u003e\u003cb\u003eJonathan Naji, Esq.\u003c/b\u003e\u003cu\u003e \u003c/u\u003e\u003cb\u003eby calling (484) 270-1453 or by email at \u003c/b\u003e\u003cb\u003einfo@ktmc.com\u003c/b\u003e\u003cb\u003e.  \u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003cu\u003e\u003cb\u003eDEFENDANTS\u0026#39; ALLEGED MISCONDUCT:\u003cbr/\u003e\u003c/b\u003e\u003c/u\u003eThe complaint alleges that, throughout the Class Period, Defendants made false and/or misleading statements and/or failed to disclose that: (1) Celsius materially oversold inventory to Pepsi far in excess of demand, and faced a looming sales cliff during which Pepsi would significantly reduce its purchases of Celsius products; (2) as Pepsi drew down significant amounts of inventory overstock, Celsius\u0026#39; sales would materially decline in future periods, hurting Celsius\u0026#39; financial performance and outlook; (3) Celsius\u0026#39; sales rate to Pepsi was unsustainable and created a misleading impression of Celsius\u0026#39; financial performance and outlook; (4) as a result, Celsius\u0026#39; business metrics and financial prospects were not as strong as indicated in Defendants\u0026#39; Class Period statements; and (5) consequently, Defendants\u0026#39; statements regarding Celsius\u0026#39; outlook and expected financial performance were false and misleading at all relevant times.\u003c/p\u003e\n\u003cp\u003e\u003cu\u003e\u003cb\u003eTHE LEAD PLAINTIFF PROCESS:\u003cbr/\u003e\u003c/b\u003e\u003c/u\u003eCelsius investors may, \u003cu\u003e\u003ci\u003e\u003cb\u003eno later than January 21, 2025,\u003c/b\u003e\u003c/i\u003e\u003c/u\u003e seek to be appointed as a lead plaintiff representative of the class through Kessler Topaz Meltzer \u0026amp; Check, LLP or other counsel, or may choose to do nothing and remain an absent class member. A lead plaintiff is a representative party who acts on behalf of all class members in directing the litigation.  The lead plaintiff is usually the investor or small group of investors who have the largest financial interest and who are also adequate and typical of the proposed class of investors. The lead plaintiff selects counsel to represent the lead plaintiff and the class and these attorneys, if approved by the court, are lead or class counsel. Your ability to share in any recovery is not affected by the decision of whether or not to serve as a lead plaintiff. \u003c/p\u003e\n\u003cp\u003eKessler Topaz Meltzer \u0026amp; Check, LLP encourages Celsius investors who have suffered significant losses to contact the firm directly to acquire more information. \u003c/p\u003e\n\u003cp\u003e\u003cb\u003eCLICK HERE\u003c/b\u003e\u003cb\u003e TO SIGN UP FOR THE CASE OR GO TO: \u003c/b\u003ehttps://www.ktmc.com/new-cases/celsius-holdings-inc?utm_source=PR\u0026amp;utm_medium=link\u0026amp;utm_campaign=celh\u0026amp;mktm=r\u003c/p\u003e\n\u003cp\u003e\u003cu\u003e\u003cb\u003eABOUT KESSLER TOPAZ MELTZER \u0026amp; CHECK, LLP:     \u003c/b\u003e\u003c/u\u003e\u003c/p\u003e\n\u003cp\u003eKessler Topaz Meltzer \u0026amp; Check, LLP prosecutes class actions in state and federal courts throughout the country and around the world.  The firm has developed a global reputation for excellence and has recovered billions of dollars for victims of fraud and other corporate misconduct. All of our work is driven by a common goal: to protect investors, consumers, employees and others from fraud, abuse, misconduct and negligence by businesses and fiduciaries. The complaint in this action was not filed by Kessler Topaz Meltzer \u0026amp; Check, LLP. For more information about Kessler Topaz Meltzer \u0026amp; Check, LLP please visit www.ktmc.com. \u003c/p\u003e\u003cp\u003e\u003cb\u003eCONTACT:\u003c/b\u003e\u003cbr/\u003eKessler Topaz Meltzer \u0026amp; Check, LLP\u003cbr/\u003eJonathan Naji, Esq.\u003cbr/\u003e(484) 270-1453\u003cbr/\u003e280 King of Prussia Road\u003cbr/\u003eRadnor, PA 19087\u003cbr/\u003einfo@ktmc.com \u003c/p\u003e\u003cp\u003eMay be considered attorney advertising in certain jurisdictions.  Past results do not guarantee future outcomes.\u003c/p\u003e\u003cp id=\"corporateLinkBack\"\u003eTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/235278\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-28T00:52:03Z",
  "modifiedTime": null
}
