{
  "id": "51506187-a780-4a80-a939-4408b33dd636",
  "title": "Crypto's $130 million congressional election binge has candidates like Utah's John Curtis poised for big wins",
  "link": "https://www.cnbc.com/2024/10/19/cryptos-130-million-election-binge-has-boosted-utahs-john-curtis.html",
  "description": "In running to take Mitt Romney's Senate seat, Republican John Curtis has benefited by being a friend to the crypto industry.",
  "author": "",
  "published": "Sat, 19 Oct 2024 11:00:02 GMT",
  "source": "https://www.cnbc.com/id/100003114/device/rss/rss.html",
  "categories": null,
  "byline": "MacKenzie Sigalos",
  "length": 5951,
  "excerpt": "In running to take Mitt Romney's Senate seat, Republican John Curtis has benefited by being a friend to the crypto industry.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "U.S. Rep. John Curtis speaks during the Utah Senate primary debate for Republican contenders battling to win the seat of retiring U.S. Sen. Mitt Romney, June 10, 2024, in Salt Lake City.Rick Bowmer | APSALT LAKE CITY — John Curtis, a Republican congressman from Utah, has become a favorite of the crypto industry in his bid to win the Senate seat held by the departing Mitt Romney. He took a somewhat oblong route through the telecommunications sector to get there.At an event in Salt Lake City last week, Curtis told a few dozen crypto enthusiasts that he had a conversation a few years ago with some fellow House members about internet service providers and how to incentivize them to boost their offerings. The various lawmakers were throwing around different connection speeds — 50 megabits, 100 megabits — but when Curtis asked whether they'd ever run a speed test, he got puzzling responses.\"They looked at me like I was from another planet,\" Curtis told the crowd at the Permissionless conference.Curtis, 64, said he realized then that lawmakers needed to be smarter about regulations and actually understand the user experience. That's particularly true in crypto, he said.\"This is so important to get government involved, because if they don't understand what you're doing, they'll make really bad decisions,\" the Provo-based congressman said, as the attendees nodded their head in unison. \"The worst part of regulation is its unpredictability.\"Curtis' attitude toward crypto is a big reason why digital coin enthusiasts have filled his coffers in his campaign against Democratic candidate Caroline Gleich, setting him up for what appears to be a landslide victory next month.The Defend American Jobs PAC, a single-issue committee focused on cryptocurrency and blockchain policy, has contributed more than $1.9 million to Curtis' campaign, according to Federal Election Commission data compiled by crypto market and blockchain analyst James Delmore and verified by CNBC. Additionally, the PAC spent more than $1.5 million to oppose Curtis' Republican primary challenger, Trent Staggs.Ben Lucas, Curtis' campaign spokesman, declined an interview on behalf of the congressman. He sent a statement from Corey Newman, the chief of staff, saying that, \"John has always been a strong supporter of the crypto industry as it will help Utah's economy continue to grow and be a great place to create jobs.\" The sprawling and decentralized digital asset industry is backing Curtis and others who are publicly adopting a pro-crypto policy within their campaigns. The crypto industry accounts for nearly half of all donations made by corporations this election cycle as the sector outpaces both the big banks and oil. Of the 42 primary candidates that crypto-backed super PACs supported, they were successful in 36.In total, crypto groups have spent over $130 million in congressional races for this year's election, including the primaries, according to FEC data.Crypto picks its targetsVenture firm Andreessen Horowitz found in its recent State of Crypto report that more than 40 million Americans hold crypto, a group that's young and bipartisan. The report said 51% of them indicated they're likely to throw their weight behind crypto-friendly candidates.Curtis says the best thing the industry can do is police itself, and then come to lawmakers with the right kind of guardrails, striking a balance of safety and security without excessive regulation.Three crypto PACs, which are primarily backed by Coinbase, Ripple, and Andreessen Horowitz, have been targeting competitive Senate and House races across the U.S.Protect Progress has given more than $10 million apiece to Senate candidates in Arizona and Michigan. In Arizona, the group favors Democrat Ruben Gallego, who is vying for the seat being vacated by Kyrsten Sinema. In Michigan, the preferred choice is Elissa Slotkin, who is currently a Democratic House member.U.S. Sen. Elizabeth Warren (D-MA) becomes emotional as the crowd cheers on Day 4 of the Democratic National Convention (DNC) at the United Center in Chicago, Illinois, U.S., August 22, 2024. Kevin Wurm | ReutersThe Republican candidates in Indiana and West Virginia have each received more than $3 million from Defend American Jobs. In Massachusetts, a super PAC for Republican John Deaton has pulled in $2.6 million from the crypto industry. Deaton, however, is polling way behind Democratic Sen. Elizabeth Warren, who is one of the crypto sector's top antagonists in Washington.\"Elizabeth Warren is not going to lose her election in Massachusetts, so the industry can't get rid of Warren,\" said Delmore. \"But they can at least help to vote out candidates who are allied with her against the crypto industry.\"One big target is Ohio Democratic Sen. Sherrod Brown, the chair of the banking committee. Some $40 million of crypto money has been directed at defeating Brown, and one PAC has paid for five ads designed to boost awareness of his Republican rival, Bernie Moreno, a blockchain entrepreneur. The race is currently very close and is crucial in determining which party will control the Senate.In House races, around $3.6 million in crypto PAC money has gone to candidates in Arizona, $5.4 million in New York, more than $4.8 million in Virginia, and $5.7 million in California, with half of that spend going to Republican Michelle Park Steel.Crypto PAC money has been party agnostic and not just focused on battleground districts. The focus is on supporting lawmakers who embrace regulation that favors the technology rather than getting in its way.\"When we talk about digital assets, when we talk about crypto, that is not about Republicans and Democrats,\" said House Majority Whip Rep. Tom Emmer (R-Minn.), at Permissionless. \"That's about Americans, that's about decentralization of a system that has been, literally, consolidated at the top.\"WATCH: Trump family given $337.5 million token stake in new crypto project",
  "image": "https://image.cnbcfm.com/api/v1/image/108050037-1729291501390-AP24284850163032.jpg?v=1729291669\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108050037\" data-test=\"InlineImage\"\u003e\u003cp\u003eU.S. Rep. John Curtis speaks during the Utah Senate primary debate for Republican contenders battling to win the seat of retiring U.S. Sen. Mitt Romney, June 10, 2024, in Salt Lake City.\u003c/p\u003e\u003cp\u003eRick Bowmer | AP\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eSALT LAKE CITY — John Curtis, a Republican congressman from Utah, has become a favorite of the crypto industry in his bid to win the Senate seat held by the departing Mitt Romney. He took a somewhat oblong route through the telecommunications sector to get there.\u003c/p\u003e\u003cp\u003eAt an event in Salt Lake City last week, Curtis told a few dozen crypto enthusiasts that he had a conversation a few years ago with some fellow House members about internet service providers and how to incentivize them to boost their offerings. The various lawmakers were throwing around different connection speeds — 50 megabits, 100 megabits — but when Curtis asked whether they\u0026#39;d ever run a speed test, he got puzzling responses.\u003c/p\u003e\u003cp\u003e\u0026#34;They looked at me like I was from another planet,\u0026#34; Curtis told the crowd at the \u003ca href=\"https://blockworks.co/event/permissionless-iii\" target=\"_blank\"\u003ePermissionless\u003c/a\u003e conference.\u003c/p\u003e\u003cp\u003eCurtis, 64, said he realized then that lawmakers needed to be smarter about regulations and actually understand the user experience. That\u0026#39;s particularly true in crypto, he said.\u003c/p\u003e\u003cp\u003e\u0026#34;This is so important to get government involved, because if they don\u0026#39;t understand what you\u0026#39;re doing, they\u0026#39;ll make really bad decisions,\u0026#34; the Provo-based congressman said, as the attendees nodded their head in unison. \u0026#34;The worst part of regulation is its unpredictability.\u0026#34;\u003c/p\u003e\u003cp\u003eCurtis\u0026#39; attitude toward crypto is a big reason why digital coin enthusiasts have filled his coffers in his campaign against Democratic candidate Caroline Gleich, setting him up for what appears to be a landslide victory next month.\u003c/p\u003e\u003cp\u003eThe Defend American Jobs PAC, a single-issue committee focused on cryptocurrency and blockchain policy, has contributed \u003ca href=\"https://www.fec.gov/data/committee/C00836221/?tab=spending\" target=\"_blank\"\u003emore than $1.9 million\u003c/a\u003e to Curtis\u0026#39; campaign, according to Federal Election Commission data compiled by crypto market and blockchain analyst James Delmore and verified by CNBC. Additionally, the PAC spent \u003ca href=\"https://www.fec.gov/data/committee/C00836221/?tab=spending\" target=\"_blank\"\u003emore than $1.5 million\u003c/a\u003e to oppose Curtis\u0026#39; Republican primary challenger, Trent Staggs.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108050049\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000355318\" aria-labelledby=\"Placeholder-ArticleBody-Video-108050049\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108048102-Screenshot_2024-10-15_at_15032_PM.png?v=1729385079\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"Crypto PAC money backs Utah Senate candidate and others across U.S.\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eBen Lucas, Curtis\u0026#39; campaign spokesman, declined an interview on behalf of the congressman. He sent a statement from Corey Newman, the chief of staff, saying that, \u0026#34;John has always been a strong supporter of the crypto industry as it will help Utah\u0026#39;s economy continue to grow and be a great place to create jobs.\u0026#34; \u003c/p\u003e\u003cp\u003eThe sprawling and decentralized digital asset industry is backing Curtis and others who are publicly adopting a pro-crypto policy within their campaigns. The crypto industry accounts for nearly half of all donations made by corporations this election cycle as the sector outpaces both the big banks and oil. Of the 42 primary candidates that crypto-backed super PACs supported, they were successful in 36.\u003c/p\u003e\u003cp\u003eIn total, crypto groups have spent over $130 million in congressional races for this year\u0026#39;s election, including the primaries, according to FEC data.\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline0\"\u003e\u003c/a\u003eCrypto picks its targets\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003eVenture firm Andreessen Horowitz found in its recent State of Crypto report that more than 40 million Americans hold crypto, a group that\u0026#39;s young and bipartisan. The report said 51% of them indicated they\u0026#39;re likely to throw their weight behind crypto-friendly candidates.\u003c/p\u003e\u003cp\u003eCurtis says the best thing the industry can do is police itself, and then come to lawmakers with the right kind of guardrails, striking a balance of safety and security without excessive regulation.\u003c/p\u003e\u003cp\u003eThree crypto PACs, which are primarily backed by \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-4\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/COIN/\"\u003eCoinbase\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e, Ripple, and Andreessen Horowitz, have been targeting competitive Senate and House races across the U.S.\u003c/p\u003e\u003cp\u003eProtect Progress has given more than $10 million apiece to Senate candidates in Arizona and Michigan. In Arizona, the group favors Democrat Ruben Gallego, who is vying for the seat being vacated by Kyrsten Sinema. In Michigan, the preferred choice is Elissa Slotkin, who is currently a Democratic House member.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"ArticleBody-InlineImage-108024615\" data-test=\"InlineImage\"\u003e\u003cp\u003eU.S. Sen. Elizabeth Warren (D-MA) becomes emotional as the crowd cheers on Day 4 of the Democratic National Convention (DNC) at the United Center in Chicago, Illinois, U.S., August 22, 2024. \u003c/p\u003e\u003cp\u003eKevin Wurm | Reuters\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThe Republican candidates in Indiana and West Virginia have each received more than $3 million from Defend American Jobs. In Massachusetts, a super PAC for Republican John Deaton has pulled in $2.6 million from the crypto industry. Deaton, however, is polling way behind Democratic \u003ca href=\"https://www.cnbc.com/elizabeth-warren/\"\u003eSen. Elizabeth Warren\u003c/a\u003e, who is one of the crypto sector\u0026#39;s top antagonists in Washington.\u003c/p\u003e\u003cp\u003e\u0026#34;Elizabeth Warren is not going to lose her election in Massachusetts, so the industry can\u0026#39;t get rid of Warren,\u0026#34; said Delmore. \u0026#34;But they can at least help to vote out candidates who are allied with her against the crypto industry.\u0026#34;\u003c/p\u003e\u003cp\u003eOne big target is Ohio Democratic \u003ca href=\"https://www.cnbc.com/sherrod-brown/\"\u003eSen. Sherrod Brown\u003c/a\u003e, the chair of the banking committee. Some $40 million of crypto money has been directed at defeating Brown, and one PAC has paid for five ads designed to boost awareness of his Republican rival, Bernie Moreno, a blockchain entrepreneur. The race is currently very close and is crucial in determining which party will control the Senate.\u003c/p\u003e\u003cp\u003eIn House races, around $3.6 million in crypto PAC money has gone to candidates in Arizona, $5.4 million in New York, more than $4.8 million in Virginia, and $5.7 million in California, with half of that spend going to Republican Michelle Park Steel.\u003c/p\u003e\u003cp\u003eCrypto PAC money has been party agnostic and not just focused on battleground districts. The focus is on supporting lawmakers who embrace regulation that favors the technology rather than getting in its way.\u003c/p\u003e\u003cp\u003e\u0026#34;When we talk about digital assets, when we talk about crypto, that is not about Republicans and Democrats,\u0026#34; said House Majority Whip Rep. Tom Emmer (R-Minn.), at Permissionless. \u0026#34;That\u0026#39;s about Americans, that\u0026#39;s about decentralization of a system that has been, literally, consolidated at the top.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWATCH:\u003c/strong\u003e \u003ca href=\"https://www.cnbc.com/video/2024/10/18/trump-family-given-337-point-5-million-token-stake-in-new-crypto-project-document-reveals.html\"\u003eTrump family given $337.5 million token stake in new crypto project\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108049596\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000355169\" aria-labelledby=\"Placeholder-ArticleBody-Video-108049596\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108049597-17292490471729249045-36721992177-1080pnbcnews.jpg?v=1729249046\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"Trump family given $337.5 million token stake in new crypto project, document reveals\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-10-19T11:00:02Z",
  "modifiedTime": "2024-10-19T11:00:02Z"
}
