{
  "id": "620552f0-c1f5-4f21-8fc6-e6a64fcb78dc",
  "title": "Evercore Unfazed: $205 Target Reaffirmed Despite GOOG Underperformance",
  "link": "https://finance.yahoo.com/news/evercore-unfazed-205-target-reaffirmed-182125884.html",
  "description": "",
  "author": "",
  "published": "2025-05-29T18:21:25Z",
  "source": "https://finance.yahoo.com/news/rssindex",
  "categories": null,
  "byline": "Usman Kabir",
  "length": 1805,
  "excerpt": "Evercore ISI recently reiterated an Outperform rating and $205 price target on Alphabet Inc. (NASDAQ:GOOG) shares. Alphabet is a technology company that owns...",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "In This Article: Evercore ISI recently reiterated an Outperform rating and $205 price target on Alphabet Inc. (NASDAQ:GOOG) shares. Alphabet is a technology company that owns and runs the internet search engine Google. In an investor note, the analyst noted that Alphabet shares had traded down following reports that Apple Senior VP of Services Eddy Cue testified that Search volumes in Apple's Safari browser fell for the first time in April and that Apple was actively exploring adding AI Search capabilities to its browser, potentially adding partners like Perplexity and Anthropic. The selloff put shares of Google's parent down a total of 26% since an early February peak, noted the analyst, who will take the other side and be buyers of this correction. Later in the day, Google issued a statement saying: We continue to see overall query growth in Search. That includes an increase in total queries coming from Apple's devices and platforms, notes Evercore. It is plausible that Cue's statement reflects both a very mature low-single digit percentage Search query growth rate and Apple Safari browser share losses, as tracked by statcounter, added the analyst. Alphabet (GOOGL) Stock Rated ‘Buy’ as Chrome Gains on Safari A laptop and phone open to Google's services in an everyday setting. While we acknowledge the potential of GOOG, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an AI stock that is more promising than GOOG and that has 100x upside potential, check out our report about this cheapest AI stock. READ NEXT: 33 Most Important AI Companies You Should Pay Attention To and 30 Best AI Stocks to Buy According to Billionaires Disclosure: None.",
  "image": "https://s.yimg.com/ny/api/res/1.2/3HoCcoUQjH3XT.PrO3zssQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM7Y2Y9d2VicA--/https://media.zenfs.com/en/insidermonkey.com/f2bc799b7e78718a08f74696ea1fcc21",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"nimbus-app\" tabindex=\"-1\"\u003e  \u003carticle\u003e  \u003cdiv\u003e  \u003cdiv data-testid=\"article-content-wrapper\"\u003e\u003ch2\u003eIn This Article: \u003c/h2\u003e   \u003cdiv\u003e   \u003cp\u003eEvercore ISI recently reiterated an Outperform rating and $205 price target on Alphabet Inc. (NASDAQ:GOOG) shares. Alphabet is a technology company that owns and runs the internet search engine Google. In an investor note, the analyst noted that Alphabet shares had traded down following reports that Apple Senior VP of Services Eddy Cue testified that Search volumes in Apple\u0026#39;s Safari browser fell for the first time in April and that Apple was actively exploring adding AI Search capabilities to its browser, potentially adding partners like Perplexity and Anthropic.\u003c/p\u003e      \u003cp\u003eThe selloff put shares of Google\u0026#39;s parent down a total of 26% since an early February peak, noted the analyst, who will take the other side and be buyers of this correction. Later in the day, Google issued a statement saying: We continue to see overall query growth in Search.\u003c/p\u003e   \u003cp\u003eThat includes an increase in total queries coming from Apple\u0026#39;s devices and platforms, notes Evercore. It is plausible that Cue\u0026#39;s statement reflects both a very mature low-single digit percentage Search query growth rate and Apple Safari browser share losses, as tracked by statcounter, added the analyst.\u003c/p\u003e   \u003cfigure\u003e\u003cdiv\u003e \u003cp\u003e\u003cimg src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" alt=\"Alphabet (GOOGL) Stock Rated \u0026amp;#x002018;Buy\u0026amp;#x002019; as Chrome Gains on Safari\" loading=\"eager\" height=\"538\" width=\"960\"/\u003e\u003c/p\u003e\u003c/div\u003e \u003cfigcaption\u003eAlphabet (GOOGL) Stock Rated ‘Buy’ as Chrome Gains on Safari  \u003c/figcaption\u003e \u003c/figure\u003e   \u003cp\u003eA laptop and phone open to Google\u0026#39;s services in an everyday setting.\u003c/p\u003e   \u003cp\u003eWhile we acknowledge the potential of GOOG, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an AI stock that is more promising than GOOG and that has 100x upside potential, check out our report about this \u003ca href=\"https://www.insidermonkey.com/blog/undervalued-ai-stock-poised-for-massive-gains-10000-upside-17/?forcedCTACode=PR4UK\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:cheapest AI stock;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cb\u003echeapest AI stock\u003c/b\u003e\u003c/a\u003e.\u003c/p\u003e   \u003cp\u003e\u003cb\u003eREAD NEXT: \u003ca href=\"https://www.insidermonkey.com/blog/33-most-important-ai-companies-you-should-pay-attention-to-1334012/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:33 Most Important AI Companies You Should Pay Attention To;elm:context_link;itc:0;sec:content-canvas\"\u003e33 Most Important AI Companies You Should Pay Attention To\u003c/a\u003e\u003c/b\u003e\u003cb\u003e and \u003ca href=\"https://www.insidermonkey.com/blog/30-best-ai-stocks-to-buy-according-to-billionaires-1504184/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:30 Best AI Stocks to Buy According to Billionaires;elm:context_link;itc:0;sec:content-canvas\"\u003e30 Best AI Stocks to Buy According to Billionaires\u003c/a\u003e\u003c/b\u003e\u003c/p\u003e   \u003cp\u003eDisclosure: None.\u003c/p\u003e \u003c/div\u003e\u003c/div\u003e     \u003chr/\u003e \u003cul\u003e\u003cli data-testid=\"seamlessscroll-f67870c6-bcbd-38de-9521-431a4273f680\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-8db453a7-8bdf-32c9-bf86-cf3952345594\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-b2b07fbd-5cc3-3c42-8327-db0c69fc6424\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-27e81f5a-8920-33bc-a904-20b19fe36d5b\"\u003e \u003c/li\u003e\u003c/ul\u003e \u003csection\u003e\u003cheader\u003e \u003c/header\u003e   \u003c/section\u003e\u003c/div\u003e\u003c/article\u003e \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-29T18:21:25Z",
  "modifiedTime": null
}
