{
  "id": "6da143ca-11db-40d5-95a7-6cf132217f37",
  "title": "Eastern bankshares announces $30B merger with HarborOne, strengthens Boston market share",
  "link": "https://seekingalpha.com/news/4436032-eastern-bankshares-announces-30b-merger-with-harborone-strengthens-boston-market-share?utm_source=feed_news_all\u0026utm_medium=referral\u0026feed_item_type=news",
  "description": "",
  "author": "",
  "published": "Fri, 25 Apr 2025 19:40:00 -0400",
  "source": "https://seekingalpha.com/market_currents.xml",
  "categories": [
    "ebc"
  ],
  "byline": "SA Transcript Insights Editor",
  "length": 1083,
  "excerpt": "Eastern Bankshares' Q1 2025 earnings call unveils its HarborOne Bancorp merger, boosting assets to $30B.",
  "siteName": "Seeking Alpha",
  "favicon": "https://seekingalpha.com/samw/static/images/favicon-192x192.png",
  "text": "Earnings Call Insights: Eastern Bankshares (EBC) Q1 2025 Management View The company announced a definitive merger agreement with HarborOne Bancorp, a $5.7 billion bank headquartered in Brockton, Massachusetts. This merger positions Eastern as the largest bank headquartered in Massachusetts, with $30 billion in assets and aSeeking Alpha's Disclaimer: The earnings call insights are compilations of earnings call transcripts and other content available on the Seeking Alpha website. The insights are generated by an AI tool and have not been curated or reviewed by editors. Due to inherent limitations in using AI-based tools, the accuracy, completeness, or timeliness of the earnings call insights cannot be guaranteed. Please see full earnings call transcripts here. The earnings call insights are intended for informational purposes only. Seeking Alpha does not take account of your objectives or your financial situation and does not offer any personalized investment advice. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank.",
  "image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-test-id=\"card-container\"\u003e\u003cheader\u003e\u003c/header\u003e\u003cdiv data-test-id=\"content-container\"\u003e\u003cp\u003eEarnings Call Insights: Eastern Bankshares (EBC) Q1 2025\u003c/p\u003e \u003ch3\u003eManagement View\u003c/h3\u003e \u003cul\u003e\u003cli\u003eThe company announced a definitive merger agreement with HarborOne Bancorp, a $5.7 billion bank headquartered in Brockton, Massachusetts. This merger positions Eastern as the largest bank headquartered in Massachusetts, with $30 billion in assets and a\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cstrong\u003eSeeking Alpha\u0026#39;s Disclaimer: \u003c/strong\u003eThe earnings call insights are compilations of earnings call transcripts and other content available on the Seeking Alpha website. The insights are generated by an AI tool and have not been curated or reviewed by editors. Due to inherent limitations in using AI-based tools, the accuracy, completeness, or timeliness of the earnings call insights cannot be guaranteed. Please see full earnings call transcripts \u003ca href=\"https://seekingalpha.com/symbol/EBC/earnings/transcripts\"\u003ehere\u003c/a\u003e. The earnings call insights are intended for informational purposes only. Seeking Alpha does not take account of your objectives or your financial situation and does not offer any personalized investment advice. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-04-25T23:40:00Z",
  "modifiedTime": null
}
