{
  "id": "7c852cff-34b7-4db2-9adc-2bb60d3209bd",
  "title": "Mondee Reschedules Webcast on Third Quarter 2024 Financial Results to November 18, 2024",
  "link": "https://www.investing.com/news/press-releases/mondee-reschedules-webcast-on-third-quarter-2024-financial-results-to-november-18-2024-93CH-3715330",
  "description": "",
  "author": "Investing.com",
  "published": "2024-11-12 01:00:07",
  "source": "https://www.investing.com/rss/news.rss",
  "categories": null,
  "byline": "Investing.com",
  "length": 5417,
  "excerpt": "Mondee Reschedules Webcast on Third Quarter 2024 Financial Results to November 18, 2024",
  "siteName": "Investing.com",
  "favicon": "",
  "text": "AUSTIN, Texas, Nov. 11, 2024 (GLOBE NEWSWIRE) -- Mondee Holdings, Inc. (Nasdaq: MOND) (Mondee or the Company), a leading travel marketplace and artificial intelligence (AI) technology company, announced today that it will hold its webcast on the third quarter 2024 financial results for the period ended September 30, 2024, on Monday, November 18, 2024, instead of Tuesday, November 12, 2024. A release shall accompany the webcast. The Company will host the audio webcast at 5:30 a.m. (PT) / 7:30 a.m. (CT) / 8:30 a.m. (ET) on Monday, November 18, 2024, to present its financial results to the investment community. The webcast will be accessible by visiting the Mondee Investor Relations website at https://investors.mondee.com. A live dial-in is available domestically at +1.833.470.1428 and internationally at +1.404.975.4839 (access code 694084). A replay of the webcast will be available by visiting Mondee's Investor Relations website and an audio replay will be available domestically at +1.866.813.9403 or internationally at +1.929.458.6194 (access code 787273) until Monday, November 25, 2024 at 11:59 p.m. ET. For additional information, please visit: https://investors.mondee.com. About Mondee Holdings, Inc. and SubsidiariesEstablished in 2011, Mondee is a leading travel marketplace and artificial intelligence (AI) technology company with its headquarters based in Austin, Texas. The Company operates 21 offices globally across the United States and Canada, Brazil, Mexico, India, and Greece. Mondee is driving change in the leisure and corporate travel sectors through its broad array of innovative solutions. Available both as an app and through the web, the Company's platform processes over 50 million daily searches and generates a substantial transactional volume annually. Mondee Marketplace includes access to Abhi, one of the most powerful and fully integrated AI travel planning assistants in the market. Mondee's network and marketplace include approximately 65,000 travel experts, 500+ airlines, and over one million hotels and vacation rentals, 30,000 rental car pickup locations, and 50+ cruise lines. The Company also offers packaged solutions and ancillary offerings that serve its global distribution. On July 19, 2022, Mondee became publicly traded on the Nasdaq Global Market under the ticker symbol MOND. For further information, visit: www.mondee.com. Forward-Looking Statements:This press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, as amended. Forward-looking statements can be identified by words such as: believe, could, may, expect, intend, potential, plan, will and similar references to future periods. Examples of forward-looking statements include, among others, statements we make regarding the Company's future growth, performance, business prospects and opportunities, strategies, expectations, future plans and intentions or other future events. Such forward-looking statements are subject to risks, uncertainties, and other factors, which could cause actual results to differ materially from those expressed or implied by such forward-looking statements. Management believes that these forward-looking statements are reasonable as and when made. However, the Company cautions you that these forward-looking statements are subject to risks and uncertainties, most of which are difficult to predict and many of which are beyond the control of the Company. Factors that may cause actual results to differ materially from current expectations include, but are not limited to, the ability to implement business plans and forecasts, the outcome of any legal proceedings that may be instituted against the Company or others and any definitive agreements with respect thereto, the ability of the Company to grow and manage growth profitably, retain management and key employees, and maintain relationships with our distribution network and suppliers, the ability of the Company to maintain compliance with Nasdaq's listing standards, the expected changes to the Company's capital structure, and other risks and uncertainties set forth in the sections entitled Risk Factors and Cautionary Note Regarding Forward-Looking Statements in the Company's Annual Report on Form 10-K for the year ended December 31, 2023 and Quarterly Report on Form 10-Q for the three months ended June 30, 2024 filed with the U.S. Securities and Exchange Commission (the SEC), and in the Company's subsequent filings with the SEC. There may be additional risks that the Company does not presently know of or that the Company currently believes are immaterial that could also cause actual results to differ from those contained in the forward-looking statements. Nothing in this press release should be regarded as a representation by any person that the forward-looking statements set forth herein will be achieved or that any of the contemplated results of such forward-looking statements will be achieved. In light of the significant uncertainties in these forward-looking statements, you should not rely upon forward-looking statements as predictions of future events. Except as required by law, Mondee undertakes no obligation to update publicly any forward-looking statements for any reason. For Further Information, Contact: Public Relationspr@mondee.com Investor Relationsir@mondee.com Source: Mondee Holdings, Inc.",
  "image": "https://i-invdn-com.investing.com/redesign/images/seo/investing_300X300.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article\"\u003e\u003cp\u003eAUSTIN, Texas, Nov.  11, 2024  (GLOBE NEWSWIRE) -- Mondee Holdings, Inc. (Nasdaq: MOND) (Mondee or the Company), a leading travel marketplace and artificial intelligence (AI) technology company, announced today that it will hold its webcast on the third quarter 2024 financial results for the period ended September 30, 2024, on Monday, November 18, 2024, instead of Tuesday, November 12, 2024. A release shall accompany the webcast.\u003c/p\u003e \u003cp\u003eThe Company will host the audio webcast at 5:30 a.m. (PT) / 7:30 a.m. (CT) / 8:30 a.m. (ET) on Monday, November 18, 2024, to present its financial results to the investment community.\u003c/p\u003e \u003cp\u003eThe webcast will be accessible by visiting the Mondee Investor Relations website at https://investors.mondee.com. A live dial-in is available domestically at +1.833.470.1428 and internationally at +1.404.975.4839 (access code 694084).\u003c/p\u003e \u003cp\u003eA replay of the webcast will be available by visiting Mondee\u0026#39;s Investor Relations website and an audio replay will be available domestically at +1.866.813.9403 or internationally at +1.929.458.6194 (access code 787273) until Monday, November 25, 2024 at 11:59 p.m. ET.\u003c/p\u003e \u003cp\u003eFor additional information, please visit: https://investors.mondee.com.\u003c/p\u003e \u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eAbout Mondee Holdings, Inc. and Subsidiaries\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEstablished in 2011, Mondee is a leading travel marketplace and artificial intelligence (AI) technology company with its headquarters based in Austin, Texas. The Company operates 21 offices globally across the United States and Canada, Brazil, Mexico, India, and Greece. Mondee is driving change in the leisure and corporate travel sectors through its broad array of innovative solutions. Available both as an app and through the web, the Company\u0026#39;s platform processes over 50 million daily searches and generates a substantial transactional volume annually. Mondee Marketplace includes access to Abhi, one of the most powerful and fully integrated AI travel planning assistants in the market. Mondee\u0026#39;s network and marketplace include approximately 65,000 travel experts, 500+ airlines, and over one million hotels and vacation rentals, 30,000 rental car pickup locations, and 50+ cruise lines. The Company also offers packaged solutions and ancillary offerings that serve its global distribution. On July 19, 2022, Mondee became publicly traded on the Nasdaq Global Market under the ticker symbol MOND. For further information, visit: www.mondee.com.\u003c/p\u003e\u003c/div\u003e \u003cp\u003e\u003cstrong\u003eForward-Looking Statements:\u003c/strong\u003e\u003cbr/\u003eThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, as amended. Forward-looking statements can be identified by words such as: believe, could, may, expect, intend, potential, plan, will and similar references to future periods. Examples of forward-looking statements include, among others, statements we make regarding the Company\u0026#39;s future growth, performance, business prospects and opportunities, strategies, expectations, future plans and intentions or other future events. Such forward-looking statements are subject to risks, uncertainties, and other factors, which could cause actual results to differ materially from those expressed or implied by such forward-looking statements.\u003c/p\u003e \u003cp\u003eManagement believes that these forward-looking statements are reasonable as and when made. However, the Company cautions you that these forward-looking statements are subject to risks and uncertainties, most of which are difficult to predict and many of which are beyond the control of the Company. Factors that may cause actual results to differ materially from current expectations include, but are not limited to, the ability to implement business plans and forecasts, the outcome of any legal proceedings that may be instituted against the Company or others and any definitive agreements with respect thereto, the ability of the Company to grow and manage growth profitably, retain management and key employees, and maintain relationships with our distribution network and suppliers, the ability of the Company to maintain compliance with Nasdaq\u0026#39;s listing standards, the expected changes to the Company\u0026#39;s capital structure, and other risks and uncertainties set forth in the sections entitled Risk Factors and Cautionary Note Regarding Forward-Looking Statements in the Company\u0026#39;s Annual Report on Form 10-K for the year ended December 31, 2023 and Quarterly Report on Form 10-Q for the three months ended June 30, 2024 filed with the U.S. Securities and Exchange Commission (the SEC), and in the Company\u0026#39;s subsequent filings with the SEC. There may be additional risks that the Company does not presently know of or that the Company currently believes are immaterial that could also cause actual results to differ from those contained in the forward-looking statements.\u003c/p\u003e \u003cp\u003eNothing in this press release should be regarded as a representation by any person that the forward-looking statements set forth herein will be achieved or that any of the contemplated results of such forward-looking statements will be achieved. In light of the significant uncertainties in these forward-looking statements, you should not rely upon forward-looking statements as predictions of future events. Except as required by law, Mondee undertakes no obligation to update publicly any forward-looking statements for any reason.\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eFor Further Information, Contact:\u003c/strong\u003e\u003c/p\u003e \u003cp\u003ePublic Relations\u003cbr/\u003epr@mondee.com\u003c/p\u003e \u003cp\u003eInvestor Relations\u003cbr/\u003eir@mondee.com\u003c/p\u003e  \u003cp\u003eSource: Mondee Holdings, Inc.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-11-12T01:00:07Z",
  "modifiedTime": null
}
