{
  "id": "7f210822-c5eb-40f2-8d3d-10f0adc764fb",
  "title": "In one of Biden’s first speeches since his cancer diagnosis, he says: ‘Real leadership is all about getting personal’",
  "link": "https://fortune.com/2025/07/10/president-joe-biden-leadership-advice/",
  "description": "Biden has historically been praised as an empathetic leader who prides himself in leaning on empathy to build relationships.",
  "author": "Kristen Parisi, HR Brew",
  "published": "Thu, 10 Jul 2025 23:09:00 +0000",
  "source": "https://fortune.com/feed",
  "categories": [
    "Success"
  ],
  "byline": "Kristen Parisi,HR Brew",
  "length": 3206,
  "excerpt": "Biden has historically been praised as an empathetic leader who prides himself in leaning on empathy to build relationships.",
  "siteName": "Fortune",
  "favicon": "https://fortune.com/icons/favicons/apple-touch-icon.png",
  "text": "What does a president understand about company culture and values? Well, it turns out a whole lot, and that, according to former President Biden, should include empathy and understanding employees on a personal level. On July 2, Biden took the stage before a packed room as SHRM’s closing keynote speaker, marking one of his first speeches since his prostate cancer diagnosis in May. “The strength of a team comes down to the individual people on that team, whether they feel valued, or they feel supported,” Biden said, noting that his dad taught him that work is about more than a paycheck. His father believed that work helps people cultivate dignity, respect, and a person’s place in their community. Biden has historically been praised as an empathetic leader who prides himself in leaning on empathy to build relationships. He’s built unlikely connections with political opponents like the late Sens. John McCain and Jesse Helms. Biden decided early in his political career that employees should be able to show up as their whole selves to work. “Too often we try to separate people into categories: their work and their family. We say it’s business, it’s not personal,” he said. “Real leadership is all about getting personal. I’ve known every major head of state I’ve sat down and talked face to face the last 40 years. It’s about [being] connected. It means having empathy.”He believes that leaders should connect personally with their staff, getting to know everything from their birthdays to their families, and asking about them. It’s about “getting a sense of what they deal with every day at home, even the most intense workplace, we can still make time for that kind of human connection.” Biden, who lost his first wife and daughter in a car accident shortly before his first Senate term, said that work shouldn’t stop people from enjoying precious moments with family. “We tell ourselves, we have to be in that meeting. Have to get that report done, take that through. Then we tell ourselves, my wife will understand. My kids will understand…I’ll spend more time with my kids. But deep down, we know we’re kidding ourselves. It does matter for moments you’ll never get back.” When Biden became vice president in 2009 he sent a new memo to staff, explaining the importance of family. “I said…I do not want you to miss important family obligations for work. These include birthdays, anniversaries, weddings, religious ceremonies, graduations, times and needs such as illness and loss,” and ignoring his directive would “disappoint him greatly”. Several times throughout his prepared remarks and interview with SHRM CEO Johnny C. Taylor Jr., Biden spoke about his career and leading through difficult times, but reminded the audience that employees need to know that HR cares for them. “They need to know you care…not just about what they can do for you, but about them, about their families, about their circumstances,” he said. “That’s how you build teams that are willing to give their all for you.”This report was originally published by HR Brew.Introducing the 2025 Fortune 500, the definitive ranking of the biggest companies in America. Explore this year's list.",
  "image": "https://fortune.com/img-assets/wp-content/uploads/2025/07/GettyImages-2222562943-e1752181601669.jpg?resize=1200,600",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-cy=\"article-content\" id=\"article-content\"\u003e\u003cp\u003eWhat does a president understand about company culture and values? Well, it turns out a whole lot, and that, according to former President Biden, should include empathy and understanding employees on a personal level.\u003c/p\u003e\u003cdiv\u003e\n\n\n\n\u003cp\u003eOn July 2, Biden took the stage before a packed room as SHRM’s closing keynote speaker, marking one of his first speeches since his \u003ca href=\"https://www.cbsnews.com/news/biden-speaks-first-time-cancer-diagnosis-delaware/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Go to https://www.cbsnews.com/news/biden-speaks-first-time-cancer-diagnosis-delaware/\"\u003eprostate cancer diagnosis\u003c/a\u003e in May.\n\n\n\n\u003c/p\u003e\u003cp\u003e“The strength of a team comes down to the individual people on that team, whether they feel valued, or they feel supported,” Biden said, noting that his dad taught him that work is about more than a paycheck. His father believed that work helps people cultivate dignity, respect, and a person’s place in their community.\n\n\n\n\u003c/p\u003e\u003cp\u003eBiden has historically been praised as an \u003ca href=\"https://www.forbes.com/sites/johnbaldoni/2020/08/20/how-empathy-defines-joe-biden/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Go to https://www.forbes.com/sites/johnbaldoni/2020/08/20/how-empathy-defines-joe-biden/\"\u003eempathetic leader\u003c/a\u003e who prides himself in leaning on empathy to build relationships. He’s built unlikely connections with political opponents like the late Sens. John McCain and Jesse Helms.\n\n\n\n\u003c/p\u003e\u003cp\u003eBiden decided early in his political career that employees should be able to show up as their whole selves to work. “Too often we try to separate people into categories: their work and their family. We say it’s business, it’s not personal,” he said. “Real leadership is all about getting personal. I’ve known every major head of state I’ve sat down and talked face to face the last 40 years. It’s about [being] connected. It means having empathy.”\u003c/p\u003e\u003cp\u003eHe believes that leaders should connect personally with their staff, getting to know everything from their birthdays to their families, and asking about them. It’s about “getting a sense of what they deal with every day at home, even the most intense workplace, we can still make time for that kind of human connection.”\n\n\n\n\u003c/p\u003e\u003cp\u003eBiden, who lost his first wife and daughter in a car accident shortly before his first Senate term, said that work shouldn’t stop people from enjoying precious moments with family. “We tell ourselves, we have to be in that meeting. Have to get that report done, take that through. Then we tell ourselves, my wife will understand. My kids will understand…I’ll spend more time with my kids. But deep down, we know we’re kidding ourselves. It does matter for moments you’ll never get back.”\n\n\n\n\u003c/p\u003e\u003cp\u003eWhen Biden became vice president in 2009 he sent a new memo to staff, explaining the importance of family. “I said…I do not want you to miss important family obligations for work. These include birthdays, anniversaries, weddings, religious ceremonies, graduations, times and needs such as illness and loss,” and ignoring his directive would “disappoint him greatly”.\n\n\n\n\u003c/p\u003e\u003cp\u003eSeveral times throughout his prepared remarks and interview with SHRM CEO Johnny C. Taylor Jr., Biden spoke about his career and leading through difficult times, but reminded the audience that employees need to know that HR cares for them.\n\n\n\n\u003c/p\u003e\u003cp\u003e“They need to know you care…not just about what they can do for you, but about them, about their families, about their circumstances,” he said. “That’s how you build teams that are willing to give their all for you.”\u003c/p\u003e\u003cp\u003e\u003cem\u003eThis report was \u003ca href=\"https://www.hr-brew.com/stories/2025/07/09/president-biden-reflects-on-leadership-values-and-empathy-in-shrm-closing-session\" target=\"_blank\" rel=\"noopener\" aria-label=\"Go to https://www.hr-brew.com/stories/2025/07/09/president-biden-reflects-on-leadership-values-and-empathy-in-shrm-closing-session\"\u003eoriginally published\u003c/a\u003e by \u003c/em\u003e\u003ca href=\"https://www.hr-brew.com/\" target=\"_blank\" rel=\"noopener\" aria-label=\"Go to https://www.hr-brew.com/\"\u003eHR Brew.\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cstrong\u003eIntroducing the 2025 Fortune 500\u003c/strong\u003e, the definitive ranking of the biggest companies in America. \u003ca href=\"https://fortune.com/ranking/fortune500/?\u0026amp;itm_source=fortune\u0026amp;itm_medium=article_tout\u0026amp;itm_campaign=plea_text\" target=\"_self\" aria-label=\"Go to https://fortune.com/ranking/fortune500/?\u0026amp;itm_source=fortune\u0026amp;itm_medium=article_tout\u0026amp;itm_campaign=plea_text\"\u003eExplore this year\u0026#39;s list.\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
