{
  "id": "80aa5ada-02af-462c-aa3e-42d4f7a1c2ba",
  "title": "Investors ditch US stocks in 'bull crash': Bank of America",
  "link": "https://finance.yahoo.com/news/investors-ditch-us-stocks-in-bull-crash-bank-of-america-151019981.html",
  "description": "",
  "author": "",
  "published": "2025-03-18T15:10:19Z",
  "source": "https://finance.yahoo.com/news/rssindex",
  "categories": null,
  "byline": "Josh Schafer",
  "length": 2732,
  "excerpt": "Investors' bullish stance on US stocks has reversed as concerns over a global trade war have driven equities lower.",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "Unlock stock picks and a broker-level newsfeed that powers Wall Street. In This Article: Investors' uber bullish sentiment for US stocks came to a screeching halt over the past month. Bank of America's latest Global Fund Manager Survey of 171 participants conducted in March showed the biggest monthly drop in investors' allocation to US equities on record, with the allocation falling 40% month-over-month. As recently as December, investors' allocation to US stocks had been at an all-time high. A team of Bank of America strategists led by Michael Hartnett described the move in the March survey as a \"bull crash,\" with investor appetite for US stocks tumbling amid the 10% drawdown in the S\u0026P 500 (^GSPC) over the past month. The rotation went into cash, per Bank of America's survey, not bonds. The swift nature of the correction in the S\u0026P 500 could be seen as a buy sign. But as Hartnett's team points out, the recent market moves are more a flushing out of uber bullishness rather than an obvious catalyst for a contrarian trade. For instance, investors' portfolio allocation to cash rose from 3.5% to 4.1%, the largest one month rise since December 2021. But still cash levels remain well below the more than 6% level seen in October 2022 when Wall Street's consensus call projected an incoming recession. SNP - Delayed Quote USD (^GSPC) At close: March 19 at 4:59:12 PM EDT ^GSPC ^DJI ^IXIC Hartnett wrote the current sentiment levels are nowhere near \"close-your-eyes-and-buy levels.\" And as Wall Street strategists have pointed out recently, part of the reason right now might not be an obvious \"buy the dip\" moment comes back to what sent stocks down in the first place. A chart in BofA's survey shows 55% of respondents believe the biggest risk to markets is that the \"trade war triggers global recession.\" This marked the highest conviction in a risk since the pandemic topped the list in April 2020. But despite a roughly 3% pop in stocks over the past two sessions, not much has changed in the trade war or growth scare story over the past week. Morgan Stanley chief investment officer Mike Wilson told clients on Sunday that \"a tradable rally\" is possible in markets. But Wilson doesn't see a sustainable rally to new record highs \"until the numerous growth headwinds are reversed\" or the Fed resumes interest rate cuts. The next major test for the markets is set for Wednesday with the Federal Reserve's latest policy decision. With markets widely expecting the central bank to hold interest rates steady, investors will focus on any clues about when the central bank could cut rates again. Fed Chair Jerome Powell's press conference is slated for 2:30 p.m. ET Wednesday.",
  "image": "https://s.yimg.com/ny/api/res/1.2/6LosUqxw4zhn_XbKZ8mJyg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-03/5a7ee770-0401-11f0-b4ed-8b203d2e3a41",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"nimbus-app\" tabindex=\"-1\"\u003e  \u003carticle\u003e \u003cdiv\u003e \u003cdiv role=\"heading\" aria-level=\"2\" aria-label=\"Unlock stock picks and a broker-level newsfeed that powers Wall Street.\"\u003e\u003cp\u003e\u003cspan\u003eUnlock stock picks and a broker-level newsfeed that powers Wall Street.\u003c/span\u003e\u003c/p\u003e \u003c/div\u003e  \u003cdiv data-testid=\"article-content-wrapper\"\u003e\u003ch2\u003eIn This Article: \u003c/h2\u003e   \u003cdiv\u003e  \u003cp\u003eInvestors\u0026#39; \u003ca data-i13n=\"cpos:1;pos:1\" href=\"https://finance.yahoo.com/video/wall-street-bullish-cash-levels-145356726.html\" data-ylk=\"slk:uber bullish sentiment;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003euber bullish sentiment\u003c/a\u003e for US stocks came to a screeching halt over the past month.\u003c/p\u003e  \u003cp\u003eBank of America\u0026#39;s latest Global Fund Manager Survey of 171 participants conducted in March showed the biggest monthly drop in investors\u0026#39; allocation to US equities on record, with the allocation falling 40% month-over-month. As \u003ca data-i13n=\"cpos:2;pos:1\" href=\"https://finance.yahoo.com/news/investors-allocation-to-us-stocks-hits-record-high-amid-super-bullish-sentiment-bofa-survey-164349535.html\" data-ylk=\"slk:recently as December;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003erecently as December\u003c/a\u003e, investors\u0026#39; allocation to US stocks had been at an all-time high.\u003c/p\u003e    \u003cp\u003eA team of Bank of America strategists led by Michael Hartnett described the move in the March survey as a \u0026#34;bull crash,\u0026#34; with investor appetite for US stocks tumbling amid the 10% drawdown in the S\u0026amp;P 500 (\u003ca data-i13n=\"cpos:3;pos:1\" href=\"https://finance.yahoo.com/quote/%5EGSPC\" data-ylk=\"slk:^GSPC;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e^GSPC\u003c/a\u003e) over the past month. The rotation went into cash, per Bank of America\u0026#39;s survey, not bonds.\u003c/p\u003e  \u003cp\u003eThe swift nature of the correction in the S\u0026amp;P 500\u003ca data-i13n=\"cpos:4;pos:1\" href=\"https://finance.yahoo.com/news/corrections-usually-dont-amount-to-much-chart-of-the-week-100044475.html\" data-ylk=\"slk:could be seen as a buy sign;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003e could be seen as a buy sign\u003c/a\u003e. But as Hartnett\u0026#39;s team points out, the recent market moves are more a flushing out of uber bullishness rather than an obvious catalyst for a contrarian trade. For instance, investors\u0026#39; portfolio allocation to cash rose from 3.5% to 4.1%, the largest one month rise since December 2021. But still cash levels remain well below the more than 6% level seen in October 2022 when Wall Street\u0026#39;s consensus call projected an incoming recession.\u003c/p\u003e  \u003cdiv data-testid=\"ticker-atom-container\" data-originalrange=\"1mo\"\u003e\u003csection data-testid=\"article-quote-header\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003eSNP - Delayed Quote\u003c/span\u003e  \u003cspan\u003eUSD\u003c/span\u003e  \u003c/span\u003e\u003c/p\u003e\u003csection\u003e\u003ch2\u003e (^GSPC)\u003c/h2\u003e \u003c/section\u003e\u003c/div\u003e \u003csection data-testid=\"quote-price\"\u003e\u003cfin-streamer data-symbol=\"^GSPC\" changeev=\"marketStateChange\" data-field=\"marketState\" data-trend=\"none\" data-value=\"\" active=\"\"\u003e\u003c/fin-streamer\u003e \u003cfin-streamer data-symbol=\"^GSPC\" changeev=\"timeChange\" data-field=\"postMarketTime\" data-trend=\"none\" data-value=\"\" active=\"\"\u003e\u003c/fin-streamer\u003e \u003csection\u003e \u003cp\u003e\u003cspan\u003e\u003cspan\u003eAt close: March 19 at 4:59:12 PM EDT \u003c/span\u003e \u003c/span\u003e \u003c/p\u003e \u003c/section\u003e \u003c/section\u003e \u003c/section\u003e \u003csection data-testid=\"article-chart-container\" data-symbol=\"^GSPC\"\u003e\u003cp\u003e\u003cspan\u003e^GSPC\u003c/span\u003e \u003cspan\u003e^DJI \u003c/span\u003e\u003cspan\u003e^IXIC \u003c/span\u003e\u003c/p\u003e   \u003c/section\u003e\u003c/div\u003e  \u003cp\u003eHartnett wrote the current sentiment levels are nowhere near \u0026#34;close-your-eyes-and-buy levels.\u0026#34;\u003c/p\u003e  \u003cp\u003eAnd as \u003ca data-i13n=\"cpos:5;pos:1\" href=\"https://finance.yahoo.com/news/after-2-day-rally-wall-street-strategists-say-stock-sell-off-has-further-to-go-as-fed-tariff-deadlines-loom-100059261.html\" data-ylk=\"slk:Wall Street strategists have pointed out recently;cpos:5;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003eWall Street strategists have pointed out recently\u003c/a\u003e, part of the reason right now might not be an obvious \u0026#34;buy the dip\u0026#34; moment comes back to what sent stocks down in the first place.\u003c/p\u003e  \u003cp\u003eA chart in BofA\u0026#39;s survey shows 55% of respondents believe the biggest risk to markets is that the \u0026#34;trade war triggers global recession.\u0026#34; This marked the highest conviction in a risk since the pandemic topped the list in April 2020.\u003c/p\u003e      \u003cp\u003eBut despite a roughly 3% pop in stocks over the past two sessions, not much has changed in the trade war or growth scare story over the past week.\u003c/p\u003e  \u003cp\u003eMorgan Stanley chief investment officer Mike Wilson told clients on Sunday that \u0026#34;a tradable rally\u0026#34; is possible in markets. But Wilson doesn\u0026#39;t see a sustainable rally to new record highs \u0026#34;until the numerous growth headwinds are reversed\u0026#34; or the Fed resumes interest rate cuts.\u003c/p\u003e    \u003cp\u003eThe next major test for the markets is set for Wednesday with the Federal Reserve\u0026#39;s latest policy decision. With markets widely expecting the central bank to hold interest rates steady, investors will focus on any clues about when the central bank could cut rates again. Fed Chair Jerome Powell\u0026#39;s press conference is slated for 2:30 p.m. ET Wednesday.\u003c/p\u003e \u003c/div\u003e\u003c/div\u003e    \u003chr/\u003e \u003cul\u003e\u003cli data-testid=\"seamlessscroll-cd254573-39b3-4c6f-845d-a9834130e4e5\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-e3f8ef39-2947-446c-aec2-faef43f9fdbe\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-e2a3d90c-f36c-4ce8-b91f-7fd678fba670\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-31d2c7aa-aa45-414d-b2b8-5ca21868e39a\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-1849a888-0178-4ad3-aabe-6a7680c008fc\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-780e233f-43b8-4499-bf5b-a0c17d876db4\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-b8f36654-d127-4e41-86ca-e7efacfffde4\"\u003e \u003c/li\u003e\u003c/ul\u003e \u003csection\u003e\u003cheader\u003e \u003c/header\u003e   \u003c/section\u003e\u003c/div\u003e\u003c/article\u003e \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-03-18T15:10:19Z",
  "modifiedTime": null
}
