{
  "id": "8c3ddc65-a35f-4d20-bdf3-3538fa8af54a",
  "title": "Readying for IPO, LG hops on to a Hyundai car",
  "link": "https://economictimes.indiatimes.com/markets/ipos/fpos/readying-for-ipo-lg-hops-on-to-a-hyundai-car/articleshow/115786304.cms",
  "description": "Broking firms said companies borrow from each other when setting up their investor sections but these are not made public until they're ready. Another person said it might have been beta testing of the section on the LG India website that went public by mistake.",
  "author": "",
  "published": "Fri, 29 Nov 2024 05:30:02 +0530",
  "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
  "categories": null,
  "byline": "Writankar Mukherjee",
  "length": 2713,
  "excerpt": "Broking firms said companies borrow from each other when setting up their investor sections but these are not made public until they're ready. Another person said it might have been beta testing of the section on the LG India website that went public by mistake.",
  "siteName": "Economic Times",
  "favicon": "",
  "text": "Kolkata: LG Electronics seems to have inadvertently taken more than a leaf out of Hyundai Motor's book. The consumer electronics company is studying the India market for an initial public offering (IPO), following in the footsteps of Hyundai Motor India (HMIL), which listed last month. Possibly toward this end, LG Electronics India has created an investor relations section on its local website. With both having South Korean chaebols as parents, there are undoubtedly a lot of similarities in the processes to be followed. But it so happens that the LG investor relations section has been populated with information related to HMIL, at least at the time of filing this story. Cut-and-paste wasn't followed by search-and-replace it appears. LG and HMIL didn't respond to queries. The site features documents and details that HMIL had used for its record IPO last month. It even lists Kancheepuram in Tamil Nadu as the address of LG India's registered office and factory. This is actually the registered office and factory address of HMIL. Even the phone number mentioned is that of HMIL's Kancheepuram office. LG India's registered office is in New Delhi.AgenciesBroking firms said companies borrow from each other when setting up their investor sections but these are not made public until they're ready. Another person said it might have been beta testing of the section on the LG India website that went public by mistake. \"South Korean companies do follow each other. LG is considering an IPO in India due to Hyundai's public listing. It's no surprise they are also building the website in Hyundai footsteps,\" said a senior analyst at a leading brokerage. Hyundai, Kia, LG, Samsung and other South Korean companies have similar organisational structures and sales strategies. LG Electronics' global chief executive had said in August the company is evaluating a share sale of its wholly-owned subsidiary in India. There have been media reports that LG India has appointed a battery of merchant bankers for the Indian IPO, some of whom were also used by Hyundai such as Citigroup, JPMorgan and Morgan Stanley. Hyundai's IPO was the largest ever in India with the company raising $3.3 billion, the first such share sale by the Indian unit of a South Korean company. As per news reports, the LG IPO is expected early next year with the company seeking to raise $1-₹1.5 billion, giving the Indian entity a valuation of about $13 billion.LG Electronics is about to set up its third factory in India with an investment of ₹5,000 crore and also plans to get its South Korean and Chinese component suppliers to set up plants locally. Part of the IPO proceeds might be used for the factory, industry executives said.",
  "image": "https://img.etimg.com/thumb/msid-115786315,width-1200,height-630,imgsize-63006,overlay-etmarkets/articleshow.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-brcount=\"12\"\u003e\u003cp\u003eKolkata: LG Electronics seems to have inadvertently taken more than a leaf out of Hyundai Motor\u0026#39;s book. The consumer electronics company is studying the India market for an initial public offering (IPO), following in the footsteps of Hyundai Motor India (HMIL), which listed last month. Possibly toward this end, LG Electronics India has created an investor relations section on its local website. With both having South Korean chaebols as parents, there are undoubtedly a lot of similarities in the processes to be followed. But it so happens that the LG investor relations section has been populated with information related to HMIL, at least at the time of filing this story. Cut-and-paste wasn\u0026#39;t followed by search-and-replace it appears. \u003c/p\u003e\u003cp\u003eLG and HMIL didn\u0026#39;t respond to queries. The site features documents and details that HMIL had used for its record IPO last month. It even lists Kancheepuram in Tamil Nadu as the address of LG India\u0026#39;s registered office and factory. This is actually the registered office and factory address of HMIL. Even the phone number mentioned is that of HMIL\u0026#39;s Kancheepuram office. LG India\u0026#39;s registered office is in New Delhi.\u003c/p\u003e\u003cdiv data-align=\"\" data-msid=\"115786326\" data-type=\"image\"\u003e\u003cfigure\u003e\u003cimg title=\"Readying for IPO, LG Hops on to a Hyundai Car\" alt=\"Readying for IPO, LG Hops on to a Hyundai Car\" src=\"https://img.etimg.com/photo/msid-115786326/readying-for-ipo-lg-hops-on-to-a-hyundai-car.jpg\" data-msid=\"115786326\" data-original=\"https://img.etimg.com/photo/msid-115786326/readying-for-ipo-lg-hops-on-to-a-hyundai-car.jpg\"/\u003e\u003cspan\u003eAgencies\u003c/span\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eBroking firms said companies borrow from each other when setting up their investor sections but these are not made public until they\u0026#39;re ready. Another person said it might have been beta testing of the section on the LG India website that went public by mistake. \u003c/p\u003e\u003cp\u003e\u0026#34;South Korean companies do follow each other. LG is considering an IPO in India due to Hyundai\u0026#39;s public listing. It\u0026#39;s no surprise they are also building the website in Hyundai footsteps,\u0026#34; said a senior analyst at a leading brokerage. Hyundai, Kia, LG, Samsung and other South Korean companies have similar organisational structures and sales strategies. \u003c/p\u003e\u003cp\u003eLG Electronics\u0026#39; global chief executive had said in August the company is evaluating a share sale of its wholly-owned subsidiary in India. There have been media reports that LG India has appointed a battery of merchant bankers for the Indian IPO, some of whom were also used by Hyundai such as Citigroup, JPMorgan and Morgan Stanley. Hyundai\u0026#39;s IPO was the largest ever in India with the company raising $3.3 billion, the first such share sale by the Indian unit of a South Korean company. As per news reports, the LG IPO is expected early next year with the company seeking to raise $1-₹1.5 billion, giving the Indian entity a valuation of about $13 billion.\u003c/p\u003e\u003cp\u003eLG Electronics is about to set up its third factory in India with an investment of ₹5,000 crore and also plans to get its South Korean and Chinese component suppliers to set up plants locally. Part of the IPO proceeds might be used for the factory, industry executives said. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-29T05:30:00+05:30",
  "modifiedTime": null
}
