{
  "id": "8c9cc0d7-25e3-4e56-b017-51a71a67bc6a",
  "title": "Guidewire Software's president John P. Mullen sells $1.23 million in stock",
  "link": "https://www.investing.com/news/insider-trading-news/guidewire-softwares-president-john-p-mullen-sells-123-million-in-stock-93CH-3780831",
  "description": "",
  "author": "Investing.com",
  "published": "2024-12-19 00:48:43",
  "source": "https://www.investing.com/rss/news.rss",
  "categories": null,
  "byline": "Investing.com",
  "length": 2117,
  "excerpt": "Guidewire Software's president John P. Mullen sells $1.23 million in stock",
  "siteName": "Investing.com",
  "favicon": "",
  "text": "The sale was conducted to cover taxes associated with the settlement of Restricted Stock Units. Following this transaction, Mullen (NASDAQ:) holds 182,096 shares directly. According to InvestingPro, Guidewire (NYSE:) maintains a \"GOOD\" financial health rating, with 12 additional key insights available to subscribers through the comprehensive Pro Research Report. According to InvestingPro, Guidewire maintains a \"GOOD\" financial health rating, with 12 additional key insights available to subscribers through the comprehensive Pro Research Report. The sale was conducted to cover taxes associated with the settlement of Restricted Stock Units. Following this transaction, Mullen holds 182,096 shares directly. In other recent news, Guidewire Software (ETR:) has been a focal point for financial analysts following significant developments within the company. The firm's shareholders approved crucial proposals, including the compensation of executive officers and the 2024 Employee Stock Purchase Plan. The company also showcased a strong financial position, with a current ratio of 2.66 and a 12.92% growth in revenue over the last year, according to an analysis by InvestingPro. Guidewire has also been the subject of various analysts' reports. DA Davidson upgraded its price target for Guidewire, maintaining a Buy rating, following a robust fiscal first-quarter performance and the revision of fiscal 2025 financial guidance. Conversely, BofA Securities maintained its Underperform rating on Guidewire, despite the company's solid performance and a gross margin expansion to 60.8%. RBC Capital Markets and Stifel also adjusted their price targets for Guidewire. RBC cited the company's strong financial performance and the closing of five Tier-1 cloud deals as reasons for the upgrade, while Stifel noted Guidewire's strong start to the fiscal year, highlighted by nine cloud deals, including five with Tier 1 clients. These are the latest in a series of recent developments for Guidewire Software. This article was generated with the support of AI and reviewed by an editor. For more information see our T\u0026C.",
  "image": "https://i-invdn-com.investing.com/news/World_News_9_800x533_L_1420026261.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article\"\u003e\u003cp\u003eThe sale was conducted to cover taxes associated with the settlement of Restricted Stock Units. Following this transaction, Mullen (NASDAQ:) holds 182,096 shares directly. According to \u003ca href=\"https://www.investing.com/pro/GWRE\"\u003eInvestingPro\u003c/a\u003e, Guidewire (NYSE:) maintains a \u0026#34;GOOD\u0026#34; financial health rating, with 12 additional key insights available to subscribers through the comprehensive Pro Research Report. According to \u003ca href=\"https://www.investing.com/pro/GWRE\"\u003eInvestingPro\u003c/a\u003e, Guidewire maintains a \u0026#34;GOOD\u0026#34; financial health rating, with 12 additional key insights available to subscribers through the comprehensive Pro Research Report. The sale was conducted to cover taxes associated with the settlement of Restricted Stock Units. Following this transaction, Mullen holds 182,096 shares directly.\u003c/p\u003e\n\u003cp\u003eIn other recent news, Guidewire \u003cspan itemscope=\"\" itemtype=\"http://schema.org/Corporation\"\u003e\u003cspan itemprop=\"name\"\u003e Software \u003c/span\u003e\u003c/span\u003e (ETR:) has been a focal point for financial analysts following significant developments within the company. The firm\u0026#39;s shareholders approved crucial proposals, including the compensation of executive officers and the 2024 Employee Stock Purchase Plan. The company also showcased a strong financial position, with a current ratio of 2.66 and a 12.92% growth in revenue over the last year, according to an analysis by InvestingPro.\u003c/p\u003e\n\u003cp\u003eGuidewire has also been the subject of various analysts\u0026#39; reports. DA Davidson upgraded its price target for Guidewire, maintaining a Buy rating, following a robust fiscal first-quarter performance and the revision of fiscal 2025 financial guidance. Conversely, BofA Securities maintained its Underperform rating on Guidewire, despite the company\u0026#39;s solid performance and a gross margin expansion to 60.8%.\u003c/p\u003e\n\u003cp\u003eRBC Capital Markets and Stifel also adjusted their price targets for Guidewire. RBC cited the company\u0026#39;s strong financial performance and the closing of five Tier-1 cloud deals as reasons for the upgrade, while Stifel noted Guidewire\u0026#39;s strong start to the fiscal year, highlighted by nine cloud deals, including five with Tier 1 clients. These are the latest in a series of recent developments for Guidewire Software.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis article was generated with the support of AI and reviewed by an editor. For more information see our T\u0026amp;C.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-12-19T00:48:43Z",
  "modifiedTime": null
}
