{
  "id": "9e30ce0e-e8dd-4f54-96f6-20d553a863de",
  "title": "Samsung India executives seek to quash $81 million penalty over tax evasion",
  "link": "https://www.business-standard.com/companies/news/samsung-india-executives-seek-to-quash-81-million-penalty-over-tax-evasion-125052801448_1.html",
  "description": "The Indian tax authority in January found Samsung and its executives evaded tariffs by misclassifying imports of key mobile tower equipment from 2018 to 2021",
  "author": "",
  "published": "Wed, 28 May 2025 23:29:07 +0530",
  "source": "https://www.business-standard.com/rss/home_page_top_stories.rss",
  "categories": null,
  "byline": "Reuters",
  "length": 2564,
  "excerpt": "The Indian tax authority in January found Samsung and its executives evaded tariffs by misclassifying imports of key mobile tower equipment from 2018 to 2021",
  "siteName": "Business Standard",
  "favicon": "https://www.business-standard.com/android-chrome-192x192-min.png",
  "text": "Seven Samsung India executives have asked a court to revoke penalties of $81 million included in New Delhi's $601-million tax demand from the company for allegedly misclassifying some imports, arguing \"no grave offence\" had been committed, according to legal papers and a source. The Indian tax authority in January found Samsung and its executives evaded tariffs by misclassifying imports of key mobile tower equipment from 2018 to 2021. Samsung has separately challenged the order before a tax appeals tribunal, where it has defended its declarations and denied any wrongdoing. While Samsung's India unit faced a $520 million demand, employees were asked to pay penalties totaling $81 million for \"knowingly and intentionally\" playing a role in the misclassification of imports. In a High Court filing in Mumbai which was not made public but was seen by Reuters, Samsung India logistics executive Ravi Chadha said the authorities issued the penalty within two to three days of receiving hundreds of pages of detailed responses from the company and its executives in January, and the process was \"rushed\". \"This timeframe is utterly insufficient to conduct the requisite in-depth study,\" read the filing by Chadha, who faces a fine of 950 million rupees ($11.1 million).Also Read \"The present case is limited to the interpretation of tariff entries, no grave offence has been committed.\" Samsung India and Chadha did not respond to Reuters queries. India's tax authority did not respond immediately to requests for comment. Online court records show the six other executives including the network division's vice president, Sung Beam Hong, a general manager for finance, Sheetal Jain, and Samsung's general manager for indirect taxes, Nikhil Aggarwal, have also challenged the tax authority's order. The lawyer for all seven executives, Sriram Sridharan of Indian law firm Lakshmikumaran \u0026 Sridharan, did not immediately respond to a request for comment. The law firm also represents Samsung in the tax appeals tribunal challenge. Their pleas and grounds for revoking the penalty are identical to Chadha's, said a source with direct knowledge of the ongoing lawsuits. In his court filing, Chadha argued that the \"egregiously exorbitant\" penalty is impossible for any salaried employee to bear, and it would take him more than 100 years to settle the amount given his earnings.(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)",
  "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2025-04/25/thumb/fitandfill/1200X630/1745572975-7101.JPG",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"parent_top_div\"\u003e\u003cp\u003e\n\tSeven Samsung India executives have asked a court to revoke penalties of $81 million included in New Delhi\u0026#39;s $601-million tax demand from the company for allegedly misclassifying some imports, arguing \u0026#34;no grave offence\u0026#34; had been committed, according to legal papers and a source.\u003c/p\u003e\n\u003cp\u003e\n\tThe Indian tax authority in January found Samsung and its executives evaded tariffs by misclassifying imports of key mobile tower equipment from 2018 to 2021. Samsung has separately challenged the order before a tax appeals tribunal, where it has defended its declarations and denied any wrongdoing.\u003c/p\u003e\n\u003cp\u003e\n\tWhile Samsung\u0026#39;s India unit faced a $520 million demand, employees were asked to pay penalties totaling $81 million for \u0026#34;knowingly and intentionally\u0026#34; playing a role in the misclassification of imports.\u003c/p\u003e\n\u003cp\u003e\n\tIn a High Court filing in Mumbai which was not made public but was seen by Reuters, Samsung India logistics executive Ravi Chadha said the authorities issued the penalty within two to three days of receiving hundreds of pages of detailed responses from the company and its executives in January, and the process was \u0026#34;rushed\u0026#34;.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;This timeframe is utterly insufficient to conduct the requisite in-depth study,\u0026#34; read the filing by Chadha, who faces a fine of 950 million rupees ($11.1 million).\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ch3\u003e\u003cspan\u003eAlso Read\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\n\t\u0026#34;The present case is limited to the interpretation of tariff entries, no grave offence has been committed.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\n\tSamsung India and Chadha did not respond to Reuters queries. India\u0026#39;s tax authority did not respond immediately to requests for comment.\u003c/p\u003e\n\u003cp\u003e\n\tOnline court records show the six other executives including the network division\u0026#39;s vice president, Sung Beam Hong, a general manager for finance, Sheetal Jain, and Samsung\u0026#39;s general manager for indirect taxes, Nikhil Aggarwal, have also challenged the tax authority\u0026#39;s order.\u003c/p\u003e\n\u003cp\u003e\n\tThe lawyer for all seven executives, Sriram Sridharan of Indian law firm Lakshmikumaran \u0026amp; Sridharan, did not immediately respond to a request for comment. The law firm also represents Samsung in the tax appeals tribunal challenge.\u003c/p\u003e\n\u003cp\u003e\n\tTheir pleas and grounds for revoking the penalty are identical to Chadha\u0026#39;s, said a source with direct knowledge of the ongoing lawsuits.\u003c/p\u003e\n\u003cp\u003e\n\tIn his court filing, Chadha argued that the \u0026#34;egregiously exorbitant\u0026#34; penalty is impossible for any salaried employee to bear, and it would take him more than 100 years to settle the amount given his earnings.\u003c/p\u003e\u003c/div\u003e\u003cp id=\"auto_disclaimer\"\u003e(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-28T23:28:52+05:30",
  "modifiedTime": null
}
