{
  "id": "b8424fe1-94f4-4968-9c0b-2be61dfdeeec",
  "title": "Trade war fallout: Cancellations of Chinese freight ships begin as bookings plummet",
  "link": "https://www.cnbc.com/2025/04/16/trade-war-fallout-china-freight-ship-decline-begins-orders-plummet.html",
  "description": "Canceled freight vessel sailings from China are up and will ripple through the supply chain as the trade war impact on the global economy intensifies.",
  "author": "",
  "published": "Wed, 16 Apr 2025 18:52:29 GMT",
  "source": "https://www.cnbc.com/id/100003114/device/rss/rss.html",
  "categories": null,
  "byline": "Lori Ann LaRocco",
  "length": 6991,
  "excerpt": "Canceled freight vessel sailings from China are up and will ripple through the supply chain as the trade war impact on the global economy intensifies.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "Aerial view of the import and export container terminal of Longtan Port on December 26, 2024 in Nanjing, Jiangsu Province of China.China News Service | China News Service | Getty ImagesU.S. importers are being notified of an increase in canceled sailings by freight ships out of China as ocean carriers try to balance the pullback in orders resulting from President Trump's tariffs and the escalation of tensions in the trade war.A total of 80 blank, or canceled, sailings out of China have been recorded by freight company HLS Group. It wrote in a recent note to clients that with the trade war between China and the U.S. leading to a demand plummet, carriers have started to suspend or adjust transpacific services.Major ocean freight alliance ONE has \"suspended until further notice\" a route it had previously been planning to bring back in May, which would include ports of Qingdao, Ningbo, Shanghai, Pusan, Vancouver, and Tacoma. Meanwhile, an existing route is planning to cancel its port call at Wilmington, North Carolina.The impact of the diminished freight container traffic to North America will be significant for many links in the economy and supply chain, including the ports and logistics companies moving the freight. If each sailing was carrying 8,000 to 10,000 TEUs (twenty-foot equivalent units), that would equal a decline in freight traffic of between 640,000-800,000 containers, and lead to decreased crane operations at the ports, lower fees that could be collected, and declines in container pick-ups and transports by trucks, rails, and to warehouses for storage.The World Trade Organization warned on Wednesday that the outlook for global trade has \"deteriorated sharply\" in the wake of Trump's tariffs plan. JB Hunt shares hit their lowest level since November 2020 after commentary during the trucking company's earnings call about the uncertainty from tariffs.\"We have no way of knowing how significant this drop in orders will be on vessel schedules,\" said Alan Murphy, CEO of Sea-Intelligence. \"There are no models to extrapolate this. What I can tell you is the majority of containers on the vessels servicing the Asia to U.S. trade routes is China. We won't go to zero containers, but we will see a decrease in containers and as a result, in the future, we will see a massive raft of blank sailings announced.\"China accounts for approximately 30% of all U.S. containerized imports (down from 37% in 2018), but accounts for approximately 54% of all U.S. containerized imports from Asia (down from 67% in 2018).Bruce Chan, director of global logistics \u0026 future mobility for Stifel, said the tariff policy has created significant uncertainty with respect to consumer demand, and retailers have been positioning their businesses conservatively with inventory, especially given \"scar tissue\" from the recent overstock after the post-Covid supply chain squeeze from 2021-2022. \"That uncertainty is beginning to manifest in blanked container ship sailings on core eastbound transpacific lanes, in our view, opening the potential for a double-digit decline in inbound containerized imports as early as next month,\" he said.Booking volumes from the last week of March to first week of April across global and U.S. trade lanes plummeted. There were sharp decreases in bookings across several categories, including apparel \u0026 accessories; and wool, fabrics \u0026 textiles, both down over 50%. Major product categories from China that are moved in containers include apparel, toys, furniture, and sports equipment, all of which are subject to steep tariffs.As a result of the decrease in containers, ocean carriers will not only cancel vessels, but also adjust or cancel vessel routes commonly called \"vessel strings,\" such as the ONE service from China to Vancouver and Tacoma. These routes dedicating vessels to move the ocean freight at specific ports take months of planning. The elimination of vessels also impacts U.S. exports bound for Asia and relying on ships traveling in both directions.Ocean carriers need to move full vessels to generate a return on investment, but it is not in their best interest to use large vessels if they cannot be filled. To ensure vessels are used at full capacity, carriers have a number of ways to alter the vessel strings. Stretching out ship arrivals by canceling sailings is an option for container volume to better match capacity. According to Murphy, 99% of vessel services are weekly and it takes a vessel approximately seven weeks to make a round trip.\"During Covid, ocean carriers parked their vessels for maintenance,\" Murphy said. \"Ocean carriers can also blank (cancel) a sailing, omit vessel strings entirely, use smaller vessels, or slow steam the vessels where they are traveling longer.\"These measures will cut the available vessel capacity for containers, according to Murphy, which helps remaining ships to be filled, with uncertain implications for overall pricing in the ocean freight business. While a decline in sailings could lead to a drop in prices, during Covid, blank sailings were identified by shippers around the world as a reason for container rates that spiked as high as $30,000. In that case, shippers say the ocean carriers canceled sailings for longer than needed.Vietnam continues to gain on ChinaThe global supply chain demand and pricing situation remains fluid and subject to sharp short-term swings tied to tariffs policy. As Chinese trade comes under strain, a key metric in ocean freight rates shows Vietnam surging in early April.The \"mid-low\" ocean rates, which represent the costs of shipping goods for a larger-sized shipper on a particular ocean route, have jumped by 43% since March 30 for Vietnam. Xeneta calculates the market mid-low and market mid-high segments by looking at the values of the 25 and 75 percentiles of a trade lane rate.\"The fact that the lower end of the market has been rising shows the heat is on,\" said Peter Sand, chief analyst at Xeneta. He said that is continuing after Trump's decision to pause what he called \"reciprocal\" tariffs on countries other than China for 90 days.\"Shippers large and small all have to pay up for frontloading, as the 'pause' made the pulling forward of freight possible again,\" Sand added.This demand from U.S. shippers importing goods can be seen in the increase in container shipping spot rates on the Ho Chi Minh City to Los Angeles ports route, jumping by 24% going into April.According to data compiled by Xeneta for 2025, the spread between China's largest container port, Shanghai, and Vietnam's largest container port, Ho Chi Minh City, has also narrowed per forty-foot equivalent unit (FEU) for shipments to the ports of LA and Long Beach.Even with increased costs for shippers, they will continue to bring in imports from non-China nations because the situation remains highly unpredictable, Sand said. \"There is every possibility the higher tariffs come into effect 90 days from now or even at an earlier stage,\" he added.",
  "image": "https://image.cnbcfm.com/api/v1/image/108084402-1736447375007-gettyimages-2191474671-vcg111538748527.jpeg?v=1744819797\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"SpecialReportArticle-ArticleBody-6\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"SpecialReportArticle-articleBody-6-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108084402\" data-test=\"InlineImage\"\u003e\u003cp\u003eAerial view of the import and export container terminal of Longtan Port on December 26, 2024 in Nanjing, Jiangsu Province of China.\u003c/p\u003e\u003cp\u003eChina News Service | China News Service | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eU.S. importers are being notified of an increase in canceled sailings by freight ships out of China as ocean carriers try to balance the pullback in orders resulting from \u003ca href=\"https://www.cnbc.com/2025/04/10/trumps-triple-digit-tariff-essentially-cuts-off-most-trade-with-china-says-economist.html\"\u003ePresident Trump\u0026#39;s tariffs\u003c/a\u003e and the \u003ca href=\"https://www.cnbc.com/2025/04/16/global-trade-outlook-for-2025-has-deteriorated-sharply-wto-warns.html\"\u003eescalation of tensions\u003c/a\u003e in the trade war.\u003c/p\u003e\u003cp\u003eA total of 80 blank, or canceled, sailings out of China have been recorded by freight company HLS Group. It wrote in a recent note to clients that with the trade war between China and the U.S. leading to a demand plummet, carriers have started to suspend or adjust transpacific services.\u003c/p\u003e\u003cp\u003eMajor ocean freight alliance ONE has \u0026#34;suspended until further notice\u0026#34; a route it had previously been planning to bring back in May, which would include ports of Qingdao, Ningbo, Shanghai, Pusan, Vancouver, and Tacoma. Meanwhile, an existing route is planning to cancel its port call at Wilmington, North Carolina.\u003c/p\u003e\u003cp\u003eThe impact of the diminished freight container traffic to North America will be significant for many links in the economy and supply chain, including the ports and logistics companies moving the freight. If each sailing was carrying 8,000 to 10,000 TEUs (twenty-foot equivalent units), that would equal a decline in freight traffic of between 640,000-800,000 containers, and lead to decreased crane operations at the ports, lower fees that could be collected, and declines in container pick-ups and transports by trucks, rails, and to warehouses for storage.\u003c/p\u003e\u003cp\u003eThe World Trade Organization warned on Wednesday that\u003cstrong\u003e \u003c/strong\u003ethe outlook for global trade has \u0026#34;deteriorated sharply\u0026#34; in the wake of Trump\u0026#39;s tariffs plan. JB Hunt shares hit their lowest level since November 2020 after commentary during the trucking company\u0026#39;s earnings call about the uncertainty from tariffs.\u003c/p\u003e\u003cp\u003e\u0026#34;We have no way of knowing how significant this drop in orders will be on vessel schedules,\u0026#34; said Alan Murphy, CEO of Sea-Intelligence. \u0026#34;There are no models to extrapolate this. What I can tell you is the majority of containers on the vessels servicing the Asia to U.S. trade routes is China. We won\u0026#39;t go to zero containers, but we will see a decrease in containers and as a result, in the future, we will see a massive raft of blank sailings announced.\u0026#34;\u003c/p\u003e\u003cp\u003eChina accounts for approximately 30% of all U.S. containerized imports (down from 37% in 2018), but accounts for approximately 54% of all U.S. containerized imports from Asia (down from 67% in 2018).\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eBruce Chan, director of global logistics \u0026amp; future mobility for Stifel, said the tariff policy has created significant uncertainty with respect to consumer demand, and retailers have been positioning their businesses conservatively with inventory, especially given \u0026#34;scar tissue\u0026#34; from the recent overstock after the post-Covid supply chain squeeze from 2021-2022. \u0026#34;That uncertainty is beginning to manifest in blanked container ship sailings on core eastbound transpacific lanes, in our view, opening the potential for a double-digit decline in inbound containerized imports as early as next month,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eBooking volumes from the last week of March to first week of April across global and U.S. trade lanes plummeted. There were sharp decreases in bookings across several categories, including apparel \u0026amp; accessories; and wool, fabrics \u0026amp; textiles, both down over 50%. Major product categories from China that are moved in containers include apparel, toys, furniture, and sports equipment, all of which are subject to steep tariffs.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAs a result of the decrease in containers, ocean carriers will not only cancel vessels, but also adjust or cancel vessel routes commonly called \u0026#34;vessel strings,\u0026#34; such as the ONE service from China to Vancouver and Tacoma. These routes dedicating vessels to move the ocean freight at specific ports take months of planning. The elimination of vessels also impacts U.S. exports bound for Asia and relying on ships traveling in both directions.\u003c/p\u003e\u003cp\u003eOcean carriers need to move full vessels to generate a return on investment, but it is not in their best interest to use large vessels if they cannot be filled. To ensure vessels are used at full capacity, carriers have a number of ways to alter the vessel strings. Stretching out ship arrivals by canceling sailings is an option for container volume to better match capacity. According to Murphy, 99% of vessel services are weekly and it takes a vessel approximately seven weeks to make a round trip.\u003c/p\u003e\u003cp\u003e\u0026#34;During Covid, ocean carriers parked their vessels for maintenance,\u0026#34; Murphy said. \u0026#34;Ocean carriers can also blank (cancel) a sailing, omit vessel strings entirely, use smaller vessels, or slow steam the vessels where they are traveling longer.\u0026#34;\u003c/p\u003e\u003cp\u003eThese measures will cut the available vessel capacity for containers, according to Murphy, which helps remaining ships to be filled, with uncertain implications for overall pricing in the ocean freight business. While a decline in sailings could lead to a drop in prices, during Covid, blank sailings were identified by shippers around the world as a reason for container rates that spiked as high as $30,000. In that case, shippers say the ocean carriers canceled sailings for longer than needed.\u003c/p\u003e\u003ch3\u003eVietnam continues to gain on China\u003c/h3\u003e\u003cp\u003eThe global supply chain demand and pricing situation remains fluid and subject to sharp short-term swings tied to tariffs policy. As Chinese trade comes under strain, a key metric in ocean freight rates shows \u003ca href=\"https://www.cnbc.com/video/2025/04/12/us-china-trade-war-threatens-the-rise-of-vietnam-economy.html\"\u003eVietnam surging\u003c/a\u003e in early April.\u003c/p\u003e\u003cp\u003eThe \u0026#34;mid-low\u0026#34; ocean rates, which represent the costs of shipping goods for a larger-sized shipper on a particular ocean route, have jumped by 43% since March 30 for Vietnam. Xeneta calculates the market mid-low and market mid-high segments by looking at the values of the 25 and 75 percentiles of a trade lane rate.\u003c/p\u003e\u003cp\u003e\u0026#34;The fact that the lower end of the market has been rising shows the heat is on,\u0026#34; said Peter Sand, chief analyst at Xeneta. He said that is continuing after Trump\u0026#39;s decision to pause what he called \u0026#34;reciprocal\u0026#34; tariffs on countries other than China for 90 days.\u003c/p\u003e\u003cp\u003e\u0026#34;Shippers large and small all have to pay up for frontloading, as the \u0026#39;pause\u0026#39; made the pulling forward of freight possible again,\u0026#34; Sand added.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThis demand from U.S. shippers importing goods can be seen in the increase in container shipping spot rates on the Ho Chi Minh City to Los Angeles ports route, jumping by 24% going into April.\u003c/p\u003e\u003cp\u003eAccording to data compiled by Xeneta for 2025, the spread between China\u0026#39;s largest container port, Shanghai, and Vietnam\u0026#39;s largest container port, Ho Chi Minh City, has also narrowed per forty-foot equivalent unit (FEU) for shipments to the ports of LA and Long Beach.\u003c/p\u003e\u003cp\u003eEven with increased costs for shippers, they will continue to bring in imports from non-China nations because the situation remains highly unpredictable, Sand said. \u0026#34;There is every possibility the higher tariffs come into effect 90 days from now or even at an earlier stage,\u0026#34; he added.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108129400\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000372402\" aria-labelledby=\"Placeholder-ArticleBody-Video-108129400\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108129408-4ED1-REQ-040925-SIMONCOHEN.jpg?v=1744224000\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"Fear is not good for the markets, says Henco Global\u0026#39;s Simon Cohen\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-04-16T17:38:40Z",
  "modifiedTime": "2025-04-16T18:52:29Z"
}
