{
  "id": "c0a789cf-fb09-4f48-9fcf-ae25de11cee5",
  "title": "UFC's Dana White joins Meta's board weeks before Trump takes office",
  "link": "https://www.cnbc.com/2025/01/06/ufcs-dana-white-joins-metas-board-weeks-before-trump-takes-office.html",
  "description": "UFC CEO Dana White, a longtime friend of Donald Trump, is joining the board of Meta two weeks before the new administration begins.",
  "author": "",
  "published": "Tue, 07 Jan 2025 00:45:29 GMT",
  "source": "https://www.cnbc.com/id/100003114/device/rss/rss.html",
  "categories": null,
  "byline": "Jonathan Vanian",
  "length": 2949,
  "excerpt": "UFC CEO Dana White, a longtime friend of Donald Trump, is joining the board of Meta two weeks before the new administration begins.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "Mark Zuckerberg posing with UFC president Dana White during a UFC Fight Night event.Jeff Bottari | Ufc | Getty ImagesDana White, CEO of the Ultimate Fighting Championship and a longtime friend of President-elect Donald Trump, is joining the board of Facebook parent Meta two weeks before the new Trump administration begins.Meta CEO Mark Zuckerberg, who had a particularly tense relationship with Trump during the president-elect's first term in office, said in a Facebook post Monday that White has built the UFC \"into one of the most valuable, fastest growing, and most popular sports enterprises in the world.\"\"I've admired him as an entrepreneur and his ability to build such a beloved brand,\" Zuckerberg said in the post.Zuckerberg has been practicing mixed martial arts in recent years and has attended several UFC events, underscoring his enthusiasm for the combat sport.In 2023, Zuckerberg tore his ACL during a sparring session as part of training for a competitive MMA fight. That year, Zuckerberg and Tesla CEO Elon Musk traded verbal barbs and indicated that they were willing to fight each other in a match that White would help produce. But Zuckerberg later said the fight was off because Musk wasn't \"serious.\"White appeared with Trump onstage on election night in November after the victory was in hand.\"This is what happens when the machine comes after you,\" White said, after being introduced by Trump. \"What you've seen over the last several years, this is what it looks like. Couldn't stop him, he keeps going forward, he doesn't quit, he's the most resilient hardworking man I've ever met in my life.\"Last month, Meta confirmed that the company had donated $1 million to Trump's inaugural fund. Zuckerberg was also one of several tech executives who visited Trump at his Mar-a-Lago resort in Palm Beach, Florida, following the election.White, who has led UFC since 2001, became embroiled in controversy two years ago after a video published by TMZ showed him slapping his wife at a New Year's Eve party in Mexico. White issued a public apology, and his wife, Anne White, issued a statement to TMZ, calling it an isolated incident.Musk has had his own connections to UFC in the recent past. In 2021, Musk joined the board of Ari Emanuel's Endeavor Group, which owns the UFC through TKO Group Holdings. He exited a year later.Other new members of Meta's board include John Elkann, the CEO of Italian holding company Exor, and former Microsoft head of corporate strategy Charlie Songhurst, Zuckerberg said.Elkann is chairman of Exor's automobile companies Stellantis and Ferrari, while Songhurst has spent the previous year on Meta's advisory group helping the company with its artificial intelligence and technology strategies, Zuckerberg added.\"We have massive opportunities ahead in AI, wearables, and the future of social media, and our board will help us achieve our vision,\" Zuckerberg said.WATCH: AI needs to deliver results",
  "image": "https://image.cnbcfm.com/api/v1/image/107260942-1687447693091-gettyimages-1429505880-12-dernvyan_20221001_jb_4866_31382d7b-ef16-4e82-92e6-9477536.jpeg?v=1736197906\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-107260942\" data-test=\"InlineImage\"\u003e\u003cp\u003eMark Zuckerberg posing with UFC president Dana White during a UFC Fight Night event.\u003c/p\u003e\u003cp\u003eJeff Bottari | Ufc | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eDana White, CEO of the Ultimate Fighting Championship and a longtime friend of President-elect \u003ca href=\"https://www.cnbc.com/donald-trump/\"\u003eDonald Trump\u003c/a\u003e, is joining the board of Facebook parent Meta two weeks before the new Trump administration begins.\u003c/p\u003e\u003cp\u003e\u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-2\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/META/\"\u003eMeta\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e CEO \u003ca href=\"https://www.cnbc.com/mark-zuckerberg/\"\u003eMark Zuckerberg\u003c/a\u003e, who had a particularly tense relationship with Trump during the president-elect\u0026#39;s first term in office, said in a Facebook post Monday that White has built the UFC \u0026#34;into one of the most valuable, fastest growing, and most popular sports enterprises in the world.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;ve admired him as an entrepreneur and his ability to build such a beloved brand,\u0026#34; Zuckerberg said in the post.\u003c/p\u003e\u003cp\u003eZuckerberg has been \u003ca href=\"https://www.cnbc.com/2024/02/02/meta-says-zuckerbergs-engagement-in-combat-sports-is-risk.html\"\u003epracticing mixed martial arts\u003c/a\u003e in recent years and has attended several UFC events, underscoring his enthusiasm for the combat sport.\u003c/p\u003e\u003cp\u003eIn 2023, Zuckerberg tore his ACL during a sparring session as part of training for a \u003ca href=\"https://www.cnbc.com/2023/11/04/meta-ceo-mark-zuckerberg-tore-his-acl-while-training-for-a-competitive-mma-fight.html\"\u003ecompetitive MMA fight\u003c/a\u003e. That year, Zuckerberg and \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-6\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/TSLA/\"\u003eTesla\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e CEO \u003ca href=\"https://www.cnbc.com/elon-musk/\"\u003eElon Musk\u003c/a\u003e traded verbal barbs and indicated that they were willing to fight each other in a match that White would help produce. But Zuckerberg later \u003ca href=\"https://www.threads.net/@zuck/post/Cv5CV3-rMKb/\" target=\"_blank\"\u003esaid\u003c/a\u003e the fight was off because Musk wasn\u0026#39;t \u0026#34;serious.\u0026#34;\u003c/p\u003e\u003cp\u003eWhite appeared with Trump onstage on election night in November after the victory was in hand.\u003c/p\u003e\u003cp\u003e\u0026#34;This is what happens when the machine comes after you,\u0026#34; White said, after being introduced by Trump. \u0026#34;What you\u0026#39;ve seen over the last several years, this is what it looks like. Couldn\u0026#39;t stop him, he keeps going forward, he doesn\u0026#39;t quit, he\u0026#39;s the most resilient hardworking man I\u0026#39;ve ever met in my life.\u0026#34;\u003c/p\u003e\u003cp\u003eLast month, Meta \u003ca href=\"https://www.cnbc.com/2024/12/24/trump-inauguration-committee-ceo-donations.html\"\u003econfirmed\u003c/a\u003e that the company had donated $1 million to Trump\u0026#39;s inaugural fund. Zuckerberg was also one of several tech executives who \u003ca href=\"https://www.cnbc.com/2024/12/24/trump-inauguration-committee-ceo-donations.html\"\u003evisited\u003c/a\u003e Trump at his Mar-a-Lago resort in Palm Beach, Florida, following the election.\u003c/p\u003e\u003cp\u003eWhite, who has led UFC since 2001, became embroiled in controversy \u003ca href=\"https://www.cnbc.com/2023/01/03/endeavor-stock-ufc-dana-white-hits-wife-video.html\"\u003etwo years ago\u003c/a\u003e after a video published by TMZ showed him slapping his wife at a New Year\u0026#39;s Eve party in Mexico. White issued a \u003ca href=\"https://www.nbc4i.com/sports/sports-illustrated/38015dc0/dana-white-addresses-media-after-new-years-eve-altercation-with-wife/\" target=\"_blank\"\u003epublic apology\u003c/a\u003e, and his wife, Anne White, issued a statement to TMZ, calling it an isolated incident.\u003c/p\u003e\u003cp\u003eMusk has had his own connections to UFC in the recent past. In 2021, Musk \u003ca href=\"https://www.cnbc.com/2021/03/31/elon-musk-tapped-to-join-endeavor-group-as-new-board-member.html\"\u003ejoined\u003c/a\u003e the board of Ari Emanuel\u0026#39;s Endeavor Group, which owns the UFC through TKO Group Holdings. He exited a year later.\u003c/p\u003e\u003cp\u003eOther new members of Meta\u0026#39;s board include John Elkann, the CEO of Italian holding company Exor, and former \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-14\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/MSFT/\"\u003eMicrosoft\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e head of corporate strategy Charlie Songhurst, Zuckerberg said.\u003c/p\u003e\u003cp\u003eElkann is chairman of Exor\u0026#39;s automobile companies Stellantis and Ferrari, while Songhurst has spent the previous year on Meta\u0026#39;s advisory group helping the company with its artificial intelligence and technology strategies, Zuckerberg added.\u003c/p\u003e\u003cp\u003e\u0026#34;We have massive opportunities ahead in AI, wearables, and the future of social media, and our board will help us achieve our vision,\u0026#34; Zuckerberg said.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWATCH\u003c/strong\u003e: \u003ca href=\"https://www.cnbc.com/video/2024/12/26/meta-heres-why-rosenblatt-securities-has-set-a-price-target-of-811-for-the-stock.html\"\u003eAI needs to deliver results\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108079942\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000361972\" aria-labelledby=\"Placeholder-ArticleBody-Video-108079942\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108079943-17352267941735226791-37717821508-1080pnbcnews.jpg?v=1735226793\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"Meta: Here\u0026#39;s why Rosenblatt Securities has set a price target of $811 for the stock\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-01-06T21:52:44Z",
  "modifiedTime": "2025-01-07T00:45:29Z"
}
