{
  "id": "dbbab311-9512-401f-9302-424fad8b9356",
  "title": "John Arnold with Dr. Peter Attia — The Greatest Energy Trader of All Time on Lessons Learned, Walking Away from Wall Street, and Reinventing Philanthropy (#818)",
  "link": "https://tim.blog/2025/07/01/john-arnold/",
  "description": "Interview with John Arnold, hosted by Peter Attia The post John Arnold with Dr. Peter Attia — The Greatest Energy Trader of All Time on Lessons Learned, Walking Away from Wall Street, and Reinventing Philanthropy (#818) appeared first on The Blog of Author Tim Ferriss.",
  "author": "Tim Ferriss",
  "published": "Wed, 02 Jul 2025 02:31:32 +0000",
  "source": "https://tim.blog/feed/",
  "categories": [
    "The Tim Ferriss Show",
    "john arnold",
    "peter attia"
  ],
  "byline": "Tim Ferriss",
  "length": 53021,
  "excerpt": "Interview with John Arnold, hosted by Peter Attia",
  "siteName": "The Blog of Author Tim Ferriss",
  "favicon": "https://i0.wp.com/tim.blog/wp-content/uploads/2025/05/favicon.png?fit=192%2C192\u0026ssl=1",
  "text": "In this special episode, my friend—and fan-favorite guest—Dr. Peter Attia takes the mic as guest host. Peter sits down with legendary trader John Arnold, widely considered the greatest energy trader of all time. Today, through his foundation Arnold Ventures, John applies the same rigorous thinking to some of America’s toughest social challenges—criminal justice reform, healthcare policy, and K–12 education, to name just a few. This interview originally aired on Peter’s excellent podcast The Drive. You can check it out at PeterAttiaMD.com, or subscribe to The Drive wherever you get your podcasts. Please enjoy! Listen to the episode on Apple Podcasts, Spotify, Overcast, Podcast Addict, Pocket Casts, Castbox, YouTube Music, Amazon Music, Audible, or on your favorite podcast platform. This episode is brought to you by Vanta trusted compliance and security platform; Eight Sleep Pod Cover 5 sleeping solution for dynamic cooling and heating; and Wealthfront high-yield cash account. John Arnold with Dr. Peter Attia — The Greatest Energy Trader of All Time on Lessons Learned, Walking Away from Wall Street, and Reinventing Philanthropy This episode is brought to you by Vanta! Vanta automates compliance for frameworks like SOC 2, ISO 27001, and HIPAA, making it simple and fast to get enterprise-grade compliant. Just like 10,000+ other companies that rely on Vanta, my friends at Duolingo and Ramp (a sponsor of this podcast and an ultra-fast growing company) both use Vanta to handle security compliance. It all adds up to impressive results: companies save up to 85% of costs, get compliant in weeks instead of months, and complete security questionnaires up to 5 times faster. So check out Vanta.com/Tim to see how Vanta can help you level up your security program. My listeners, that’s you, can get $1,000 off. This episode is brought to you by Wealthfront! Wealthfront is a financial services platform that offers services to help you save and invest your money. Right now, you can earn 4.00% APY—that’s the Annual Percentage Yield—with the Wealthfront Brokerage Cash Accoount. That’s nearly 10x more interest than if you left your money in a savings account at the average bank, with savings rates at 0.42%, according to FDIC.gov, as of 05/19/2025. It takes just a few minutes to sign up, and then you’ll immediately start earning 4.00% APY from program  banks on your uninvested cash. And when new clients open an account today, they’ll get an extra $50 bonus with a deposit of $500 or more. Terms and Conditions apply.  Visit Wealthfront.com/Tim to get started. Cash Account offered by Wealthfront Brokerage LLC, member FINRA/SIPC. Wealthfront is not a bank. The APY on cash deposits as of 04/30/2025, is representative, subject to change, and requires no minimum. Funds in the Cash Account are swept to program banks, where they earn a variable APY. Tim receives cash compensation from Wealthfront Brokerage for advertising and holds a non-controlling equity interest in the corporate parent of Wealthfront Brokerage. Tim and Wealthfront Brokerage have no other affiliation. Tim reflects his own opinions and Wealthfront does not endorse, sponsor, or promote them. See full disclosures here. This episode is brought to you by Eight Sleep. Temperature is one of the main causes of poor sleep, and heat is my personal nemesis. I’ve suffered for decades, tossing and turning, throwing blankets off, pulling them back on, and repeating ad nauseam. But a few years ago, I started using the Pod Cover, and it has transformed my sleep. Eight Sleep has launched their newest generation of the Pod: Pod 5 Ultra. It cools, it heats, and now it elevates, automatically. With the best temperature performance to date, Pod 5 Ultra ensures you and your partner stay cool in the heat and cozy warm in the cold. Plus, it automatically tracks your sleep time, snoring, sleep stages, and HRV, all with high precision. For example, their heart rate tracking is at an incredible 99% accuracy. Pod 5 Ultra also introduces an adjustable Base that fits between your mattress and your bed frame to add custom positions for the best sleeping experience. It also automatically reduces your snoring when detected. Add it easily to any bed. And for full coverage, you can include the Blanket, which uses the same technology as the Pod’s Cover to extend temperature regulation over your entire body.And now, listeners of The Tim Ferriss Show can get $350 off of the Pod 5 Ultra for a limited time! Click here to claim this deal and unlock your full potential through optimal sleep. What was your favorite quote or lesson from this episode? Please let me know in the comments. Timestamps (Credit to Peter Attia’s team) [00:00:00] Start.[00:05:37] Peter Attia’s intro: who is John Arnold?[00:08:38] John’s background, upbringing, and early entrepreneurial tendencies.[00:21:16] John’s time and rise at Enron.[00:33:40] Characteristics that made John an exceptional natural gas trader and how they translate to his philanthropic work.[00:41:10] The collapse of Enron.[00:46:46] The success of John’s hedge fund, and his early interest in philanthropy.[01:02:03] The infamous 2006 trade that brought down Amaranth Advisors.[01:08:28] John’s analytical prowess and emphasis on fundamentals.[01:15:13] The decision to become a full-time philanthropist and the founding of Arnold Ventures.[01:25:03] Education — John’s quest to fundamentally change K-12 education.[01:30:36] Strategic philanthropy — preventing problems by attacking root causes and creating structural change.[01:37:50] The criminal justice system — structural changes needed to address mass incarceration, policing practices, and recidivism.[01:55:07] Re-imagining prisons to reduce recidivism.[02:02:27] US health care policy — John’s focus on drug prices, and the severe consequences of not making system changes.[02:20:00] Climate change — the bipartisan role of John’s foundation.[02:23:52] Advice for young adults interested in philanthropy.[02:30:52] Parting thoughts. Show Notes — Created by Peter Attia’s Team John’s background, upbringing, and early entrepreneurial tendencies Who is John? He’s an “equal opportunity special interest pot stirrer” John and his foundation get major flack from both the left and the right politically (Therefore, the issues he attempts to zoom in to are ones where the left and the right are starting to come together) Prior to the foundation, John made his fortune as a natural gas trader Arnold Ventures Arnold Ventures, the foundation founded by John and his wife Laura, is currently focusing mostly on health policy, public finance platforms, and criminal justice Foundation gives about 400 million away each year “Our philanthropic intent is to give away the vast majority of our money during our lifetime.” An entrepreneur from a young age John was an entrepreneur and an aspiring businessman starting as a young kid At 12 he mowed lawns but realized not much money and too much competition Started selling sports cards at age 14 With the trading card work, he basically figured out geographical areas of arbitrage within the trading card industry and created a business out of it “I ended up spending a couple summers just full time on this baseball card, really geographic arbitrage and information arbitrage, that I would have a sense of who the best buyer was for every product.” Defining arbitrage— “I would describe arbitrage as taking advantage of price differences with little to no risk.” Today with the internet, a lot of that arbitrage and pricing inefficiencies have gone away or have been, what’s called in the trade, “Arbed out” What he wanted to do after college “I was the guy that was trying to get out of there and into the game as quickly as possible. Every day I was at college, it was one less day that I had to be in the game.” From a young age, John knew he wanted to be in Wall Street He didn’t know much about it, but he felt like it was the “biggest game around” The books Liar’s Poker as well as Barbarians at the Gate intensified his interest During college, he was focused on getting out of there and into the game as quickly as possible Despite not being recruited heavily, he talked his way into an interview at Enron and was offered an analyst position John’s time and rise at Enron John arrived at Enron in 1995, before it was all that well-known Historically, Enron was a pipeline company The natural gas industry was regulated heavily until 1992 when it became deregulated  What that meant to the industry: Previous to 1992, the pipeline was responsible for providing the merchant services to the buyer and seller So the producer of gas would sell to the pipeline  And then the pipeline would transport the gas and sell it to the customer It was viewed that this was negative because pipelines are natural monopolies frequently, and so the services and the cost of those services were too high So in 1992, they deregulate it and here is Enron as the gas merchant In 1995, there were 2 aspects to Enron’s business: 1 – The historical pipeline business  2 – A new “investment bank” side Around that time was when the decision was made to promote Jeff Skilling to the #2 position of the company This made sense because the company was looking to move towards the investment bank/trading business as, generally speaking, the return on equity is higher if you have fewer assets (sort of the direction of corporate America at the time) John first job at Enron First job was as an analyst on the trading floor – very rare for first position He wasn’t trading right away, more just running spreadsheets and analytical work He was able to learn the business up close John quickly realized that a trading career was directly in line with his skillset “I found the perfect job for my skill set as my first job. And I think that’s pretty rare, and it happened by accident. I could have very easily ended up a mergers and acquisition investment banker at Merrill Lynch, but I ended up trading commodities at a relative upstart of a company that was just the perfect spot for my skill set.”  How John rose so quickly through Enron All new hires were supposed to do four 6-month rotations in different sides of the business then they go back to business school But they made an exception for John as he was really well liked in the natural gas group However, one of the traders made a big mistake on the trading floor and the group had to be dissolved John had the choice to go to the UK or go downstairs and work in the natural gas trading group While tempted to go overseas, John knew the natural gas group was the future at Enron so he chose that route Winter of 1996—“A whole new game” This is when the natural gas prices “blew out” John says—It was an extremely cold winter and all the historical relationships that gas had just completely changed People who had spent their entire career in gas weren’t sure if they knew anything about gas anymore “It was a whole new game.” First job within the natural gas division: They put John as an assistant trader with a gentleman who had the expertise on the physical side of the business and they were told to “go figure this out” Around this time is when Enron became a “darling” in the industry The mid-level guys were being poached by competitive companies making Enron a unique environment for a smart and responsible young person to rise quickly By the time John was 25, he was the head natural gas trader at the largest natural gas trading company in the industry While John benefited greatly from this “merit-based” system of promotion, he suspects the company gave out too much responsibility and didn’t have enough control— “I think it ended up being the downfall of the company as well, as there just wasn’t the controls on people who were given too much responsibility, too much of the company’s balance sheet to use without their adequate controls on it.” Characteristics that made John an exceptional natural gas trader and how they translate to his philanthropic work “The stress level was intense. I think I’m very good at handling stress, but the stress level was intense to a point of not being healthy.” In a given day, John was trading billions of dollars of notional value of gas Much of it was trying to buy at $2 and trying to sell it at $2 and a half penny for enormous volumes From the moment you sat down in the morning until about 4pm, it was just nonstop trading Food was delivered to your desk, and bathroom breaks meant running back and forth This non-stop stress is why traders generally have short trading careers How do many traders destress? Destressing for traders usually meant drinking, partying, gambling, etc.  In his 20s, he gained weight and was just not at all healthy especially compared to him now  John gravitated away from that lifestyle in his 30s when he matured, got married, kids, etc. Did John experience an “addiction” to the “high” of trading? It’s not uncommon for traders to be addicted to the rush, the high, the physiologic response that they get to a good trade John says he knows the feeling and saw many traders afflicted by this However, he felt like he wasn’t addicted to it What made John such an exceptional trader?  John credits his success to two traits: 1-His ability to not let emotions impact his decision making process 2-He fell perfectly on the confidence spectrum (confident but not too arrogant) Regarding emotional detachment— Whether he was having a great day or the worst day, you couldn’t tell by looking at him He instead was just “100% focused on executing the process” ⇒ There’s a saying in the investment world, “Fear and greed drives a lot of price trends in financial assets.”  This phrase refers to the fact that many traders are either greedy or fearful and that’s driving your behavior The more you can eliminate those fear and greed from the trading process, the better you get The confidence spectrum— John says he fell perfectly on the confidence spectrum Confidence is key, but you can’t be too arrogant—arrogance has been the “destroyer of many trading careers” The right way to think is, “I’m confident in my view on this, but I know I might be wrong.” How did these traits translate into John’s philanthropy work? John says these traits translated very well With his foundation they come up with plenty of theories on how to solve a complex issue You must have confidence in that theory, however, you must not be wedded to it because you know you could be wrong  “Everything we’re doing in the foundation is evidence-based, but the evidence is never perfect.” The collapse of Enron Book about the fall of Enron: The Smartest Guys in the Room  Preceding Enron’s collapse… John’s trading group was wildly successful Yet, Enron was soon to be bankrupt John was so singularly focused on his job that he didn’t have much of a sense as to what was going so wrong in other divisions Enron, like most companies at the time, was disintermediating their business chain Bad decisions— There were some bad decisions being made in those other sectors that were leading to the downfall In parallel, there was a culture of never being able to admit failure  Enron had morphed into a financial business which is completely contingent upon having the faith of your creditors (i.e., Wall Street) Once Wall Street loses faith in you and refuses to fund you, “the business is toast” — And that’s what happened to Enron When did John realize his career at Enron was going to be cut short? John was likely the most profitable person at Enron But it became clear that the company was in trouble Enron eventually reached a deal with a JV partner (a New York bank) but John had different view on how the business should proceed and he decided to leave The success of John’s hedge fund, and his early interest in philanthropy When John was still at Enron… Many people were calling John saying they wanted to invest with him if he did his “own thing” When John knew Enron was collapsing, he started a fund, hired people, bought equipment, etc. John had plans to raise $50 million for his fund and would’ve easily had the investors to do so But then BOOM—the investigating into Enron breaks open and nobody knows if john was a fraud or if he was going to prison John started Centaurus (hedge fund) but had to settle for only $8 mil initial funding (his money plus 2 investors) How John grew Centaurus so successfully After Enron scandal, about half the pipeline and electric utility merchant/trading businesses were out of business because that industry fell out of favor with Wall Street The market became incredibly inefficient and there was a great need for risk intermediation/risk warehousing It was very low risk for arbitrage type trades that shouldn’t exist in a normally functioning market that existed for that next year just because the market players had been so decimated This low-risk model resulted in John’s fund making $3 million in the first month, and was up 150% in 3 months With that success, investors became interested again which helped increase his AUM The synergy of market arbitrage plus speculative trading: The two strands of John’s hedge fund—  1) Providing liquidity and getting paid for the service of warehousing some risks, and   2) Speculative trading – Trying to make a call on where natural gas prices were going next In the first few years, his business was mostly doing the low risk stuff to create the base and an upward trend in profitability But on top of that line of business, John started doing more and more speculative trading This worked well because if he was ever wrong on a market call, he wouldn’t be decimated since he was still making money on the arbitrage side of the business The inefficiency in the market, which created the low-risk arbitrage, made it the “perfect time to be in natural gas” The moment John realized he’d never have to worry about money again: In 2002/2003, the demand was high and supply wasn’t keeping up John wasn’t the only trader that recognized this, however, the risk/reward was being very misvalued John recognized that if they were to have a very cold winter in 2002 or 2003, the gas market could experience some significant shortages and there would be corresponding price spikes This cold weather event was perhaps a 1 in 5 probability, but the bets were pricing them as if it was 1 in 50 There ended up being a 2-day stretch in late February 2003 which sent prices to one of the three highest gas prices in the last 20 years The fund more than doubled in those two days in terms of total assets Afterwards, he called his mom to say, “We’re set. We have financial security now forever regardless of what happens.” When did John first start thinking about philanthropy? “I always recognized the limited social value of trading. I think there is a need for someone to provide risk warehousing and liquidity to markets, but trying to tell the story about how I was adding value or contributing to society was hard. And that always bothered me.” John began thinking about trading in his early Enron days (He was getting paid well — 100k bonus checks) His charitable interest gravitated towards K-12 education He found KIPP Charter Schools and gave them a 5-figure donation This was the start of his very long journey, thinking about K-12 education in the country But in 2002/2003, after his massive early success with his hedge fund, he was only thinking about philanthropy about 1% of the time. When John’s hedge fund started gaining major attention: At some point a magazine published the top 100 traders and listed john at top 5 in making money This sort of broadcast to the rest of the industry that something was going on in natural gas This naturally brought in a bunch of new entrants in the gas market John made a deliberate decision keep the focus of the business narrow—Didn’t want to trade oil,  didn’t want to trade natural gas stocks or natural gas bonds, didn’t want to trade agriculture “I wanted to be the best in the world at North American natural gas and power trading.” This was a strategic move to put a natural limit as to the amount of assets that they could manage John’s assets under management (AUM) peaked around $6 billion—This was bordering on too big because you may be spreading yourself too thin into areas that you don’t have the deepest domain expertise John business was all about return (not fees from investors)— John wasn’t in it to make fees from investors John was personally the largest investor in the fund  So he was in it for the return on the money and that’s how he pitch it to potential investors It was always driven by: How do I want my money managed? The infamous 2006 trade that brought down Amaranth Advisors Background Brian Hunter and Amaranth Advisors did very well in 2005 during the hurricane season The impact of Hurricane Katrina created a massive shortage in gas and the price of gas had one of the greatest peaks in last ~30 years After 2005, two things happened in the industry— A belief that the increasing frequency and intensity of hurricanes would damage the structure of the energy sector and natural gas sector There would be a great fear amongst any trader to be short during that time period (the hurricane season) Amaranth’s position in 2006— In 2005, Brian Hunter, the head trader at Amaranth, was in the long position and made tons of money when gas prices spiked after Hurricane Katrina caused massive shortages in supply Brian thought something similar would happen (or at least a big scare would happen) in 2006 causing the same type of move in gas prices However, the 2005 Katrina event sent the signal to every producer to increase supplies John, who had a 25% opposite position of Brian, could see that supplies were ramping up in 2006 Despite this increase in supply, Brian continued buying more and more—so much that he distorted the relative values in that market The story is often told like it was Brian vs. John (John had a 25% opposite position)  Reality is that it was the whole market (including John) versus Brian, because Brian was such a large long position in this So what happened in 2006? There was no hurricane in 2006, and prices collapsed Brian couldn’t hold up the prices any longer and it destroyed Amaranth The story is framed as if Brian and John had competing bets as to what the weather was going to do  However, it was actually taking a position on the more important question–supply John felt like even if they WERE hit with a demand shock from a weather event, the market was much better prepared to absorb the hit compared to 2005 How John thought about the situation: “You had this probability distribution function of the possible outcomes. And then think about, under each outcome, ‘how would I think about what fair value is of the commodity at that time?’” The mistake Brian made was—The market was already so mispriced to expected value that even had you had the supply shock happen, what was the upside? “We’re already priced for that.” Peter adds, “You realize that it was probably a bit more of an error in hubris as well, which goes back to your point about maybe being a little too confident in your ability to predict what’s going to happen.” John’s analytical prowess and emphasis on fundamentals John has a “third superpower”—an insatiable, bordering on pathological, obsession for knowing everything Peter knows the feeling John says his appetite for knowledge has served him well in trading and philanthropy In his trading days… By being a hedge fund and not being in the physical business (dealing with customers, etc.), John says they were at an “information disadvantage” So when a counterparty put up an opposite trade of John’s position, he was always thinking about: What are they thinking?  What do they know? Can I replicate as best I can, the knowledge that they have so that I can make an educated and confident decision? John’s team was at an information handicap (compared to say, BP)  How did John make up for this informational disadvantage?  1) Better analysis—knowing where to get third party information, having better analysis, and crafting better models that described what the past was and thus what the future is going to be 2) The biggest fundamental research department  — i.e., count the molecules, try to count as many molecules as you can—Where did it come from? Where did it travel? How was it consumed? “Our advantage was that we’re going to invest in the fundamentals more than anybody else is and then overlay that with some good trading.” 3 main reasons why trading natural gas was “easier” than oil:  1) It was this closed system —the molecules, for the most part, just stayed in North America  2) Deregulation got the pipelines out of the business of trading The pipelines, which had the most fundamental information about where the gas came from and where it was going, now had to publish all this information publicly and they couldn’t trade on it  Compare that versus oil, Exxon can own the oil platform in the Gulf of Mexico, stick it on an Exxon ship, take it to an Exxon owned refinery and put it in Exxon gas stations. And so as an outsider, trying to figure out and track those molecules, it’s impossible. That’s why the best, most profitable oil traders have to be in the physical business  3) Twice a year, there was a mechanism to get you back close to fair value Because nat. gas was a seasonal product, you store it during the summer getting ready for the peak winter demand which created a window of what it should be when you exit the winter Compare that to a tech stock today— there’s no forcing mechanism that necessarily has to get that tech stock back to one’s belief of fair value So with nat gas… while price could deviate from fundamental value for parts of the time of the year, twice a year, it kind of had to go back to that fair value, which was great as a fundamental trader The decision to become a full-time philanthropist and the founding of Arnold Ventures Deciding to focus on philanthropy “I started thinking more about giving the money away than making more of it. That was really the signal to me that I want to be spending my time on the other side of the table and I’m physically and mentally, emotionally exhausted with trading natural gas.”  Met his wife, Laura, in early 2006 and got married not long after  They both started to really think about ‘what should we do with our lives now?’ In 2006, 3% of his focus on philanthropy But by 2008, John and Laura had founded Arnold Ventures and John was putting about my 10-15% of his energy into the foundation This became an issue because trading takes 100% laser focus in order stay above the competition In 2012, John decided it’s time to shut down his hedge fund This was more than a decade living and breathing nothing but natural gas A hard decision It was a hard decision to make, says John, but it got easier because things had changed in the market— The shale revolution increased supply greatly The market went from being very volatile with booms and busts, to one that was in perpetual oversupply and kind of bouncing around marginal cost to produce John had to give billions of dollars back to investors because the market opportunity was no longer there to the same degree “When you’ve been playing in Vegas with the $25 table to go back down to the $5 table. It’s just not as emotionally interesting.” Summary of factors leading to the shutdown of his hedge fund— Got married, had kids New regulations put into the business (largely due to the Brian Hunter/Amaranth episodes) Arbitrage and opportunity in the market became harder to find John began to lose the focus as his interest in the foundation was increasing “These things came together and it still took me two years to make that call, that it’s time, it’s time to close this up and go find happiness somewhere else.” Skills in trading that translated to philanthropy:   1-Emotional temperament—not letting your feelings get in the way of what you’re doing   2-Having the right amount of confidence  You have to be able to say, “Yeah, this is a huge and hard problem, but we should go after it.” But maybe not too much confidence to say, “We’re going to solve this problem no matter what.”   3-An ability to become an expert in something in a relatively short period of time Peter compares John to Bill Gates, who is the ultimate example (check out the Bill Gates documentary) Education—John’s quest to fundamentally change K-12 education K-12 education — the first problem the foundation looked at deeply The questions John had about K-12 education: Why does one school have different results from a school down the street serving a very similar population of kids? How do you take what the best individual schools are doing and scale that? What makes a school better? Is it small schools?  Is it better principals?  Is it better teachers?  Is it the curriculum?  Is it technology?  What’s the idea that scales and creates structural change? “[K-12] is just the most fundamental issue facing long-term health and viability of this country.” The theory of change that drives John’s work in K-12: The theory: Strong and robust systems of any kind have the attributes of biological evolution In living organisms you have, Variance amongst the organisms with the differential fitness There’s a different rate of survival and reproduction And then inheritability of fitness You need to have a strong and robust system and that’s getting better over time Education, generally speaking, is not that (e.g., same curriculum, the same process, the same way of hiring, of training, of trying to develop teachers) In public education— For the good ideas, there’s no natural mechanism for that to grow  For the bad/outdated idea, there’s no mechanism for them to stop and go away In order to have the heritability of traits, you need the learning aspect—but public schools (or really any government monopoly) is not good at quality control and innovation in order to provide the necessary variance Arnold Foundation’s theory is that… i) the school system needs to become a system of schools, and  ii) the natural role for government is not to be the service provider, but to be the regulator  Currently, the government is filling both roles which is a problem because “no system can regulate itself”) If this theory works… The parents and kids will have real choice in what type of model they want An immersion program High discipline or regular discipline,  An art school or other specialty, etc. Giving real choice to parents/kids is the “best quality control that can happen” The government, as the regulator, needs to make sure that all kids are served, but is largely out of the business of providing the service of education Strategic philanthropy—preventing problems by attacking root causes and creating structural change What’s the role of philanthropy?  Currently, only about 1% of the economy is philanthropy for social services or social goods A big question John and his foundation think about is: What’s the best use of that?  It can either— 1) Supplement government services (typically described as charity, i.e., trying to solve today’s problems) E.g., Giving money to existing programs like a food bank 2) Try to get to the root cause of problems with strategic philanthropy, i.e., prevent those problems from developing tomorrow Both are important, but John gravitates towards the latter The latter allows for exploring… How does the philanthropic money compliment government services to make them better? What is the market failure as to why government programs are not working as well as they should? Role for “strategic” philanthropy Most of the existing social non-profits are so focused on simply providing the day-to-day that they have no bandwidth for experimentation or innovation Strategic philanthropy can come in to explore, “How can these actors in these systems perform better?” Arnold Foundation spends more of it’s time looking at structural changes to the system b/c it’s scalable in a way that just providing another dollar for a program largely is not Strategic philanthropy requires experts and manpower to explore new ideas, old ideas, theoretical frameworks, potential second order effects of structural changes, etc. How challenging is doing this kind of strategic philanthropy? Arnold Foundation has about 120 employees — “We had no desire or interest to have 120 employees 10 years ago. That was not by design. We thought giving would be easy.” At the beginning, John was sifting through the literature Example, the topic like preschool: You see three papers that say preschool is amazing, it generates all these outcomes later in life Then you see one evaluation of the Head Start program that shows it doesn’t really have an effect As you dig deeper, you see huge arguments within this research sector about what the evidence really shows In every area that John has researched, he finds the same thing— The first scan through it appears that everything works, it’s all great, writing checks there is a great way to invest money But as you dig deeper, it gets very frustrating because the more you study, the less you know about what worked and what didn’t *One main insight from doing the deep digging: Very few new programs worked And the things that DO work are generally already part of the fabric of society, e.g., K-12 education The question for the foundation became: What’s our role? Where could our dollars be most helpful? John’s frustration with trying to find the “right program” to fund really led him and the foundation down the path of—How do you change and improve the system and the incentives and the rules of a system rather than what’s the next program we can fund? The criminal justice system—structural changes needed to address mass incarceration, policing practices, and recidivism When the criminal justice system got on John’s radar: Laura had a legal background and gave her a perspective on it — one of the first organizations they gave money to was the Innocence Project by Barry Scheck which got innocent men off of death row This got them thinking more strategically—How do we change the system so that the wrongful convictions don’t happen in the first place? They realized that changing the system and policies is where they wanted to spend the time— Higher potential reward It is harder work and the chance of success is lower But the impact, if successful, is so much higher if you can improve how the system works The foundation spent an entire year just thinking about all the ways the inefficiencies in the system was leading to bad outcomes “There is this natural impatience. But I think we’ve been smart enough to realize that it’s smarter to invest wisely tomorrow than do something that’s unlikely to have an impact today.” How criminal justice system is broken: Peter points out three clear issues with the criminal justice system: 1-There seems to be an enormous racial disparity 2-There are great difficulties in appealing, even in the presence of evidence that the first trial may not have been a great trial 3-Coercion is a real problem which results in people pleading guilty to something they did not do John’s take on how we got to the current state of the criminal just system:  Increasing violent crime which peaked in the late 80s/early 90s This scary trend created a bipartisan response — crime was really destroying communities Everyone came together to start this tough on crime mantra The foundation of that was to intensify the “war on drugs” — which ended up having second and third order effects  Crime ended up peaking in the early ’90s Some of it was because of some of the policies passed, but a lot of it wasn’t John says the drop in crime was relatively independent of when communities adopted the new policies (across America as well as globally) The significant drop in crime over the past 30 years is still a bit of a mystery, says John Fast forward to today— Times have clearly changed, but we still have policies that were a reaction to an environment that was very different than today We’ve now seen the negative impact of those policies neighborhoods, the financial costs of those policies, and the trade offs associated with some of those policies We arrived at a point where both Republicans and Democrats have come together trying to rethink the right way to structure all aspects of the criminal justice system—from policing and courts and prisons and recidivism Speculating on what accounted for the reduction is crime starting in the mid-90s What other factors could have accounted for the reduction in crime if not the increase in incarceration? John says the best thing he’s seen on this is a report from the Brennan Center The summary is that it’s hard to see any one of them being really causal in the shifting crime Plus the same downward trends were happening globally (without the “tough on crime” policies) John says “I’m not sure we’ll ever know” what the main driver of reduced crime was Of all the mechanisms or tactics that would lead to an increase in incarceration, which of those were perhaps the most responsible for mass incarceration? John thinks part of it has been longer sentences and part of it has been the conviction rates The system is built to demand a plea bargain The reality is that we just don’t have the court resources (the defense attorneys, the prosecutors, the judges, etc.) to hear a vast majority of cases In fact, less than 5% of cases actually go in front of a judge, most of them just get pled out How do we solve this problem? Incentives that have been built into the system almost coerce people to plead guilty to crimes that they may not have committed. – i.e., plea is 6 months and trial plus conviction is 20 years It’s really hard to see how you solve that problem without a massive infusion of resources into the courts, prosecutors, \u0026 defense attorneys) which is not where we want to be spending money  The solution is more likely to come from spending money on preventing crime (such as on certain social services) The goal would be trying to figure out how to get rid of this culture where the system can’t handle everybody going to trial Is the role for philanthropy to try to address the questions of racism within law enforcement? For a long time, the focus has been on reducing crime rates with no regard for the secondary effects that the criminal justice system causes on these communities and families ‘Family’ example—a disproportionate number of black men that go to prison leaving children without a father Psychological effects—Being a black man in America, especially in a low income neighborhood, comes with a psychological effect which is only worsened by an overly-aggressive police force in that community A big dilemma: Minority communities have felt both over-policed and under policed at the same time. But violent crime is still a big problem and a huge cost to a community But most crime is committed within one’s own community So nobody in the community wants the police to leave entirely, there still has to be that function of deterrence  Addressing the problem: The problem doesn’t get solved just by passing one new policy This is an issue that has developed over decades of policing techniques, and centuries of disinvestment in these communities.  The question is being considered: How do you both provide the public safety while not causing the damage that some policing techniques cause today? Re-imagining prisons to reduce recidivism Peter’s take on the prison system: Peter had a profound experience when visiting a prison (See episode of The Drive with former inmate Corey McCarthy) From that experience, Peter points out the reasons to put somebody in prison: 1-To protect the public from them. 2-To punish them for something they have done 3-To provide them with a set of skills to reintegrate into society in a better way Peter says there was virtually no effort into the rehabilitative part which virtually guarantees recidivism Peter wonders: Is there an opportunity for strategic philanthropy to play a role in the rehabilitative side of incarceration? John’s response: It’s very hard to design effective recidivism programs AFTER someone’s come out The evidence is very poor that after-prison programs actually work “The nature of prisons has to change. If you wait until the days someone’s released, that’s way too late.” The foundation’s work on re-imagining prisons They have a couple projects trying to reimagine prisons  They are thinking through, What’s the role of prisons?  The struggle is that states and counties that fund this are often constrained financially— They are trying to figure out how to meet today’s problem which too many people in prison  And there’s very little bandwidth and money going towards improving outcomes over the long term when they HAVE to meet today’s needs The foundation is exploring questions like… What should prisoners be doing with their day?  How can we try to maximize the percent chance that they don’t come back here when they’re released?  The ROI case You could certainly make an ROI case that if you invest more now you’ll save much more tomorrow The problem is that the pay off may not be for 5+ years In the private sector, they would make that investment every day But in the public sector, it’s on a cash accounting basis — i.e., you have to balance the books this year \u0026 you have a fixed amount of money That’s where the philanthropic sector can be an active player in this system is by providing the funds to experiment with different ideas and programs and then funding the high quality evaluation to see the potential ROI The values case Another part of the foundations work is more about values  Questions like: Should we keep someone detained in jail before they’ve gone to their court date because they don’t have the money to pay bail?  The broader question being explored: How do we fix it so it more closely represents American values while minimizing any potential second order effects, negative second order effects? US health care policy—John’s focus on drug prices, and the severe consequences of not making system changes How is John thinking about health policy in America? John comments that this is just such a big, complex issue: “The number of things that one could work on in health policy is immense.” So where is John trying to apply his resources? The first area John wants to address is drug prices because it’s a topic with: Very obvious flaws in the existing system There were ideas that were one could conceive of being enacted on how to fix it And the political window might open in the future such that there was demand by the public and thus by politicians to actually adopt some of this stuff The foundation is focused on creating a more rational system to price pharmaceuticals that—  Balances interest and balances incentives that are necessary for the private sector to do the innovation Balances the financial interests of the state and the federal government that’s largely paying for a lot of this stuff, and That maximizes access for the patient The political window: The foundation focuses on finding issues where a political window going to open up in the future So when the window opens, they can have evidence-based ideas that we could present to policymakers  For politicians to consider health care policies— You need ideas to present to them and say, “Here are the three things you need to do.”  The reality is, the health care system is so complex, it really has 20+ problems But “you start to lose policymakers when you hit number four”, so you really want to narrow it down as best as you can (i.e., focusing on drug pricing) Peter’s rant on the US health care: Our taxes disproportionately subsidize 2 things in the world, and one is military spend, and the other is healthcare spend For example, we pay so much more for drugs here than our neighbors do that we in effect subsidize the cost of R\u0026D  The United States is 3% of the world’s population, yet we pay 50% of the pharmaceutical revenues of the world The inflated prices that Americans are paying is helping and creating incentive for more medicines to be made here that then other countries get the benefit from.  The NIH, for example, spends so much money on the basic science that’s required to get these drugs started, and in return, the pharmaceutical companies charge us 2x-3x the prices of other countries You could argue that we should be getting a discount because the United States taxpayers are funding much of the basic science and the cost of developing these drugs ⇒ For more on the health care system and issues with drugs, see Peter’s interviews with Marty Makary and Katherine Eban  Enormous health care spending—how can we change this? One could argue that the US health care spending is not sustainable We’re currently spending 15+% of GDP per year and it’s probably increasing at 5% per year in relative growth Without the greatest sovereign default on debt, what is it going to take to change this? At the state level, The downsides of the state having to balance a budget every year is that it can’t make the high ROI investments that it should The upside is that it forces the states to consider trade offs—they have to decide where’s the highest value, and they look to save money  The federal government, on the other hand, without that budgetary constraint, doesn’t have to make those trade offs So what happens is that any proposed legislation where somebody gets harmed will not pass, because no hard decisions want to get made The ramification of that is enormous budget deficits today and a potential default on a debt in the future But perhaps the most concerning part is the possibility of severe inflation The severe consequences of inflation We seem to have a fiscal or monetary response to every problem, but the one problem you can’t solve from fiscal and monetary tools is inflation John is particularly concerned about inflation because that’s when you have to be cutting fiscal spending and increasing interest rates to try to combat inflation The negative repercussions of that is enormous because we are so levered with debt at household level, at the business level, at cities and states, at the federal level Inflation is less of a problem as long as GDP is growing faster than real inflation The US debt is increasing much faster than real GDP, and so the real debt is increasing and we never pay it off Bad things happen if interest rates rise to just 5%, much less double digits which we’ve seen before in this country “I want to help the world, I want to solve problems, but if the answer is just shovel more money at it, that’s not a sustainable answer in my mind.” John’s foundation is working on: How do we improve the system without spending more money? If you believe that there are no trade offs with how we spend our resources, then pharma prices are fine (in fact, double them, triple them) But that’s not what John believes, “I believe there is a trade off and that a dollar put into pharma innovation is a dollar less for everything else.” Other things like, Other healthcare innovation (or health care services) Education Less recidivism Etc. The pharma system has just been able to create this island where they don’t have to compete with anybody They got their own rules, and it’s a messed up set of rules that incentivizes the wrong thing.  So even within that, we’re not getting the drugs that we should be getting We’re getting things like marginal oncology drugs  We’re not investing in the antibiotics and vaccines, because the financial incentive isn’t there  “So we’re spending tons of money as a society and not even getting good returns for it.” Optimistic about the future — Change happens slowly, then very quickly John remains optimistic that real changing is coming But admits that this process is “emotionally frustrating”… to be banging on a problem for years with little perceptible progress Peter compares change like this to a stone mason hitting a rock over and over— There’s a bunch of tiny imperceptible cracks and then there’s one hit that splits in open But it wasn’t that one hit that did it, it was the many many that came before it Citing two real world examples – The campaign against the Don’t ask, don’t tell policy seemingly went nowhere for decades until finally getting repealed (see book by Josh Seefried) Rick Doblin’s life-long work with psychedelics is close to coming to fruition  “You just don’t have that feedback mechanism in this work that you had in the [natural gas] market and the complete opposite end of the spectrum”  Climate change—the bipartisan role of John’s foundation John’s high level thoughts on climate change It’s a problem where the downside possibilities are so enormous that it makes sense as a society for us to make the investments today to try to decrease the probability of those downside scenarios.  John admits that he does not know the probability of some of the truly catastrophic scenarios, but “it’s greater than zero. . .and less than 100%” John says that the downside is so great that society needs to make that investment How will John’s foundation work on climate change? The foundation typically looks at issues and areas where there’s not much philanthropic focus And the climate field already has very thoughtful philanthropists who are working on this today Where John thinks they can add value: In the climate change realm, most of the researchers, advocates, and funders come from the left (politically) But John believes this can only be solved with a bipartisan effort John says the democrats aren’t doing a very good job of bringing the republicans into the conversation when they do things like “put the whole Democratic platform into a climate change bill” John thinks the role of his foundation is to try to bring the both parties into the discussion by supporting organizations and politicians that are on the right who want to start taking steps Advice for young adults interested in philanthropy Regarding his own kids— He doesn’t want their lives to be defined by their parents, bur rather for them to have their own life experiences and create their own life He is discouraging them from working at the Arnold Foundation “Whenever you have that checkbook, people look at you differently, and treat you differently. . .because there is always something that they want funded. . .If somebody’s growing up in their teens and their 20s, and is looked at by the rest of the world as a checkbook first, I think that’s a very damaging way to grow up.” Advice to young adults with an interest in philanthropy: As a society, we benefit when our community around us is stronger Whenever we have the needs of our family taken care of, it’s human nature to start thinking about your community John’s general advice about giving money is to try to do it strategically and intelligently And by giving to your community, you are likely making a more informed gift since you have a better sense of what the needs are of your own community",
  "image": "https://tim.blog/wp-content/uploads/2025/07/John-Arnold-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg data-recalc-dims=\"1\" decoding=\"async\" width=\"1024\" height=\"819\" src=\"https://i0.wp.com/tim.blog/wp-content/uploads/2025/07/John-Arnold.jpg?resize=1024%2C819\u0026amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/tim.blog/wp-content/uploads/2025/07/John-Arnold-scaled.jpg?resize=1024%2C819\u0026amp;ssl=1 1024w, https://i0.wp.com/tim.blog/wp-content/uploads/2025/07/John-Arnold-scaled.jpg?resize=300%2C240\u0026amp;ssl=1 300w, https://i0.wp.com/tim.blog/wp-content/uploads/2025/07/John-Arnold-scaled.jpg?resize=768%2C614\u0026amp;ssl=1 768w, https://i0.wp.com/tim.blog/wp-content/uploads/2025/07/John-Arnold-scaled.jpg?resize=1536%2C1229\u0026amp;ssl=1 1536w, https://i0.wp.com/tim.blog/wp-content/uploads/2025/07/John-Arnold-scaled.jpg?resize=2048%2C1638\u0026amp;ssl=1 2048w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%201024%20819\u0026#39;%3E%3C/svg%3E\" data-lazy-srcset=\"https://i0.wp.com/tim.blog/wp-content/uploads/2025/07/John-Arnold-scaled.jpg?resize=1024%2C819\u0026amp;ssl=1 1024w, https://i0.wp.com/tim.blog/wp-content/uploads/2025/07/John-Arnold-scaled.jpg?resize=300%2C240\u0026amp;ssl=1 300w, https://i0.wp.com/tim.blog/wp-content/uploads/2025/07/John-Arnold-scaled.jpg?resize=768%2C614\u0026amp;ssl=1 768w, https://i0.wp.com/tim.blog/wp-content/uploads/2025/07/John-Arnold-scaled.jpg?resize=1536%2C1229\u0026amp;ssl=1 1536w, https://i0.wp.com/tim.blog/wp-content/uploads/2025/07/John-Arnold-scaled.jpg?resize=2048%2C1638\u0026amp;ssl=1 2048w\" data-lazy-src=\"https://i0.wp.com/tim.blog/wp-content/uploads/2025/07/John-Arnold.jpg?resize=1024%2C819\u0026amp;ssl=1\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIn this special episode, my friend—and fan-favorite guest—\u003ca href=\"https://peterattiamd.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cstrong\u003eDr. Peter Attia\u003c/strong\u003e\u003c/a\u003e takes the mic as guest host. Peter sits down with legendary trader \u003ca href=\"https://www.arnoldventures.org/people/laura-arnold-john-arnold\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cstrong\u003eJohn Arnold\u003c/strong\u003e\u003c/a\u003e, widely considered the greatest energy trader of all time. Today, through his foundation \u003ca href=\"https://www.arnoldventures.org/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cstrong\u003eArnold Ventures\u003c/strong\u003e\u003c/a\u003e, John applies the same rigorous thinking to some of America’s toughest social challenges—criminal justice reform, healthcare policy, and K–12 education, to name just a few. \u003c/p\u003e\n\n\n\n\u003cp\u003eThis interview originally aired on Peter’s excellent podcast \u003ca href=\"https://peterattiamd.com/podcast/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cstrong\u003e\u003cem\u003eThe Drive\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e. You can check it out at \u003ca href=\"https://peterattiamd.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ePeterAttiaMD.com\u003c/a\u003e, or subscribe to \u003cem\u003eThe Drive\u003c/em\u003e wherever you get your podcasts.\u003c/p\u003e\n\n\n\n\u003cp\u003ePlease enjoy!\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eListen to the episode on \u003ca target=\"_blank\" href=\"https://podcasts.apple.com/us/podcast/818-john-arnold-with-dr-peter-attia-the-greatest/id863897795?i=1000715334945\"\u003eApple Podcasts\u003c/a\u003e, \u003ca target=\"_blank\" href=\"https://open.spotify.com/episode/1IDBJiU6RWESRyV8aWrSNi?si=L4eR07UcT2-hsJRLFe2Dgg\"\u003eSpotify\u003c/a\u003e, \u003ca href=\"https://overcast.fm/+AAKebuNjTqs\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eOvercast\u003c/a\u003e, \u003ca href=\"https://podcastaddict.com/podcast/2031148#\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ePodcast Addict\u003c/a\u003e, \u003ca href=\"https://pca.st/timferriss\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ePocket Casts\u003c/a\u003e, \u003ca href=\"https://castbox.fm/channel/id1059468?country=us\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eCastbox\u003c/a\u003e, \u003ca target=\"_blank\" href=\"https://music.youtube.com/playlist?list=PLuu6fDad2eJyWPm9dQfuorm2uuYHBZDCB\"\u003eYouTube Music\u003c/a\u003e, \u003ca href=\"https://music.amazon.com/podcasts/9814f3cc-1dc5-4003-b816-44a8eb6bf666/the-tim-ferriss-show\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eAmazon Music\u003c/a\u003e, \u003ca href=\"https://www.audible.com/podcast/The-Tim-Ferriss-Show/B08K58QX5W\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eAudible\u003c/a\u003e, or on your favorite podcast platform. \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eThis episode is brought to you by\u003c/strong\u003e \u003ca href=\"https://vanta.com/tim\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cstrong\u003eVanta\u003c/strong\u003e\u003c/a\u003e\u003cstrong\u003e trusted compliance and security platform; \u003c/strong\u003e\u003ca href=\"https://www.eightsleep.com/tim/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cstrong\u003eEight Sleep Pod Cover 5\u003c/strong\u003e\u003c/a\u003e\u003cstrong\u003e sleeping solution for dynamic cooling and heating; and \u003c/strong\u003e\u003ca href=\"https://wealthfront.com/Tim\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cstrong\u003eWealthfront\u003c/strong\u003e\u003c/a\u003e\u003cstrong\u003e high-yield cash account\u003c/strong\u003e.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003cdiv\u003e\u003cp\u003eJohn Arnold with Dr. Peter Attia — The Greatest Energy Trader of All Time on Lessons Learned, Walking Away from Wall Street, and Reinventing Philanthropy\u003c/p\u003e\u003c/div\u003e\n\n\n\n\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eThis episode is brought to you by \u003ca target=\"_blank\" href=\"http://vanta.com/tim\"\u003eVanta\u003c/a\u003e! \u003c/strong\u003eVanta automates compliance for frameworks like SOC 2, ISO 27001, and HIPAA, making it simple and \u003cem\u003efast\u003c/em\u003e to get enterprise-grade compliant. Just like 10,000+ other companies that rely on Vanta, my friends at Duolingo and Ramp (a sponsor of this podcast and an ultra-fast growing company) both \u003cstrong\u003e\u003ca target=\"_blank\" href=\"http://vanta.com/tim\"\u003euse Vanta to handle security compliance\u003c/a\u003e\u003c/strong\u003e. \u003c/p\u003e\u003cp\u003eIt all adds up to impressive results: companies save up to 85% of costs, get compliant in weeks instead of months, and complete security questionnaires up to 5 times faster. \u003cstrong\u003eSo check out \u003ca target=\"_blank\" href=\"http://vanta.com/tim\"\u003eVanta.com/Tim\u003c/a\u003e to see how Vanta can help you level up your security program. My listeners, that’s you, can get $1,000 off.\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eThis episode is brought to you by Wealthfront!\u003c/strong\u003e Wealthfront is a financial services platform that offers services to help you save and invest your money. Right now, you can earn 4.00% APY—that’s the Annual Percentage Yield—with the \u003ca href=\"http://wealthfront.com/Tim\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eWealthfront Brokerage Cash Accoount\u003c/a\u003e. That’s nearly 10x more interest than if you left your money in a savings account at the average bank, with savings rates at 0.42%, according to FDIC.gov, as of 05/19/2025. It takes just a few minutes to sign up, and then you’ll immediately start earning 4.00% APY from program  banks on your uninvested cash. \u003cstrong\u003eAnd when new clients open an account today, they’ll get \u003ca href=\"http://wealthfront.com/Tim\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ean extra $50 bonus\u003c/a\u003e with a deposit of $500 or more. Terms and Conditions apply.  Visit \u003ca href=\"http://wealthfront.com/Tim\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eWealthfront.com/Tim\u003c/a\u003e to get started. \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eCash Account offered by Wealthfront Brokerage LLC, member FINRA/SIPC. Wealthfront is not a bank. The APY on cash deposits as of 04/30/2025, is representative, subject to change, and requires no minimum. Funds in the Cash Account are swept to program banks, where they earn a variable APY. Tim receives cash compensation from Wealthfront Brokerage for advertising and holds a non-controlling equity interest in the corporate parent of Wealthfront Brokerage. Tim and Wealthfront Brokerage have no other affiliation. Tim reflects his own opinions and Wealthfront does not endorse, sponsor, or promote them. See full disclosures \u003ca href=\"https://cash.wealthfront.com/tim?utm_medium=podcast\u0026amp;utm_source=timferrissshow\u0026amp;utm_campaign=podcast_cash_50incentive\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ehere\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eThis episode is brought to you by \u003c/strong\u003e\u003ca href=\"http://eightsleep.com/Tim\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cstrong\u003eEight Sleep\u003c/strong\u003e\u003c/a\u003e\u003cstrong\u003e. \u003c/strong\u003eTemperature is one of the main causes of poor sleep, and heat is my personal nemesis. I’ve suffered for decades, tossing and turning, throwing blankets off, pulling them back on, and repeating ad nauseam. But a few years ago, I started using the Pod Cover, and it has transformed my sleep. \u003cstrong\u003e\u003ca target=\"_blank\" href=\"http://eightsleep.com/Tim\"\u003eEight Sleep has launched their newest generation of the Pod: Pod 5 Ultra\u003c/a\u003e.\u003c/strong\u003e It cools, it heats, and now it elevates, automatically. With the best temperature performance to date, Pod 5 Ultra ensures you and your partner stay cool in the heat and cozy warm in the cold. Plus, it automatically tracks your sleep time, snoring, sleep stages, and HRV, all with high precision. For example, their heart rate tracking is at an incredible 99% accuracy.\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\u003cp\u003ePod 5 Ultra also introduces an adjustable Base that fits between your mattress and your bed frame to add custom positions for the best sleeping experience. It also automatically reduces your snoring when detected. Add it easily to any bed. And for full coverage, you can include the Blanket, which uses the same technology as the Pod’s Cover to extend temperature regulation over your entire body.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAnd now, listeners of \u003cem\u003eThe Tim Ferriss Show\u003c/em\u003e can \u003ca target=\"_blank\" href=\"http://eightsleep.com/Tim\"\u003eget $350 off\u003c/a\u003e of the Pod 5 Ultra for a limited time! \u003ca target=\"_blank\" href=\"http://eightsleep.com/Tim\"\u003eClick here to claim this deal and unlock your full potential through optimal sleep\u003c/a\u003e.\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWhat was your favorite quote or lesson from this episode? Please let me know \u003ca href=\"#respond\"\u003ein the comments\u003c/a\u003e.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003ch3\u003e\u003cstrong\u003eTimestamps\u003c/strong\u003e (Credit to Peter Attia’s team)\u003c/h3\u003e\n\n\n\n\u003cp\u003e[00:00:00] Start.\u003cbr/\u003e[00:05:37] Peter Attia’s intro: who is John Arnold?\u003cbr/\u003e[00:08:38] John’s background, upbringing, and early entrepreneurial tendencies.\u003cbr/\u003e[00:21:16] John’s time and rise at Enron.\u003cbr/\u003e[00:33:40] Characteristics that made John an exceptional natural gas trader and how they translate to his philanthropic work.\u003cbr/\u003e[00:41:10] The collapse of Enron.\u003cbr/\u003e[00:46:46] The success of John’s hedge fund, and his early interest in philanthropy.\u003cbr/\u003e[01:02:03] The infamous 2006 trade that brought down Amaranth Advisors.\u003cbr/\u003e[01:08:28] John’s analytical prowess and emphasis on fundamentals.\u003cbr/\u003e[01:15:13] The decision to become a full-time philanthropist and the founding of Arnold Ventures.\u003cbr/\u003e[01:25:03] Education — John’s quest to fundamentally change K-12 education.\u003cbr/\u003e[01:30:36] Strategic philanthropy — preventing problems by attacking root causes and creating structural change.\u003cbr/\u003e[01:37:50] The criminal justice system — structural changes needed to address mass incarceration, policing practices, and recidivism.\u003cbr/\u003e[01:55:07] Re-imagining prisons to reduce recidivism.\u003cbr/\u003e[02:02:27] US health care policy — John’s focus on drug prices, and the severe consequences of not making system changes.\u003cbr/\u003e[02:20:00] Climate change — the bipartisan role of John’s foundation.\u003cbr/\u003e[02:23:52] Advice for young adults interested in philanthropy.\u003cbr/\u003e[02:30:52] Parting thoughts.\u003c/p\u003e\n\n\n\n\u003ch2\u003eShow Notes — Created by Peter Attia’s Team \u003c/h2\u003e\n\n\n\n\u003ch2\u003eJohn’s background, upbringing, and early entrepreneurial tendencies\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWho is John?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eHe’s an “\u003cem\u003eequal opportunity special interest pot stirrer\u003c/em\u003e”\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn and his \u003ca href=\"https://www.arnoldventures.org/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003efoundation\u003c/a\u003e get major flack from both the left and the right politically (Therefore, the issues he attempts to zoom in to are ones where the l\u003cem\u003eeft and the right are starting to come together)\u003c/em\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003ePrior to the foundation, John made his fortune as a natural gas trader\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eArnold Ventures\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://www.arnoldventures.org/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eArnold Ventures\u003c/a\u003e, the foundation founded by John and his wife \u003ca href=\"https://www.arnoldventures.org/people/laura-arnold-john-arnold\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eLaura\u003c/a\u003e, is currently focusing mostly on health policy, public finance platforms, and criminal justice\u003c/li\u003e\n\n\n\n\u003cli\u003eFoundation gives about 400 million away each year\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“Our philanthropic intent is to give away the vast majority of our money during our lifetime.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eAn entrepreneur from a young age\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eJohn was an entrepreneur and an aspiring businessman starting as a young kid\u003c/li\u003e\n\n\n\n\u003cli\u003eAt 12 he mowed lawns but realized not much money and too much competition\u003c/li\u003e\n\n\n\n\u003cli\u003eStarted selling sports cards at age 14\u003c/li\u003e\n\n\n\n\u003cli\u003eWith the trading card work, he basically figured out geographical areas of arbitrage within the trading card industry and created a business out of it\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“I ended up spending a couple summers just full time on this baseball card, really geographic arbitrage and information arbitrage, that I would have a sense of who the best buyer was for every product.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eDefining arbitrage—\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e“I would describe arbitrage as taking advantage of price differences with little to no risk.”\u003c/li\u003e\n\n\n\n\u003cli\u003eToday with the internet, a lot of that arbitrage and pricing inefficiencies have gone away or have been, what’s called in the trade, “Arbed out”\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWhat he wanted to do after college\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“I was the guy that was trying to get out of there and into the game as quickly as possible. Every day I was at college, it was one less day that I had to be in the game.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eFrom a young age, John knew he wanted to be in Wall Street\u003c/li\u003e\n\n\n\n\u003cli\u003eHe didn’t know much about it, but he felt like it was the “biggest game around”\u003c/li\u003e\n\n\n\n\u003cli\u003eThe books \u003ca href=\"https://www.amazon.com/Liars-Poker-Mchael-Lews/dp/B003B12P62/ref=sr_1_2?dchild=1\u0026amp;keywords=liar%27s+poker+1989\u0026amp;qid=1598130318\u0026amp;s=books\u0026amp;sr=1-2\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eLiar’s Poker\u003c/a\u003e as well as \u003ca href=\"https://www.amazon.com/Barbarians-Gate-Fall-RJR-Nabisco/dp/0099545837/ref=tmm_pap_swatch_0?_encoding=UTF8\u0026amp;qid=\u0026amp;sr=\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBarbarians at the Gate\u003c/a\u003e intensified his interest\u003c/li\u003e\n\n\n\n\u003cli\u003eDuring college, he was focused on getting out of there and into the game as quickly as possible\u003c/li\u003e\n\n\n\n\u003cli\u003eDespite not being recruited heavily, he talked his way into an interview at Enron and was offered an analyst position\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2\u003eJohn’s time and rise at Enron\u003c/h2\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eJohn arrived at \u003ca href=\"https://en.wikipedia.org/wiki/Enron\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eEnron\u003c/a\u003e in 1995, before it was all that well-known\u003c/li\u003e\n\n\n\n\u003cli\u003eHistorically, Enron was a pipeline company\u003c/li\u003e\n\n\n\n\u003cli\u003eThe natural gas industry was regulated heavily until 1992 when it became deregulated \u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eWhat that meant to the industry\u003c/em\u003e:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003ePrevious to 1992, the pipeline was responsible for providing the merchant services to the buyer and seller\u003c/li\u003e\n\n\n\n\u003cli\u003eSo the producer of gas would sell to the pipeline \u003c/li\u003e\n\n\n\n\u003cli\u003eAnd then the pipeline would transport the gas and sell it to the customer\u003c/li\u003e\n\n\n\n\u003cli\u003eIt was viewed that this was negative because pipelines are natural monopolies frequently, and so the services and the cost of those services were too high\u003c/li\u003e\n\n\n\n\u003cli\u003eSo in 1992, they deregulate it and here is Enron as the gas merchant\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eIn 1995, there were 2 aspects to Enron’s business:\u003c/p\u003e\n\n\n\n\u003cp\u003e1 – The historical pipeline business \u003c/p\u003e\n\n\n\n\u003cp\u003e2 – A new “investment bank” side\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eAround that time was when the decision was made to promote \u003ca href=\"https://en.wikipedia.org/wiki/Jeffrey_Skilling\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eJeff Skilling\u003c/a\u003e to the #2 position of the company\u003c/li\u003e\n\n\n\n\u003cli\u003eThis made sense because the company was looking to move towards the investment bank/trading business as, generally speaking, the return on equity is higher if you have fewer assets (sort of the direction of corporate America at the time)\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eJohn first job at Enron\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eFirst job was as an analyst on the trading floor – very rare for first position\u003c/li\u003e\n\n\n\n\u003cli\u003eHe wasn’t trading right away, more just running spreadsheets and analytical work\u003c/li\u003e\n\n\n\n\u003cli\u003eHe was able to learn the business up close\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn quickly realized that a trading career was directly in line with his skillset\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“I found the perfect job for my skill set as my first job. And I think that’s pretty rare, and it happened by accident. I could have very easily ended up a mergers and acquisition investment banker at Merrill Lynch, but I ended up trading commodities at a relative upstart of a company that was just the perfect spot for my skill set.” \u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eHow John rose so quickly through Enron\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eAll new hires were supposed to do four 6-month rotations in different sides of the business then they go back to business school\u003c/li\u003e\n\n\n\n\u003cli\u003eBut they made an exception for John as he was really well liked in the natural gas group\u003c/li\u003e\n\n\n\n\u003cli\u003eHowever, one of the traders made a big mistake on the trading floor and the group had to be dissolved\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn had the choice to go to the UK or go downstairs and work in the \u003cstrong\u003enatural gas trading grou\u003c/strong\u003ep\u003c/li\u003e\n\n\n\n\u003cli\u003eWhile tempted to go overseas,\u003cem\u003e John knew the natural gas group was the future at Enron \u003c/em\u003eso he chose that route\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWinter of 1996—“\u003c/strong\u003e\u003cstrong\u003e\u003cem\u003eA whole new game\u003c/em\u003e\u003c/strong\u003e\u003cstrong\u003e”\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eThis is when the natural gas prices “blew out” John says—It was an extremely cold winter and all the historical relationships that gas had just completely changed\u003c/li\u003e\n\n\n\n\u003cli\u003ePeople who had spent their entire career in gas weren’t sure if they knew anything about gas anymore\u003c/li\u003e\n\n\n\n\u003cli\u003e“\u003cstrong\u003e\u003cem\u003eIt was a whole new game.\u003c/em\u003e\u003c/strong\u003e”\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cem\u003eFirst job within the natural gas division\u003c/em\u003e: They put John as an assistant trader with a gentleman who had the expertise on the physical side of the business and they were told to “go figure this out”\u003c/li\u003e\n\n\n\n\u003cli\u003eAround this time is when Enron became a “darling” in the industry\u003c/li\u003e\n\n\n\n\u003cli\u003eThe mid-level guys were being poached by competitive companies making Enron a unique environment for a smart and responsible young person to rise quickly\u003c/li\u003e\n\n\n\n\u003cli\u003eBy the time John was 25, he was the \u003cstrong\u003ehead natural gas trader at the largest natural gas trading company in the industry\u003c/strong\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eWhile John benefited greatly from this “merit-based” system of promotion, he suspects the company gave out too much responsibility and didn’t have enough control—\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“\u003cem\u003eI think it ended up being the downfall of the company as well, as there just wasn’t the controls on people who were given too much responsibility, too much of the company’s balance sheet to use without their adequate controls on it.\u003c/em\u003e”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003ch2\u003eCharacteristics that made John an exceptional natural gas trader and how they translate to his philanthropic work\u003c/h2\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“The stress level was intense. I think I’m very good at handling stress, but the stress level was intense to a point of not being healthy.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eIn a given day, John was trading \u003cstrong\u003ebillions of dollars\u003c/strong\u003e of notional value of gas\u003c/li\u003e\n\n\n\n\u003cli\u003eMuch of it was trying to buy at $2 and trying to sell it at $2 and a half penny for enormous volumes\u003c/li\u003e\n\n\n\n\u003cli\u003eFrom the moment you sat down in the morning until about 4pm, it was just nonstop trading\u003c/li\u003e\n\n\n\n\u003cli\u003eFood was delivered to your desk, and bathroom breaks meant running back and forth\u003c/li\u003e\n\n\n\n\u003cli\u003eThis non-stop stress is why traders generally have short trading careers\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eHow do many traders destress?\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eDestressing for traders usually meant drinking, partying, gambling, etc. \u003c/li\u003e\n\n\n\n\u003cli\u003eIn his 20s, he gained weight and was just not at all healthy especially compared to him now \u003c/li\u003e\n\n\n\n\u003cli\u003eJohn gravitated away from that lifestyle in his 30s when he matured, got married, kids, etc.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eDid John experience an “addiction” to the “high” of trading?\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eIt’s not uncommon for traders to be addicted to the rush, the high, the physiologic response that they get to a good trade\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn says he knows the feeling and saw many traders afflicted by this\u003c/li\u003e\n\n\n\n\u003cli\u003eHowever, he felt like he wasn’t addicted to it\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eWhat made John such an exceptional trader?\u003c/em\u003e\u003c/strong\u003e\u003cem\u003e \u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eJohn credits his success to two traits:\n\u003cul\u003e\n\u003cli\u003e1-His ability to not let emotions impact his decision making process\u003c/li\u003e\n\n\n\n\u003cli\u003e2-He fell perfectly on the confidence spectrum (confident but not too arrogant)\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eRegarding \u003c/em\u003e\u003cstrong\u003e\u003cem\u003eemotional detachmen\u003c/em\u003e\u003c/strong\u003e\u003cstrong\u003et\u003c/strong\u003e—\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eWhether he was having a great day or the worst day, you couldn’t tell by looking at him\u003c/li\u003e\n\n\n\n\u003cli\u003eHe instead was just “\u003cstrong\u003e\u003cem\u003e100% focused on executing the process\u003c/em\u003e\u003c/strong\u003e”\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e⇒ There’s a saying in the investment world, “\u003cem\u003eFear and greed drives a lot of price trends in financial assets.\u003c/em\u003e” \u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eThis phrase refers to the fact that many traders are either greedy or fearful and that’s driving your behavior\u003c/li\u003e\n\n\n\n\u003cli\u003eThe more you can eliminate those fear and greed from the trading process, the better you get\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eThe \u003c/em\u003e\u003cstrong\u003e\u003cem\u003econfidence spectrum\u003c/em\u003e\u003c/strong\u003e—\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eJohn says he fell perfectly on the confidence spectrum\u003c/li\u003e\n\n\n\n\u003cli\u003eConfidence is key, but you can’t be too arrogant—arrogance has been the “\u003cem\u003edestroyer of many trading careers\u003c/em\u003e”\u003c/li\u003e\n\n\n\n\u003cli\u003eThe right way to think is, “\u003cstrong\u003e\u003cem\u003eI’m confident in my view on this, but I know I might be wrong.\u003c/em\u003e\u003c/strong\u003e”\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eHow did these traits translate into John’s philanthropy work?\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eJohn says these traits translated very well\u003c/li\u003e\n\n\n\n\u003cli\u003eWith his foundation they come up with plenty of theories on how to solve a complex issue\u003c/li\u003e\n\n\n\n\u003cli\u003eYou must have confidence in that theory, however, you must not be wedded to it because you know you could be wrong \u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“Everything we’re doing in the foundation is evidence-based, but the evidence is never perfect.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003ch2\u003eThe collapse of Enron \u003c/h2\u003e\n\n\n\n\u003cp\u003eBook about the fall of Enron: \u003ca href=\"https://www.amazon.com/Smartest-Guys-Room-Amazing-Scandalous/dp/1591840538\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eThe Smartest Guys in the Room\u003c/a\u003e \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003ePreceding Enron’s collapse…\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eJohn’s trading group was wildly successful\u003c/li\u003e\n\n\n\n\u003cli\u003eYet, Enron was soon to be bankrupt\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn was so singularly focused on his job that he didn’t have much of a sense as to what was going so wrong in other divisions\u003c/li\u003e\n\n\n\n\u003cli\u003eEnron, like most companies at the time, was \u003ca href=\"https://en.wikipedia.org/wiki/Disintermediation\" target=\"_blank\" rel=\"noreferrer noopener\"\u003edisintermediating\u003c/a\u003e their business chain\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eBad decisions—\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eThere were some bad decisions being made in those other sectors that were leading to the downfall\u003c/li\u003e\n\n\n\n\u003cli\u003eIn parallel, there was a culture of \u003cstrong\u003enever being able to admit failure\u003c/strong\u003e \u003c/li\u003e\n\n\n\n\u003cli\u003eEnron had morphed into a financial business which is completely contingent upon having the faith of your creditors (i.e., Wall Street)\u003c/li\u003e\n\n\n\n\u003cli\u003eOnce Wall Street loses faith in you and refuses to fund you, “\u003cem\u003ethe business is toast\u003c/em\u003e” — And that’s what happened to Enron\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eWhen did John realize his career at Enron was going to be cut short?\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eJohn was likely the most profitable person at Enron\u003c/li\u003e\n\n\n\n\u003cli\u003eBut it became clear that the company was in trouble\u003c/li\u003e\n\n\n\n\u003cli\u003eEnron eventually reached a deal with a JV partner (a New York bank) but John had different view on how the business should proceed and he decided to leave\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2\u003eThe success of John’s hedge fund, and his early interest in philanthropy \u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eWhen John was still at Enron…\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eMany people were calling John saying they wanted to invest with him if he did his “own thing”\u003c/li\u003e\n\n\n\n\u003cli\u003eWhen John knew Enron was collapsing, he started a fund, hired people, bought equipment, etc.\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn had plans to raise $50 million for his fund and would’ve easily had the investors to do so\u003c/li\u003e\n\n\n\n\u003cli\u003eBut then BOOM—the investigating into Enron breaks open and nobody knows if john was a fraud or if he was going to prison\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn started \u003ca href=\"https://en.wikipedia.org/wiki/John_D._Arnold#Centaurus\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eCentaurus\u003c/a\u003e (hedge fund) but had to settle for only $8 mil initial funding (his money plus 2 investors)\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eHow John grew \u003c/strong\u003e\u003ca href=\"https://en.wikipedia.org/wiki/John_D._Arnold#Centaurus\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cstrong\u003eCentaurus\u003c/strong\u003e\u003c/a\u003e\u003cstrong\u003e so successfully\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eAfter Enron scandal, about half the pipeline and electric utility merchant/trading businesses were out of business because that industry fell out of favor with Wall Street\u003c/li\u003e\n\n\n\n\u003cli\u003eThe market became \u003cstrong\u003eincredibly inefficient \u003c/strong\u003eand there was a great need for \u003cstrong\u003erisk intermediation/risk warehousing\u003c/strong\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eIt was very low risk for arbitrage type trades that shouldn’t exist in a \u003cem\u003enormally\u003c/em\u003e functioning market that existed for that next year just because the market players had been so decimated\u003c/li\u003e\n\n\n\n\u003cli\u003eThis low-risk model resulted in John’s fund making $3 million in the first month, and was up 150% in 3 months\u003c/li\u003e\n\n\n\n\u003cli\u003eWith that success, investors became interested again which helped increase his \u003ca href=\"https://en.wikipedia.org/wiki/Assets_under_management\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eAUM\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eThe synergy of market arbitrage plus speculative trading\u003c/strong\u003e:\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eThe two strands of John’s hedge fund\u003c/em\u003e—\u003c/p\u003e\n\n\n\n\u003cp\u003e 1) Providing liquidity and getting paid for the service of warehousing some risks, and \u003c/p\u003e\n\n\n\n\u003cp\u003e 2) Speculative trading – Trying to make a call on where natural gas prices were going next\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eIn the first few years, his business was mostly doing the low risk stuff to create the base and an upward trend in profitability\u003c/li\u003e\n\n\n\n\u003cli\u003eBut on top of that line of business, John started doing more and more speculative trading\u003c/li\u003e\n\n\n\n\u003cli\u003eThis worked well because if he was ever wrong on a market call, he wouldn’t be decimated since he was still making money on the arbitrage side of the business\u003c/li\u003e\n\n\n\n\u003cli\u003eThe inefficiency in the market, which created the low-risk arbitrage, made it the “\u003cstrong\u003e\u003cem\u003eperfect time to be in natural gas\u003c/em\u003e\u003c/strong\u003e”\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eThe moment John realized he’d never have to worry about money again:\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eIn 2002/2003, the demand was high and supply wasn’t keeping up\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn wasn’t the only trader that recognized this, however, the \u003cstrong\u003erisk/reward was being very misvalued\u003c/strong\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn recognized that if they were to have a very cold winter in 2002 or 2003, the gas market could experience some significant shortages and there would be corresponding price spikes\u003c/li\u003e\n\n\n\n\u003cli\u003eThis cold weather event was perhaps a \u003cstrong\u003e1 in 5 probability\u003c/strong\u003e, but the bets were pricing them as if it was \u003cstrong\u003e1 in 50\u003c/strong\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eThere ended up being a 2-day stretch in late February 2003 which sent prices to one of the three highest gas prices in the last 20 years\u003c/li\u003e\n\n\n\n\u003cli\u003eThe fund \u003cstrong\u003emore than doubled\u003c/strong\u003e in those two days in terms of total assets\u003c/li\u003e\n\n\n\n\u003cli\u003eAfterwards, he called his mom to say, “\u003cstrong\u003e\u003cem\u003eWe’re set. We have financial security now forever regardless of what happens\u003c/em\u003e\u003c/strong\u003e\u003cem\u003e.\u003c/em\u003e”\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWhen did John first start thinking about philanthropy?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“I always recognized the limited social value of trading. I think there is a need for someone to provide risk warehousing and liquidity to markets, but trying to tell the story about how I was adding value or contributing to society was hard. And that always bothered me.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eJohn began thinking about trading in his early Enron days (He was getting paid well — 100k bonus checks)\u003c/li\u003e\n\n\n\n\u003cli\u003eHis charitable interest gravitated towards \u003cstrong\u003eK-12 education\u003c/strong\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eHe found \u003ca href=\"https://www.kipp.org/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eKIPP Charter Schools\u003c/a\u003e and gave them a \u003cem\u003e5-figure donation\u003c/em\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eThis was the start of his very long journey, thinking about K-12 education in the country\u003c/li\u003e\n\n\n\n\u003cli\u003eBut in 2002/2003, after his massive early success with his hedge fund, he was only thinking about philanthropy about 1% of the time.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWhen John’s hedge fund started gaining major attention\u003c/strong\u003e:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eAt some point a magazine published the top 100 traders and listed john at top 5 in making money\u003c/li\u003e\n\n\n\n\u003cli\u003eThis sort of broadcast to the rest of the industry that something was going on in natural gas\u003c/li\u003e\n\n\n\n\u003cli\u003eThis naturally brought in a bunch of new entrants in the gas market\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn made a deliberate decision keep the focus of the business narrow—Didn’t want to trade oil,  didn’t want to trade natural gas stocks or natural gas bonds, didn’t want to trade agriculture\u003c/li\u003e\n\n\n\n\u003cli\u003e“\u003cstrong\u003e\u003cem\u003eI wanted to be the best in the world at North American natural gas and power trading\u003c/em\u003e\u003c/strong\u003e.”\u003c/li\u003e\n\n\n\n\u003cli\u003eThis was a strategic move to put a natural limit as to the amount of assets that they could manage\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn’s assets under management (AUM) peaked around \u003cstrong\u003e$6 billion\u003c/strong\u003e—This was bordering on too big because you may be spreading yourself too thin into areas that you don’t have the deepest domain expertise\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eJohn business was \u003c/em\u003e\u003cstrong\u003e\u003cem\u003eall about return\u003c/em\u003e\u003c/strong\u003e\u003cem\u003e (not fees from investors)—\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eJohn wasn’t in it to make fees from investors\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn was personally the largest investor in the fund \u003c/li\u003e\n\n\n\n\u003cli\u003eSo he was in it for the \u003cstrong\u003ereturn on the money\u003c/strong\u003e and that’s how he pitch it to potential investors\u003c/li\u003e\n\n\n\n\u003cli\u003eIt was always driven by: \u003cem\u003eHow do I want my money managed?\u003c/em\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2\u003eThe infamous 2006 trade that brought down Amaranth Advisors \u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eBackground\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://en.wikipedia.org/wiki/Brian_Hunter_(trader)\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBrian Hunter\u003c/a\u003e and \u003ca href=\"https://en.wikipedia.org/wiki/Amaranth_Advisors\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eAmaranth Advisors\u003c/a\u003e did very well in 2005 during the hurricane season\u003c/li\u003e\n\n\n\n\u003cli\u003eThe impact of \u003ca href=\"https://en.wikipedia.org/wiki/Hurricane_Katrina\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eHurricane Katrina\u003c/a\u003e created a massive shortage in gas and the price of gas had one of the greatest peaks in last ~30 years\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eAfter 2005, two things happened in the industry—\u003c/p\u003e\n\n\n\n\u003col\u003e\n\u003cli\u003eA belief that the increasing frequency and intensity of hurricanes would damage the structure of the energy sector and natural gas sector\u003c/li\u003e\n\n\n\n\u003cli\u003eThere would be a great fear amongst any trader to be \u003cstrong\u003eshort\u003c/strong\u003e during that time period (the hurricane season)\u003c/li\u003e\n\u003c/ol\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eAmaranth’s position in 2006\u003c/strong\u003e—\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eIn 2005, Brian Hunter, the head trader at \u003ca href=\"https://en.wikipedia.org/wiki/Amaranth_Advisors\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eAmaranth\u003c/a\u003e, was in the \u003cstrong\u003elong position\u003c/strong\u003e and made tons of money when gas prices spiked after Hurricane Katrina caused massive shortages in supply\u003c/li\u003e\n\n\n\n\u003cli\u003eBrian thought something similar would happen (or at least a big scare would happen) in 2006 causing the same type of move in gas prices\u003c/li\u003e\n\n\n\n\u003cli\u003eHowever, the 2005 Katrina event sent the signal to every producer to \u003cstrong\u003eincrease supplies\u003c/strong\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn, who had a 25% opposite position of Brian, could see that supplies were ramping up in 2006\u003c/li\u003e\n\n\n\n\u003cli\u003eDespite this increase in supply, Brian continued buying more and more—so much that he distorted the relative values in that market\u003c/li\u003e\n\n\n\n\u003cli\u003eThe story is often told like it was \u003cem\u003eBrian vs. John\u003c/em\u003e (John had a 25% opposite position) \u003c/li\u003e\n\n\n\n\u003cli\u003eReality is that it was the \u003cem\u003ewhole market (including John) versus Brian\u003c/em\u003e, because Brian was such a large long position in this\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eSo what happened in 2006?\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eThere was no hurricane in 2006, and prices collapsed\u003c/li\u003e\n\n\n\n\u003cli\u003eBrian couldn’t hold up the prices any longer and it destroyed Amaranth\u003c/li\u003e\n\n\n\n\u003cli\u003eThe story is framed as if Brian and John had competing bets as to \u003cstrong\u003ewhat the \u003c/strong\u003e\u003cstrong\u003e\u003cem\u003eweather\u003c/em\u003e\u003c/strong\u003e\u003cstrong\u003e was going to do\u003c/strong\u003e \u003c/li\u003e\n\n\n\n\u003cli\u003eHowever, it was actually taking a position on the more important question–\u003cstrong\u003e\u003cem\u003esupply\u003c/em\u003e\u003c/strong\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn felt like even if they WERE hit with a demand shock from a weather event, the market was much better prepared to absorb the hit compared to 2005\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eHow John thought about the situation\u003c/em\u003e:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e“You had this probability distribution function of the possible outcomes. And then think about, under each outcome, ‘how would I think about what fair value is of the commodity at that time?’”\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eThe mistake Brian made was\u003c/strong\u003e—The market was already so mispriced to expected value that even had you had the supply shock happen, what was the upside? “We’re already priced for that.”\u003c/li\u003e\n\n\n\n\u003cli\u003ePeter adds, “\u003cem\u003eYou realize that it was probably a bit more of an error in hubris as well, which goes back to your point about maybe being a little too confident in your ability to predict what’s going to happen.\u003c/em\u003e”\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2\u003eJohn’s analytical prowess and emphasis on fundamentals \u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eJohn has a “third superpower”—an insatiable, bordering on pathological, obsession for knowing everything\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003ePeter knows the feeling\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn says his appetite for knowledge has served him well in trading and philanthropy\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eIn his trading days…\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eBy being a hedge fund and not being in the physical business (dealing with customers, etc.), John says they were at an “information disadvantage”\u003c/li\u003e\n\n\n\n\u003cli\u003eSo when a counterparty put up an opposite trade of John’s position, he was always thinking about:\n\u003cul\u003e\n\u003cli\u003e\u003cem\u003eWhat are they thinking? \u003c/em\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cem\u003eWhat do they know?\u003c/em\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eCan I replicate as best I can, the knowledge that they have so that I can make an educated and confident decision?\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn’s team was at an information handicap (compared to say, \u003ca href=\"https://en.wikipedia.org/wiki/BP\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBP\u003c/a\u003e) \u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eHow did John make up for this informational disadvantage?\u003c/em\u003e \u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003e1) Better analysis\u003c/strong\u003e—knowing where to get third party information, having better analysis, and crafting better models that described what the past was and thus what the future is going to be\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003e2) The biggest fundamental research department\u003c/strong\u003e  — i.e., count the molecules, try to count as many molecules as you can—Where did it come from? Where did it travel? How was it consumed?\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“Our advantage was that we’re going to invest in the fundamentals more than anybody else is and then overlay that with some good trading.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e3 main reasons why trading natural gas was “easier” than oil:\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e 1) \u003cstrong\u003eIt was this closed system\u003c/strong\u003e —the molecules, for the most part, just stayed in North America\u003c/p\u003e\n\n\n\n\u003cp\u003e 2) \u003cstrong\u003eDeregulation got the pipelines out of the business of trading\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eThe pipelines, which had the most fundamental information about where the gas came from and where it was going, now had to publish all this information publicly and they couldn’t trade on it \u003c/li\u003e\n\n\n\n\u003cli\u003eCompare that versus oil, Exxon can own the oil platform in the Gulf of Mexico, stick it on an Exxon ship, take it to an Exxon owned refinery and put it in Exxon gas stations. And so as an outsider, trying to figure out and track those molecules, it’s impossible.\u003c/li\u003e\n\n\n\n\u003cli\u003eThat’s why the best, most profitable oil traders have to be in the physical business\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e 3) \u003cstrong\u003eTwice a year, there was a mechanism to get you back close to fair value\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eBecause nat. gas was a seasonal product, you store it during the summer getting ready for the peak winter demand which created a window of what it should be when you exit the winter\u003c/li\u003e\n\n\n\n\u003cli\u003eCompare that to a tech stock today— there’s no forcing mechanism that necessarily has to get that tech stock back to one’s belief of fair value\u003c/li\u003e\n\n\n\n\u003cli\u003eSo with nat gas… while price could deviate from fundamental value for parts of the time of the year, twice a year, it kind of had to go back to that fair value, which was \u003cstrong\u003egreat as a fundamental trader\u003c/strong\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2\u003eThe decision to become a full-time philanthropist and the founding of Arnold Ventures \u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eDeciding to focus on philanthropy\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“I started thinking more about giving the money away than making more of it. That was really the signal to me that I want to be spending my time on the other side of the table and I’m physically and mentally, emotionally exhausted with trading natural gas.” \u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eMet his wife, Laura, in early 2006 and got married not long after \u003c/li\u003e\n\n\n\n\u003cli\u003eThey both started to really think about ‘\u003cstrong\u003e\u003cem\u003ewhat should we do with our lives now?\u003c/em\u003e\u003c/strong\u003e’\u003c/li\u003e\n\n\n\n\u003cli\u003eIn 2006, 3% of his focus on philanthropy\u003c/li\u003e\n\n\n\n\u003cli\u003eBut by 2008, John and Laura had founded \u003ca href=\"https://en.wikipedia.org/wiki/Arnold_Ventures_LLC\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eArnold Ventures\u003c/a\u003e and John was putting about my 10-15% of his energy into the foundation\u003c/li\u003e\n\n\n\n\u003cli\u003eThis became an issue because \u003cstrong\u003etrading takes 100% laser focus\u003c/strong\u003e in order stay above the competition\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eIn 2012, John decided it’s time to \u003cstrong\u003eshut down his hedge fund\u003c/strong\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eThis was more than a decade living and breathing nothing but natural gas\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eA hard decision\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eIt was a hard decision to make, says John, but it got easier because \u003cem\u003ethings had changed in the market—\u003c/em\u003e\n\u003cul\u003e\n\u003cli\u003eThe shale revolution increased supply greatly\u003c/li\u003e\n\n\n\n\u003cli\u003eThe market went from being very volatile with booms and busts, to one that was in perpetual oversupply and kind of bouncing around marginal cost to produce\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn had to give billions of dollars back to investors because the market opportunity was no longer there to the same degree\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“When you’ve been playing in Vegas with the $25 table to go back down to the $5 table. It’s just not as emotionally interesting.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eSummary of factors leading to the shutdown of his hedge fund—\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eGot married, had kids\u003c/li\u003e\n\n\n\n\u003cli\u003eNew regulations put into the business (largely due to the Brian Hunter/Amaranth episodes)\u003c/li\u003e\n\n\n\n\u003cli\u003eArbitrage and opportunity in the market became harder to find\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn began to lose the focus as his interest in the foundation was increasing\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“These things came together and it still took me two years to make that call, that it’s time, it’s time to close this up and go find happiness somewhere else.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eSkills in trading that translated to philanthropy:\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e  1-\u003cstrong\u003eEmotional temperament\u003c/strong\u003e—not letting your feelings get in the way of what you’re doing\u003c/p\u003e\n\n\n\n\u003cp\u003e  2-Having the \u003cstrong\u003eright amount of confidence\u003c/strong\u003e \u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eYou have to be able to say, “Yeah, this is a huge and hard problem, but we should go after it.”\u003c/li\u003e\n\n\n\n\u003cli\u003eBut maybe not too much confidence to say, “We’re going to solve this problem no matter what.”\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e  3-An ability to \u003cstrong\u003ebecome an expert\u003c/strong\u003e in something in a relatively short period of time\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003ePeter compares John to Bill Gates, who is the ultimate example (check out the \u003ca href=\"https://www.netflix.com/title/80184771\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBill Gates documentary\u003c/a\u003e)\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2\u003eEducation—John’s quest to fundamentally change K-12 education\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eK-12 education — the first problem the foundation looked at deeply\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe questions John had about K-12 education:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eWhy does one school have different results from a school down the street serving a very similar population of kids?\u003c/li\u003e\n\n\n\n\u003cli\u003eHow do you take what the best individual schools are doing and scale that?\u003c/li\u003e\n\n\n\n\u003cli\u003eWhat makes a school better?\n\u003cul\u003e\n\u003cli\u003eIs it small schools? \u003c/li\u003e\n\n\n\n\u003cli\u003eIs it better principals? \u003c/li\u003e\n\n\n\n\u003cli\u003eIs it better teachers? \u003c/li\u003e\n\n\n\n\u003cli\u003eIs it the curriculum? \u003c/li\u003e\n\n\n\n\u003cli\u003eIs it technology? \u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\n\n\n\u003cli\u003eWhat’s the idea that \u003cstrong\u003escales\u003c/strong\u003e and creates \u003cstrong\u003estructural change\u003c/strong\u003e?\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“[K-12] is just the most fundamental issue facing long-term health and viability of this country.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eThe theory of change that drives John’s work in K-12:\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eThe theory\u003c/em\u003e: Strong and robust systems of any kind have the attributes of biological evolution\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eIn living organisms you have,\n\u003cul\u003e\n\u003cli\u003eVariance amongst the organisms with the differential fitness\u003c/li\u003e\n\n\n\n\u003cli\u003eThere’s a different rate of survival and reproduction\u003c/li\u003e\n\n\n\n\u003cli\u003eAnd then inheritability of fitness\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\n\n\n\u003cli\u003eYou need to have a \u003cstrong\u003estrong and robust system and that’s getting better over time\u003c/strong\u003e\n\u003cul\u003e\n\u003cli\u003eEducation, generally speaking, is not that (e.g., same curriculum, the same process, the same way of hiring, of training, of trying to develop teachers)\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eIn public education—\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eFor the good ideas, there’s no natural mechanism for that to grow \u003c/li\u003e\n\n\n\n\u003cli\u003eFor the bad/outdated idea, there’s no mechanism for them to stop and go away\u003c/li\u003e\n\n\n\n\u003cli\u003eIn order to have the heritability of traits, you need the learning aspect—but public schools (or really any government monopoly) is not good at quality control and innovation in order to provide the necessary variance\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eArnold Foundation’s theory is that…\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003ei) the school system needs to become a system of schools, and \u003c/li\u003e\n\n\n\n\u003cli\u003eii) the natural role for government is not to be the service provider, but to be the \u003cem\u003eregulator \u003c/em\u003e\n\u003cul\u003e\n\u003cli\u003eCurrently, the government is filling both roles which is a problem because “\u003cstrong\u003e\u003cem\u003eno system can regulate itself\u003c/em\u003e\u003c/strong\u003e\u003cstrong\u003e”\u003c/strong\u003e)\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eIf this theory works…\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eThe parents and kids will have real choice in what type of model they want\u003c/li\u003e\n\n\n\n\u003cli\u003eAn immersion program\u003c/li\u003e\n\n\n\n\u003cli\u003eHigh discipline or regular discipline, \u003c/li\u003e\n\n\n\n\u003cli\u003eAn art school or other specialty, etc.\u003c/li\u003e\n\n\n\n\u003cli\u003eGiving real choice to parents/kids is the “\u003cstrong\u003ebest quality control that can happen\u003c/strong\u003e”\u003c/li\u003e\n\n\n\n\u003cli\u003eThe government, as the regulator, needs to make sure that all kids are served, but is largely out of the business of providing the service of education\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2\u003eStrategic philanthropy—preventing problems by attacking root causes and creating structural change \u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWhat’s the role of philanthropy? \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eCurrently, only about 1% of the economy is philanthropy for social services or social goods\u003c/li\u003e\n\n\n\n\u003cli\u003eA big question John and his foundation think about is: \u003cstrong\u003e\u003cem\u003eWhat’s the best use of that? \u003c/em\u003e\u003c/strong\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eIt can either—\n\u003cul\u003e\n\u003cli\u003e1) \u003cstrong\u003eSupplement government services\u003c/strong\u003e (typically described as charity, i.e., trying to solve today’s problems)\n\u003cul\u003e\n\u003cli\u003eE.g., Giving money to existing programs like a food bank\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\n\n\n\u003cli\u003e2) \u003cstrong\u003eTry to get to the root cause of problems\u003c/strong\u003e with \u003cem\u003estrategic\u003c/em\u003e philanthropy, i.e., \u003cstrong\u003eprevent\u003c/strong\u003e those problems from developing tomorrow\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\n\n\n\u003cli\u003eBoth are important, but John gravitates towards the latter\u003c/li\u003e\n\n\n\n\u003cli\u003eThe latter allows for exploring…\n\u003cul\u003e\n\u003cli\u003e\u003cem\u003eHow does the philanthropic money compliment government services to make them better?\u003c/em\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cem\u003eWhat is the market failure as to why government programs are not working as well as they should?\u003c/em\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eRole for “strategic” philanthropy\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eMost of the existing social non-profits are so focused on simply providing the day-to-day that they have no bandwidth for experimentation or innovation\u003c/li\u003e\n\n\n\n\u003cli\u003eStrategic philanthropy can come in to explore, “How can these actors in these systems perform better?”\u003c/li\u003e\n\n\n\n\u003cli\u003eArnold Foundation spends more of it’s time looking at structural changes to the system b/c it’s scalable in a way that just providing another dollar for a program largely is not\u003c/li\u003e\n\n\n\n\u003cli\u003eStrategic philanthropy requires experts and manpower to explore new ideas, old ideas, theoretical frameworks, potential second order effects of structural changes, etc.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eHow challenging is doing this kind of strategic philanthropy?\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eArnold Foundation has about 120 employees — “\u003cem\u003eWe had no desire or interest to have 120 employees 10 years ago. That was not by design. We thought giving would be easy.\u003c/em\u003e”\u003c/li\u003e\n\n\n\n\u003cli\u003eAt the beginning, John was sifting through the literature\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eExample, the topic like preschool:\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eYou see three papers that say preschool is amazing, it generates all these outcomes later in life\u003c/li\u003e\n\n\n\n\u003cli\u003eThen you see one evaluation of the \u003ca href=\"https://en.wikipedia.org/wiki/Head_Start_(program)\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eHead Start program\u003c/a\u003e that shows it doesn’t really have an effect\u003c/li\u003e\n\n\n\n\u003cli\u003eAs you dig deeper, you see \u003cstrong\u003ehuge arguments\u003c/strong\u003e within this research sector about what the evidence really shows\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eIn every area that John has researched, he finds the same thing—\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eThe first scan through it appears that everything works, it’s all great, writing checks there is a great way to invest money\u003c/li\u003e\n\n\n\n\u003cli\u003eBut as you dig deeper, it gets very frustrating because \u003cstrong\u003ethe more you study, the less you know\u003c/strong\u003e about what worked and what didn’t\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e*One main insight from doing the deep digging:\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003col\u003e\n\u003cli\u003eVery few new programs worked\u003c/li\u003e\n\n\n\n\u003cli\u003eAnd the things that DO work are generally already part of the fabric of society, e.g., K-12 education\u003c/li\u003e\n\u003c/ol\u003e\n\n\n\n\u003cp\u003eThe question for the foundation became:\u003cem\u003e What’s our role? Where could our dollars be most helpful?\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eJohn’s frustration with trying to find the “right program” to fund really led him and the foundation down the path of—\u003cem\u003eHow do you change and improve the system and the incentives and the rules of a system rather than what’s the next program we can fund?\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003ch2\u003eThe criminal justice system—structural changes needed to address mass incarceration, policing practices, and recidivism \u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWhen the criminal justice system got on John’s radar:\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eLaura had a legal background and gave her a perspective on it — one of the first organizations they gave money to was the \u003ca href=\"https://www.innocenceproject.org/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eInnocence Project\u003c/a\u003e by \u003ca href=\"https://en.wikipedia.org/wiki/Barry_Scheck\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBarry Scheck\u003c/a\u003e which got innocent men off of death row\u003c/li\u003e\n\n\n\n\u003cli\u003eThis got them thinking more strategically—\u003cem\u003eHow do we change the system so that the wrongful convictions don’t happen in the first place?\u003c/em\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eThey realized that \u003cstrong\u003echanging the system and policies\u003c/strong\u003e is where they wanted to spend the time—\n\u003cul\u003e\n\u003cli\u003eHigher potential reward\u003c/li\u003e\n\n\n\n\u003cli\u003eIt is harder work and the chance of success is lower\u003c/li\u003e\n\n\n\n\u003cli\u003eBut the impact, if successful, is so much higher if you can improve how the system works\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\n\n\n\u003cli\u003eThe foundation spent an \u003cstrong\u003eentire year\u003c/strong\u003e just thinking about all the ways the inefficiencies in the system was leading to bad outcomes\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“There is this natural impatience. But I think we’ve been smart enough to realize that it’s smarter to invest wisely tomorrow than do something that’s unlikely to have an impact today.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eHow criminal justice system is broken:\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003ePeter points out three clear issues with the criminal justice system:\n\u003cul\u003e\n\u003cli\u003e1-There seems to be an enormous racial disparity\u003c/li\u003e\n\n\n\n\u003cli\u003e2-There are great difficulties in appealing, even in the presence of evidence that the first trial may not have been a great trial\u003c/li\u003e\n\n\n\n\u003cli\u003e3-Coercion is a real problem which results in people pleading guilty to something they did not do\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eJohn’s take on how we got to the current state of the criminal just system: \u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eIncreasing violent crime which peaked in the late 80s/early 90s\u003c/li\u003e\n\n\n\n\u003cli\u003eThis scary trend created a bipartisan response — crime was really destroying communities\u003c/li\u003e\n\n\n\n\u003cli\u003eEveryone came together to start this \u003cstrong\u003etough on crime\u003c/strong\u003e mantra\u003c/li\u003e\n\n\n\n\u003cli\u003eThe foundation of that was to intensify the “war on drugs” — which ended up having second and third order effects \u003c/li\u003e\n\n\n\n\u003cli\u003eCrime ended up peaking in the early ’90s\u003c/li\u003e\n\n\n\n\u003cli\u003eSome of it was because of some of the policies passed, but \u003cstrong\u003ea lot of it wasn’t\u003c/strong\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn says the drop in crime was relatively \u003cstrong\u003eindependent of when communities adopted the new policies\u003c/strong\u003e (across America as well as globally)\u003c/li\u003e\n\n\n\n\u003cli\u003eThe significant drop in crime over the past 30 years is still a bit of a mystery, says John\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eFast forward to today—\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eTimes have clearly changed, but we still have policies that were a reaction to an environment that was very different than today\u003c/li\u003e\n\n\n\n\u003cli\u003eWe’ve now seen the negative impact of those policies neighborhoods, the financial costs of those policies, and the trade offs associated with some of those policies\u003c/li\u003e\n\n\n\n\u003cli\u003eWe arrived at a point where both Republicans and Democrats have come together trying to rethink the right way to structure all aspects of the criminal justice system—from policing and courts and prisons and recidivism\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eSpeculating on what accounted for the reduction is crime starting in the mid-90s\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eWhat other factors could have accounted for the reduction in crime if not the increase in incarceration?\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eJohn says the best thing he’s seen on this is a \u003ca href=\"https://www.brennancenter.org/our-work/research-reports/what-caused-crime-decline\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ereport from the Brennan Center\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eThe summary is that it’s hard to see any one of them being really \u003cstrong\u003ecausal\u003c/strong\u003e in the shifting crime\u003c/li\u003e\n\n\n\n\u003cli\u003ePlus the same downward trends were happening globally (without the “tough on crime” policies)\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn says “\u003cem\u003eI’m not sure we’ll ever know\u003c/em\u003e” what the main driver of reduced crime was\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eOf all the mechanisms or tactics that would lead to an increase in incarceration, which of those were perhaps the \u003c/em\u003e\u003cstrong\u003e\u003cem\u003emost responsible\u003c/em\u003e\u003c/strong\u003e\u003cem\u003e for mass incarceration?\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eJohn thinks part of it has been longer sentences and part of it has been the conviction rates\u003c/li\u003e\n\n\n\n\u003cli\u003eThe system is built to demand a plea bargain\u003c/li\u003e\n\n\n\n\u003cli\u003eThe reality is that we just don’t have the court resources (the defense attorneys, the prosecutors, the judges, etc.) to hear a vast majority of cases\u003c/li\u003e\n\n\n\n\u003cli\u003eIn fact, \u003ca href=\"https://www.pewresearch.org/fact-tank/2019/06/11/only-2-of-federal-criminal-defendants-go-to-trial-and-most-who-do-are-found-guilty/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eless than 5% of cases actually go in front of a judge\u003c/a\u003e, most of them just get pled out\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eHow do we solve this problem?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eIncentives that have been built into the system almost coerce people to plead guilty to crimes that they may not have committed. – i.e., plea is 6 months and trial plus conviction is 20 years\u003c/li\u003e\n\n\n\n\u003cli\u003eIt’s really hard to see how you solve that problem without a \u003cstrong\u003emassive infusion of resources\u003c/strong\u003e into the courts, prosecutors, \u0026amp; defense attorneys) \u003cem\u003ewhich is not where we want to be spending money\u003c/em\u003e \u003c/li\u003e\n\n\n\n\u003cli\u003eThe solution is more likely to come from spending money on \u003cstrong\u003epreventing crime\u003c/strong\u003e (such as on certain social services)\u003c/li\u003e\n\n\n\n\u003cli\u003eThe goal would be trying to figure out how to get rid of this culture where the system can’t handle everybody going to trial\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eIs the role for philanthropy to try to address the questions of racism within law enforcement?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eFor a long time, the focus has been on reducing crime rates with no regard for the \u003cstrong\u003esecondary effects\u003c/strong\u003e that the criminal justice system causes on these communities and families\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003cem\u003e‘Family’ example\u003c/em\u003e—a disproportionate number of black men that go to prison leaving children without a father\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cem\u003ePsychological effects\u003c/em\u003e—Being a black man in America, especially in a low income neighborhood, comes with a psychological effect which is only worsened by an overly-aggressive police force in that community\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eA big dilemma\u003c/strong\u003e: Minority communities have felt both \u003cstrong\u003eover-policed\u003c/strong\u003e and \u003cstrong\u003eunder policed\u003c/strong\u003e at the same time.\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eBut violent crime is still a big problem and a huge cost to a community\u003c/li\u003e\n\n\n\n\u003cli\u003eBut most crime is committed within one’s own community\u003c/li\u003e\n\n\n\n\u003cli\u003eSo nobody in the community wants the police to leave entirely, there still has to be that function of deterrence \u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eAddressing the problem\u003c/em\u003e:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eThe problem doesn’t get solved just by passing one new policy\u003c/li\u003e\n\n\n\n\u003cli\u003eThis is an issue that has developed over decades of policing techniques, and centuries of disinvestment in these communities. \u003c/li\u003e\n\n\n\n\u003cli\u003eThe question is being considered: \u003cstrong\u003e\u003cem\u003eHow do you both provide the public safety while not causing the damage that some policing techniques cause today?\u003c/em\u003e\u003c/strong\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2\u003eRe-imagining prisons to reduce recidivism \u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003ePeter’s take on the prison system:\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003ePeter had a profound experience when visiting a prison (See \u003ca target=\"_blank\" href=\"https://peterattiamd.com/coreymccarthy/\"\u003eepisode of The Drive with former inmate Corey McCarthy\u003c/a\u003e)\u003c/li\u003e\n\n\n\n\u003cli\u003eFrom that experience, Peter points out the reasons to put somebody in prison:\n\u003cul\u003e\n\u003cli\u003e1-To protect the public from them.\u003c/li\u003e\n\n\n\n\u003cli\u003e2-To punish them for something they have done\u003c/li\u003e\n\n\n\n\u003cli\u003e3-To provide them with a set of skills to reintegrate into society in a better way\n\u003cul\u003e\n\u003cli\u003ePeter says there was virtually no effort into the rehabilitative part which virtually guarantees recidivism\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\n\n\n\u003cli\u003ePeter wonders: \u003cem\u003eIs there an opportunity for strategic philanthropy to play a role in the rehabilitative side of incarceration?\u003c/em\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eJohn’s response\u003c/em\u003e:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eIt’s very hard to design effective recidivism programs AFTER someone’s come out\u003c/li\u003e\n\n\n\n\u003cli\u003eThe evidence is very poor that after-prison programs actually work\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“The nature of prisons has to change. If you wait until the days someone’s released, that’s way too late.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eThe foundation’s work on re-imagining prisons\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eThey have a couple projects trying to reimagine prisons \u003c/li\u003e\n\n\n\n\u003cli\u003eThey are thinking through, \u003cem\u003eWhat’s the role of prisons? \u003c/em\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eThe struggle is that states and counties that fund this are often constrained financially—\n\u003cul\u003e\n\u003cli\u003eThey are trying to figure out how to meet \u003cem\u003etoday’s problem\u003c/em\u003e which \u003cstrong\u003etoo many people in prison \u003c/strong\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eAnd there’s very little bandwidth and money going towards improving outcomes over the long term when they HAVE to meet \u003cem\u003etoday’s\u003c/em\u003e needs\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\n\n\n\u003cli\u003eThe foundation is exploring questions like…\n\u003cul\u003e\n\u003cli\u003eW\u003cem\u003ehat should prisoners be doing with their day\u003c/em\u003e? \u003c/li\u003e\n\n\n\n\u003cli\u003eH\u003cem\u003eow can we try to maximize the percent chance that they don’t come back here when they’re released\u003c/em\u003e? \u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eThe ROI case\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eYou could certainly make an ROI case that if you invest more now you’ll save much more tomorrow\u003c/li\u003e\n\n\n\n\u003cli\u003eThe problem is that the pay off may not be for 5+ years\u003c/li\u003e\n\n\n\n\u003cli\u003eIn the private sector, they would make that investment every day\u003c/li\u003e\n\n\n\n\u003cli\u003eBut in the public sector, it’s on a cash accounting basis — i.e., you have to balance the books this year \u0026amp; you have a fixed amount of money\u003c/li\u003e\n\n\n\n\u003cli\u003eThat’s where the philanthropic sector can be an active player in this system is by providing the funds to experiment with different ideas and programs and then funding the high quality evaluation to see the potential ROI\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eThe values case\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eAnother part of the foundations work is more about values \u003c/li\u003e\n\n\n\n\u003cli\u003eQuestions like: Should we keep someone detained in jail before they’ve gone to their court date because they don’t have the money to pay bail? \u003c/li\u003e\n\n\n\n\u003cli\u003eThe broader question being explored: \u003cem\u003eHow do we fix it so it more closely represents American values while minimizing any potential second order effects, negative second order effects?\u003c/em\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2\u003eUS health care policy—John’s focus on drug prices, and the severe consequences of not making system changes \u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eHow is John thinking about health policy in America?\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eJohn comments that this is just such a big, complex issue: “The number of things that one could work on in health policy is immense.”\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eSo where is John trying to apply his resources?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe first area John wants to address is \u003cstrong\u003edrug prices \u003c/strong\u003ebecause it’s a topic with:\u003c/p\u003e\n\n\n\n\u003col\u003e\n\u003cli\u003eVery obvious flaws in the existing system\u003c/li\u003e\n\n\n\n\u003cli\u003eThere were ideas that were one could conceive of being enacted on how to fix it\u003c/li\u003e\n\n\n\n\u003cli\u003eAnd the political window might open \u003cem\u003ein the future\u003c/em\u003e such that there was demand by the public and thus by politicians to actually adopt some of this stuff\u003c/li\u003e\n\u003c/ol\u003e\n\n\n\n\u003cp\u003eThe foundation is focused on creating a more rational system to price pharmaceuticals that— \u003c/p\u003e\n\n\n\n\u003col\u003e\n\u003cli\u003eBalances interest and balances incentives that are necessary for the private sector to do the innovation\u003c/li\u003e\n\n\n\n\u003cli\u003eBalances the financial interests of the state and the federal government that’s largely paying for a lot of this stuff, and\u003c/li\u003e\n\n\n\n\u003cli\u003eThat maximizes access for the patient\u003c/li\u003e\n\u003c/ol\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eThe political window\u003c/em\u003e:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eThe foundation focuses on finding issues where a political window going to open up in the future\u003c/li\u003e\n\n\n\n\u003cli\u003eSo when the window opens, they can have evidence-based ideas that we could present to policymakers \u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eFor politicians to consider health care policies—\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eYou need ideas to present to them and say, “Here are the three things you need to do.” \u003c/li\u003e\n\n\n\n\u003cli\u003eThe reality is, the health care system is so complex, it really has 20+ problems\u003c/li\u003e\n\n\n\n\u003cli\u003eBut “you start to lose policymakers when you hit number four”, so you really want to narrow it down as best as you can (i.e., focusing on drug pricing)\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003ePeter’s rant on the US health care:\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eOur taxes disproportionately subsidize 2 things in the world, and one is military spend, and the other is healthcare spend\u003c/li\u003e\n\n\n\n\u003cli\u003eFor example, we pay so much more for drugs here than our neighbors do that we in effect subsidize the cost of R\u0026amp;D \u003c/li\u003e\n\n\n\n\u003cli\u003eThe United States is 3% of the world’s population, yet we pay 50% of the pharmaceutical revenues of the world\u003c/li\u003e\n\n\n\n\u003cli\u003eThe inflated prices that Americans are paying is helping and creating incentive for more medicines to be made here that then other countries get the benefit from. \u003c/li\u003e\n\n\n\n\u003cli\u003eThe NIH, for example, spends so much money on the basic science that’s required to get these drugs started, and in return, the pharmaceutical companies charge us 2x-3x the prices of other countries\u003c/li\u003e\n\n\n\n\u003cli\u003eYou could argue that we should be getting a discount because the United States taxpayers are funding much of the basic science and the cost of developing these drugs\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e⇒ For more on the health care system and issues with drugs, see Peter’s interviews with \u003ca target=\"_blank\" href=\"https://peterattiamd.com/martymakary/\"\u003eMarty Makary\u003c/a\u003e and \u003ca target=\"_blank\" href=\"https://peterattiamd.com/katherineeban/\"\u003eKatherine Eban\u003c/a\u003e \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eEnormous health care spending—how can we change this?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eOne could argue that the US health care spending is not sustainable\u003c/li\u003e\n\n\n\n\u003cli\u003eWe’re currently spending 15+% of GDP per year and it’s probably increasing at 5% per year in relative growth\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eWithout the greatest sovereign default on debt, \u003cstrong\u003e\u003cem\u003ewhat is it going to take to change this?\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eAt the state level,\n\u003cul\u003e\n\u003cli\u003eThe \u003cstrong\u003edownsides\u003c/strong\u003e of the state having to balance a budget every year is that it can’t make the high ROI investments that it should\u003c/li\u003e\n\n\n\n\u003cli\u003eThe \u003cstrong\u003eupside\u003c/strong\u003e is that it forces the states to consider trade offs—they have to decide where’s the highest value, and they look to save money \u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\n\n\n\u003cli\u003eThe \u003cstrong\u003efederal government\u003c/strong\u003e, on the other hand, without that budgetary constraint, doesn’t have to make those trade offs\n\u003cul\u003e\n\u003cli\u003eSo what happens is that any proposed legislation where somebody gets harmed will not pass, because no hard decisions want to get made\u003c/li\u003e\n\n\n\n\u003cli\u003eThe ramification of that is enormous budget deficits today and a potential default on a debt in the future\u003c/li\u003e\n\n\n\n\u003cli\u003eBut perhaps the most concerning part is the possibility of severe \u003ca href=\"https://en.wikipedia.org/wiki/Inflation\" target=\"_blank\" rel=\"noreferrer noopener\"\u003einflation\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eThe severe consequences of inflation\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eWe seem to have a fiscal or monetary response to every problem, but the one problem you can’t solve from fiscal and monetary tools is inflation\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn is particularly concerned about inflation because that’s when you have to be \u003cstrong\u003ecutting fiscal spending and increasing interest rates\u003c/strong\u003e to try to combat inflation\u003c/li\u003e\n\n\n\n\u003cli\u003eThe negative repercussions of that is enormous because we are so levered with debt at household level, at the business level, at cities and states, at the federal level\u003c/li\u003e\n\n\n\n\u003cli\u003eInflation is less of a problem as long as GDP is growing faster than real inflation\u003c/li\u003e\n\n\n\n\u003cli\u003eThe US debt is increasing much faster than real GDP, and so the real debt is increasing and we never pay it off\u003c/li\u003e\n\n\n\n\u003cli\u003eBad things happen if interest rates rise to just 5%, much less double digits which we’ve seen before in this country\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“I want to help the world, I want to solve problems, but if the answer is just shovel more money at it, that’s not a sustainable answer in my mind.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eJohn’s foundation is working on: \u003cstrong\u003e\u003cem\u003eHow do we improve the system without spending more money?\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eIf you believe that there are no trade offs with how we spend our resources, then pharma prices are fine (in fact, double them, triple them)\u003c/li\u003e\n\n\n\n\u003cli\u003eBut that’s not what John believes, “\u003cem\u003eI believe there is a trade off and that a dollar put into pharma innovation is a dollar less for everything else\u003c/em\u003e.”\u003c/li\u003e\n\n\n\n\u003cli\u003eOther things like,\n\u003cul\u003e\n\u003cli\u003eOther healthcare innovation (or health care services)\u003c/li\u003e\n\n\n\n\u003cli\u003eEducation\u003c/li\u003e\n\n\n\n\u003cli\u003eLess recidivism\u003c/li\u003e\n\n\n\n\u003cli\u003eEtc.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\n\n\n\u003cli\u003eThe pharma system has just been able to create this island where they don’t have to compete with anybody\n\u003cul\u003e\n\u003cli\u003eThey got their own rules, and it’s a messed up set of rules that incentivizes the wrong thing. \u003c/li\u003e\n\n\n\n\u003cli\u003eSo even within that, we’re not getting the drugs that we should be getting\u003c/li\u003e\n\n\n\n\u003cli\u003eWe’re getting things like marginal oncology drugs \u003c/li\u003e\n\n\n\n\u003cli\u003eWe’re not investing in the antibiotics and vaccines, because the financial incentive isn’t there \u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\n\n\n\u003cli\u003e“\u003cem\u003eSo we’re spending tons of money as a society and not even getting good returns for it.\u003c/em\u003e”\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eOptimistic about the future — Change happens slowly, then very quickly\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eJohn remains optimistic that real changing is coming\u003c/li\u003e\n\n\n\n\u003cli\u003eBut admits that this process is “emotionally frustrating”… to be banging on a problem for years with little perceptible progress\u003c/li\u003e\n\n\n\n\u003cli\u003ePeter compares change like this to a stone mason hitting a rock over and over—\n\u003cul\u003e\n\u003cli\u003eThere’s a bunch of tiny imperceptible cracks and then there’s one hit that splits in open\u003c/li\u003e\n\n\n\n\u003cli\u003eBut it wasn’t that one hit that did it, it was the many many that came before it\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\n\n\n\u003cli\u003eCiting two real world examples –\n\u003cul\u003e\n\u003cli\u003eThe campaign against the \u003ca href=\"https://en.wikipedia.org/wiki/Don%27t_ask,_don%27t_tell\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eDon’t ask, don’t tell\u003c/a\u003e policy seemingly went nowhere for decades until finally getting repealed (see \u003ca href=\"https://www.amazon.com/Our-Time-Breaking-Silence-Dont/dp/0143122193\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ebook by Josh Seefried\u003c/a\u003e)\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca target=\"_blank\" href=\"https://peterattiamd.com/rickdoblin/\"\u003eRick Doblin’s life-long work with psychedelics\u003c/a\u003e is close to coming to fruition \u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“You just don’t have that feedback mechanism in this work that you had in the [natural gas] market and the complete opposite end of the spectrum” \u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003ch2\u003eClimate change—the bipartisan role of John’s foundation\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eJohn’s high level thoughts on climate change\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eIt’s a problem where the downside possibilities are so enormous that it makes sense as a society for us to make the investments today to try to decrease the probability of those downside scenarios. \u003c/li\u003e\n\n\n\n\u003cli\u003eJohn admits that he does not know the probability of some of the truly catastrophic scenarios, but “it’s greater than zero. . .and less than 100%”\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn says that the downside is so great that society needs to make that investment\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eHow will John’s foundation work on climate change?\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eThe foundation typically looks at issues and areas where there’s not much philanthropic focus\u003c/li\u003e\n\n\n\n\u003cli\u003eAnd the climate field already has very thoughtful philanthropists who are working on this today\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eWhere John thinks they can add value\u003c/em\u003e:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eIn the climate change realm, most of the researchers, advocates, and funders come from the left (politically)\u003c/li\u003e\n\n\n\n\u003cli\u003eBut John believes this can only be solved with a bipartisan effort\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn says the democrats aren’t doing a very good job of bringing the republicans into the conversation when they do things like “put the whole Democratic platform into a climate change bill”\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn thinks the role of his foundation is to try to bring the both parties into the discussion by supporting organizations and politicians that are \u003cem\u003eon the right\u003c/em\u003e who want to start taking steps\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2\u003eAdvice for young adults interested in philanthropy \u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eRegarding his own kids—\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eHe doesn’t want their lives to be defined by their parents, bur rather for them to have their own life experiences and create their own life\u003c/li\u003e\n\n\n\n\u003cli\u003eHe is discouraging them from working at the Arnold Foundation\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“Whenever you have that checkbook, people look at you differently, and treat you differently. . .because there is always something that they want funded. . .If somebody’s growing up in their teens and their 20s, and is looked at by the rest of the world as a checkbook first, I think that’s a very damaging way to grow up.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eAdvice to young adults with an interest in philanthropy\u003c/strong\u003e:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eAs a society, we benefit when our community around us is stronger\u003c/li\u003e\n\n\n\n\u003cli\u003eWhenever we have the needs of our family taken care of, it’s human nature to start thinking about your community\u003c/li\u003e\n\n\n\n\u003cli\u003eJohn’s general advice about giving money is to try to do it strategically and intelligently\u003c/li\u003e\n\n\n\n\u003cli\u003eAnd by giving to your community, you are likely making a more informed gift since you have a better sense of what the needs are of your own community\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "55 min read",
  "publishedTime": "2025-07-02T02:31:32Z",
  "modifiedTime": "2025-07-24T16:31:15Z"
}
