{
  "id": "dd5c1566-7bc7-4c47-8ce2-2ded5e8dca87",
  "title": "Cathie Wood's ARK ETF adjusts with AMD and Amazon stock trades",
  "link": "https://www.investing.com/news/company-news/cathie-woods-ark-etf-adjusts-with-amd-and-amazon-stock-trades-93CH-3745393",
  "description": "",
  "author": "Investing.com",
  "published": "2024-11-28 01:02:21",
  "source": "https://www.investing.com/rss/news.rss",
  "categories": null,
  "byline": "Investing.com",
  "length": 2897,
  "excerpt": "Cathie Wood's ARK ETF adjusts with AMD and Amazon stock trades",
  "siteName": "Investing.com",
  "favicon": "",
  "text": "Cathie Wood's ARK ETFs have published their daily trades for Wednesday, November 27th, 2024, revealing a series of strategic buy and sell actions across a range of companies. The most significant dollar-value trade for the day was the purchase of shares in Advanced Micro Devices Inc (NASDAQ:), with a total of 127,363 shares acquired across the ARKK and ARKX (NYSE:) ETFs, amounting to a value of $17,540,432. This move underscores ARK's increasing investment in the semiconductor industry, particularly in AMD, which has seen additional shares bought in recent days, indicating a bullish stance on the company's prospects. Following closely, ARK also increased its position in e-commerce giant Amazon.com Inc (NASDAQ:) by purchasing 82,735 shares, valued at $17,197,297. This decision aligns with ARK's focus on technology and innovation-driven companies, and it reflects confidence in Amazon's growth trajectory. On the sell side, ARK divested a significant number of shares in several companies. The most notable was the sale of 282,335 shares of Butterfly Network Inc (NYSE:BFLY) through the ARKG ETF, with a total dollar value of $892,178. This move is part of a continued trend of reducing exposure to the medical imaging company. In addition, ARK sold shares in Palantir Technologies Inc (NYSE:NASDAQ:), Roblox Corp (NYSE:NYSE:), Rocket Lab USA Inc (NASDAQ:RKLB), Repare Therapeutics Inc (NASDAQ:RPTX), and Block Inc (NYSE:SQ), with the sale of Block Inc being the largest in terms of dollar value at $9,854,475. On the other hand, ARK's buying activity also included 9,125 shares of Illumina Inc (NASDAQ:), 574,994 shares of Pacific Biosciences (NASDAQ:) of California Inc (NASDAQ:PACB), and 108,376 shares of Pinterest Inc (NYSE:NYSE:), with the latter trade worth $3,359,656. The smaller trades for the day involved the sale of 100 shares of Markforged Holding Corp (NYSE:MKFG), totaling only $409, reflecting ARK's minute adjustments to its holdings in the 3D printing company. Observing ARK's trading patterns over the past week, there is a discernible accumulation of shares in companies like Advanced Micro Devices Inc (AMD), Illumina Inc (ILMN), and Pacific Biosciences of California Inc (PACB), suggesting a long-term confidence in these stocks. Conversely, there has been a consistent sell-off in companies such as Palantir Technologies Inc (PLTR) and Repare Therapeutics Inc (RPTX), indicating a potential shift in ARK's investment strategy away from these entities. Investors following Cathie Wood's ARK ETFs can glean insights into the fund's strategic positioning and market outlook based on these daily trade reports, which showcase ARK's commitment to investing in innovation and growth opportunities while also making tactical exits when deemed necessary. This article was generated with the support of AI and reviewed by an editor. For more information see our T\u0026C.",
  "image": "https://i-invdn-com.investing.com/redesign/images/seo/investing_300X300.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article\"\u003e\u003cp\u003eCathie Wood\u0026#39;s ARK ETFs have published their daily trades for Wednesday, November 27th, 2024, revealing a series of strategic buy and sell actions across a range of companies. The most significant dollar-value trade for the day was the purchase of shares in Advanced Micro Devices Inc (NASDAQ:), with a total of 127,363 shares acquired across the ARKK and ARKX (NYSE:) ETFs, amounting to a value of $17,540,432. This move underscores ARK\u0026#39;s increasing investment in the semiconductor industry, particularly in AMD, which has seen additional shares bought in recent days, indicating a bullish stance on the company\u0026#39;s prospects.\u003c/p\u003e\n\u003cp\u003eFollowing closely, ARK also increased its position in e-commerce giant Amazon.com Inc (NASDAQ:) by purchasing 82,735 shares, valued at $17,197,297. This decision aligns with ARK\u0026#39;s focus on technology and innovation-driven companies, and it reflects confidence in Amazon\u0026#39;s growth trajectory.\u003c/p\u003e\n\u003cp\u003eOn the sell side, ARK divested a significant number of shares in several companies. The most notable was the sale of 282,335 shares of Butterfly Network Inc (NYSE:BFLY) through the ARKG ETF, with a total dollar value of $892,178. This move is part of a continued trend of reducing exposure to the medical imaging company.\u003c/p\u003e\n\u003cp\u003eIn addition, ARK sold shares in \u003cspan itemscope=\"\" itemtype=\"http://schema.org/Corporation\"\u003e\u003cspan itemprop=\"name\"\u003e Palantir Technologies Inc \u003c/span\u003e\u003c/span\u003e (NYSE:NASDAQ:), \u003cspan itemscope=\"\" itemtype=\"http://schema.org/Corporation\"\u003e\u003cspan itemprop=\"name\"\u003e Roblox Corp \u003c/span\u003e\u003c/span\u003e (NYSE:NYSE:), Rocket Lab USA Inc (NASDAQ:RKLB), Repare Therapeutics Inc (NASDAQ:RPTX), and Block Inc (NYSE:SQ), with the sale of Block Inc being the largest in terms of dollar value at $9,854,475.\u003c/p\u003e\n\u003cp\u003eOn the other hand, ARK\u0026#39;s buying activity also included 9,125 shares of Illumina Inc (NASDAQ:), 574,994 shares of Pacific Biosciences (NASDAQ:) of California Inc (NASDAQ:PACB), and 108,376 shares of \u003cspan itemscope=\"\" itemtype=\"http://schema.org/Corporation\"\u003e\u003cspan itemprop=\"name\"\u003e Pinterest Inc \u003c/span\u003e\u003c/span\u003e (NYSE:NYSE:), with the latter trade worth $3,359,656.\u003c/p\u003e\n\u003cp\u003eThe smaller trades for the day involved the sale of 100 shares of Markforged Holding Corp (NYSE:MKFG), totaling only $409, reflecting ARK\u0026#39;s minute adjustments to its holdings in the 3D printing company.\u003c/p\u003e\n\u003cp\u003eObserving ARK\u0026#39;s trading patterns over the past week, there is a discernible accumulation of shares in companies like Advanced Micro Devices Inc (AMD), Illumina Inc (ILMN), and Pacific Biosciences of California Inc (PACB), suggesting a long-term confidence in these stocks. Conversely, there has been a consistent sell-off in companies such as Palantir Technologies Inc (PLTR) and Repare Therapeutics Inc (RPTX), indicating a potential shift in ARK\u0026#39;s investment strategy away from these entities.\u003c/p\u003e\n\u003cp\u003eInvestors following Cathie Wood\u0026#39;s ARK ETFs can glean insights into the fund\u0026#39;s strategic positioning and market outlook based on these daily trade reports, which showcase ARK\u0026#39;s commitment to investing in innovation and growth opportunities while also making tactical exits when deemed necessary.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis article was generated with the support of AI and reviewed by an editor. For more information see our T\u0026amp;C.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-28T01:02:21Z",
  "modifiedTime": null
}
