{
  "id": "df4fda07-5172-48ac-9085-b34831b26a26",
  "title": "JCB eyes double-digit growth with launch of stage 5 construction machines",
  "link": "https://www.business-standard.com/companies/news/jcb-eyes-double-digit-growth-with-launch-of-stage-5-construction-machines-125011900770_1.html",
  "description": "JCB India CEO and managing director Deepak Shetty said the new machines will help customers save fuel cost of up to Rs 18.5 lakh over five years",
  "author": "",
  "published": "Sun, 19 Jan 2025 23:29:39 +0530",
  "source": "https://www.business-standard.com/rss/home_page_top_stories.rss",
  "categories": null,
  "byline": "Press Trust of India",
  "length": 3508,
  "excerpt": "Heavy machinery maker JCB expects to maintain double-digit growth in India with the rollout of a new range of emission norms, stage 5, ready construction equipment, a senior company official said on Sunday.",
  "siteName": "Business Standard",
  "favicon": "https://www.business-standard.com/android-chrome-192x192.png",
  "text": "Heavy machinery maker JCB expects to maintain double-digit growth in India with the rollout of a new range of emission norms, stage 5, ready construction equipment, a senior company official said on Sunday. While speaking at the launch of the new range of construction machines, JCB India CEO and managing director Deepak Shetty said the new machines will help customers save fuel cost of up to Rs 18.5 lakh over five years. \"We are very excited to launch Stage 5 ready range of machines. These machines will be better in fuel efficiency from 10 to 15 per cent. They are more productive, have less maintenance cost, and overall, they will have less total cost of ownership for our customers, for the operators will operate these machines,\" Shetty said. The company will discontinue production of the old models with the launch of new ranges of machines. Shetty said that JCB will continue to support existing equipment throughout their lifetime. He said that the new range of machines comes with Roll-over Protective Structure (ROPS) compliant technology which will protect the operators in case the machine topples.Also Read Elaborating on the fuel efficiency due to new emission norms compliance features in the machine, Shetty said that the savings will differ from equipment to equipment. He claimed that one of the loader machines supports fuel saving worth Rs 18.5 lakh over a period of five years which is about 30 per cent of the equipment cost. When asked about price increment due to new emission norms, Shetty said that traditionally, the cost increases in the industry by 8 per cent and beyond but JCB has tried to limit it lower than 8 per cent and closer to 3.5- 4 per cent. JCB also showcased its first hydrogen fuel-based heavy machine. Shetty said that the Hydrogen based machine is in line with the Prime Minister's vision. \"The National Hydrogen mission based infrastructure is coming up across the country. When that infrastructure will be ready, We will be ready with our machine. We are not limiting ourselves to only one fossil fuel like diesel, but we are ready with the machines across the range,\" Shetty said. Talking about the company's business growth with the launch of a new range of machines, Shetty said the government has been focusing on infrastructure development which has been a key growth driver for the company. \"Last few years we have seen, with the government's focus on infrastructure development, we have seen a double digit growth. We expect that growth to continue,\" he said. JCB manufactures majority of its equipment in India and supplies it to both domestic and overseas markets. JCB at Bharat Mobility unveiled a simulator for Rs 5 lakh to train operators across the country to help reduce their training cost. \"Our engineers have developed Daksh, which is a VR-based simulator. It is India's first VR based simulator which will be used for training operators across India. It is a small kind of device which can be moved across the country, and more and more operators can be trained,\" Shetty said. JCB India also announced that it has signed a Memorandum of Understanding (MOU) with Shriram Automall India Limited (SAMIL), India's Largest Phygital Pre-owned Marketplace for Vehicles and Equipment to efficiently manage sale of pre-owned certified JCB machines.(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)",
  "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-10/11/thumb/fitandfill/1200X630/1728642753-7496.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"parent_top_div\"\u003e\u003cp\u003e\n\tHeavy machinery maker JCB expects to maintain double-digit growth in India with the rollout of a new range of emission norms, stage 5, ready construction equipment, a senior company official said on Sunday.\u003c/p\u003e\n\u003cp\u003e\n\tWhile speaking at the launch of the new range of construction machines, JCB India CEO and managing director Deepak Shetty said the new machines will help customers save fuel cost of up to Rs 18.5 lakh over five years.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;We are very excited to launch Stage 5 ready range of machines. These machines will be better in fuel efficiency from 10 to 15 per cent. They are more productive, have less maintenance cost, and overall, they will have less total cost of ownership for our customers, for the operators will operate these machines,\u0026#34; Shetty said.\u003c/p\u003e\n\u003cp\u003e\n\tThe company will discontinue production of the old models with the launch of new ranges of machines. Shetty said that JCB will continue to support existing equipment throughout their lifetime.\u003c/p\u003e\n\u003cp\u003e\n\tHe said that the new range of machines comes with Roll-over Protective Structure (ROPS) compliant technology which will protect the operators in case the machine topples.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ch3\u003e\u003cspan\u003eAlso Read\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\n\tElaborating on the fuel efficiency due to new emission norms compliance features in the machine, Shetty said that the savings will differ from equipment to equipment.\u003c/p\u003e\n\u003cp\u003e\n\tHe claimed that one of the loader machines supports fuel saving worth Rs 18.5 lakh over a period of five years which is about 30 per cent of the equipment cost.\u003c/p\u003e\n\u003cp\u003e\n\tWhen asked about price increment due to new emission norms, Shetty said that traditionally, the cost increases in the industry by 8 per cent and beyond but JCB has tried to limit it lower than 8 per cent and closer to 3.5- 4 per cent.\u003c/p\u003e\n\u003cp\u003e\n\tJCB also showcased its first hydrogen fuel-based heavy machine.\u003c/p\u003e\n\u003cp\u003e\n\tShetty said that the Hydrogen based machine is in line with the Prime Minister\u0026#39;s vision.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;The National Hydrogen mission based infrastructure is coming up across the country. When that infrastructure will be ready, We will be ready with our machine. We are not limiting ourselves to only one fossil fuel like diesel, but we are ready with the machines across the range,\u0026#34; Shetty said.\u003c/p\u003e\n\u003cp\u003e\n\tTalking about the company\u0026#39;s business growth with the launch of a new range of machines, Shetty said the government has been focusing on infrastructure development which has been a key growth driver for the company.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;Last few years we have seen, with the government\u0026#39;s focus on infrastructure development, we have seen a double digit growth. We expect that growth to continue,\u0026#34; he said.\u003c/p\u003e\n\u003cp\u003e\n\tJCB manufactures majority of its equipment in India and supplies it to both domestic and overseas markets.\u003c/p\u003e\n\u003cp\u003e\n\tJCB at Bharat Mobility unveiled a simulator for Rs 5 lakh to train operators across the country to help reduce their training cost. \u0026#34;Our engineers have developed Daksh, which is a VR-based simulator. It is India\u0026#39;s first VR based simulator which will be used for training operators across India. It is a small kind of device which can be moved across the country, and more and more operators can be trained,\u0026#34; Shetty said.\u003c/p\u003e\n\u003cp\u003e\n\tJCB India also announced that it has signed a Memorandum of Understanding (MOU) with Shriram Automall India Limited (SAMIL), India\u0026#39;s Largest Phygital Pre-owned Marketplace for Vehicles and Equipment to efficiently manage sale of pre-owned certified JCB machines.\u003c/p\u003e\u003c/div\u003e\u003cp id=\"auto_disclaimer\"\u003e(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-19T23:29:35+05:30",
  "modifiedTime": null
}
