{
  "id": "e21b0a66-a6a5-432a-b273-4dfd92004948",
  "title": "Asia's airlines blame supply chain woes for disrupted operations",
  "link": "https://www.investing.com/news/stock-market-news/asias-airlines-blame-supply-chain-woes-for-disrupted-operations-3721913",
  "description": "",
  "author": "Reuters",
  "published": "2024-11-14 00:56:13",
  "source": "https://www.investing.com/rss/news.rss",
  "categories": null,
  "byline": "Reuters",
  "length": 3513,
  "excerpt": "Asia's airlines blame supply chain woes for disrupted operations",
  "siteName": "Investing.com",
  "favicon": "",
  "text": "By Lisa Barrington BANDAR SERI BEGAWAN, Brunei (Reuters) - Asia-Pacific travel demand has recovered from the pandemic, but earnings at the region's airlines are under pressure from supply chain problems disrupting operations and exposing them to strengthening consumer protection rules, industry executives say. A shortage of parts, labour and new planes as the aviation industry emerged from the pandemic has coincided with higher-than-expected repairs needed on the latest-generation engines. \"The supply chain issue is the biggest challenge the industry is facing,\" Subhas Menon, the director general of the Association of Asia Pacific Airlines (AAPA) said at the trade body's annual meeting in Brunei this week. Turnaround times for engine maintenance are at record lengths, with airlines having to cut flights, move parts around and lease stop-gap engines or planes to keep operations ticking. Thai Airways CEO Chai Eamsiri said servicing the Rolls-Royce (OTC:) engines on its Boeing (NYSE:) 787 jets used to take around three months, but that has blown out to about six. \"We have to stretch the aircraft. We used to operate 12.5 hours a day, now we have to stretch it to 13 plus,\" he told Reuters on the sidelines of the gathering. SUPPLY CHAIN FRUSTRATION The heads of major carriers including Thai Airways, Singapore Airlines (OTC:), Malaysia Airlines and Kazakhstan's Air Astana expressed frustration with maintenance times and said governments trying to improve consumer protections should stop placing the blame on airlines for delays. \"The root cause is coming from the supply chain...But we are the one facing the customer,\" Eamsiri told the meeting. Malaysia, Australia, Thailand and the Philippines are among the countries beefing up airline consumer protections to require refund options in the case of delays and cancellations, as is the United States, though the rules are not as onerous as EU regulations requiring payments to affected passengers. Aviation manufacturers \"have to get their act together\", Air Astana CEO Peter Foster said. Amid a shortage of planes, labour and parts, Malaysia Airlines suffered a string of service disruptions this year and cut its network capacity by 20% from September. Malaysia's civil aviation regulator cut the duration of the carrier's air operator certificate to one year from three years after an investigation. \"All airlines are wringing the neck of our suppliers,\" Malaysia Airlines CEO Izham Ismail told attendees. Engine servicing used to take around 55 days before the pandemic, but now it needs 100 or more, Ismail said. Representatives of Airbus and Rolls-Royce said separately they were working to resolve supply chain snags, including improving suppliers' access to financing. AIRFARES FALLING Travel in the Asia-Pacific region, which accounts for around 32% of global passenger traffic, recovered later than other parts of the world due to a belated lifting of pandemic travel restrictions, particularly in China. In September, passenger volumes for 40 Asia-Pacific based carriers averaged 97.5% of the corresponding month in 2019, according to AAPA data. Airlines globally have been seeing stable demand but airfares are declining as a post-pandemic travel boom abates and most planes are back in the skies. Singapore Airlines, seen as a bellwether for the region, last week posted a 48.5% plunge in interim net profit, reflecting stiff competition, and flagged its earnings would stay under pressure despite robust travel demand.",
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEKAD00R_M.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article\"\u003e \u003cp\u003eBy Lisa Barrington\u003c/p\u003e \u003cp\u003eBANDAR SERI BEGAWAN, Brunei (Reuters) - Asia-Pacific travel demand has recovered from the pandemic, but earnings at the region\u0026#39;s airlines are under pressure from supply chain problems disrupting operations and exposing them to strengthening consumer protection rules, industry executives say.\u003c/p\u003e \u003cp\u003eA shortage of parts, labour and new planes as the aviation industry emerged from the pandemic has coincided with higher-than-expected repairs needed on the latest-generation engines.\u003c/p\u003e \u003cp\u003e\u0026#34;The supply chain issue is the biggest challenge the industry is facing,\u0026#34; Subhas Menon, the director general of the Association of Asia Pacific Airlines (AAPA) said at the trade body\u0026#39;s annual meeting in Brunei this week. \u003c/p\u003e \u003cp\u003eTurnaround times for engine maintenance are at record lengths, with airlines having to cut flights, move parts around and lease stop-gap engines or planes to keep operations ticking.\u003c/p\u003e \u003cp\u003eThai Airways CEO Chai Eamsiri said servicing the Rolls-Royce (OTC:) engines on its Boeing (NYSE:) 787 jets used to take around three months, but that has blown out to about six. \u003c/p\u003e \u003cp\u003e\u0026#34;We have to stretch the aircraft. We used to operate 12.5 hours a day, now we have to stretch it to 13 plus,\u0026#34; he told Reuters on the sidelines of the gathering. \u003c/p\u003e \u003cp\u003eSUPPLY CHAIN FRUSTRATION\u003c/p\u003e \u003cp\u003eThe heads of major carriers including Thai Airways, Singapore Airlines (OTC:), Malaysia Airlines and Kazakhstan\u0026#39;s Air Astana expressed frustration with maintenance times and said governments trying to improve consumer protections should stop placing the blame on airlines for delays. \u003c/p\u003e \u003cp\u003e\u0026#34;The root cause is coming from the supply chain...But we are the one facing the customer,\u0026#34; Eamsiri told the meeting.\u003c/p\u003e \u003cp\u003eMalaysia, Australia, Thailand and the Philippines are among the countries beefing up airline consumer protections to require refund options in the case of delays and cancellations, as is the United States, though the rules are not as onerous as EU regulations requiring payments to affected passengers. \u003c/p\u003e \u003cp\u003eAviation manufacturers \u0026#34;have to get their act together\u0026#34;, Air Astana CEO Peter Foster said. \u003c/p\u003e \u003cp\u003eAmid a shortage of planes, labour and parts, Malaysia Airlines suffered a string of service disruptions this year and cut its network capacity by 20% from September.\u003c/p\u003e \u003cp\u003eMalaysia\u0026#39;s civil aviation regulator cut the duration of the carrier\u0026#39;s air operator certificate to one year from three years after an investigation. \u003c/p\u003e \u003cp\u003e\u0026#34;All airlines are wringing the neck of our suppliers,\u0026#34; Malaysia Airlines CEO Izham Ismail told attendees. \u003c/p\u003e \u003cp\u003eEngine servicing used to take around 55 days before the pandemic, but now it needs 100 or more, Ismail said. \u003c/p\u003e \u003cp\u003eRepresentatives of Airbus and Rolls-Royce said separately they were working to resolve supply chain snags, including improving suppliers\u0026#39; access to financing. \u003c/p\u003e \u003cp\u003eAIRFARES FALLING\u003c/p\u003e \u003cp\u003eTravel in the Asia-Pacific region, which accounts for around 32% of global passenger traffic, recovered later than other parts of the world due to a belated lifting of pandemic travel restrictions, particularly in China.\u003c/p\u003e \u003cp\u003eIn September, passenger volumes for 40 Asia-Pacific based carriers averaged 97.5% of the corresponding month in 2019, according to AAPA data. \u003c/p\u003e \u003cp\u003e\u003cimg src=\"https://i-invdn-com.investing.com/trkd-images/LYNXMPEKAD00Q_L.jpg\" title=\"© Reuters. FILE PHOTO: Malaysia Airlines planes are seen on the tarmac of Kuala Lumpur International Airport at Sepang, Malaysia August 28, 2024. REUTERS/Hasnoor Hussain/File Photo\" alt=\"© Reuters. FILE PHOTO: Malaysia Airlines planes are seen on the tarmac of Kuala Lumpur International Airport at Sepang, Malaysia August 28, 2024. REUTERS/Hasnoor Hussain/File Photo\" rel=\"external-image\"/\u003e\u003c/p\u003e\n\u003cp\u003eAirlines globally have been seeing stable demand but airfares are declining as a post-pandemic travel boom abates and most planes are back in the skies.\u003c/p\u003e \u003cp\u003eSingapore Airlines, seen as a bellwether for the region, last week posted a 48.5% plunge in interim net profit, reflecting stiff competition, and flagged its earnings would stay under pressure despite robust travel demand. \u003c/p\u003e \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-11-14T00:43:07Z",
  "modifiedTime": null
}
