{
  "id": "ebe038c2-e60c-42d5-a576-9a1ad7b49c0c",
  "title": "Judge in Trump Murdoch libel case handled lawsuit president dropped against Michael Cohen",
  "link": "https://www.cnbc.com/2025/07/21/trump-murdoch-libel-judge-cohen-court.html",
  "description": "Proving that the Wall Street Journal's reporting is false would require Trump to answer questions under oath about Jeffrey Epstein.",
  "author": "",
  "published": "Mon, 21 Jul 2025 21:57:30 GMT",
  "source": "https://www.cnbc.com/id/100003114/device/rss/rss.html",
  "categories": null,
  "byline": "Dan Mangan",
  "length": 5737,
  "excerpt": "Proving that the Wall Street Journal's reporting is false would require Trump to answer questions under oath about Jeffrey Epstein.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "U.S. President Donald Trump and Rupert Murdoch. Evelyn Hockstein | Elizabeth Frantz | ReutersPresident Donald Trump's new $10 billion libel lawsuit against media baron Rupert Murdoch over a Wall Street Journal article about sex offender Jeffrey Epstein will be handled by the same Florida federal judge who presided over a prior breach-of-contract suit Trump filed against his former personal lawyer Michael Cohen.Trump voluntarily dropped that $500 million lawsuit against Cohen, which was filed in U.S. District Court in Miami in 2023, shortly after Judge Darrin Gayles scheduled a deposition where Trump would have had to answer questions about his allegations under oath by Cohen's attorney.The president's filing of the suit against Murdoch sets the stage for Gayles to schedule another deposition for Trump — and for Trump to weigh whether he wants to answer questions under oath from Murdoch's legal team.Those questions could focus on Trump's past friendship with Epstein and his convicted procurer, Ghislaine Maxwell, and comments such as one Trump made in 2002 to New York magazine about Epstein.\"He's a lot of fun to be with,\" Trump is quoted saying. \"It is even said that he likes beautiful women as much as I do, and many of them are on the younger side.\"Gayles was randomly assigned as the judge for Trump's new lawsuit on Monday.A former federal prosecutor whom then-President Barack Obama nominated to the bench in 2014, Gayles became the first openly gay Black man to serve as a federal judge after the Senate confirmed him in a 98-0 vote.Cohen told CNBC on Monday that even if Gayles orders Trump to sit for a deposition for his suit against Murdoch, he does not expect history to repeat itself.Michael Cohen, former personal lawyer to former U.S. President Donald Trump, attends the second day of the Democratic National Convention at the United Center on August 20, 2024 in Chicago, Illinois.Andrew Harnik | Getty ImagesIn addition to Murdoch, Trump is suing his company News Corp, its CEO Robert Thomson, the Journal's publisher, Dow Jones \u0026 Co., and the two reporters who wrote the article that said the president sent Epstein a \"bawdy\" birthday letter in 2003.Cohen, who fell out with Trump years ago, said he thinks the president will pursue the case — and that Murdoch will cave.\"I predict Murdoch, et al will settle this matter in the same manner that ABC and CBS did,\" Cohen said in a text message, referring to recent multi-million-dollar settlements Trump obtained from ABC and the parent company of CBS News after suing those two news organizations.\"Unlike the lawsuit against me, this action has real consequences: such as advertisers pulling away from the newspaper or journalists being denied access to the White House,\" Cohen said.But Cohen's own former personal lawyer, Lanny Davis, told CNBC that he thinks Trump will voluntarily withdraw his case against Murdoch and the others after Gayles schedules a deposition for the president.Read more CNBC politics coverageHunter Biden blames Ambien for President Biden's terrible Trump debateTrump Media builds $2 billion bitcoin hoard, as crypto swells president's net worthTreasury Secretary Bessent calls for a review of 'the entire' Federal ReserveBessent: Collecting Aug. 1 tariffs 'will put more pressure' on trade partners for dealsTrump disputes WSJ report on Bessent talking him out of firing PowellAug. 1 is 'hard deadline' for Trump's tariffs, Lutnick saysTrump complains about Epstein file pressure: 'Nothing will be good enough'Trump says releasing Epstein files wouldn't satisfy 'troublemakers,' as pressure mountsJustice Department asks court to unseal Epstein, Maxwell grand jury transcriptsTrump sues Murdoch for $10 billion over WSJ story on Epstein birthday letter\"If he's smart, even if he has nothing to hide,\" Trump will not submit to a deposition, Davis predicted. \"He doesn't want this story to alienate his base for the next two years.\"Trump sued Murdoch and the other defendants on Friday, a day after the Journal reported that a letter sent by Trump for Epstein's 50th birthday was among material reviewed by federal investigators as part of a criminal probe of the notorious sex offender.Trump has angrily denied writing the letter.The Journal's story was published as Trump faced growing pressure to have the Justice Department release investigatory files about Epstein, a convicted sex offender who killed himself in 2019 after being arrested on child sex trafficking charges.Trump had been friends with Epstein for years before the two men had a falling out, long before Epstein's 2019 arrest.Davis compared filing a defamation case to submitting oneself to an invasive physical examination.\"As a matter of crisis management, what Trump has done is make matters worse with both his base and his critics, which is hard to do,\" Davis said.\"He's extended the story,\" Davis said. \"If you file a lawsuit, it's the opposite of good crisis management, because you're asking for more drip by drip stories, questioning you under oath.\"CNBC has requested comment from Dow Jones, which on Friday showed no sign of backing down from Trump after he filed his lawsuit.\"We have full confidence in the rigor and accuracy of our reporting, and will vigorously defend against any lawsuit,\" the publisher said at that time.Trump, for his part, has suggested it is Murdoch who would have the most to fear from being deposed.A spokesman for Trump, when asked about comments by Cohen and Davis on Monday, directed CNBC to the president's social media post last Friday.\"I hope Rupert and his 'friends' are looking forward to the many hours of depositions and testimonies they will have to provide in this case,\" Trump wrote in that Truth Social post.",
  "image": "https://image.cnbcfm.com/api/v1/image/108174186-1752873502792-Trump_Murdoch3.jpg?v=1752873942\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108174186\" data-test=\"InlineImage\"\u003e\u003cp\u003eU.S. President Donald Trump and Rupert Murdoch. \u003c/p\u003e\u003cp\u003eEvelyn Hockstein | Elizabeth Frantz | Reuters\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003ePresident \u003ca href=\"https://www.cnbc.com/donald-trump/\"\u003eDonald Trump\u003c/a\u003e\u0026#39;s new $10 billion \u003ca href=\"https://www.courtlistener.com/docket/70843413/trump-v-murdoch/\" target=\"_blank\"\u003elibel lawsuit a\u003c/a\u003egainst media baron \u003ca href=\"https://www.cnbc.com/2025/07/18/trump-sues-epstein-murdoch-wsj.html\"\u003eRupert Murdoch\u003c/a\u003e over a Wall Street Journal article about sex offender \u003ca href=\"https://www.cnbc.com/2025/07/18/trump-epstein-fbi-durbin.html\"\u003eJeffrey Epstein\u003c/a\u003e will be handled by the same Florida federal judge who presided over a prior breach-of-contract suit Trump filed against his former personal lawyer \u003ca href=\"https://storage.courtlistener.com/recap/gov.uscourts.flsd.645291/gov.uscourts.flsd.645291.1.0_2.pdf\" target=\"_blank\"\u003eMichael Cohen\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eTrump voluntarily dropped that \u003ca href=\"https://www.nbcnews.com/politics/donald-trump/trump-sues-michael-cohen-key-witness-ny-criminal-case-seeking-500-mill-rcna79399\" target=\"_blank\"\u003e$500 million lawsuit\u003c/a\u003e against Cohen, which was filed in U.S. District Court in Miami in 2023, shortly after \u003ca href=\"https://www.nbcnews.com/news/crime-courts/senate-confirms-first-openly-gay-black-federal-judge-n133986\" target=\"_blank\"\u003eJudge Darrin Gayles\u003c/a\u003e scheduled a \u003ca href=\"https://www.nbcnews.com/politics/donald-trump/trump-gets-deposition-notice-lawsuit-michael-cohen-rcna97432\" target=\"_blank\"\u003edeposition\u003c/a\u003e where Trump would have had to answer questions about his allegations under oath by Cohen\u0026#39;s attorney.\u003c/p\u003e\u003cp\u003eThe president\u0026#39;s filing of the suit against Murdoch sets the stage for Gayles to schedule another deposition for Trump — and for Trump to weigh whether he wants to answer questions under oath from Murdoch\u0026#39;s legal team.\u003c/p\u003e\u003cp\u003eThose questions could focus on Trump\u0026#39;s past friendship with Epstein and his convicted procurer, Ghislaine Maxwell, and comments such as one Trump made in 2002 to New York magazine about Epstein.\u003c/p\u003e\u003cp\u003e\u0026#34;He\u0026#39;s a lot of fun to be with,\u0026#34; Trump is quoted saying. \u0026#34;It is even said that he likes beautiful women as much as I do, and many of them are on the younger side.\u0026#34;\u003c/p\u003e\u003cp\u003eGayles was randomly assigned as the judge for Trump\u0026#39;s new lawsuit on Monday.\u003c/p\u003e\u003cp\u003eA former federal prosecutor whom then-President \u003ca href=\"https://www.cnbc.com/barack-obama/\"\u003eBarack Obama\u003c/a\u003e nominated to the bench in 2014, Gayles became the first openly gay Black man to serve as a federal judge after the Senate confirmed him in a 98-0 vote.\u003c/p\u003e\u003cp\u003eCohen told CNBC on Monday that even if Gayles orders Trump to sit for a deposition for his suit against Murdoch, he does not expect history to repeat itself.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"ArticleBody-InlineImage-108023201\" data-test=\"InlineImage\"\u003e\u003cp\u003eMichael Cohen, former personal lawyer to former U.S. President Donald Trump, attends the second day of the Democratic National Convention at the United Center on August 20, 2024 in Chicago, Illinois.\u003c/p\u003e\u003cp\u003eAndrew Harnik | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIn addition to Murdoch, Trump is suing his company \u003ca href=\"https://www.cnbc.com/quotes/NWSA/\"\u003eNews Corp\u003c/a\u003e, its CEO Robert Thomson, the Journal\u0026#39;s publisher, Dow Jones \u0026amp; Co., and the two reporters who wrote the article that said the president sent Epstein a \u003ca href=\"https://www.cnbc.com/2025/07/17/trump-jeffrey-epstein-birthday-letter-wsj.html\"\u003e\u0026#34;bawdy\u0026#34; birthday letter\u003c/a\u003e in 2003.\u003c/p\u003e\u003cp\u003eCohen, who fell out with Trump years ago, said he thinks the president will pursue the case — and that Murdoch will cave.\u003c/p\u003e\u003cp\u003e\u0026#34;I predict Murdoch, et al will settle this matter in the same manner that \u003ca href=\"https://www.nbcnews.com/media/abc-news-pay-15-million-legal-settlement-trump-george-stephanopoulos-rcna184269\" target=\"_blank\"\u003eABC\u003c/a\u003e and \u003ca href=\"https://www.nbcnews.com/news/us-news/paramount-agrees-pay-16-million-settle-trumps-lawsuit-60-minutes-kamal-rcna216419\" target=\"_blank\"\u003eCBS\u003c/a\u003e did,\u0026#34; Cohen said in a text message, referring to recent multi-million-dollar settlements Trump obtained from ABC and the parent company of CBS News after suing those two news organizations.\u003c/p\u003e\u003cp\u003e\u0026#34;Unlike the lawsuit against me, this action has real consequences: such as advertisers pulling away from the newspaper or journalists being denied access to the White House,\u0026#34; Cohen said.\u003c/p\u003e\u003cp\u003eBut Cohen\u0026#39;s own former personal lawyer, Lanny Davis, told CNBC that he thinks Trump will voluntarily withdraw his case against Murdoch and the others after Gayles schedules a deposition for the president.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"RegularArticle-RelatedContent-1\"\u003e\u003ch2\u003eRead more CNBC politics coverage\u003c/h2\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/07/21/biden-trump-debate-ambien-hunter.html\"\u003eHunter Biden blames Ambien for President Biden\u0026#39;s terrible Trump debate\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/07/21/trump-djt-bitcoin-net-worth.html\"\u003eTrump Media builds $2 billion bitcoin hoard, as crypto swells president\u0026#39;s net worth\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/07/21/treasury-secretary-bessent-calls-for-a-review-of-the-entire-federal-reserve.html\"\u003eTreasury Secretary Bessent calls for a review of \u0026#39;the entire\u0026#39; Federal Reserve\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/07/21/trump-bessent-trade-deadline.html\"\u003eBessent: Collecting Aug. 1 tariffs \u0026#39;will put more pressure\u0026#39; on trade partners for deals\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/07/19/bessent-trump-powell-treasury.html\"\u003eTrump disputes WSJ report on Bessent talking him out of firing Powell\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/07/20/trump-trade-lutnick-august-1-tariffs.html\"\u003eAug. 1 is \u0026#39;hard deadline\u0026#39; for Trump\u0026#39;s tariffs, Lutnick says\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/07/19/trump-jeffrey-epstein-files-pam-bondi.html\"\u003eTrump complains about Epstein file pressure: \u0026#39;Nothing will be good enough\u0026#39;\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/07/19/trump-jeffrey-epstein-files-pam-bondi.html\"\u003eTrump says releasing Epstein files wouldn\u0026#39;t satisfy \u0026#39;troublemakers,\u0026#39; as pressure mounts\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/07/18/epstein-maxwell-grand-jury-trump.html\"\u003eJustice Department asks court to unseal Epstein, Maxwell grand jury transcripts\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/07/18/trump-sues-epstein-murdoch-wsj.html\"\u003eTrump sues Murdoch for $10 billion over WSJ story on Epstein birthday letter\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u0026#34;If he\u0026#39;s smart, even if he has nothing to hide,\u0026#34; Trump will not submit to a deposition, Davis predicted. \u0026#34;He doesn\u0026#39;t want this story to alienate his base for the next two years.\u0026#34;\u003c/p\u003e\u003cp\u003eTrump sued Murdoch and the other defendants on Friday, a day after the Journal reported that a letter sent by Trump for Epstein\u0026#39;s 50th birthday was among material reviewed by federal investigators as part of a criminal probe of the notorious sex offender.\u003c/p\u003e\u003cp\u003eTrump has angrily denied writing the letter.\u003c/p\u003e\u003cp\u003eThe Journal\u0026#39;s story was published as Trump faced growing pressure to have the Justice Department release investigatory files about Epstein, a convicted sex offender who killed himself in 2019 after being arrested on child sex trafficking charges.\u003c/p\u003e\u003cp\u003eTrump had been friends with Epstein for years before the two men had a falling out, long before Epstein\u0026#39;s 2019 arrest.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-106024521\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000089554\" aria-labelledby=\"Placeholder-ArticleBody-Video-106024521\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/106024529-1596566627856-eps.jpg?v=1684379089\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"NBC archive footage shows Trump partying with Jeffrey Epstein in 1992\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eDavis compared filing a defamation case to submitting oneself to an invasive physical examination.\u003c/p\u003e\u003cp\u003e\u0026#34;As a matter of crisis management, what Trump has done is make matters worse with both his base and his critics, which is hard to do,\u0026#34; Davis said.\u003c/p\u003e\u003cp\u003e\u0026#34;He\u0026#39;s extended the story,\u0026#34; Davis said. \u0026#34;If you file a lawsuit, it\u0026#39;s the opposite of good crisis management, because you\u0026#39;re asking for more drip by drip stories, questioning you under oath.\u0026#34;\u003c/p\u003e\u003cp\u003eCNBC has requested comment from Dow Jones, which on Friday showed no sign of backing down from Trump after he filed his lawsuit.\u003c/p\u003e\u003cp\u003e\u0026#34;We have full confidence in the rigor and accuracy of our reporting, and will vigorously defend against any lawsuit,\u0026#34; the publisher said at that time.\u003c/p\u003e\u003cp\u003eTrump, for his part, has suggested it is Murdoch who would have the most to fear from being deposed.\u003c/p\u003e\u003cp\u003eA spokesman for Trump, when asked about comments by Cohen and Davis on Monday, directed CNBC to the president\u0026#39;s social media post last Friday.\u003c/p\u003e\u003cp\u003e\u0026#34;I hope Rupert and his \u0026#39;friends\u0026#39; are looking forward to the many hours of depositions and testimonies they will have to provide in this case,\u0026#34; Trump wrote in that \u003ca href=\"https://truthsocial.com/@realDonaldTrump/posts/114876683513144253\" target=\"_blank\"\u003eTruth Social post\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-07-21T21:57:30Z",
  "modifiedTime": "2025-07-21T21:57:30Z"
}
