{
  "id": "ecdaa5e0-103e-4963-b4ff-9d838ef35230",
  "title": "Amazon to invest $10bn in North Carolina data centres",
  "link": "https://finance.yahoo.com/news/amazon-invest-10bn-north-carolina-101107420.html",
  "description": "",
  "author": "",
  "published": "2025-06-05T10:11:07Z",
  "source": "https://finance.yahoo.com/news/rssindex",
  "categories": null,
  "byline": "GlobalData",
  "length": 2770,
  "excerpt": "The project aims to support advancements in AI and cloud computing technologies.",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "In This Article: Tech giant Amazon has announced a $10bn investment in the US state of North Carolina to expand its data centre infrastructure. The project aims to support advancements in artificial intelligence (AI) and cloud computing technologies. The investment, according to the company, will create at least 500 “high-skilled” jobs. It will also support thousands of additional jobs within the Amazon Web Services (AWS) data centre supply chain. According to Amazon’s press release, the rising demand for generative AI is increasing the need for advanced cloud infrastructure and compute power. This expansion will strengthen AWS data centres in the state. Commenting on the move, Amazon chief global affairs and legal officer David Zapolsky said: “Amazon's $10bn investment in North Carolina underscores our commitment to driving innovation and advancing the future of cloud computing and AI technologies.” “We look forward to partnering with state and local leaders, local suppliers, and educational institutions to nurture the next generation of talent.” In a separate development, Amazon is reportedly developing software for humanoid robots. These robots could potentially replace delivery workers, Reuters reported citing a report published by The Information, citing a person familiar with the matter. The company is building a “humanoid park,” an indoor obstacle course, at one of its San Francisco offices to test these robots. Amazon is focusing on developing the AI software for these robots while using hardware from other firms for testing. Amazon did not immediately respond to requests for comment outside regular business hours. Recently, Amazon started testing a new feature that uses generative AI (genAI) to create short-form audio summaries on select product detail pages. The feature provides concise overviews of products by analysing product details, customer reviews, and other relevant online information. The initial test feature targets products that often require careful consideration before buying, offering clear insights through in-depth discussion to help Amazon customers shop more efficiently, the company said in a post. \"Amazon to invest $10bn in North Carolina data centres\" was originally created and published by Verdict, a GlobalData owned brand. The information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.",
  "image": "https://s.yimg.com/ny/api/res/1.2/WCL_QGgj99vhPJMvn0S8yg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/verdict_626/6c506fd4ee686c56b92edd19d2b44eb2",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"nimbus-app\" tabindex=\"-1\"\u003e  \u003carticle\u003e  \u003cdiv\u003e  \u003cdiv data-testid=\"article-content-wrapper\"\u003e\u003ch2\u003eIn This Article: \u003c/h2\u003e   \u003cdiv\u003e   \u003cp\u003eTech giant Amazon has announced a $10bn investment in the US state of North Carolina to expand its data centre infrastructure.\u003c/p\u003e   \u003cp\u003eThe project aims to support advancements in artificial intelligence (AI) and cloud computing technologies.\u003c/p\u003e   \u003cp\u003eThe investment, according to the company, will create at least 500 “high-skilled” jobs.\u003c/p\u003e      \u003cp\u003eIt will also support thousands of additional jobs within the Amazon Web Services (AWS) data centre supply chain.\u003c/p\u003e   \u003cp\u003eAccording to Amazon’s press release, the rising demand for generative AI is increasing the need for advanced cloud infrastructure and compute power.\u003c/p\u003e   \u003cp\u003eThis expansion will strengthen AWS data centres in the state.\u003c/p\u003e   \u003cp\u003eCommenting on the move, Amazon chief global affairs and legal officer David Zapolsky said: “Amazon\u0026#39;s $10bn investment in North Carolina underscores our commitment to driving innovation and advancing the future of cloud computing and AI technologies.”\u003c/p\u003e      \u003cp\u003e“We look forward to partnering with state and local leaders, local suppliers, and educational institutions to nurture the next generation of talent.”\u003c/p\u003e   \u003cp\u003eIn a separate development, Amazon is reportedly developing software for humanoid robots.\u003c/p\u003e   \u003cp\u003eThese robots could potentially replace delivery workers, \u003ca href=\"https://www.reuters.com/business/retail-consumer/amazon-prepares-test-humanoid-robots-package-deliveries-information-reports-2025-06-05/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Reuters reported;elm:context_link;itc:0;sec:content-canvas\"\u003eReuters reported\u003c/a\u003e citing a report published by The Information, citing a person familiar with the matter.\u003c/p\u003e   \u003cp\u003eThe company is building a “humanoid park,” an indoor obstacle course, at one of its San Francisco offices to test these robots. Amazon is focusing on developing the AI software for these robots while using hardware from other firms for testing.\u003c/p\u003e      \u003cp\u003eAmazon did not immediately respond to requests for comment outside regular business hours.\u003c/p\u003e   \u003cp\u003eRecently, Amazon \u003ca href=\"https://www.verdict.co.uk/amazon-trials-audio-summaries/?cf-view\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:started testing a new feature;elm:context_link;itc:0;sec:content-canvas\"\u003estarted testing a new feature\u003c/a\u003e that uses generative AI (genAI) to create short-form audio summaries on select product detail pages.\u003c/p\u003e   \u003cp\u003eThe feature provides concise overviews of products by analysing product details, customer reviews, and other relevant online information.\u003c/p\u003e   \u003cp\u003eThe initial test feature targets products that often require careful consideration before buying, offering clear insights through in-depth discussion to help Amazon customers shop more efficiently, the company said in a post.\u003c/p\u003e      \u003cp\u003e\u0026#34;Amazon to invest $10bn in North Carolina data centres\u0026#34; was originally created and published by \u003ca href=\"https://www.verdict.co.uk/amazon-north-carolina-data-centres/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Verdict;elm:context_link;itc:0;sec:content-canvas\"\u003eVerdict\u003c/a\u003e, a GlobalData owned brand.\u003c/p\u003e         \u003cp\u003e\u003ci\u003e\u003cbr/\u003e\u003csmall\u003eThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.\u003c/small\u003e\u003c/i\u003e\u003c/p\u003e \u003c/div\u003e\u003c/div\u003e     \u003chr/\u003e \u003cul\u003e\u003cli data-testid=\"seamlessscroll-006676bf-5c0b-37d8-88ff-0558b3ae4f19\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-5b6ded98-b99f-3723-a1bd-e121b3a4e48b\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-1b147d18-b97f-3ba2-b41b-2ad4b5bf41fd\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-8d9a2492-5fb9-355d-a0ea-2b0750e29848\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-26b49aaa-ba87-3abe-b02d-a69a16b7539e\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-1a2122fb-5abe-3eaa-8e99-ac07c7051495\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-87d227a1-44fb-343f-b8b3-843d4dab0549\"\u003e \u003c/li\u003e\u003c/ul\u003e \u003csection\u003e\u003cheader\u003e \u003c/header\u003e   \u003c/section\u003e\u003c/div\u003e\u003c/article\u003e \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-05T10:11:07Z",
  "modifiedTime": null
}
