[
  {
    "id": "c255ef31-a811-4e15-9112-63c216f638c1",
    "title": "Fortezza da Basso, Florence",
    "link": "https://www.thesartorialist.com/the-fortezza-florence-10/",
    "description": "",
    "author": "sartorialist",
    "published": "Fri, 01 May 2020 18:00:00 +0000",
    "image": "",
    "source": "https://feeds.feedburner.com/TheSartorialist",
    "categories": [
      "Women",
      "Boots",
      "Dresses",
      "Florence",
      "Sunglasses"
    ]
  },
  {
    "id": "6c53f189-2f0f-46a5-93e4-bf36ca51ea9f",
    "title": "East Village, New York",
    "link": "https://www.thesartorialist.com/east-village-friday-new-york/",
    "description": "",
    "author": "sartorialist",
    "published": "Fri, 01 May 2020 14:00:39 +0000",
    "image": "",
    "source": "https://feeds.feedburner.com/TheSartorialist",
    "categories": [
      "Women",
      "Black",
      "New York",
      "Shorts"
    ]
  },
  {
    "id": "3bac1fcb-5364-416c-a4a3-bcc71c53198c",
    "title": "Godox Has Announced Ultra Compact Affordable Flash – The New iT20/iT22",
    "link": "https://www.lightstalking.com/godox-it20-it22/",
    "description": "Godox, a company popularly known for photography lighting equipment, has recently released a couple of mini TTL flashes that are ultra compact and will easily fit into your pocket. These camera flashes are perfect for both indoor and outdoor photography use, and come with magnetic accessories for quick switching between light effects. The post Godox Has Announced Ultra Compact Affordable Flash – The New iT20/iT22 appeared first on Light Stalking.",
    "author": "Dahlia Ambrose",
    "published": "Thu, 24 Jul 2025 12:00:00 +0000",
    "image": "",
    "source": "https://www.lightstalking.com/feed/",
    "categories": [
      "Photography News"
    ]
  },
  {
    "id": "b508e919-242d-463d-bfe7-f17549725f05",
    "title": "How to Photograph Flowers",
    "link": "https://www.lightstalking.com/how-to-photograph-flowers/",
    "description": "Flowers are just about the most cooperative model that you'll ever find in photography. And for that reason, they're also a great place to both get amazing images and learn the tricks of the trade.  You can go to a local park or find a flower bed downtown or at the mall. You can visit […] The post How to Photograph Flowers appeared first on Light Stalking.",
    "author": "Iza Korwel",
    "published": "Wed, 23 Jul 2025 02:30:04 +0000",
    "image": "",
    "source": "https://www.lightstalking.com/feed/",
    "categories": [
      "Macro Photography",
      "Sigma"
    ]
  },
  {
    "id": "8620d6f0-c3d8-402f-a2b3-b3858b5e2095",
    "title": "Creating Visual Rhythm with Multiple Exposures",
    "link": "https://iso.500px.com/creating-visual-rhythm-multiple-exposures/",
    "description": "Photography is a medium filled with endless creative possibilities, and one captivating technique stands out: multiple exposures. By layering two or more images into a single photograph, you can introduce visual rhythm, tell compelling stories, and create unique, dreamlike effects. Ready to explore how multiple exposures can elevate your photography? Let’s dive in! The Artistic Appeal of Multiple Exposures Multiple exposure photography combines different images to produce intriguing, layered visuals […] The post Creating Visual Rhythm with Multiple Exposures appeared first on 500px.",
    "author": "500px Blog",
    "published": "Thu, 24 Jul 2025 15:00:38 +0000",
    "image": "https://iso.500px.com/wp-content/uploads/2025/07/silhouette-sunset-mountains-multiple-exposures.png",
    "source": "https://iso.500px.com/feed/",
    "categories": [
      "500px Blog",
      "Headline",
      "Home Feed",
      "double exposure",
      "double exposures",
      "double-exposure photography"
    ]
  },
  {
    "id": "a8d2a254-efdb-4654-b79b-5f469789a10d",
    "title": "Capturing the Moment: Mastering High-Speed Photography",
    "link": "https://iso.500px.com/capturing-moment-mastering-high-speed-photography/",
    "description": "Have you ever marvelled at a photograph of a hummingbird frozen mid-flight or water droplets suspended in mid-air? These stunning images are possible through high-speed photography, a technique that freezes fleeting moments too fast for the human eye. Mastering this form of photography not only enhances your skills but also transforms everyday occurrences into captivating visual stories. Let’s dive into the fascinating world of high-speed photography and discover how to […] The post Capturing the Moment: Mastering High-Speed Photography appeared first on 500px.",
    "author": "500px Blog",
    "published": "Thu, 17 Jul 2025 15:00:11 +0000",
    "image": "https://iso.500px.com/wp-content/uploads/2025/07/water-drop-collision-high-speed-photography.png",
    "source": "https://iso.500px.com/feed/",
    "categories": [
      "500px Blog",
      "Headline",
      "Home Feed",
      "burst",
      "burst mode",
      "high speed",
      "high speed photography"
    ]
  },
  {
    "id": "de2ed5d6-8b9e-4904-ba8d-2ae1455dcc08",
    "title": "Globe staff photos of the month, February 2020",
    "link": "https://www.bostonglobe.com/news/bigpicture/2020/03/04/globe-staff-photos-month-february/CDiztYMhad5stG0VBAvsjJ/story.html?rss_id=section_rss_full\u0026s_campaign=bg:full:rss:section",
    "description": "Here’s a look at some of the best images taken by Globe photographers last month: the New Hamphire primary, Ash Wednesday, living with progeria, the Beanpot Tournament, and Red Sox spring training.",
    "author": "",
    "published": "Wed, 04 Mar 2020 22:19:03 +0000",
    "image": "https://cloudfront-us-east-1.images.arcpublishing.com/bostonglobe/32PTLQSKVUI6VDICL5JAZBREOM.jpg",
    "source": "https://www.bostonglobe.com/rss/bigpicture",
    "categories": null
  },
  {
    "id": "b4a92ec0-c4f3-492a-859f-740c6837640b",
    "title": "Life during the coronavirus pandemic",
    "link": "https://www.bostonglobe.com/news/bigpicture/2020/03/30/life-during-coronavirus-pandemic/wOmubnlrYaN8m2epe1FAHO/story.html?rss_id=section_rss_full\u0026s_campaign=bg:full:rss:section",
    "description": "Globe staff photographers document the Boston area and beyond during this unprecented time. The gallery is updated weekly throughout the crisis.",
    "author": "",
    "published": "Mon, 30 Mar 2020 22:49:52 +0000",
    "image": "https://cloudfront-us-east-1.images.arcpublishing.com/bostonglobe/A27O6IULEUI6VL32SQ7K27FODM.jpg",
    "source": "https://www.bostonglobe.com/rss/bigpicture",
    "categories": null
  },
  {
    "id": "9e797554-806c-46d2-9c15-8515a6839a96",
    "title": "Digital Photography School on Twitter",
    "link": "https://digital-photography-school.com/digital-photography-school-on-twitter/",
    "description": "The post Digital Photography School on Twitter appeared first on Digital Photography School. It was authored by Darren Rowse. Today Digital Photography School has made the leap into a new online medium – Twitter. UPDATE:  So I was just browsing older articles here on dPS, and came across this gem, remember when Twitter was called Twitter… oh, err, I mean ‘X’ – whatever, you know what I mean! Well we are STILL on X […] The post Digital Photography School on Twitter appeared first on Digital Photography School. It was authored by Darren Rowse.",
    "author": "Darren Rowse",
    "published": "Wed, 23 Jul 2025 05:51:58 +0000",
    "image": "https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2008/06/twitter-1.png?resize=210%2C49\u0026ssl=1",
    "source": "https://feeds.feedburner.com/DigitalPhotographySchool",
    "categories": [
      "DPS Site News"
    ]
  },
  {
    "id": "8c5b10f8-5c4e-44ef-9693-aa70b1631481",
    "title": "5 Ways to Create More Artistic Photos (Fast!)",
    "link": "https://digital-photography-school.com/create-more-artistic-photos-tips/",
    "description": "The post 5 Ways to Create More Artistic Photos (Fast!) appeared first on Digital Photography School. It was authored by Jaymes Dempsey. Looking back at this article from Jaymes, maybe all in one long post it can be a little overwhelming, what about if you were to write down the five points and then tackle them one at a time? Use minimalism to improve your compositions Add split toning to enhance the colors Decrease the depth of […] The post 5 Ways to Create More Artistic Photos (Fast!) appeared first on Digital Photography School. It was authored by Jaymes Dempsey.",
    "author": "Jaymes Dempsey",
    "published": "Mon, 21 Jul 2025 10:49:07 +0000",
    "image": "https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2020/02/dps-more-artistic-photos-pinterest.jpg?resize=1200%2C1200\u0026ssl=1",
    "source": "https://feeds.feedburner.com/DigitalPhotographySchool",
    "categories": [
      "Featured: Tips and Tutorials",
      "Photography Tips and Tutorials",
      "photographic inspiration"
    ]
  },
  {
    "id": "a5d0e10f-db5e-47a6-b12a-d9a68f6117bc",
    "title": "I've Been Working on Something",
    "link": "http://strobist.blogspot.com/2024/06/ive-been-working-on-something.html",
    "description": "Hey gang, it’s David. It’s been a while! In 2021, I archived Strobist as a completed project. I can’t honestly say that I’ve missed the breakneck pace of running a solo site. But I’ve definitely missed interacting with so many cool people all of the time. That said, I am still teaching. X-Peditions gives me the twin advantages much smaller class sizes, plus being in Hanoi every fall. And that’s been wonderful. Better yet, my new schedule has given me the breathing room to be able build my current project. Like Strobist, this project is designed for photographers. But unlike this website, it has nothing at all to do with flash. Today I’m introducing my new book, The Traveling Photographer’s Manifesto. It aspires to be for traveling photographers what Strobist always tried to be for lighting photographers. The premise of the book is that your camera can, and should, be much more than just a pricey recording device when you travel. It can also serve as a passport, opening up new connections and possibilities that otherwise might not have happened. Using a photo trip to Southeast Asia as a framework, the book walks through many things that you can do to help this to happen. I have uploaded three documents to help you to know if TTPM might be suited for you: 1. A 5-minute summary: This will quickly give you a feel for the book. 2. A 27-page supplement: Only a small portion of the book, which is unillustrated, is about camera operation. This visual supplement is available for readers who are more visual learners. And it will give you a quick skim of parts 4 and 5. 3. A sample chapter: How to become more comfortable meeting and engaging with people as a photographer. As you'll see from the summary, most of the book is not about camera operation at all. It’s more about the countless little things that working photojournalists do while on assignment that an enthusiast might not think of. These little habits, taken together, can start to form the impression of a photographer being consistently, conspicuously lucky. When in reality, luck had very little to do with it. So, if this is the sort of thing that interests you, I hope you’ll give the book a spin. It is available now, on Amazon.com worldwide. Just as with Strobist, I welcome your feedback from this project as well. My email is listed on the copyright page and elsewhere. And of course, I will read and take to heart every Amazon review. Because my goal is for the project to continue to evolve and improve over time, just as the material on this website did. Thanks for your interest, and for your readership of Strobist. As always, please say hi at any time on Twitter at @Strobist. Cheers, David The Traveling Photographer’s Manifesto (Amazon.com)",
    "author": "David Hobby",
    "published": "Tue, 11 Jun 2024 22:22:00 +0000",
    "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi-W17q9tcAHlutYrIFGWU0YglpFYEfSkjZZWB7RouSVTQJtMvAy9WhRx5n4JMvFjiVVDTJ3P5qMC0Lp1MQ8SPj4ZFsA1RLw5j-6Mo9tBME3hR3nny3H3yn-foRWK-3kVYgYcIcjUFC5K-gQTa7-nMsJ_RgWyoVRxDT6SWAngTK7y7TaDoAEcBi/s400/Lede%20TTPM.JPG",
    "source": "http://feeds.feedburner.com/blogspot/WOBq",
    "categories": null
  },
  {
    "id": "07c614ad-b813-4e62-84e3-fc4de7b895b6",
    "title": "So Long (for Now!) and Thank You.",
    "link": "http://strobist.blogspot.com/2021/07/so-long-for-now-and-thank-you.html",
    "description": "In 2006 I started a lighting blog while working full-time as a staffer at The Baltimore Sun. By early 2007, it became obvious that I didn't have the personal resources to give 100% to both Strobist and my job at the newspaper. That’s exactly the position I find myself in today. For the past year I have been working on a new project. It is photography-based, and will be as unique to the photo space as Strobist was back in 2006. But, as I found with Strobist in 2007, this project will require all of my focus. So I am shifting Strobist into archive mode to allow myself the time and mental space to do that. If I had more available brain cells/hours in the day, I would be happy to do both. Alas, I do not. So I am choosing the one I think can make a bigger difference to photographers. When the new project launches, I’ll do my best to make sure you hear about it. So please, stay tuned! For those of you who are interested in our in-person lighting workshops and/or our X-Peditions trips (both of which are currently on pause during the pandemic) we absolutely are planning to restart them once the coast is clear. Please make sure you are on the relevant notification list(s) by clicking through to the links above. Finally, I want to take this moment to say thank you to the countless people I have met, and new friendships made, as a result of publishing Strobist over the past 15 years. It is impossible to express how much you all have enriched my life, and that of my family. Thank you so much, David",
    "author": "David Hobby",
    "published": "Thu, 01 Jul 2021 15:26:00 +0000",
    "image": "http://farm1.static.flickr.com/171/447819702_778a34024c.jpg",
    "source": "http://feeds.feedburner.com/blogspot/WOBq",
    "categories": null
  },
  {
    "id": "9f0bd428-7175-43af-9e7c-dbcc6e1fd070",
    "title": "How the iPhone 16 Can Help You Be a Better Content Creator",
    "link": "http://onebigphoto.com/how-the-iphone-16-can-help-you-be-a-better-content-creator/",
    "description": "If you’re a content creator, you know the value of using tools that help you produce better quality content and make the entire editing process easy from start to finish. Whether you’re creating videos, podcasts, written content, or even graphics, the iPhone 16 just might be your new favorite tool. As long as you have […]",
    "author": "Bigphoto",
    "published": "Fri, 24 May 2024 18:49:35 +0000",
    "image": "http://onebigphoto.com/uploads/2019/11/whystudentsneed1-300x200.jpg",
    "source": "http://feeds.feedburner.com/OneBigPhoto",
    "categories": [
      "Blog"
    ]
  },
  {
    "id": "f98d34ba-831d-46c7-a37b-1b25e8a4a9ce",
    "title": "Wallet Management 101: How to Keep Your Wallet in Great Shape",
    "link": "http://onebigphoto.com/wallet-management-101-how-to-keep-your-wallet-in-great-shape/",
    "description": "Wallets aren’t incredibly expensive, but if you take good care of them, they can serve you well and last a lifetime. Thankfully, the most important strategies for keeping a wallet in good condition are both inexpensive and highly accessible.   How do you keep your wallet in great shape?   Choose the Right Wallet   […]",
    "author": "Bigphoto",
    "published": "Fri, 24 May 2024 18:34:24 +0000",
    "image": "http://onebigphoto.com/uploads/2024/05/walletobp-300x150.jpg",
    "source": "http://feeds.feedburner.com/OneBigPhoto",
    "categories": [
      "Blog"
    ]
  },
  {
    "id": "cb49974a-fd57-4ad0-a682-425a6370c025",
    "title": "Photographer’s Hacked Vintage Digital Point-and-Shoot Camera Is Surprisingly Awesome",
    "link": "https://petapixel.com/2025/07/24/photographers-hacked-vintage-digital-point-and-shoot-camera-is-surprisingly-awesome/",
    "description": "Photographer and artist Red transformed the 15-year-old Canon PowerShot A490 compact camera into an impressively capable camera. The camera, which launched in 2010 for just over $100, delivers surprisingly good image quality, at least after a bit of hacking. [Read More]",
    "author": "Jeremy Gray",
    "published": "Thu, 24 Jul 2025 21:05:01 +0000",
    "image": "https://petapixel.com/assets/uploads/2025/07/hacked-powershot-a490-featured.jpg",
    "source": "https://petapixel.com/feed/",
    "categories": [
      "Analog",
      "Do It Yourself",
      "Equipment",
      "News",
      "Canon",
      "canonpowershot",
      "canonpowershota490"
    ]
  },
  {
    "id": "1d10087d-3508-48f5-afcf-ed078e66d7cb",
    "title": "Reto Pano Film Point-and-Shoot Review: C I N E M A T I C",
    "link": "https://petapixel.com/2025/07/24/reto-pano-film-point-and-shoot-review-c-i-n-e-m-a-t-i-c/",
    "description": "In May, vintage-inspired analog camera company Reto announced the Reto Pano, a reusable point-and-shoot camera with both an ultra-wide lens and the promise of being able to switch freely between standard 35mm film aspect ratio and panoramic mid-roll. It got my attention. [Read More]",
    "author": "Jaron Schneider",
    "published": "Thu, 24 Jul 2025 20:01:51 +0000",
    "image": "https://petapixel.com/assets/uploads/2025/07/Reto-Pano-Film-Point-and-Shoot-Review-C-I-N-E-M-A-T-I-C.jpg",
    "source": "https://petapixel.com/feed/",
    "categories": [
      "Analog",
      "Reviews",
      "35mm",
      "analog",
      "disposablecamera",
      "film",
      "kodakgold",
      "pano",
      "panoramic",
      "reto",
      "retopano",
      "review"
    ]
  },
  {
    "id": "0ed024ac-77c9-4f6b-bdcc-ec0d6ca5a24a",
    "title": "This Week on The Grid: Bring Your Own Style to Iconic Locations with Special Guest John Dukes",
    "link": "https://lightroomkillertips.com/travel-photography-style-grid-episode/",
    "description": "In this week’s episode of The Grid, Scott teams up with travel photographer John Dukes to talk all about developing your travel photography style—especially when you’re shooting those classic, iconic spots. They chat about what makes a photographer’s style stand out, how to avoid cookie-cutter shots, and why showing your personal vision in your travel images really matters. You’ll also get a peek at some cool new classes and tips to help you grow your style and storytelling skills. So if you’ve ever wondered how to make your travel photos feel more “you,” this episode is packed with practical tips, creative ideas, and plenty of laughs. The post This Week on The Grid: Bring Your Own Style to Iconic Locations with Special Guest John Dukes appeared first on Lightroom Killer Tips.",
    "author": "Kim Doty",
    "published": "Thu, 24 Jul 2025 08:16:00 +0000",
    "image": "",
    "source": "https://lightroomkillertips.com/feed/",
    "categories": [
      "Featured",
      "KelbyOne",
      "Photography",
      "The Grid",
      "travel photography"
    ]
  },
  {
    "id": "6ec75edb-0ba3-452f-8a31-96b7b0b2b64a",
    "title": "Now There’s a Platypod for Everyone!",
    "link": "https://lightroomkillertips.com/now-theres-a-platypod-for-everyone/",
    "description": "If you’ve spent any time in the photography world over the past few years, you’ve probably heard the name Platypod tossed around in conversations about travel gear, tripod alternatives, or clever tools for tight spaces.  What started as a quirky, flat tripod base has evolved into something much bigger—a full ecosystem of smart tools that help photographers stay light, creative, and nimble in the field.  Several new products this year alone including Delta, Traveler, MagGrip and Tab—all to help get you started on your next photography journey.   Also, if you want to learn more about what we do and Photography in general, join over 7500 subscribers to our YouTube channel. Just search on YouTube for “platypod channel” (or click here) where we release a new video once a week to help you along with your imaging.  For more information on our products as well as helpful tutorials please visit us over at www.platypod.com  The post Now There’s a Platypod for Everyone!  appeared first on Lightroom Killer Tips.",
    "author": "KelbyOne",
    "published": "Wed, 23 Jul 2025 13:00:00 +0000",
    "image": "https://lightroomkillertips.com/wp-content/uploads/2025/07/02_PLA_KelbyOne_LRTips2025_IMGs__06__1024x684_v1.jpg",
    "source": "https://lightroomkillertips.com/feed/",
    "categories": [
      "Gear",
      "Photography",
      "Sponsored",
      "photography",
      "Platypod"
    ]
  },
  {
    "id": "c284df6e-e538-4683-981a-d5d47507b81a",
    "title": "The Many Falls",
    "link": "https://stuckincustoms.com/2025/07/15/the-many-falls/",
    "description": "Daily Photo – The Many Falls One thing (of many good things) that New Zealand does is create and well maintain walking tracks. They’re all over the place on the South Island and even from the middle of a town or city you’re often only a few minutes from the beginning of a trail that […] The post The Many Falls appeared first on Stuck in Customs.",
    "author": "Stu Davidson",
    "published": "Tue, 15 Jul 2025 16:49:14 +0000",
    "image": "https://i0.wp.com/stuckincustoms.smugmug.com/Portfolio/i-BbFCpkf/0/MB4cKDXGQF5HJGR8hm3Qcf2hBmhtdvQdJDKqVcxg4/600x900/DSC03512_HDR-600x900.jpg?resize=600%2C900\u0026ssl=1",
    "source": "https://stuckincustoms.com/feed/",
    "categories": [
      "Camera Gear",
      "New Zealand",
      "Sony a7CR",
      "Travel",
      "Waterfall"
    ]
  },
  {
    "id": "9d0437cf-48f9-48a7-a83c-7a7aa3aa054f",
    "title": "A collection of the surreal…",
    "link": "https://stuckincustoms.com/2025/07/10/a-collection-of-the-surreal/",
    "description": "Made with the new Midjourney… The post A collection of the surreal… appeared first on Stuck in Customs.",
    "author": "Stu Davidson",
    "published": "Thu, 10 Jul 2025 18:46:14 +0000",
    "image": "",
    "source": "https://stuckincustoms.com/feed/",
    "categories": [
      "artificial intelligence",
      "generative",
      "Midjourney",
      "video"
    ]
  }
]
