[
  {
    "id": "58e13c99-c743-4e1d-b195-c369d5d46c14",
    "title": "Fortezza da Basso, Florence",
    "link": "https://www.thesartorialist.com/the-fortezza-florence-10/",
    "description": "",
    "author": "sartorialist",
    "published": "Fri, 01 May 2020 18:00:00 +0000",
    "image": "",
    "source": "https://feeds.feedburner.com/TheSartorialist",
    "categories": [
      "Women",
      "Boots",
      "Dresses",
      "Florence",
      "Sunglasses"
    ]
  },
  {
    "id": "9036b584-18dd-4e49-8de8-225ca347f488",
    "title": "East Village, New York",
    "link": "https://www.thesartorialist.com/east-village-friday-new-york/",
    "description": "",
    "author": "sartorialist",
    "published": "Fri, 01 May 2020 14:00:39 +0000",
    "image": "",
    "source": "https://feeds.feedburner.com/TheSartorialist",
    "categories": [
      "Women",
      "Black",
      "New York",
      "Shorts"
    ]
  },
  {
    "id": "1dcce2b3-8ab8-40aa-a900-f0c391f01d93",
    "title": "Capturing grand perspectives in sweeping landscapes",
    "link": "https://iso.500px.com/capturing-grand-perspectives-in-sweeping-landscapes/",
    "description": "Sweeping landscapes are the most captivating subjects in photography, offering a chance to show the vastness of nature and the intricate details within it. The post Capturing grand perspectives in sweeping landscapes appeared first on 500px.",
    "author": "500px Blog",
    "published": "Thu, 23 Jan 2025 12:30:23 +0000",
    "image": "https://iso.500px.com/wp-content/uploads/2025/01/Chianti-Vineyards-By-Giulio-Donati-2.jpeg",
    "source": "https://iso.500px.com/feed/",
    "categories": [
      "500px Blog",
      "Headline",
      "Home Feed",
      "advanced techniques",
      "beauty",
      "capture a view",
      "composition",
      "lighting",
      "natural world",
      "perspective",
      "plan your shots",
      "Scale",
      "Sweeping landscapes",
      "tell a story"
    ]
  },
  {
    "id": "60be8106-03b5-426e-9176-b33125de4db2",
    "title": "Creating depth and drama with moody photography",
    "link": "https://iso.500px.com/creating-depth-and-drama-with-moody-photography/",
    "description": "Moody photography is a trend that captivates audiences, using rich shadows, dramatic lighting, and subdued tones to evoke emotion and tell powerful stories. The post Creating depth and drama with moody photography appeared first on 500px.",
    "author": "500px Blog",
    "published": "Thu, 16 Jan 2025 12:30:21 +0000",
    "image": "https://iso.500px.com/wp-content/uploads/2024/12/The-Dancer-By-David-Martín-Castan-2.jpeg",
    "source": "https://iso.500px.com/feed/",
    "categories": [
      "500px Blog",
      "Featured",
      "Home Feed",
      "compelling narratives",
      "composition",
      "depth",
      "emotion",
      "lighting",
      "Moody photography",
      "photo trends",
      "scenes",
      "storytelling",
      "tonal balance"
    ]
  },
  {
    "id": "c06d7068-c954-462d-b7e1-ad4de221d6ae",
    "title": "Zoom Lenses: Your Comprehensive Guide",
    "link": "https://digital-photography-school.com/zoom-lens/",
    "description": "The post Zoom Lenses: Your Comprehensive Guide appeared first on Digital Photography School. It was authored by Jaymes Dempsey. Zoom lenses are cheap, effective, and incredibly popular; they’re used by hordes of photographers around the globe. For many beginners, a nice kit zoom is an amazing way to get started with photography, and for many professionals, a high-quality zoom is pretty much always mounted to their camera. But what actually is a zoom lens? […] The post Zoom Lenses: Your Comprehensive Guide appeared first on Digital Photography School. It was authored by Jaymes Dempsey.",
    "author": "Jaymes Dempsey",
    "published": "Tue, 21 Jan 2025 09:00:00 +0000",
    "image": "https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/02/zoom-lens-photography-1005.jpg?resize=1242%2C1265\u0026ssl=1",
    "source": "https://feeds.feedburner.com/DigitalPhotographySchool",
    "categories": [
      "Cameras and Equipment",
      "beginner",
      "gear fundamentals"
    ]
  },
  {
    "id": "672df794-166f-46bd-9a6c-96d0ebbc62c9",
    "title": "Shallow Depth of Field Photography: A Practical Guide",
    "link": "https://digital-photography-school.com/how-to-get-shallow-depth-of-field-in-your-digital-photos/",
    "description": "The post Shallow Depth of Field Photography: A Practical Guide appeared first on Digital Photography School. It was authored by Darren Rowse. Have you ever felt like your photos were missing something essential? A shallow depth of field effect is one of my favorite ways to take your images from “zero” to “hero.” You see, thanks to shallow DoF techniques, you can capture shots that are both artistic and professional. Of course, controlling the depth of field […] The post Shallow Depth of Field Photography: A Practical Guide appeared first on Digital Photography School. It was authored by Darren Rowse.",
    "author": "Darren Rowse",
    "published": "Mon, 20 Jan 2025 09:00:00 +0000",
    "image": "https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/09/shallow-depth-of-field-photography-1005.jpg?resize=1200%2C1268\u0026ssl=1",
    "source": "https://feeds.feedburner.com/DigitalPhotographySchool",
    "categories": [
      "Photography Tips and Tutorials",
      "beginners",
      "photography fundamentals"
    ]
  },
  {
    "id": "c9b0e604-948b-42d7-a7b8-67efc75b3594",
    "title": "Very excited to be launching a new podcast today!",
    "link": "https://lightroomkillertips.com/very-excited-to-be-launching-a-new-podcast-today/",
    "description": "It’s called “One On1,” and it’s tips, tricks, techniques and news for the On1 Software Community. I’ve got a killer tip for Effects 2025 users to kick off the show, plus Dan Harlacher will be joining me to show their new portrait and wedding photography productivity plug-in for Lightroom – today at 3:00 PM ET live. Hope you’ll stop by and check it out. https://bit.ly/4arpK14 See you then! -Scott The post Very excited to be launching a new podcast today! appeared first on Lightroom Killer Tips.",
    "author": "Scott Kelby",
    "published": "Wed, 22 Jan 2025 16:06:41 +0000",
    "image": "https://lightroomkillertips.com/wp-content/uploads/2025/01/on1one-1024x680.jpg",
    "source": "https://lightroomkillertips.com/feed/",
    "categories": [
      "Featured"
    ]
  },
  {
    "id": "50c7cfe1-b3be-44ee-a3f1-06caf93f4ce3",
    "title": "Delta Makes the Difference",
    "link": "https://lightroomkillertips.com/delta-makes-the-difference/",
    "description": "By Larry Tiefenbrunn, MD CEO and inventor, Platypod Pro LLC  Don’t get me wrong. I absolutely love tripods. I personally own about a half a dozen of them of all different brands. I use them for studio work, group portraiture, even some product shots.   However, when I’m out and about, the last thing I want to do is carry around unnecessarily heavy equipment. And I certainly don’t want to be told by security guards (#TripodPolice) that I can’t use a tripod to take long exposures for whatever reasons they conjure up. A compact flat tripod that slips into my camera bag, that doesn’t take up the space of a telephoto lens, is why I invented the very first Platypod, and that is why I have dedicated 10 years of time to this company… so that I can share my idea with like-minded photographers.   After several iterations of “the world‘s most compact tripod base” I have taken the very best features of our patented designs, and coalesced them into what I believe is going to be the most popular tripod of its kind, the Platypod Delta. The triangular design, flip out legs and adaptations to straps and 1/4” threaded accessories make this the fastest and most versatile Platypod to date. You just add on your own tripod head to this plate, and you are ready to shoot photo or video. Don’t have a spare tripod head? Look at any of our Platyball ballhead models or the Platypod grip for your smart phone.  What is new and different about Delta?  Δ Flip out hinged spikes – when we introduced the recent Platypod eXtreme, everyone was so happy that they no longer had to insert each spike individually. They could now simply pull out the hinges and flip the spikes into place. Our previous hand sized model, the Platypod ultra also required the spikes to be carried in a separate wallet which was not as convenient. For Delta, we designed all new heavy duty hinges with adjustable tension (with included 2 mm Allen wrench). Three 1/4 inch threaded spikes take three or four seconds to deploy.   They also incorporate our unique nylon/silicone retractable feet to reveal the sharp spikes for stone and concrete, or conversely, to cover them with a soft rubber tip to protect delicate surfaces.  Δ Triangular design – All our previous designs relied upon a primarily four legged system for added stability. The sacrifice however was speed since on almost any uneven surface some degree of leg adjustment was necessary for balance as well as to avoid jitter. The three legged system allows instant stability upon spike deployment.  Δ Super lightweight design – at only 4.2 ounces including spikes and tips this is our most lightweight and compact Platypod with a substantially smaller surface area due to the aircraft like cut out design. We bumped up the thickness of the metal from 5 mm to 6 mm to maintain maximum strength and stability. Fits beautifully into any camera bag or your pocket.  What remains the same?  It is compatible with our entire product line and maintains the Platypod features our users love:  …and yes, it really does open beer bottles.  Delta is available for discounted pre-order via Kickstarter now through February 15, 2025 and later on at platypod.com   Platypod®? Delta Travel Tripod by Larry Tiefenbrunn — Kickstarter  The post Delta Makes the Difference appeared first on Lightroom Killer Tips.",
    "author": "KelbyOne",
    "published": "Fri, 17 Jan 2025 08:16:00 +0000",
    "image": "https://lightroomkillertips.com/wp-content/uploads/2025/01/157__DELTA__Kickstarter__KelbyOne__Blog_Img2_1040x684.jpg",
    "source": "https://lightroomkillertips.com/feed/",
    "categories": [
      "Gear",
      "News",
      "Sponsored",
      "innovation",
      "kickstarter",
      "photography",
      "Platypod",
      "Travel",
      "travel photography",
      "tripod",
      "tripod alternative"
    ]
  },
  {
    "id": "05c75576-113c-4e3c-b191-37229841b14d",
    "title": "How the iPhone 16 Can Help You Be a Better Content Creator",
    "link": "http://onebigphoto.com/how-the-iphone-16-can-help-you-be-a-better-content-creator/",
    "description": "If you’re a content creator, you know the value of using tools that help you produce better quality content and make the entire editing process easy from start to finish. Whether you’re creating videos, podcasts, written content, or even graphics, the iPhone 16 just might be your new favorite tool. As long as you have […]",
    "author": "Bigphoto",
    "published": "Fri, 24 May 2024 18:49:35 +0000",
    "image": "http://onebigphoto.com/uploads/2019/11/whystudentsneed1-300x200.jpg",
    "source": "http://feeds.feedburner.com/OneBigPhoto",
    "categories": [
      "Blog"
    ]
  },
  {
    "id": "ac121b23-8c95-4a4b-83e9-26b274046a21",
    "title": "Wallet Management 101: How to Keep Your Wallet in Great Shape",
    "link": "http://onebigphoto.com/wallet-management-101-how-to-keep-your-wallet-in-great-shape/",
    "description": "Wallets aren’t incredibly expensive, but if you take good care of them, they can serve you well and last a lifetime. Thankfully, the most important strategies for keeping a wallet in good condition are both inexpensive and highly accessible.   How do you keep your wallet in great shape?   Choose the Right Wallet   […]",
    "author": "Bigphoto",
    "published": "Fri, 24 May 2024 18:34:24 +0000",
    "image": "http://onebigphoto.com/uploads/2024/05/walletobp-300x150.jpg",
    "source": "http://feeds.feedburner.com/OneBigPhoto",
    "categories": [
      "Blog"
    ]
  },
  {
    "id": "fb090b95-3c9e-4e1b-b55d-ef0aafa3c213",
    "title": "Globe staff photos of the month, February 2020",
    "link": "https://www.bostonglobe.com/news/bigpicture/2020/03/04/globe-staff-photos-month-february/CDiztYMhad5stG0VBAvsjJ/story.html?rss_id=section_rss_full\u0026s_campaign=bg:full:rss:section",
    "description": "Here’s a look at some of the best images taken by Globe photographers last month: the New Hamphire primary, Ash Wednesday, living with progeria, the Beanpot Tournament, and Red Sox spring training.",
    "author": "",
    "published": "Wed, 04 Mar 2020 22:19:03 +0000",
    "image": "https://cloudfront-us-east-1.images.arcpublishing.com/bostonglobe/32PTLQSKVUI6VDICL5JAZBREOM.jpg",
    "source": "https://www.bostonglobe.com/rss/bigpicture",
    "categories": null
  },
  {
    "id": "33b84be9-6e42-48b0-b448-a213c74e53ad",
    "title": "Life during the coronavirus pandemic",
    "link": "https://www.bostonglobe.com/news/bigpicture/2020/03/30/life-during-coronavirus-pandemic/wOmubnlrYaN8m2epe1FAHO/story.html?rss_id=section_rss_full\u0026s_campaign=bg:full:rss:section",
    "description": "Globe staff photographers document the Boston area and beyond during this unprecented time. The gallery is updated weekly throughout the crisis.",
    "author": "",
    "published": "Mon, 30 Mar 2020 22:49:52 +0000",
    "image": "https://cloudfront-us-east-1.images.arcpublishing.com/bostonglobe/A27O6IULEUI6VL32SQ7K27FODM.jpg",
    "source": "https://www.bostonglobe.com/rss/bigpicture",
    "categories": null
  },
  {
    "id": "fa98cce4-4012-43b4-98eb-8629cb95b1b4",
    "title": "I've Been Working on Something",
    "link": "http://strobist.blogspot.com/2024/06/ive-been-working-on-something.html",
    "description": "Hey gang, it’s David. It’s been a while! In 2021, I archived Strobist as a completed project. I can’t honestly say that I’ve missed the breakneck pace of running a solo site. But I’ve definitely missed interacting with so many cool people all of the time. That said, I am still teaching. X-Peditions gives me the twin advantages much smaller class sizes, plus being in Hanoi every fall. And that’s been wonderful. Better yet, my new schedule has given me the breathing room to be able build my current project. Like Strobist, this project is designed for photographers. But unlike this website, it has nothing at all to do with flash. Today I’m introducing my new book, The Traveling Photographer’s Manifesto. It aspires to be for traveling photographers what Strobist always tried to be for lighting photographers. The premise of the book is that your camera can, and should, be much more than just a pricey recording device when you travel. It can also serve as a passport, opening up new connections and possibilities that otherwise might not have happened. Using a photo trip to Southeast Asia as a framework, the book walks through many things that you can do to help this to happen. I have uploaded three documents to help you to know if TTPM might be suited for you: 1. A 5-minute summary: This will quickly give you a feel for the book. 2. A 27-page supplement: Only a small portion of the book, which is unillustrated, is about camera operation. This visual supplement is available for readers who are more visual learners. And it will give you a quick skim of parts 4 and 5. 3. A sample chapter: How to become more comfortable meeting and engaging with people as a photographer. As you'll see from the summary, most of the book is not about camera operation at all. It’s more about the countless little things that working photojournalists do while on assignment that an enthusiast might not think of. These little habits, taken together, can start to form the impression of a photographer being consistently, conspicuously lucky. When in reality, luck had very little to do with it. So, if this is the sort of thing that interests you, I hope you’ll give the book a spin. It is available now, on Amazon.com worldwide. Just as with Strobist, I welcome your feedback from this project as well. My email is listed on the copyright page and elsewhere. And of course, I will read and take to heart every Amazon review. Because my goal is for the project to continue to evolve and improve over time, just as the material on this website did. Thanks for your interest, and for your readership of Strobist. As always, please say hi at any time on Twitter at @Strobist. Cheers, David The Traveling Photographer’s Manifesto (Amazon.com)",
    "author": "David Hobby",
    "published": "Tue, 11 Jun 2024 22:22:00 +0000",
    "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi-W17q9tcAHlutYrIFGWU0YglpFYEfSkjZZWB7RouSVTQJtMvAy9WhRx5n4JMvFjiVVDTJ3P5qMC0Lp1MQ8SPj4ZFsA1RLw5j-6Mo9tBME3hR3nny3H3yn-foRWK-3kVYgYcIcjUFC5K-gQTa7-nMsJ_RgWyoVRxDT6SWAngTK7y7TaDoAEcBi/s400/Lede%20TTPM.JPG",
    "source": "http://feeds.feedburner.com/blogspot/WOBq",
    "categories": null
  },
  {
    "id": "3e0aa036-66aa-46be-a363-42614678a56d",
    "title": "So Long (for Now!) and Thank You.",
    "link": "http://strobist.blogspot.com/2021/07/so-long-for-now-and-thank-you.html",
    "description": "In 2006 I started a lighting blog while working full-time as a staffer at The Baltimore Sun. By early 2007, it became obvious that I didn't have the personal resources to give 100% to both Strobist and my job at the newspaper. That’s exactly the position I find myself in today. For the past year I have been working on a new project. It is photography-based, and will be as unique to the photo space as Strobist was back in 2006. But, as I found with Strobist in 2007, this project will require all of my focus. So I am shifting Strobist into archive mode to allow myself the time and mental space to do that. If I had more available brain cells/hours in the day, I would be happy to do both. Alas, I do not. So I am choosing the one I think can make a bigger difference to photographers. When the new project launches, I’ll do my best to make sure you hear about it. So please, stay tuned! For those of you who are interested in our in-person lighting workshops and/or our X-Peditions trips (both of which are currently on pause during the pandemic) we absolutely are planning to restart them once the coast is clear. Please make sure you are on the relevant notification list(s) by clicking through to the links above. Finally, I want to take this moment to say thank you to the countless people I have met, and new friendships made, as a result of publishing Strobist over the past 15 years. It is impossible to express how much you all have enriched my life, and that of my family. Thank you so much, David",
    "author": "David Hobby",
    "published": "Thu, 01 Jul 2021 15:26:00 +0000",
    "image": "http://farm1.static.flickr.com/171/447819702_778a34024c.jpg",
    "source": "http://feeds.feedburner.com/blogspot/WOBq",
    "categories": null
  },
  {
    "id": "f59c4bc8-74ea-4f93-90de-d227f0711100",
    "title": "Canon RF 16-28mm F2.8 IS STM Patent Discussion",
    "link": "https://www.canonrumors.com/canon-rf-16-28mm-f2-8-is-stm-patent-discussion/",
    "description": "I missed this patent. In my defence, I looked at it and went.. meh, Canon doing ANOTHER Ultrawide? At the time, this was before the now likely trinity of f/2.8’s IS STMs were forming, so I can be forgiven (maybe) for that judgment call. After some looking around because I did remember the RF 16-28mm [...] The post Canon RF 16-28mm F2.8 IS STM Patent Discussion appeared first on Canon Rumors.",
    "author": "Richard",
    "published": "Fri, 24 Jan 2025 10:34:50 +0000",
    "image": "",
    "source": "https://www.canonrumors.com/feed/",
    "categories": [
      "Canon Patents",
      "RF 16-28 f/2.8 IS STM",
      "spotlight"
    ]
  },
  {
    "id": "19c0d1c6-faff-4c28-8bfb-d9798e05c30b",
    "title": "Sony’s ZV-E10 the most popular Camera in Japan in 2024",
    "link": "https://www.canonrumors.com/sonys-zv-e10-the-most-popular-camera-in-japan-in-2024/",
    "description": "BCN Retail dove into their annual results a bit more and summarized what the top-selling mirrorless cameras were of 2024. BCN Retail reports on the actual sales data of around 50-60% of all retail stores in Japan, so it’s an excellent look at the Japanese market, which purchases the most cameras of any one country [...] The post Sony’s ZV-E10 the most popular Camera in Japan in 2024 appeared first on Canon Rumors.",
    "author": "Richard",
    "published": "Fri, 24 Jan 2025 09:28:54 +0000",
    "image": "",
    "source": "https://www.canonrumors.com/feed/",
    "categories": [
      "Industry News",
      "R10",
      "R50",
      "Sony ZV-E10"
    ]
  },
  {
    "id": "47775152-f0e2-433d-b8fd-62758ab4a7d8",
    "title": "Emotional Landscapes, Humans in Nature \u0026 Emus!",
    "link": "https://www.lightstalking.com/emotional-landscapes-humans-in-nature-emus/",
    "description": "In perspective with nature, our existence becomes meaningless for sure. So tiny we are, that even our local landscapes are vast enough for us to feel overwhelmingly small. Truly independent from ourselves, earth's scenery is filled with great opportunities for some spectacular tripod-friendly photography. And never expect them to present to you in the most […] The post Emotional Landscapes, Humans in Nature \u0026 Emus! appeared first on Light Stalking.",
    "author": "Federico Alegria",
    "published": "Thu, 23 Jan 2025 00:50:46 +0000",
    "image": "",
    "source": "https://www.lightstalking.com/feed/",
    "categories": [
      "Cool Photos \u0026 Photographers"
    ]
  },
  {
    "id": "c4612164-b9e4-4c9d-8126-e82d99c94a3c",
    "title": "Embracing Bad Weather Photography for Awesome Images",
    "link": "https://www.lightstalking.com/bad-weather-photography/",
    "description": "When you start reading about bad weather in photography, the articles or the videos you're watching invariably talk mainly about protecting your gear. And while that is very important because you don't want to ruin thousands of dollars worth of expensive gear, it also misses the main point of photographing in bad weather. And that […] The post Embracing Bad Weather Photography for Awesome Images appeared first on Light Stalking.",
    "author": "",
    "published": "Thu, 16 Jan 2025 13:00:00 +0000",
    "image": "",
    "source": "https://www.lightstalking.com/feed/",
    "categories": [
      "Landscape Photography"
    ]
  },
  {
    "id": "b83ec366-f827-4f32-84e3-ed73fe016682",
    "title": "This is the Only Photo of the Concorde Flying at Supersonic Speed",
    "link": "https://petapixel.com/2025/01/25/photo-concorde-supersonic-speed-mach-2/",
    "description": "The Concorde was the fastest commercial airliner in history with an astonishing cruising speed of roughly 1,354 miles per hour otherwise known as Mach 2.04. [Read More]",
    "author": "Matt Growcoot",
    "published": "Sat, 25 Jan 2025 14:00:44 +0000",
    "image": "https://petapixel.com/assets/uploads/2025/01/Concorde-2.jpg",
    "source": "https://petapixel.com/feed/",
    "categories": [
      "Features",
      "airplane",
      "concorde",
      "speedofsound",
      "supersonic",
      "supersonicjet"
    ]
  },
  {
    "id": "148aedb0-12a3-4b29-a008-2b7414031a5f",
    "title": "PSA: Update Your OWC Atlas CFexpress Type A Memory Card Now",
    "link": "https://petapixel.com/2025/01/24/psa-update-your-owc-atlas-cfexpress-type-a-memory-card-now/",
    "description": "The OWC Atlas CFexpress Type A memory card is one of PetaPixel's favorites, but OWC has found an issue with the card, and customers are advised to update their card's firmware as soon as possible. The good news is that the data on the card is safe. [Read More]",
    "author": "Jeremy Gray",
    "published": "Fri, 24 Jan 2025 20:55:10 +0000",
    "image": "https://petapixel.com/assets/uploads/2024/04/owc-atlas-pro-cfexprss-type-a-featured.jpg",
    "source": "https://petapixel.com/feed/",
    "categories": [
      "Equipment",
      "News",
      "Technology",
      "cfexpresstypea",
      "memorycard",
      "owc",
      "owcatlas",
      "owcatlascfexpresstypea",
      "psa"
    ]
  },
  {
    "id": "7ce5c263-1a86-4a15-988a-2a45d7ea4578",
    "title": "Sunset on the Pixel",
    "link": "https://stuckincustoms.com/2025/01/24/sunset-on-the-pixel/",
    "description": "Here’s another shot from my review of the Pixel 9 Pro Fold. Great dynamic range on this thing! The post Sunset on the Pixel appeared first on Stuck in Customs.",
    "author": "Stu Davidson",
    "published": "Fri, 24 Jan 2025 19:47:51 +0000",
    "image": "https://i0.wp.com/stuckincustoms.smugmug.com/photos/i-f96wHp2/0/LqMtg22Zg3hMxSzgjB4dgHnvKmpWNFHrhWqc6pztK/900x520/i-f96wHp2-900x520.jpg?resize=900%2C520\u0026ssl=1",
    "source": "https://stuckincustoms.com/feed/",
    "categories": [
      "Camera Gear",
      "Google Pixel 9 Pro Fold",
      "Scotland",
      "Travel",
      "United Kingdom",
      "landscape",
      "mobile phone",
      "mobile photography"
    ]
  },
  {
    "id": "28ea798a-f20c-4d17-a594-d5c208051e6a",
    "title": "The Next Gallery",
    "link": "https://stuckincustoms.com/2025/01/20/the-next-gallery-2/",
    "description": "More from my AI Insta over at @trairatcliff The post The Next Gallery appeared first on Stuck in Customs.",
    "author": "Stu Davidson",
    "published": "Mon, 20 Jan 2025 22:49:50 +0000",
    "image": "https://i0.wp.com/stuckincustoms.com/wp-content/uploads/2025/01/Trey-Ratcliff-New-AI-batch-5-003-678x900.png?ssl=1",
    "source": "https://stuckincustoms.com/feed/",
    "categories": [
      "artificial intelligence",
      "AI"
    ]
  }
]
