{
  "id": "177c0d8f-c725-483e-8012-c781fcb2527e",
  "title": "Inside A Charming 1960s Cottage Stay In Basin View, NSW",
  "link": "https://thedesignfiles.wpenginepowered.com/2025/01/stays-nellie-the-sugar-shack/",
  "description": "A stay inside this retro holiday home is like stepping back in time. Bronwyn and Bruce Drayton are only the third owners of this charming cottage, affectionately named ‘The Sugar Shack’. They purchased it in 2018 and worked to preserve its original design. Steeped in nostalgia, this ‘mini beachcomber’ is an idyllic lakeside retreat, now available for bookings.",
  "author": "The Design Files",
  "published": "Tue, 14 Jan 2025 03:00:29 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 2029,
  "excerpt": "A stay inside this retro holiday home is like stepping back in time. See more of The Sugar Shack in Basin View here.",
  "siteName": "",
  "favicon": "",
  "text": "When Bronwyn Drayton first laid eyes on this 1960s cottage in Basin View, NSW, she knew its prevailing charm was to be cherished. At the time, her childhood friend had just bought it from its original owners, and planned to knock it down and build a new home on the site. ‘[It] horrified me,’ says Bronwyn. ‘I begged her to sell it to me if she didn’t go through with her rebuilding plans. I was so in love with it.’ To her delight, in 2018 her friend decided to sell the still untouched home and the charming shack was Bronwyns to revitalise. ‘My vision was always to preserve its originality, while giving it a fresh coat of paint and a lot of love,’ she says. ‘The Sugar Shack’s’ original structure and ‘quirky layout’ remains unchanged — as do the original orange doors — whilst the interior has been refreshed with a lick of white paint. Bronwyn’s husband Bruce also built a set of bunk beds in the sunroom for the grandkids, and they converted the back garage into extra accommodation for family and friends. Two years after they bought their ‘mini Beachcomber’, Bronwyn found a caravan, called Nellie, for sale in Bundeena. ‘I fell in love with her cute 60s style… and we thought she would perfectly complement The Sugar Shack, while providing extra accommodation.’ She spent the next three months bringing Nellie back to life. ‘We always planned to Airbnb the property to help with costs,’ explains Bronwyn. ‘But we ended up having too much fun with family and friends on weekends and holidays so those plans were put on hold.’ Now, however, the adorable shack is available for bookings — much to the disappointment of Bronwyn and Bruce’s family and friends. ‘In a throwaway world where old and original are often undervalued, I am incredibly proud of preserving this unique little property. I’ve maintained the nostalgic charm for not only our grandchildren, but for others to enjoy for hopefully many years to come. ‘It’s always been my dream to set it up for others,’ says Bronwyn. Book a stay at The Sugar Shack here.",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2025/01/Nellie-tdf-vertithub4-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003eWhen Bronwyn Drayton first laid eyes on this 1960s cottage in Basin View, NSW, she knew its prevailing charm was to be cherished.\u003c/h3\u003e\n\u003cp\u003eAt the time, her childhood friend had just bought it from its original owners, and planned to knock it down and build a new home on the site.\u003c/p\u003e\n\u003cp\u003e‘[It] horrified me,’ says Bronwyn. ‘I begged her to sell it to me if she didn’t go through with her rebuilding plans. I was so in love with it.’\u003c/p\u003e\n\u003cp\u003eTo her delight, in 2018 her friend decided to sell the still untouched home and the charming shack was Bronwyns to revitalise.\u003c/p\u003e\n\u003cp\u003e‘My vision was always to preserve its originality, while giving it a fresh coat of paint and a lot of love,’ she says.\u003c/p\u003e\n\u003cp\u003e‘The Sugar Shack’s’ original structure and ‘quirky layout’ remains unchanged — as do the original orange doors — whilst the interior has been refreshed with a lick of white paint.\u003c/p\u003e\n\u003cp\u003eBronwyn’s husband Bruce also built a set of bunk beds in the sunroom for the grandkids, and they converted the back garage into extra accommodation for family and friends.\u003c/p\u003e\n\u003cp\u003eTwo years after they bought their ‘mini Beachcomber’, Bronwyn found a caravan, called Nellie, for sale in Bundeena.\u003c/p\u003e\n\u003cp\u003e‘I fell in love with her cute 60s style… and we thought she would perfectly complement The Sugar Shack, while providing extra accommodation.’\u003c/p\u003e\n\u003cp\u003eShe spent the next three months bringing Nellie back to life.\u003c/p\u003e\n\u003cp\u003e‘We always planned to Airbnb the property to help with costs,’ explains Bronwyn. ‘But we ended up having too much fun with family and friends on weekends and holidays so those plans were put on hold.’\u003c/p\u003e\n\u003cp\u003eNow, however, the adorable shack is available for bookings — much to the disappointment of Bronwyn and Bruce’s family and friends.\u003c/p\u003e\n\u003cp\u003e‘In a throwaway world where old and original are often undervalued, I am incredibly proud of preserving this unique little property. I’ve maintained the nostalgic charm for not only our grandchildren, but for others to enjoy for hopefully many years to come.\u003c/p\u003e\n\u003cp\u003e‘It’s always been my dream to set it up for others,’ says Bronwyn.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.nellieandthesugarshack.com/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cem\u003e\u003cstrong\u003eBook a stay at The Sugar Shack here.\u003c/strong\u003e\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
