{
  "id": "17b9830d-8bdb-45cf-83d0-90cb1bc82017",
  "title": "3D scans of athenian facades shape porcelain objects by yiannis ghikas and myran",
  "link": "https://www.designboom.com/design/3d-scans-athenian-facades-porcelain-objects-yiannis-ghikas-myran-07-12-2025/",
  "description": "the designer scans artificiel patterns from buildings in kypseli and kolonaki using photogrammetry and 3d modeling. The post 3D scans of athenian facades shape porcelain objects by yiannis ghikas and myran appeared first on designboom | architecture \u0026 design magazine.",
  "author": "yiannis ghikas",
  "published": "Sat, 12 Jul 2025 10:50:39 +0000",
  "source": "https://www.designboom.com/design/feed",
  "categories": [
    "design",
    "readers",
    "3D scanning",
    "ceramic art and design",
    "coffee cups and mugs",
    "yiannis ghikas"
  ],
  "byline": "yiannis ghikas",
  "length": 2190,
  "excerpt": "yiannis ghikas, in collaboration with myran, introduces artificiel, a series of porcelain objects based on the facades of athenian buildings.",
  "siteName": "designboom | architecture \u0026 design magazine",
  "favicon": "",
  "text": "yiannis ghikas turns building textures into porcelain objectsProduct designer Yiannis Ghikas, in collaboration with Myran Scandinavian Design, introduces Artificiel, a series of porcelain objects based on the sculpted cement surfaces found on mid-20th-century apartment buildings in Athens. The project documents and translates the city’s vanishing artificiel facades, once crafted by hand and now threatened by new insulation regulations, into tangible domestic forms, like cups and bowls, using digital scanning and traditional casting techniques.To preserve this overlooked layer of the city’s material history, the designer scans three types of surviving artificiel patterns, chtení (fine), thrapína (medium), and koutaliá (coarse), from buildings in Kypseli and Kolonaki neighborhoods using photogrammetry and 3D modeling. These digital textures are then used to produce molds for porcelain objects, which were cast and manufactured in Portugal.100ml, 180ml and 300ml cups | all images by Giorgos Vitsaropoulos, unless stated otherwiserelocating the fading architectural skin of athensArtificiel refers to a colloquial term for a finishing method that gave many Athenian ‘polykatoikia’ buildings their textured cement exteriors. These surfaces were shaped manually by skilled construction workers known as ‘pelekanoi’ between the 1930s and 1970s. Though once a defining feature of Athenian urban architecture, they are now being covered or destroyed as external thermal insulation becomes the new norm under contemporary building standards.Through Artificiel, Athens-based Yiannis Ghikas together with Myran offer a way to engage with the architectural skin of Athens in a moment when it risks being erased. Rather than preserving these surfaces in place, The series relocates these surfaces into a different context, one that is domestic and tactile. It draws attention to a vernacular aesthetic that is often ignored, yet remains central to the city’s visual identity.Yiannis Ghikas collaborates with Myran Scandinavian Design for Artificielthis series is based on the sculpted cement surfaces found on Athens’ mid-20th-century apartment buildingsKoutalia pattern on the espresso cup",
  "image": "https://www.designboom.com/twitterimages/uploads/2025/07/3d-scans-athenian-facades-porcelain-objects-yiannis-ghikas-myran-designboom-1200.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003carticle\u003e\u003ch2\u003eyiannis ghikas turns building textures into porcelain objects\u003c/h2\u003e\u003cp\u003eProduct designer \u003ca href=\"https://www.designboom.com/tag/yiannis-ghikas/\"\u003e\u003cstrong\u003eYiannis Ghikas\u003c/strong\u003e\u003c/a\u003e, in collaboration with Myran Scandinavian Design, introduces Artificiel, a series of \u003ca href=\"https://www.designboom.com/tag/ceramics/\"\u003e\u003cstrong\u003eporcelain\u003c/strong\u003e\u003c/a\u003e objects based on the sculpted cement surfaces found on mid-20th-century apartment buildings in Athens. The project documents and translates the city’s vanishing artificiel \u003ca href=\"https://www.designboom.com/tag/facades/\"\u003e\u003cstrong\u003efacades\u003c/strong\u003e\u003c/a\u003e, once crafted by hand and now threatened by new insulation regulations, into tangible domestic forms, like \u003ca href=\"https://www.designboom.com/tag/coffee-cups-and-mugs/\"\u003e\u003cstrong\u003ecups\u003c/strong\u003e\u003c/a\u003e and bowls, using digital scanning and traditional casting techniques.\u003c/p\u003e\u003cp\u003eTo preserve this overlooked layer of the city’s material history, the designer scans three types of surviving artificiel patterns, chtení (fine), thrapína (medium), and koutaliá (coarse), from buildings in Kypseli and Kolonaki neighborhoods using \u003ca href=\"https://www.designboom.com/tag/3d-scanning/\"\u003e\u003cstrong\u003ephotogrammetry\u003c/strong\u003e\u003c/a\u003e and 3D modeling. These digital textures are then used to produce molds for porcelain objects, which were cast and manufactured in Portugal.\u003c/p\u003e\u003cp\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" alt=\"artificiel athens 8\" width=\"818\" height=\"446\" data-src=\"https://static.designboom.com/wp-content/dbsub/95160/2025-03-14/artificiel-athens-8-67d3c461c1447.jpg\" loading=\"lazy\" src=\"https://static.designboom.com/wp-content/dbsub/95160/2025-03-14/artificiel-athens-8-67d3c461c1447.jpg\"/\u003e\u003cbr/\u003e100ml, 180ml and 300ml cups | all images by Giorgos Vitsaropoulos, unless stated otherwise\u003c/p\u003e\u003ch2\u003erelocating the fading architectural skin of athens\u003c/h2\u003e\u003cp\u003eArtificiel refers to a colloquial term for a finishing method that gave many Athenian ‘polykatoikia’ buildings their textured cement exteriors. These surfaces were shaped manually by skilled construction workers known as ‘pelekanoi’ between the 1930s and 1970s. Though once a defining feature of Athenian urban architecture, they are now being covered or destroyed as external thermal insulation becomes the new norm under contemporary building standards.\u003c/p\u003e\u003cp\u003eThrough Artificiel, \u003ca href=\"http://www.yiannisghikas.com/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eAthens-based\u003c/strong\u003e\u003c/a\u003e Yiannis Ghikas together with Myran offer a way to engage with the architectural skin of Athens in a moment when it risks being erased. Rather than preserving these surfaces in place, The series relocates these surfaces into a different context, one that is domestic and tactile. It draws attention to a vernacular aesthetic that is often ignored, yet remains central to the city’s visual identity.\u003c/p\u003e\u003cp\u003e\u003cimg decoding=\"async\" alt=\"artificiel athens 9\" width=\"818\" height=\"566\" data-src=\"https://static.designboom.com/wp-content/dbsub/95160/2025-03-14/artificiel-athens-9-67d3c461c1486.jpg\" loading=\"lazy\" src=\"https://static.designboom.com/wp-content/dbsub/95160/2025-03-14/artificiel-athens-9-67d3c461c1486.jpg\"/\u003e\u003cbr/\u003eYiannis Ghikas collaborates with Myran Scandinavian Design for Artificiel\u003c/p\u003e\u003cp\u003e\u003cimg decoding=\"async\" alt=\"artificiel athens 6\" width=\"818\" height=\"1227\" data-src=\"https://static.designboom.com/wp-content/dbsub/95160/2025-03-14/artificiel-athens-6-67d3c461c13af.jpg\" loading=\"lazy\" src=\"https://static.designboom.com/wp-content/dbsub/95160/2025-03-14/artificiel-athens-6-67d3c461c13af.jpg\"/\u003e\u003cbr/\u003ethis series is based on the sculpted cement surfaces found on Athens’ mid-20th-century apartment buildings\u003c/p\u003e\u003cp\u003e\u003cimg decoding=\"async\" alt=\"artificiel athens 2\" width=\"818\" height=\"818\" data-src=\"https://static.designboom.com/wp-content/dbsub/95160/2025-03-14/artificiel-athens-2-67d3c461c12ab.jpg\" loading=\"lazy\" src=\"https://static.designboom.com/wp-content/dbsub/95160/2025-03-14/artificiel-athens-2-67d3c461c12ab.jpg\"/\u003e\u003cbr/\u003eKoutalia pattern on the espresso cup\u003c/p\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-07-12T10:50:39Z",
  "modifiedTime": null
}
