{
  "id": "21ebb006-6f85-494a-8e90-76839686d0cf",
  "title": "TDF Collect Presents: ‘Surely, This Is The Place They Sing About’ by Bobby Bowers",
  "link": "https://thedesignfiles.wpenginepowered.com/2024/10/art-tdf-collect-bobby-bowers-surely-this-is-the-place-they-sing-about/",
  "description": "Bobby Bowers’ paintings are a good reminder to look up and appreciate the beauty in everyday things. It’s something we’ve always been drawn to in his work. We’re thrilled to present Bobby’s captivating pieces in our last TDF Collect exhibition for the year, ‘Surely, this is the place they sing about’ — a verdant show tinged with nostalgia. Pre-sales are officially open from today! Find the full catalogue here, and email art@thedesignfiles.net to purchase. Otherwise, pop into our TDF Collect gallery from November 1, to see this beautiful exhibition for yourself!",
  "author": "The Design Files",
  "published": "Sun, 13 Oct 2024 19:00:44 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 2421,
  "excerpt": "Pre-sales for our last exhibition of the year, 'Surely, this must be the place they sing about' by Bobby Bowers, are open now!",
  "siteName": "",
  "favicon": "",
  "text": "Bobby Bowers paints exactly how he sees the world — the intensity of light, texture, pollen, scent and even sound — it’s evocative, verdant and undeniably nostalgic. In fact, the title of his TDF Collect show — ‘Surely, this is the place they sing about’ — is a reference to this rose-tinted outlook. ‘I do a lot of walking and looking around different suburbs, just taking it all in and then developing paintings over months of work and contemplation,’ he says. His paintings are a measure of time. This exhibition in particular marks the shift in seasons between summer and autumn, bringing with it the addition of ‘surprisingly vibrant’ pinks and yellows. Bobby uses acrylic paints in his work. ‘I enjoy its ability to show light and shadow in the same way I perceive it,’ he explains. ‘The best example of this is seen in the foliage of my landscape paintings, which are exaggerated to strengthen the impression of that first glance while out on a walk.’ He scratches and layers paint back and forth to capture every detail; the brightening, sharpening, softening, shifting  — and in some cases even disappearing — light according to the season and the time of day. It’s impossible to look at the 11 pieces he’s created for this exhibition and not be reminded of a past or present home, a friend’s neighbourhood or even a street corner passed on the daily commute. Even the names of the pieces themselves — ‘What Night Is Bin Night?’, for example — are laced with familiarity and humour. Perhaps the best way to sum up the show is hidden in another of the work’s names; ‘Ordinary Magic’. Bobby has found the extraordinary in the ordinary. ‘Surely, this is the place they sing about’ officially opens on October 31 (if you’re in Melbourne, please join us for the opening at 5.30!), but in the meantime pre-sales are open from today! See the full catalogue of works here, and email art@thedesignfiles.net to purchase. Surely, this is the place they sing about TDF Collect 14 Little Oxford Street Collingwood, VIC Opening night: Thursday October 31, 5.30pm – 7.30pm Exhibition dates: Friday November 1, 10am – 4pm Saturday November 2, 10am – 4pm Sunday November 3, CLOSED Monday November 4, 10am – 4pm Tuesday November 5, 10am – 4pm For all artwork sales and enquiries please contact art@thedesignfiles.net and we’ll get back to you ASAP.  TDF Collect exhibitions are generously supported by Dulux, Bodriggy, and TINA.",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2024/10/bowers-tdf-collect6-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.instagram.com/bobby___bowers/\" target=\"_blank\" rel=\"noopener\"\u003eBobby Bowers\u003c/a\u003e paints exactly how he sees the world — the intensity of light, texture, pollen, scent and even sound — it’s evocative, verdant and undeniably nostalgic.\u003c/h3\u003e\n\u003cp\u003eIn fact, the title of his \u003ca href=\"https://tdfcollect.com/\" target=\"_blank\" rel=\"noopener\"\u003eTDF Collect\u003c/a\u003e show — ‘Surely, this is the place they sing about’ — is a reference to this rose-tinted outlook.\u003c/p\u003e\n\u003cp\u003e‘I do a lot of walking and looking around different suburbs, just taking it all in and then developing paintings over months of work and contemplation,’ he says.\u003c/p\u003e\n\u003cp\u003eHis paintings are a measure of time. This exhibition in particular marks the shift in seasons between summer and autumn, bringing with it the addition of ‘surprisingly vibrant’ pinks and yellows.\u003c/p\u003e\n\u003cp\u003eBobby uses acrylic paints in his work. ‘I enjoy its ability to show light and shadow in the same way I perceive it,’ he explains. ‘The best example of this is seen in the foliage of my landscape paintings, which are exaggerated to strengthen the impression of that first glance while out on a walk.’\u003c/p\u003e\n\u003cp\u003eHe scratches and layers paint back and forth to capture every detail; the brightening, sharpening, softening, shifting  — and in some cases even disappearing — light according to the season and the time of day.\u003c/p\u003e\n\u003cp\u003eIt’s impossible to look at the 11 pieces he’s created for this exhibition and not be reminded of a past or present home, a friend’s neighbourhood or even a street corner passed on the daily commute.\u003c/p\u003e\n\u003cp\u003eEven the names of the pieces themselves — ‘\u003cem\u003eWhat Night Is Bin Night?’, \u003c/em\u003e for example — are laced with familiarity and humour. Perhaps the best way to sum up the show is hidden in another of the work’s names; ‘\u003cem\u003eOrdinary Magic’. \u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eBobby has found the extraordinary in the ordinary.\u003c/p\u003e\n\u003cp\u003e‘Surely, this is the place they sing about’ officially opens on October 31 (if you’re in Melbourne, please join us for the opening at 5.30!), but in the meantime pre-sales are open from today!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://tdfcollect.com/\" target=\"_blank\" rel=\"noopener\"\u003eSee the full catalogue of works here\u003c/a\u003e, and email \u003ca href=\"mailto:art@thedesignfiles.net\"\u003eart@thedesignfiles.net\u003c/a\u003e to purchase.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003e\u003ci\u003eSurely, this is the place they sing about\u003c/i\u003e\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTDF Collect\u003cbr/\u003e\n14 Little Oxford Street\u003cbr/\u003e\nCollingwood, VIC\u003c/p\u003e\n\u003cp\u003e\u003cb\u003eOpening night:\u003cbr/\u003e\n\u003c/b\u003e\u003cb\u003e\u003c/b\u003eThursday October 31, 5.30pm – 7.30pm\u003c/p\u003e\n\u003cp\u003e\u003cb\u003eExhibition dates:\u003cbr/\u003e\n\u003c/b\u003e\u003cb\u003e\u003c/b\u003eFriday November 1, 10am – 4pm\u003cbr/\u003e\nSaturday November 2, 10am – 4pm\u003cbr/\u003e\nSunday November 3, CLOSED\u003cbr/\u003e\nMonday November 4, 10am – 4pm\u003cbr/\u003e\nTuesday November 5, 10am – 4pm\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eFor all artwork sales and enquiries please contact art@thedesignfiles.net and we’ll get back to you ASAP. \u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eTDF Collect exhibitions are generously supported by \u003c/i\u003e\u003ca href=\"https://www.dulux.com.au/\"\u003e\u003ci\u003eDulux\u003c/i\u003e\u003c/a\u003e\u003ci\u003e, \u003c/i\u003e\u003ca href=\"https://www.bodriggy.beer/\"\u003e\u003ci\u003eBodriggy\u003c/i\u003e\u003c/a\u003e\u003ci\u003e, \u003c/i\u003e\u003ci\u003eand \u003c/i\u003e\u003ca href=\"https://tinadrinks.com/\"\u003e\u003ci\u003eTINA\u003c/i\u003e\u003c/a\u003e\u003ci\u003e.\u003c/i\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
