{
  "id": "2307fd57-664a-4262-88b8-d4a1a6c14413",
  "title": "Simplicity sets Osaka's \"first modern ryokan\" inside Nikken Sekkei high-rise",
  "link": "https://www.dezeen.com/2024/10/30/four-seasons-osaka-gensui-floor-simplicity/",
  "description": "Design studio Simplicity used a palette of natural materials including wood, stone and tatami to evoke the look and feel of a traditional Japanese inn when creating the ryokan floor of the Four Seasons Hotel in Osaka. The hotel is located in the Dojima business district of Osaka, set within the multi-use One Dojima high-rise The post Simplicity sets Osaka's \"first modern ryokan\" inside Nikken Sekkei high-rise appeared first on Dezeen.",
  "author": "Alyn Griffiths",
  "published": "Wed, 30 Oct 2024 09:00:03 +0000",
  "source": "https://www.dezeen.com/interiors/feed/",
  "categories": [
    "all",
    "Interiors",
    "Hotels",
    "Simplicity",
    "Four Seasons Hotels",
    "Japan",
    "Osaka"
  ],
  "byline": "Alyn Griffiths",
  "length": 8345,
  "excerpt": "Design studio Simplicity used a palette of natural materials including wood, stone and tatami to evoke the look and feel of a traditional Japanese inn when creating the ryokan floor of the Four Seasons Hotel in Osaka.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Design studio Simplicity used a palette of natural materials including wood, stone and tatami to evoke the look and feel of a traditional Japanese inn when creating the ryokan floor of the Four Seasons Hotel in Osaka. The hotel is located in the Dojima business district of Osaka, set within the multi-use One Dojima high-rise by Japanese architecture firm Nikken Sekkei. The ryokan floor of the Four Seasons Osaka (top image) is accessed via a separate check-in counter (above)Across 12 of the building's 49 storeys, the Four Seasons houses 175 guest rooms, a spa and six different restaurants and bars. Simplicity was responsible for transforming the 28th floor of the hotel into the city's \"first modern ryokan experience\" – referencing Japanese inns famous for their elaborate omotenashi hospitality and traditional features such as tatami rooms, futon beds and communal baths. The Gensui floor welcomes guests with a darkened elevator landingSimplicity merged these historic elements with contemporary conveniences to recreate \"the harmonious balance of tradition and modern innovation that defines Osaka\". The studio designed the interiors for the entire floor including its 21 tatami rooms and suites – accessed via a separate check-in counter – as well as circulation areas and a dedicated tea lounge, resulting in a holistic scheme. The rooms include traditional ryokan features such as futon-style bedsDark hues enshroud the hallways and the elevator landing of the 28th floor, also known as the Gensui floor based on the Japanese concept of \"gen\", which refers to the different shades of black found in the deepest darkness. This moody colour palette offers a stark contrast with the hotel's lighter-toned Western-style rooms and common areas, courtesy of Japanese firms Curiosity and Design Studio Spin. \"As the elevator doors slide open, guests find themselves in an unexpected realm that looks and feels entirely different from the rest of the hotel,\" Simplicity told Dezeen. Guests can sit on low-slung chairs or straight on the tatami floorsSimplicity's ryokan-style guest rooms feature a classic doma entrance area where guests can remove their shoes before stepping onto the rush-grass tatami floors. \"Tatami mats hold a vital place in Japanese life and have traditionally been used for everyday activities like dining, working and sleeping,\" the designers said. \"We wanted international guests to experience this beautiful facet of our culture as authentically as possible, without having to give up modern comforts.\" Simplicity designed all of the furniture in the rooms, including low-slung chairs that enable guests to sit closer to the ground. The circular shape of the chairs also allows for sitting cross-legged. Other authentic Japanese details found in the rooms include futon-style platform beds, sliding doors, washi paper headboards and bamboo sudare blinds. A palette of natural materials was chosen to enhance the comfortable feel of the spaces and ensure the various surfaces improve with age and use. Bathrooms are finished in the same moody colour palette as the hallwaysMuch of the bespoke joinery features Simplicity's signature curved lines and rounded corners. Tables with angled edges make movement around them more straightforward, while tatami-inspired benches at the entrance to each room can be used for storing luggage. Elsewhere on the Genusi floor, Simplicity designed the interiors of the Sabo tea lounge, which serves breakfast bento boxes and a selection of Japanese beverages. The interior features custom-made furniture designed to enhance the tea-drinking experience and dark hexagonal tiles that represent the \"gen\" concept. Simplicity also extended these darker tones into the Sabo tea loungeSimplicity was also responsible for designing the hotel's spa area on the 36th floor, where heated ofuro soaking tubs fulfil the same function as the communal baths found in many ryokans. The Osaka hotel is the fourth Four Seasons Hotel in Japan as the company aims to capitalise on Japan's surging economy and the upcoming Expo 2025 Osaka, which will feature national pavilions by architecture studios including Nikken Sekkei, Foster + Partners and Kengo Kuma \u0026 Associates. Ofuro soaking tubs feature in the spa at Four Seasons OsakaDesigner Shinichiro Ogata founded Tokyo-based studio Simplicity in 1998, applying his contemporary take on traditional Japanese design philosophies to projects ranging from architecture and interiors to product, graphic and packaging design. In his role as a creative director, Ogata has overseen the interior and spatial design for brands including Hyatt Hotels and skincare brand Aesop, including a store in Kyoto featuring screens made from draped black fabric. The photography is by Ken Seet.  Subscribe to our newsletters Your email address New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2024/10/sq-four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_0-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2133755\" data-article-id=\"2133755\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/hero-four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_0.jpg\" id=\"preload-hero\"\u003e\n\t\t\n\n\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2024/10/hero-four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_0-852x479.jpg\" alt=\"Tatami seating area on Gensui floor of Four Seasons Osaka hotel\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2024/10/hero-four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_0-852x479.jpg 1x, https://static.dezeen.com/uploads/2024/10/hero-four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_0-1704x959.jpg 2x\" data-pin-nopin=\"true\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/10/hero-four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_0-852x479.jpg\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eDesign studio \u003ca href=\"https://www.dezeen.com/tag/simplicity/\"\u003eSimplicity\u003c/a\u003e used a palette of natural materials including wood, stone and tatami to evoke the look and feel of a traditional Japanese inn when creating the ryokan floor of the \u003ca href=\"https://www.dezeen.com/tag/four-seasons-hotels/\"\u003eFour Seasons Hotel\u003c/a\u003e in \u003ca href=\"https://www.dezeen.com/tag/osaka/\"\u003eOsaka\u003c/a\u003e.\u003cspan id=\"more-2133755\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe hotel is located in the Dojima business district of Osaka, set within the multi-use \u003ca href=\"https://www.one-dojima.com/\"\u003eOne Dojima\u003c/a\u003e high-rise by Japanese architecture firm \u003ca href=\"https://www.dezeen.com/tag/nikken-sekkei/\"\u003eNikken Sekkei\u003c/a\u003e.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2135658\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_5.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_5-852x568.jpg\" alt=\"Lobby of Four Seasons Osaka hotel\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_5-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_5-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_5-852x568.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2135658\"\u003eThe ryokan floor of the Four Seasons Osaka (top image) is accessed via a separate check-in counter (above)\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eAcross 12 of the building\u0026#39;s 49 storeys, the Four Seasons houses 175 guest rooms, a spa and six different restaurants and bars.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://simplicity.co.jp/\"\u003eSimplicity\u003c/a\u003e was responsible for transforming the 28th floor of the hotel into the city\u0026#39;s \u0026#34;first modern ryokan experience\u0026#34; – referencing Japanese inns famous for their elaborate \u003ca href=\"https://www.japan.travel/en/au/experience/culture/omotenashi/\"\u003eomotenashi hospitality\u003c/a\u003e and traditional features such as tatami rooms, futon beds and communal baths.\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2135664\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_11.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_11-852x568.jpg\" alt=\"Darkened hallway in a hotel designed by Simplicity\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_11-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_11-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_11-852x568.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2135664\"\u003eThe Gensui floor welcomes guests with a darkened elevator landing\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eSimplicity merged these historic elements with contemporary conveniences to recreate \u0026#34;the harmonious balance of tradition and modern innovation that defines Osaka\u0026#34;.\u003c/p\u003e\n\n\n\u003cp\u003eThe studio designed the interiors for the entire floor including its 21 tatami rooms and suites – accessed via a separate check-in counter – as well as circulation areas and a dedicated tea lounge, resulting in a holistic scheme.\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2135663\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_10.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_10-852x568.jpg\" alt=\"Tatami seating area and bed on Gensui floor of Four Seasons Osaka hotel\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_10-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_10-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_10-852x568.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2135663\"\u003eThe rooms include traditional ryokan features such as futon-style beds\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eDark hues enshroud the hallways and the elevator landing of the 28th floor, also known as the Gensui floor based on the Japanese concept of \u0026#34;gen\u0026#34;, which refers to the different shades of black found in the deepest darkness.\u003c/p\u003e\n\u003cp\u003eThis moody colour palette offers a stark contrast with the hotel\u0026#39;s lighter-toned Western-style rooms and common areas, courtesy of Japanese firms \u003ca href=\"https://curiosity.jp/\"\u003eCuriosity\u003c/a\u003e and \u003ca href=\"http://www.ds-spin.com/\"\u003eDesign Studio Spin\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u0026#34;As the elevator doors slide open, guests find themselves in an unexpected realm that looks and feels entirely different from the rest of the hotel,\u0026#34; Simplicity told Dezeen.\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2135665\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_12.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_12-852x568.jpg\" alt=\"Tatami seating area in a high rise building\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_12-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_12-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_12-852x568.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2135665\"\u003eGuests can sit on low-slung chairs or straight on the tatami floors\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eSimplicity\u0026#39;s ryokan-style guest rooms feature a classic doma entrance area where guests can remove their shoes before stepping onto the rush-grass tatami floors.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Tatami mats hold a vital place in Japanese life and have traditionally been used for everyday activities like dining, working and sleeping,\u0026#34; the designers said.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We wanted international guests to experience this beautiful facet of our culture as authentically as possible, without having to give up modern comforts.\u0026#34;\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003eSimplicity designed all of the furniture in the rooms, including low-slung chairs that enable guests to sit closer to the ground. The circular shape of the chairs also allows for sitting cross-legged.\u003c/p\u003e\n\u003cp\u003eOther authentic Japanese details found in the rooms include futon-style platform beds, sliding doors, washi paper headboards and bamboo sudare blinds.\u003c/p\u003e\n\u003cp\u003eA palette of natural materials was chosen to enhance the comfortable feel of the spaces and ensure the various surfaces improve with age and use.\u003c/p\u003e\n\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-2135661\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_8.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_8-852x568.jpg\" alt=\"Bathroom on Gensui floor of Four Seasons Osaka hotel\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_8-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_8-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_8-852x568.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2135661\"\u003eBathrooms are finished in the same moody colour palette as the hallways\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eMuch of the bespoke joinery features Simplicity\u0026#39;s signature curved lines and rounded corners. Tables with angled edges make movement around them more straightforward, while tatami-inspired benches at the entrance to each room can be used for storing luggage.\u003c/p\u003e\n\u003cp\u003eElsewhere on the Genusi floor, Simplicity designed the interiors of the Sabo tea lounge, which serves breakfast bento boxes and a selection of Japanese beverages.\u003c/p\u003e\n\u003cp\u003eThe interior features custom-made furniture designed to enhance the tea-drinking experience and dark hexagonal tiles that represent the \u0026#34;gen\u0026#34; concept.\u003c/p\u003e\n\u003cfigure id=\"preload-5\" aria-describedby=\"caption-attachment-2135655\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_2.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_2-852x568.jpg\" alt=\"Sabo tea lounge designed by Simplicity\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_2-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_2-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_2-852x568.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2135655\"\u003eSimplicity also extended these darker tones into the Sabo tea lounge\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eSimplicity was also responsible for designing the hotel\u0026#39;s spa area on the 36th floor, where heated ofuro soaking tubs fulfil the same function as the communal baths found in many ryokans.\u003c/p\u003e\n\u003cp\u003eThe Osaka hotel is the fourth Four Seasons Hotel in Japan as the company aims to capitalise on Japan\u0026#39;s surging economy and the upcoming \u003ca href=\"https://www.dezeen.com/tag/osaka-expo-2025/\"\u003eExpo 2025 Osaka\u003c/a\u003e, which will feature \u003ca href=\"https://www.dezeen.com/tag/osaka-expo-2025/\"\u003enational pavilions by architecture studios\u003c/a\u003e including \u003ca href=\"https://www.nikken.co.jp/\"\u003eNikken Sekkei\u003c/a\u003e, \u003ca href=\"https://www.dezeen.com/2023/11/22/foster-partners-saudi-arabia-expo-2025-osaka/\"\u003eFoster + Partners\u003c/a\u003e and \u003ca href=\"https://www.dezeen.com/2024/08/09/kengo-kuma-associates-qatar-pavilion-osaka-expo/\"\u003eKengo Kuma \u0026amp; Associates\u003c/a\u003e.\u003c/p\u003e\n\u003cfigure id=\"preload-6\" aria-describedby=\"caption-attachment-2135660\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_7.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_7-852x568.jpg\" alt=\"Ofuro soaking tub in spa of Four Seasons Osaka hotel\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_7-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_7-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/10/four-seasons-osaka-simplicity-interiors-gensui-floor_dezeen_2364_col_7-852x568.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2135660\"\u003eOfuro soaking tubs feature in the spa at Four Seasons Osaka\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eDesigner Shinichiro Ogata founded Tokyo-based studio Simplicity in 1998, applying his contemporary take on traditional Japanese design philosophies to projects ranging from architecture and interiors to product, graphic and packaging design.\u003c/p\u003e\n\u003cp\u003eIn his role as a creative director, Ogata has overseen the interior and spatial design for brands including Hyatt Hotels and skincare brand Aesop, including a \u003ca href=\"https://www.dezeen.com/2014/01/31/translucent-fabric-divides-aesop-store-in-kyoto-by-simplicity/\"\u003estore in Kyoto\u003c/a\u003e featuring screens made from draped black fabric.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe photography is by \u003ca href=\"https://www.enfocafotos.com/fotos-kenseet.php\"\u003eKen Seet\u003c/a\u003e. \u003c/em\u003e\u003c/p\u003e\n\n                \n                \n                \n\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#dfafadb6a9bebca69fbbbaa5babab1f1bcb0b2\"\u003e\u003cspan data-cfemail=\"1d6d6f746b7c7e645d797867787873337e7270\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-10-30T09:00:03Z",
  "modifiedTime": "2024-10-29T14:45:20Z"
}
