{
  "id": "2a132387-6bb8-4fb0-a215-3b9eb0ff4acc",
  "title": "Studio Becky Carter uses amber glass to cast moody light inside Providence bar",
  "link": "https://www.dezeen.com/2025/01/18/loma-bar-providence-rhode-island-studio-becky-carter/",
  "description": "Cast-glass sconces and amber window panes radiate a soft caramel glow across Loma bar in Providence, Rhode Island, designed by New York-based Studio Becky Carter. Loma is owned by Leishla Maldonado, who grew up in a Puerto Rican family, and brothers Osman and Yefri Cortave, who emigrated from Guatemala as children. The trio's vision for The post Studio Becky Carter uses amber glass to cast moody light inside Providence bar appeared first on Dezeen.",
  "author": "Dan Howarth",
  "published": "Sat, 18 Jan 2025 18:10:42 +0000",
  "source": "https://www.dezeen.com/interiors/feed/",
  "categories": [
    "Restaurants and bars",
    "all",
    "Interiors",
    "Bars",
    "Rhode Island",
    "Providence",
    "USA"
  ],
  "byline": "Dan Howarth",
  "length": 6972,
  "excerpt": "Cast-glass sconces and amber window panes radiate a soft caramel glow across this bar in Providence, Rhode Island, designed by New York-based Studio Becky Carter.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Cast-glass sconces and amber window panes radiate a soft caramel glow across Loma bar in Providence, Rhode Island, designed by New York-based Studio Becky Carter. Loma is owned by Leishla Maldonado, who grew up in a Puerto Rican family, and brothers Osman and Yefri Cortave, who emigrated from Guatemala as children. A custom mahogany screen obscures the view on Loma from the bar's entranceThe trio's vision for the compact space was to reflect their roots and provide guests with an intimate experience. \"From the beginning, the three owners of Loma knew they wanted their space to have a distinct 'vintage Latin bar' feel – welcoming, warm, tucked away,\" said Carter. Terracotta tiles cover the floor and side tables as an homage to Latin American interiors\"We embraced the 450 square footprint, amplifying the intimacy by leaning into darker, more monotone hues, the entirety wrapped in warmth,\" she added. Lighting played a key role in setting the tone, and Carter sourced a set of 1970s Italian cast glass sconces that produce dynamic shadows across the lime-washed walls. 1970s cast-glass sconces and amber window panes create a soft glow within the barThe two street-facing windows were covered with a second pane of textured amber glass to diffuse the natural light and add to the warm radiant glow. A custom mahogany partition separates the entrance from the rest of the bar, with rectangular cutouts offering peeks through before rounding the corner. A custom velvet-upholstered banquette wraps the main seating area\"Upon entering the bar, guests encounter glimpses, corner-of-the-eye moments, rays of warm glowing light, objects in the periphery,\" Carter said. \"Each detail reveals itself as part of the greater whole over time.\" Terracotta tiles cover the floor as an homage to Latin American interiors and also wrap cylindrical side tables for placing drinks upon. Most of the furniture pieces and objects displayed are vintage or second-hand, selected by Carter and the Loma team together. The remainder were custom designed by Carter and fabricated by locally based Transom Woodwork for the project, including a velvet-upholstered banquette that wraps the main seating area. The bar itself is designed as a cosy niche and has only four stools for easy conversationThe bar itself is designed as a cosy niche wrapped in lacquered mahogany, with only four stools so that Maldonado can easily converse with guests as she prepares drinks. Only a curated, rotating selection of liquor bottles is displayed on the back bar and a huge cube of ice is hand-chiseled for each drink. A variety of vintage and second-hand items were sourced by Carter and the Loma team for the spaceFounded in 2016, Studio Becky Carter was shortlisted for emerging interior designer of the year at the Dezeen Awards 2023. The firm's other hospitality projects include Cecchi's restaurant in Manhattan's West Village, which pulls together references from Bauhaus luncheonettes to comedic characters. The photography is by Joseph Kramm. Subscribe to our newsletters Your email address New! Dezeen Agenda US Sent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events. New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_hero1-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2158829\" data-article-id=\"2158829\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_hero1.jpg\" id=\"preload-hero\"\u003e\n\t\t\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_hero1-852x479.jpg\" alt=\"Loma by Studio Becky Carter\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_hero1-852x479.jpg 1x, https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_hero1-1704x958.jpg 2x\" data-pin-nopin=\"true\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eCast-glass sconces and amber window panes radiate a soft caramel glow across Loma \u003ca href=\"https://www.dezeen.com/tag/bars/\"\u003ebar\u003c/a\u003e in \u003ca href=\"https://www.dezeen.com/tag/providence/\"\u003eProvidence\u003c/a\u003e, Rhode Island, designed by New York-based Studio Becky Carter.\u003cspan id=\"more-2158829\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://www.instagram.com/loma_bar/\" target=\"_blank\" rel=\"noopener\"\u003eLoma\u003c/a\u003e is owned by Leishla Maldonado, who grew up in a Puerto Rican family, and brothers Osman and Yefri Cortave, who emigrated from Guatemala as children.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2158832\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_1-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_1-852x1136.jpg\" alt=\"Entrance to Loma bar in Providence\" width=\"1773\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_1-852x1136.jpg 1x, https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_1-1704x2272.jpg 2x\" sizes=\"(max-width: 1773px) 100vw, 1773px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2158832\"\u003eA custom mahogany screen obscures the view on Loma from the bar\u0026#39;s entrance\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe trio\u0026#39;s vision for the compact space was to reflect their roots and provide guests with an intimate experience.\u003c/p\u003e\n\u003cp\u003e\u0026#34;From the beginning, the three owners of Loma knew they wanted their space to have a distinct \u0026#39;vintage Latin bar\u0026#39; feel – welcoming, warm, tucked away,\u0026#34; said Carter.\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2158840\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_9-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_9-852x1136.jpg\" alt=\"Two chairs either side of a cylindrical side table, atop a tiled floor\" width=\"1774\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_9-852x1136.jpg 1x, https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_9-1704x2271.jpg 2x\" sizes=\"(max-width: 1774px) 100vw, 1774px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2158840\"\u003eTerracotta tiles cover the floor and side tables as an homage to Latin American interiors\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;We embraced the 450 square footprint, amplifying the intimacy by leaning into darker, more monotone hues, the entirety wrapped in warmth,\u0026#34; she added.\u003c/p\u003e\n\n\n\u003cp\u003eLighting played a key role in setting the tone, and Carter sourced a set of 1970s Italian cast glass sconces that produce dynamic shadows across the lime-washed walls.\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2158835\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_4-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_4-852x1136.jpg\" alt=\"Bar seating area with 1970s cast-glass sconces and amber window panes\" width=\"1773\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_4-852x1136.jpg 1x, https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_4-1704x2272.jpg 2x\" sizes=\"(max-width: 1773px) 100vw, 1773px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2158835\"\u003e1970s cast-glass sconces and amber window panes create a soft glow within the bar\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe two street-facing windows were covered with a second pane of textured amber glass to diffuse the natural light and add to the warm radiant glow.\u003c/p\u003e\n\u003cp\u003eA custom mahogany partition separates the entrance from the rest of the bar, with rectangular cutouts offering peeks through before rounding the corner.\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2158836\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_5-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_5-852x1136.jpg\" alt=\"A custom velvet-upholstered banquette around a seating area\" width=\"1773\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_5-852x1136.jpg 1x, https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_5-1704x2272.jpg 2x\" sizes=\"(max-width: 1773px) 100vw, 1773px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2158836\"\u003eA custom velvet-upholstered banquette wraps the main seating area\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;Upon entering the bar, guests encounter glimpses, corner-of-the-eye moments, rays of warm glowing light, objects in the periphery,\u0026#34; Carter said. \u0026#34;Each detail reveals itself as part of the greater whole over time.\u0026#34;\u003c/p\u003e\n\u003cp\u003eTerracotta tiles cover the floor as an homage to Latin American interiors and also wrap cylindrical side tables for placing drinks upon.\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003eMost of the furniture pieces and objects displayed are vintage or second-hand, selected by Carter and the Loma team together.\u003c/p\u003e\n\u003cp\u003eThe remainder were custom designed by Carter and fabricated by locally based \u003ca href=\"https://transomstudio.square.site/\" target=\"_blank\" rel=\"noopener\"\u003eTransom Woodwork\u003c/a\u003e for the project, including a velvet-upholstered banquette that wraps the main seating area.\u003c/p\u003e\n\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-2158838\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_7.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_7-852x639.jpg\" alt=\"Mahogany bar with four stools\" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_7-852x639.jpg 1x, https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_7-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2158838\"\u003eThe bar itself is designed as a cosy niche and has only four stools for easy conversation\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe bar itself is designed as a cosy niche wrapped in lacquered mahogany, with only four stools so that Maldonado can easily converse with guests as she prepares drinks.\u003c/p\u003e\n\u003cp\u003eOnly a curated, rotating selection of liquor bottles is displayed on the back bar and a huge cube of ice is hand-chiseled for each drink.\u003c/p\u003e\n\u003cfigure id=\"preload-5\" aria-describedby=\"caption-attachment-2158846\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_15-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_15-852x1136.jpg\" alt=\"View into a bathroom with plants and a totem-like vessel in front\" width=\"1774\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_15-852x1136.jpg 1x, https://static.dezeen.com/uploads/2025/01/loma_studio-becky-carter_dezeen_2364_col_15-1704x2271.jpg 2x\" sizes=\"(max-width: 1774px) 100vw, 1774px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2158846\"\u003eA variety of vintage and second-hand items were sourced by Carter and the Loma team for the space\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eFounded in 2016, Studio Becky Carter was \u003ca href=\"https://www.dezeen.com/awards/2023/shortlists/studio-becky-carter/\"\u003eshortlisted for emerging interior designer of the year\u003c/a\u003e at the Dezeen Awards 2023.\u003c/p\u003e\n\u003cp\u003eThe firm\u0026#39;s other hospitality projects include \u003ca href=\"https://www.dezeen.com/2023/09/10/cecchis-restaurant-west-village-new-york-studio-becky-carter/\"\u003eCecchi\u0026#39;s restaurant in Manhattan\u0026#39;s West Village\u003c/a\u003e, which pulls together references from Bauhaus luncheonettes to comedic characters.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe photography is by \u003ca href=\"https://www.josephkramm.com/\" target=\"_blank\" rel=\"noopener\"\u003eJoseph Kramm\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\n                \n                \n                \n\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Agenda US\u003c/strong\u003e\n                \u003cp\u003eSent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#d7a7a5bea1b6b4ae97b3b2adb2b2b9f9b4b8ba\"\u003e\u003cspan data-cfemail=\"4232302b3423213b0226273827272c6c212d2f\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-01-18T18:10:42Z",
  "modifiedTime": "2025-01-18T18:10:41Z"
}
