{
  "id": "394d576d-75f1-4884-bcd5-e24f9428766e",
  "title": "Policronica crafts Parisian hotel interior using \"invasive wood\"",
  "link": "https://www.dezeen.com/2024/11/07/policronica-crafts-parisian-hotel-invasive-eucalyptus-wood/",
  "description": "Design studio Policronica has transformed the interior of Hotel Elysée Montmartre in Paris, relying almost exclusively on a single species of wood. The 850-square-metre space nods to the studio's signature aesthetic and features a monochrome interior characterised by architectural woodwork and wooden furnishings. Nearly every element of the hotel interior was custom-designed and crafted on-site The post Policronica crafts Parisian hotel interior using \"invasive wood\" appeared first on Dezeen.",
  "author": "Rachael Gilby",
  "published": "Thu, 07 Nov 2024 10:00:07 +0000",
  "source": "https://www.dezeen.com/interiors/feed/",
  "categories": [
    "all",
    "Interiors",
    "France",
    "Paris",
    "Hotels"
  ],
  "byline": "Rachael Gilby",
  "length": 7005,
  "excerpt": "Design studio Policronica has transformed the interiors of Hotel Elysée Montmartre in Paris, relying almost exclusively on a single species of wood.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Design studio Policronica has transformed the interior of Hotel Elysée Montmartre in Paris, relying almost exclusively on a single species of wood. The 850-square-metre space nods to the studio's signature aesthetic and features a monochrome interior characterised by architectural woodwork and wooden furnishings. Nearly all furnishings in the hotel were crafted from eucalyptus woodNearly every element of the hotel interior was custom-designed and crafted on-site at Policronica's workshop in Lisbon using locally sourced eucalyptus wood. \"Everything is made from eucalyptus wood, an invasive wood that we are requalifying,\" the studio said. \"We proposed to the customer that all the hotel's fixtures and fittings be made from eucalyptus trunks, which are normally cut to make paper pulp.\" Most elements of the hotel interior were manufactured in Policronica's workshopBy bringing the entire design and manufacturing process in-house, the studio aimed to rethink the production process for a commercial interior – a choice that it says significantly lowered the project's carbon footprint. \"In contrast to the typical approaches to hotel interior design, often addressed in a more ensemble-focused logic, we aimed for this project to design and manufacture 100 per cent of the hotel's elements: the furnishings, lighting and handles,\" architect Julien Labrousse told Dezeen. \"Without repetitive shipping from one point to another, as in traditional schemes, our production is extremely low in carbon.\" A warm, neutral colour palette was used throughout the interiorFeaturing \"warm and raw materials\" such as wood, plant fibres, brass and neutral fabrics, the studio strived to create a clean, organic aesthetic throughout all 16 rooms of Hotel Elysée Montmartre. \"This resulted in a very cohesive interior design that evokes a return to basics in an urban context,\" said Labrousse. \"The design highlights raw materials in their most natural form, where wood – ever-present – is worked to preserve its imperfections.\" With its design, Policronica aimed to reevaluate the local eucalyptus wood – typically reserved for papermaking – by using it to show high-end craftsmanship throughout the interior. \"The goal, on a small scale, is to demonstrate the possibility of using this wood for noble purposes, valorising this material and getting involved in heterogeneous forestry practices,\" Labrousse explained. The space showcases a sleek, monochromatic designInformed by Nordic aesthetics and Japanese architectural woodwork, the studio’s use of pared-back, natural materials intended to emphasise the simplicity and functionality of its design. \"It is inspired by different universes, such as Nordic design and Japanese wooden architecture,\" explained Labrousse. \"These influences manifest in simple forms, [with] a strong emphasis on woodwork and the refinement of joinery.\" Other natural materials were chosen to complement the woodThe studio is still in the process of finalising the interior, with Hotel Elysée Montmartre scheduled to open in January 2025. Plans for ongoing renovations hope to see an additional ten rooms added to the hotel within a year of its opening. This project has been shortlisted in the hotel and short-stay interior category of Dezeen Awards 2024. Other projects that have also been shortlisted in this category include Ennea Hotel by Comité de Proyectos and Locke at East Side Gallery by Grzywinksk + Pons. Subscribe to our newsletters Your email address New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2024/10/Policronica-Hero-and-Feature_dezeen_2364_col_0-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2135368\" data-article-id=\"2135368\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/Policronica-Hero-and-Feature_dezeen_2364_col_0.jpg\" id=\"preload-hero\"\u003e\n\t\t\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2024/10/Policronica-Hero-and-Feature_dezeen_2364_col_0-852x479.jpg\" alt=\"Close-up photograph of wooden furnishings in the lounge.\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2024/10/Policronica-Hero-and-Feature_dezeen_2364_col_0-852x479.jpg 1x, https://static.dezeen.com/uploads/2024/10/Policronica-Hero-and-Feature_dezeen_2364_col_0-1704x959.jpg 2x\" data-pin-nopin=\"true\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eDesign studio Policronica has transformed the interior of Hotel Elysée Montmartre in \u003ca href=\"https://www.dezeen.com/tag/paris/\"\u003eParis\u003c/a\u003e, relying almost exclusively on a single species of \u003ca href=\"https://www.dezeen.com/tag/wood/\"\u003ewood\u003c/a\u003e.\u003cspan id=\"more-2135368\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe 850-square-metre space nods to the studio\u0026#39;s signature aesthetic and features a monochrome interior characterised by architectural woodwork and wooden furnishings.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2135372\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/Policronica-Hotel-Elysee-Montmartre_dezeen_2364_col_2-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/Policronica-Hotel-Elysee-Montmartre_dezeen_2364_col_2-852x1136.jpg\" alt=\"Photograph of a lounge area, showing furnishings mostly constructed from wood. \" width=\"1772\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/10/Policronica-Hotel-Elysee-Montmartre_dezeen_2364_col_2-852x1136.jpg 1x, https://static.dezeen.com/uploads/2024/10/Policronica-Hotel-Elysee-Montmartre_dezeen_2364_col_2-1704x2273.jpg 2x\" sizes=\"(max-width: 1772px) 100vw, 1772px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2135372\"\u003eNearly all furnishings in the hotel were crafted from eucalyptus wood\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eNearly every element of the hotel interior was custom-designed and crafted on-site at \u003ca href=\"https://www.policronica.com/\"\u003ePolicronica\u003c/a\u003e\u0026#39;s workshop in Lisbon using locally sourced eucalyptus wood.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Everything is made from eucalyptus wood, an invasive wood that we are requalifying,\u0026#34; the studio said. \u0026#34;We proposed to the customer that all the hotel\u0026#39;s fixtures and fittings be made from eucalyptus trunks, which are normally cut to make paper pulp.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2135370\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/Policronica-Hotel-Elysee-Montmartre_dezeen_2364_col_8.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/Policronica-Hotel-Elysee-Montmartre_dezeen_2364_col_8-852x639.jpg\" alt=\"Photograph of an open plan, minimalist lounge area with a dining table. The furnishings are mostly crafted from a light toned wood.\" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2024/10/Policronica-Hotel-Elysee-Montmartre_dezeen_2364_col_8-852x639.jpg 1x, https://static.dezeen.com/uploads/2024/10/Policronica-Hotel-Elysee-Montmartre_dezeen_2364_col_8-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2135370\"\u003e\u003cspan\u003eMost elements of the hotel interior were manufactured in Policronica\u0026#39;s workshop\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eBy bringing the entire design and manufacturing process in-house, the studio aimed to rethink the production process for a commercial interior – a choice that it says significantly lowered the project\u0026#39;s carbon footprint.\u003c/p\u003e\n\n\n\u003cp\u003e\u0026#34;In contrast to the typical approaches to hotel interior design, often addressed in a more ensemble-focused logic, we aimed for this project to design and manufacture 100 per cent of the hotel\u0026#39;s elements: the furnishings, lighting and handles,\u0026#34; architect Julien Labrousse told Dezeen.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Without repetitive shipping from one point to another, as in traditional schemes, our production is extremely low in carbon.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2135376\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/Policronica-Hotel-Elysee-Montmartre_dezeen_2364_col_6-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/Policronica-Hotel-Elysee-Montmartre_dezeen_2364_col_6-852x1136.jpg\" alt=\"Photograph of a minimalist hotel bedroom with a seating area by a large window.\" width=\"1773\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/10/Policronica-Hotel-Elysee-Montmartre_dezeen_2364_col_6-852x1136.jpg 1x, https://static.dezeen.com/uploads/2024/10/Policronica-Hotel-Elysee-Montmartre_dezeen_2364_col_6-1704x2272.jpg 2x\" sizes=\"(max-width: 1773px) 100vw, 1773px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2135376\"\u003eA warm, neutral colour palette was used throughout the interior\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eFeaturing \u0026#34;warm and raw materials\u0026#34; such as wood, plant fibres, brass and neutral fabrics, the studio strived to create a clean, organic aesthetic throughout all 16 rooms of Hotel Elysée Montmartre.\u003c/p\u003e\n\u003cp\u003e\u0026#34;This resulted in a very cohesive interior design that evokes a return to basics in an urban context,\u0026#34; said Labrousse. \u0026#34;The design highlights raw materials in their most natural form, where wood – ever-present – is worked to preserve its imperfections.\u0026#34;\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003eWith its design, Policronica aimed to reevaluate the local eucalyptus wood – typically reserved for papermaking – by using it to show high-end craftsmanship throughout the interior.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The goal, on a small scale, is to demonstrate the possibility of using this wood for noble purposes, valorising this material and getting involved in heterogeneous forestry practices,\u0026#34; Labrousse explained.\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2135369\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/Policronica-Hotel-Elysee-Montmartre_dezeen_2364_col_0-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/Policronica-Hotel-Elysee-Montmartre_dezeen_2364_col_0-852x1136.jpg\" alt=\"Photograph of a minimalist lounge area with a reception desk. The furnishings are mostly crafted from a light toned wood.\" width=\"1773\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/10/Policronica-Hotel-Elysee-Montmartre_dezeen_2364_col_0-852x1136.jpg 1x, https://static.dezeen.com/uploads/2024/10/Policronica-Hotel-Elysee-Montmartre_dezeen_2364_col_0-1704x2272.jpg 2x\" sizes=\"(max-width: 1773px) 100vw, 1773px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2135369\"\u003eThe space showcases a sleek, monochromatic design\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eInformed by Nordic aesthetics and Japanese architectural woodwork, the studio’s use of pared-back, natural materials intended to emphasise the simplicity and functionality of its design.\u003c/p\u003e\n\u003cp\u003e\u0026#34;It is inspired by different universes, such as Nordic design and Japanese wooden architecture,\u0026#34; explained Labrousse. \u0026#34;These influences manifest in simple forms, [with] a strong emphasis on woodwork and the refinement of joinery.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-2135373\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/10/Policronica-Hotel-Elysee-Montmartre_dezeen_2364_col_3-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/10/Policronica-Hotel-Elysee-Montmartre_dezeen_2364_col_3-852x1136.jpg\" alt=\"Photograph of a hotel bedroom with a minimalist scheme and wooden furniture.\" width=\"1773\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/10/Policronica-Hotel-Elysee-Montmartre_dezeen_2364_col_3-852x1136.jpg 1x, https://static.dezeen.com/uploads/2024/10/Policronica-Hotel-Elysee-Montmartre_dezeen_2364_col_3-1704x2272.jpg 2x\" sizes=\"(max-width: 1773px) 100vw, 1773px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2135373\"\u003eOther natural materials were chosen to complement the wood\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe studio is still in the process of finalising the interior, with Hotel Elysée Montmartre scheduled to open in January 2025. Plans for ongoing renovations hope to see an additional ten rooms added to the hotel within a year of its opening.\u003c/p\u003e\n\u003cp\u003eThis project has been shortlisted in the hotel and short-stay interior category of Dezeen Awards 2024. Other projects that have also been shortlisted in this category include \u003ca href=\"https://www.dezeen.com/awards/2024/shortlists/ennea-hotel/\"\u003eEnnea Hotel by Comité de Proyectos\u003c/a\u003e and \u003ca href=\"https://www.dezeen.com/awards/2024/shortlists/locke-at-east-side-gallery/\"\u003eLocke at East Side Gallery by Grzywinksk + Pons.\u003c/a\u003e\u003c/p\u003e\n\n                \n                \n                \n\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#4a3a38233c2b29330a2e2f302f2f2464292527\"\u003e\u003cspan data-cfemail=\"7707051e0116140e3713120d1212195914181a\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-11-07T10:00:07Z",
  "modifiedTime": "2024-11-07T10:14:15Z"
}
