{
  "id": "4019a8a8-5657-49c3-89d5-4d3c7636e115",
  "title": "This Incredible Victorian Mansion In Melbourne Is For Sale!",
  "link": "https://thedesignfiles.wpenginepowered.com/2025/05/on-the-market-160-the-avenue-parkville/",
  "description": "One of Melbourne’s most spectacular historic homes is on the market, and they really don’t make them like this anymore! Cumnock is a circa-1889 Victorian Italianate mansion in Melbourne designed by celebrated architect Charles Webb, who also designed many of the ornate, heritage-listed buildings around the city. Surrounded by landscaped gardens, the landmark home spans more than 1376 square metres, with luxurious rooms, soaring ceilings, and period details that have been remarkably maintained over the last 139 years. See it all below.",
  "author": "The Design Files",
  "published": "Wed, 07 May 2025 04:00:05 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 2367,
  "excerpt": "A multimillion-dollar 1889 Victorian Italianate mansion with landscaped gardens awaits a new custodian. See inside!",
  "siteName": "",
  "favicon": "",
  "text": "The mansion at 160-162 The Avenue, Parkville is the kind of historic home most people can only dream about. Set on a prestigious corner block spanning 1376 square metres, the Victorian Italianate residence was designed by significant architect Charles Webb — who was also behind Bourke Street Mall’s elegant Royal Arcade, the Mandeville Hall and the Windsor Hotel on Spring Street. Built in the late 1880s, Cumnock has been impeccably maintained over the last century and it’s now awaiting a new custodian. ‘I’ve sold homes for 36 years in the inner city and this would be one of the best examples of a classic Italianate style home I’ve ever seen,’ Nelson Alexander Carlton North director Nicholas West says. ‘As soon as you walk up to the house and see the landscaped gardens, you know you’ve arrived at somewhere special.’ The stately facade opens to a pressed-metal foyer adorned with soaring ceilings, polished floorboards, towering archways and intricate stained-glass windows. On the ground floor, you’ll find a formal living room with bay windows overlooking the lush grounds, a home office with a separate library, alongside a modern kitchen and meals area. French doors open to the outdoor terrace, primed for entertaining below the leafy tree canopy. While a grand original timber staircase leads to the upper level, a spiral glass staircase has been added for extra functionality — just one of the updates that’s helped to ‘tastefully’ bring the Victorian into the 21st century. Upstairs isn’t short on luxury either. There’s four palatial bedrooms, a lavish marble ensuite, and the enormous wraparound balcony, and in true mansion style, you can climb up to the turreted tower with panoramic park views! ‘[The home has] clearly gone through an evolution. It’s got a great blend of old and new, which you don’t always see in these older mansions,’ Nicholas adds. ‘It’s contemporary, but hasn’t lost any of the period richness you’d expect from a home like this.’ But beyond the ornate architecture, the private house is also completely surrounded by parklands, located opposite Royal Park with Princes Park a short walk away, and convenient access to the CBD. 160-162 The Avenue, Parkville, VIC 3052 is listed for sale by expressions of interest closing on Tuesday May 27 at 5.00pm with Nicholas West and Stephanie Hawke at Nelson Alexander Carlton North.",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2025/04/TheAvenue-tdf-otm4-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003eThe mansion at 160-162 The Avenue, Parkville is the kind of historic home most people can only dream about.\u003c/h3\u003e\n\u003cp\u003eSet on a prestigious corner block spanning 1376 square metres, the Victorian Italianate residence was designed by significant architect Charles Webb — who was also behind Bourke Street Mall’s elegant Royal Arcade, the Mandeville Hall\u003ci data-stringify-type=\"italic\"\u003e \u003c/i\u003eand the Windsor Hotel on Spring Street.\u003c/p\u003e\n\u003cp\u003eBuilt in the late 1880s, Cumnock has been impeccably maintained over the last century and it’s now awaiting a new custodian.\u003c/p\u003e\n\u003cp\u003e‘I’ve sold homes for 36 years in the inner city and this would be one of the best examples of a classic Italianate style home I’ve ever seen,’ Nelson Alexander Carlton North director Nicholas West says.\u003c/p\u003e\n\u003cp\u003e‘As soon as you walk up to the house and see the landscaped gardens, you know you’ve arrived at somewhere special.’\u003c/p\u003e\n\u003cp\u003eThe stately facade opens to a pressed-metal foyer adorned with soaring ceilings, polished floorboards, towering archways and intricate stained-glass windows.\u003c/p\u003e\n\u003cp\u003eOn the ground floor, you’ll find a formal living room with bay windows overlooking the lush grounds, a home office with a separate library, alongside a modern kitchen and meals area. French doors open to the outdoor terrace, primed for entertaining below the leafy tree canopy.\u003c/p\u003e\n\u003cp\u003eWhile a grand original timber staircase leads to the upper level, a spiral glass staircase has been added for extra functionality — just one of the updates that’s helped to ‘tastefully’ bring the Victorian into the 21st century.\u003c/p\u003e\n\u003cp\u003eUpstairs isn’t short on luxury either. There’s four palatial bedrooms, a lavish marble ensuite, and the enormous wraparound balcony, and in true mansion style, you can climb up to the turreted tower with panoramic park views!\u003c/p\u003e\n\u003cp\u003e‘[The home has] clearly gone through an evolution. It’s got a great blend of old and new, which you don’t always see in these older mansions,’ Nicholas adds. ‘It’s contemporary, but hasn’t lost any of the period richness you’d expect from a home like this.’\u003c/p\u003e\n\u003cp\u003eBut beyond the ornate architecture, the private house is also completely surrounded by parklands, located opposite Royal Park with Princes Park a short walk away, and convenient access to the CBD.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003e\u003ca href=\"https://www.nelsonalexander.com.au/property/1679930/160-162-the-avenue-parkville-vic-3052/\" target=\"_blank\" rel=\"noopener\"\u003e160-162 The Avenue, Parkville, VIC 3052\u003c/a\u003e is listed for sale by expressions of interest closing on Tuesday May 27 at 5.00pm with Nicholas West and Stephanie Hawke at Nelson Alexander Carlton North.\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
