{
  "id": "5bdfbdb9-990f-45f3-bbe6-261e12c57b79",
  "title": "Kengo Kuma embellishes Kyoto hotel with timber-skeleton theatre stage",
  "link": "https://www.dezeen.com/2025/01/16/banyan-tree-higashiyama-kyoto-hotel-kengo-kuma/",
  "description": "The \"ethereal beauty\" of classical Japanese Noh theatre informed Kengo Kuma and Associates' design for the Banyan Tree hotel in Kyoto, with a dedicated stage hidden in its stepped gardens. Banyan Tree Higashiyama Kyoto is set in the foothills of the city's easterly Higashiyama mountains, in a historic district brimming with temples and shrines, ancient The post Kengo Kuma embellishes Kyoto hotel with timber-skeleton theatre stage appeared first on Dezeen.",
  "author": "Jennifer Hahn",
  "published": "Thu, 16 Jan 2025 11:45:27 +0000",
  "source": "https://www.dezeen.com/interiors/feed/",
  "categories": [
    "all",
    "Architecture",
    "Interiors",
    "Japan",
    "Hotels",
    "Kyoto",
    "Kengo Kuma"
  ],
  "byline": "Jennifer Hahn",
  "length": 10908,
  "excerpt": "The \"ethereal beauty\" of classical Japanese Noh theatre informed Kengo Kuma and Associates' design for the Banyan Tree hotel in Kyoto, with a dedicated stage hidden in its stepped gardens.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "The \"ethereal beauty\" of classical Japanese Noh theatre informed Kengo Kuma and Associates' design for the Banyan Tree hotel in Kyoto, with a dedicated stage hidden in its stepped gardens. Banyan Tree Higashiyama Kyoto is set in the foothills of the city's easterly Higashiyama mountains, in a historic district brimming with temples and shrines, ancient cemeteries and burial grounds. Banyan Tree Higashiyama Kyoto (above) has its own Noh stage (top image)The area's symbolic role as a bridge to the afterlife led Kengo Kuma and Associates (KKA) to find the main inspiration for its design in the 14th-century art of Noh, sometimes called the \"theatre of ghosts\" because it tends to feature spirits as key characters. \"The hotel was inspired by the ethereal beauty of Noh,\" Kuma told Dezeen. \"Noh is a traditional art form that has roots in Kyoto, Japan, and is a wonderful expression of the inner struggles and complex emotions of human beings.\" A miniature gabled roof shelters the hotel's entranceThese references can be seen not just in the hotel's dedicated Noh stage – a timber skeleton made of yellow cedar and Kyoto cypress – but also in the architecture of the hotel itself and the interiors of its 52 guest rooms designed by the late designer Yukio Hashimoto. The hotel's design was guided by the Japanese aesthetic principle of yūgen, describing a mysterious, quiet beauty that is one of the central tenets of Noh, as set out by playwright Zeami Motokiyo. Different forms of timber dominate the triple-height lobby\"The entire hotel was designed to provide a place for reflection,\" Kuma said. \"And the Noh stage, set against the surrounding greenery, is arguably the most symbolic place within the hotel that reflects the concept of yūgen.\" Banyan Tree Higashiyama Kyoto is set on a sloped site with a height difference of 12 metres between its lowest and highest point. The Ryozen restaurant serves multi-course kaiseki mealsTo make the most of the limited space, KKA created a pair of mid-rise reinforced concrete volumes, providing panoramic views over Kyoto and framing the stepped gardens, which can be accessed from different floors of the hotel. Banyan Tree's main four-storey building houses the bedrooms and all of the common areas – including a triple-height lobby, the Ryozen restaurant, a cavernous bar and gender-split onsen baths – while the perpendicular three-storey annexe accommodates additional guests. Rough stone walls frame the cavernous Bar RyozenKKA installed three tiers of eaves with slatted timber overhangs to break up these two monolithic volumes and provide a modern take on traditional Japanese architecture. \"The limited site meant that the hotel build would be significant in volume,\" Kuma said. \"To match the scale of the surrounding area, we decided to use the eaves to visually divide the building into smaller sections.\" \"Continuous rafters were then installed to create the deep, elongated eaves and soft shadows that reflect the traditional Japanese dimension system and harmonise with the surroundings.\" The hotel has gender-split onsen bathsThe hotel's entrance is sheltered by a miniature gabled roof, held up without columns. Instead, the cantilevered structure is supported by an elaborate stack of criss-crossing beams. \"By employing cutting-edge resin-based construction methods to securely join the wooden beams, we achieved a sense of levitation that would not be possible with conventional wooden construction,\" Kuma said. \"This innovative blend of modern technology and traditional craftsmanship allows us to present a remarkable architectural feat – a massive wooden structure seemingly floating in the air to welcome visitors.\" To blend the building into the Higashiyama landscape, KKA used weathered stones from an existing masonry wall on the site alongside rustic chunks of granite to clad the base of the main building. The studio also preserved and restored the existing landscaping on the site, including moss, stones, trees and a small bamboo grove, which hides the hot spring feeding the hotel's onsen baths. A craggy rock pond sits on the same level as the ground-floor lobby and annexe, while the bamboo grove and Noh stage can be accessed from the second floor via the terrace of restaurant Ryozen, which serves multi-course kaiseki meals. A newly created rock pond sits on the same level as the annexeThe stage itself is set on stilts above a shallow reflecting pool and offers an even more pared-back interpretation of a typically minimalist Noh stage, with no solid walls or roof hiding its timber skeleton. Instead of the traditional kagami-ita backdrop of a painted pine tree, the stage now frames views of real trees. The Noh stage is accessed via restaurant Ryozen on the second floor\"Constructing a roofed building was not permitted on the site where the Noh stage now stands,\" Kuma said. \"However, this restriction inspired a unique approach to the stage's design.\" \"To honour this art form, we designed the Noh stage with an exposed wooden framework that reaches towards the sky, seamlessly integrating with the surrounding natural landscape, while aiming to retain the features of a traditional Noh stage as much as possible.\" Tatami flooring features in the guest roomsThe interior also aims to translate traditional Japanese design details via a simplified, modern material selection, drawing heavily on wood and stone. To maintain visual interest despite this pared-back palette, timber was treated in different ways throughout the lobby – either charred to form decorative columns or laid in a chequerboard pattern of alternating grains across the floor. The horigotatsu seating area was raised for Western-style seatingA mottled texture reminiscent of hammered metal was translated into wood to form the base of the reception desk, making use of a traditional Japanese carving technique known as naguri. This same pattern, covered in locally sourced gold leaf, also features across headboards in the guest suites. The rooms are rich in traditional details like tatami flooring and cypress-wood bathtubs – although many were adapted to suit modern tastes. Cypress tubs feature in all of the roomsThe moveable shoji screens enclosing the tub, for example, have their timber lattices hidden behind layers of washi paper, while the horigotatsu seating area was raised to cater to Western seating preferences and create a small workspace. \"We blend classic Japanese elements with a contemporary execution in subtle ways throughout our design,\" said the Hashimoto Yukio Design Studio team. \"An example would be the tea table, where we combined a natural solid piece of tochi for the tabletop with hexagon-shaped legs – a subtle and sophisticated detail to match the style of the room.\" KKA has previously been responsible for designing a number of popular hotels across the country including the Ace Hotel Kyoto and Edition hotels in Tokyo's Toranomon and Ginza districts. Subscribe to our newsletters Your email address New! Dezeen Agenda US Sent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events. New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2025/01/c-banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_1-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2159888\" data-article-id=\"2159888\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/c-banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_1.jpg\" id=\"preload-hero\"\u003e\n\t\t\n\n\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2025/01/c-banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_1-852x479.jpg\" alt=\"Noh stage of Banyan Tree Higashiyama Kyoto by Kengo Kuma\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2025/01/c-banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_1-852x479.jpg 1x, https://static.dezeen.com/uploads/2025/01/c-banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_1-1704x959.jpg 2x\" data-pin-nopin=\"true\" data-cfsrc=\"https://static.dezeen.com/uploads/2025/01/c-banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_1-852x479.jpg\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eThe \u0026#34;ethereal beauty\u0026#34; of classical Japanese Noh theatre informed \u003ca href=\"https://www.dezeen.com/tag/kengo-kuma/\"\u003eKengo Kuma and Associates\u003c/a\u003e\u0026#39; design for the Banyan Tree \u003ca href=\"https://www.dezeen.com/tag/hotels/\"\u003ehotel\u003c/a\u003e in \u003ca href=\"https://www.dezeen.com/tag/kyoto/\"\u003eKyoto\u003c/a\u003e, with a dedicated stage hidden in its stepped gardens.\u003cspan id=\"more-2159888\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://www.banyantree.com/japan/kyoto\"\u003eBanyan Tree Higashiyama Kyoto\u003c/a\u003e is set in the foothills of the city\u0026#39;s easterly Higashiyama mountains, in a historic district brimming with temples and shrines, ancient cemeteries and burial grounds.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2159908\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_17.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_17-852x548.jpg\" alt=\"Overview of Banyan Tree Higashiyama Kyoto\" width=\"2364\" height=\"1521\" srcset=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_17-852x548.jpg 1x, https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_17-1704x1096.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_17-852x548.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2159908\"\u003eBanyan Tree Higashiyama Kyoto (above) has its own Noh stage (top image)\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe area\u0026#39;s \u003ca href=\"https://blog.japanwondertravel.com/mysterious-spots-in-kyoto-22283\"\u003esymbolic role as a bridge to the afterlife\u003c/a\u003e led Kengo Kuma and Associates (\u003ca href=\"https://kkaa.co.jp/en/\"\u003eKKA\u003c/a\u003e) to find the main inspiration for its design in the 14th-century art of Noh, sometimes called the \u0026#34;theatre of ghosts\u0026#34; because it tends to feature spirits as key characters.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The hotel was inspired by the ethereal beauty of Noh,\u0026#34; Kuma told Dezeen. \u0026#34;Noh is a traditional art form that has roots in Kyoto, Japan, and is a wonderful expression of the inner struggles and complex emotions of human beings.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2159896\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_5.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_5-852x639.jpg\" alt=\"Gabled overhang next to entrance of Banyan Tree Higashiyama Kyoto\" width=\"2364\" height=\"1774\" srcset=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_5-852x639.jpg 1x, https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_5-1704x1279.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_5-852x639.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2159896\"\u003eA miniature gabled roof shelters the hotel\u0026#39;s entrance\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThese references can be seen not just in the hotel\u0026#39;s dedicated Noh stage – a timber skeleton made of yellow cedar and Kyoto cypress – but also in the architecture of the hotel itself and the interiors of its 52 guest rooms designed by the late designer \u003ca href=\"https://www.hydesign.jp/en/\"\u003eYukio Hashimoto\u003c/a\u003e.\u003c/p\u003e\n\n\n\u003cp\u003eThe hotel\u0026#39;s design was guided by the Japanese aesthetic principle of \u003ca href=\"https://traditionalkyoto.com/culture/yugen/\"\u003eyūgen\u003c/a\u003e, describing a mysterious, quiet beauty that is one of the central tenets of Noh, as set out by playwright \u003ca href=\"https://www.britannica.com/biography/Zeami\"\u003eZeami Motokiyo\u003c/a\u003e.\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2159902\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_11.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_11-852x639.jpg\" alt=\"Lobby of hotel by Kengo Kuma\" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_11-852x639.jpg 1x, https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_11-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_11-852x639.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2159902\"\u003eDifferent forms of timber dominate the triple-height lobby\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;The entire hotel was designed to provide a place for reflection,\u0026#34; Kuma said. \u0026#34;And the Noh stage, set against the surrounding greenery, is arguably the most symbolic place within the hotel that reflects the concept of yūgen.\u0026#34;\u003c/p\u003e\n\u003cp\u003eBanyan Tree Higashiyama Kyoto is set on a sloped site with a height difference of 12 metres between its lowest and highest point.\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2159904\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_13.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_13-852x639.jpg\" alt=\"Ryozen restaurant\" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_13-852x639.jpg 1x, https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_13-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_13-852x639.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2159904\"\u003eThe Ryozen restaurant serves multi-course kaiseki meals\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eTo make the most of the limited space, KKA created a pair of mid-rise reinforced concrete volumes, providing panoramic views over Kyoto and framing the stepped gardens, which can be accessed from different floors of the hotel.\u003c/p\u003e\n\u003cp\u003eBanyan Tree\u0026#39;s main four-storey building houses the bedrooms and all of the common areas – including a triple-height lobby, the Ryozen restaurant, a cavernous bar and gender-split onsen baths – while the perpendicular three-storey annexe accommodates additional guests.\u003c/p\u003e\n\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-2159894\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_3.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_3-852x639.jpg\" alt=\"Bar Ryozen\" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_3-852x639.jpg 1x, https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_3-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_3-852x639.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2159894\"\u003eRough stone walls frame the cavernous Bar Ryozen\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eKKA installed three tiers of eaves with slatted timber overhangs to break up these two monolithic volumes and provide a modern take on traditional Japanese architecture.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The limited site meant that the hotel build would be significant in volume,\u0026#34; Kuma said. \u0026#34;To match the scale of the surrounding area, we decided to use the eaves to visually divide the building into smaller sections.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;Continuous rafters were then installed to create the deep, elongated eaves and soft shadows that reflect the traditional Japanese dimension system and harmonise with the surroundings.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-5\" aria-describedby=\"caption-attachment-2159901\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_10.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_10-852x639.jpg\" alt=\"Onsen of Banyan Tree Higashiyama Kyoto\" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_10-852x639.jpg 1x, https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_10-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_10-852x639.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2159901\"\u003eThe hotel has gender-split onsen baths\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe hotel\u0026#39;s entrance is sheltered by a miniature gabled roof, held up without columns. Instead, the cantilevered structure is supported by an elaborate stack of criss-crossing beams.\u003c/p\u003e\n\u003cp\u003e\u0026#34;By employing cutting-edge resin-based construction methods to securely join the wooden beams, we achieved a sense of levitation that would not be possible with conventional wooden construction,\u0026#34; Kuma said.\u003c/p\u003e\n\u003cp\u003e\u0026#34;This innovative blend of modern technology and traditional craftsmanship allows us to present a remarkable architectural feat – a massive wooden structure seemingly floating in the air to welcome visitors.\u0026#34;\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003eTo blend the building into the Higashiyama landscape, KKA used weathered stones from an existing masonry wall on the site alongside rustic chunks of granite to clad the base of the main building.\u003c/p\u003e\n\u003cp\u003eThe studio also preserved and restored the existing landscaping on the site, including moss, stones, trees and a small bamboo grove, which hides the hot spring feeding the hotel\u0026#39;s onsen baths.\u003c/p\u003e\n\u003cp\u003eA craggy rock pond sits on the same level as the ground-floor lobby and annexe, while the bamboo grove and Noh stage can be accessed from the second floor via the terrace of restaurant Ryozen, which serves multi-course \u003ca href=\"https://en.wikipedia.org/wiki/Kaiseki\"\u003ekaiseki\u003c/a\u003e meals.\u003c/p\u003e\n\u003cfigure id=\"preload-6\" aria-describedby=\"caption-attachment-2159903\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_12.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_12-852x639.jpg\" alt=\"Garden of hotel by Kengo Kuma\" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_12-852x639.jpg 1x, https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_12-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_12-852x639.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2159903\"\u003eA newly created rock pond sits on the same level as the annexe\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe stage itself is set on stilts above a shallow reflecting pool and offers an even more pared-back interpretation of a typically minimalist Noh stage, with no solid walls or roof hiding its timber skeleton.\u003c/p\u003e\n\u003cp\u003eInstead of the traditional kagami-ita backdrop of a painted pine tree, the stage now frames views of real trees.\u003c/p\u003e\n\u003cfigure id=\"preload-7\" aria-describedby=\"caption-attachment-2160723\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/d-banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_1.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/d-banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_1-852x639.jpg\" alt=\"Noh stage of Banyan Tree Higashiyama Kyoto by Kengo Kuma\" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2025/01/d-banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_1-852x639.jpg 1x, https://static.dezeen.com/uploads/2025/01/d-banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_1-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2025/01/d-banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_1-852x639.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2160723\"\u003eThe Noh stage is accessed via restaurant Ryozen on the second floor\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;Constructing a roofed building was not permitted on the site where the Noh stage now stands,\u0026#34; Kuma said. \u0026#34;However, this restriction inspired a unique approach to the stage\u0026#39;s design.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;To honour this art form, we designed the Noh stage with an exposed wooden framework that reaches towards the sky, seamlessly integrating with the surrounding natural landscape, while aiming to retain the features of a traditional Noh stage as much as possible.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-8\" aria-describedby=\"caption-attachment-2159907\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_16.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_16-852x639.jpg\" alt=\"Guest room of Banyan Tree Higashiyama Kyoto\" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_16-852x639.jpg 1x, https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_16-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_16-852x639.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2159907\"\u003eTatami flooring features in the guest rooms\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe interior also aims to translate traditional Japanese design details via a simplified, modern material selection, drawing heavily on wood and stone.\u003c/p\u003e\n\u003cp\u003eTo maintain visual interest despite this pared-back palette, timber was treated in different ways throughout the lobby – either charred to form decorative columns or laid in a chequerboard pattern of alternating grains across the floor.\u003c/p\u003e\n\u003cfigure id=\"preload-9\" aria-describedby=\"caption-attachment-2159906\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_15.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_15-852x639.jpg\" alt=\"Seating area overlooking Kyoto\" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_15-852x639.jpg 1x, https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_15-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_15-852x639.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2159906\"\u003eThe horigotatsu seating area was raised for Western-style seating\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eA mottled texture reminiscent of hammered metal was translated into wood to form the base of the reception desk, making use of a traditional Japanese carving technique known as naguri.\u003c/p\u003e\n\u003cp\u003eThis same pattern, covered in locally sourced gold leaf, also features across headboards in the guest suites.\u003c/p\u003e\n\u003cp\u003eThe rooms are rich in traditional details like tatami flooring and cypress-wood bathtubs – although many were adapted to suit modern tastes.\u003c/p\u003e\n\u003cfigure id=\"preload-10\" aria-describedby=\"caption-attachment-2159899\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_8.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_8-852x639.jpg\" alt=\"Bathroom of suite in Banyan Tree Higashiyama Kyoto\" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_8-852x639.jpg 1x, https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_8-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2025/01/banyan-tree-higashiyama-kyoto-kengo-kuma_dezeen_2364_col_8-852x639.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2159899\"\u003eCypress tubs feature in all of the rooms\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe moveable shoji screens enclosing the tub, for example, have their timber lattices hidden behind layers of washi paper, while the horigotatsu seating area was raised to cater to Western seating preferences and create a small workspace.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We blend classic Japanese elements with a contemporary execution in subtle ways throughout our design,\u0026#34; said the Hashimoto Yukio Design Studio team.\u003c/p\u003e\n\u003cp\u003e\u0026#34;An example would be the tea table, where we combined a natural solid piece of tochi for the tabletop with hexagon-shaped legs – a subtle and sophisticated detail to match the style of the room.\u0026#34;\u003c/p\u003e\n\u003cp\u003eKKA has previously been responsible for designing a number of popular hotels across the country including the \u003ca href=\"https://www.dezeen.com/2020/02/08/ace-hotel-kyoto-interiors-kengo-kuma-commune/\"\u003eAce Hotel Kyoto\u003c/a\u003e and Edition hotels in \u003ca href=\"https://www.dezeen.com/2022/12/07/kengo-kuma-tokyo-edition-toranomon-hotel/\"\u003eTokyo\u0026#39;s Toranomon\u003c/a\u003e and Ginza districts.\u003c/p\u003e\n\n                \n                \n                \n\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Agenda US\u003c/strong\u003e\n                \u003cp\u003eSent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#08787a617e696b71486c6d726d6d66266b6765\"\u003e\u003cspan data-cfemail=\"5222203b2433312b1236372837373c7c313d3f\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2025-01-16T11:45:27Z",
  "modifiedTime": "2025-01-16T11:48:08Z"
}
