{
  "id": "6f9e7b27-beda-489e-b105-a6fbb4afb542",
  "title": "First Look: Furniture Brand Eva’s New Sydney Store Feels Like A Cosy Home",
  "link": "https://thedesignfiles.wpenginepowered.com/2025/07/shopping-eva-surry-hills-showroom/",
  "description": "Originally starting as an online-only retailer in 2017, Australian furniture brand Eva has just opened its first Sydney showroom. Founded by husband-and-wife team Amanda Niu and Ken Lau, the label’s motto is all about designing pieces that are ‘made for living’, so setting up their new store inside a cosy, heritage home felt like a perfect fit. Step inside Eva Surry Hills House below!",
  "author": "The Design Files",
  "published": "Tue, 01 Jul 2025 04:00:11 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 2111,
  "excerpt": "Eva has just opened its first-ever Sydney showroom, so you can shop the locally designed furniture in person!",
  "siteName": "",
  "favicon": "",
  "text": "Melbourne-based furniture brand Eva has come a long way since founders Amanda Niu and Ken Lau ‘humbly’ launched their start-up from a storage unit. In the eight years since the couple first released their award-winning mattress-in-a-box, they’ve grown the business to include designs for almost every room in your house. And now, you can also shop Eva’s extensive ranges in their brand-new Sydney showroom. The store is located inside a charming heritage building in Surry Hills, and feels more like a cosy, welcoming home than a traditional retail space. But co-founder Amanda Niu says that’s exactly what they were going for. ‘The concept [is to] make the furniture shine in its natural habitat — in other words the home,’ Amanda explains. She says the inspiration for Eva’s first Sydney location came after the success of their initial flagship Melbourne showroom, Eva Carlton House, which opened just last year. But it took plenty of patience before they finally found the right building where they’ve created their latest bricks-and-mortar store, Surry Hills House. And the inner-city neighbourhood’s rich cultural scene, complete with art galleries, cafes, and elegant period architecture, felt like a perfect fit. ‘We spent seven months searching for a space with history and heart, something heritage-protected, with character you can’t replicate,’ Amanda adds. ‘We’re drawn to spaces with a story, where we can honour the past while creating something new.’ With help from architects In Addition Studio, the showroom has become a perfect backdrop for Eva’s simple, yet, timeless designs. One area is laid out like a dreamy bedroom showcasing hero pieces like the Eva Timber Bed Frame, surrounded by the brand’s homewares. Browsing the products in real life also means you can also see how the Kin Dining Table and matching chairs look together, or try out the bestselling Slideaway Sofa Bed for yourself. Plus, as an embodiment of Eva’s no-fuss ethos, the store is kid and pet-friendly too so you can come shop with the whole family. Visit Eva’s Sydney store at 75 Fitzroy Street, Surry Hills, NSW now.",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2025/06/EvaSydneyShowroom-tdf-spons11-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003eMelbourne-based \u003ca href=\"https://eva.com.au/\" target=\"_blank\" rel=\"noopener\"\u003efurniture brand Eva\u003c/a\u003e has come a long way since founders Amanda Niu and Ken Lau ‘humbly’ launched their start-up from a storage unit.\u003c/h3\u003e\n\u003cp\u003eIn the eight years since the couple first released their award-winning mattress-in-a-box, they’ve grown the business to include designs for almost every room in your house. And now, you can also shop Eva’s extensive ranges in their brand-new Sydney showroom.\u003c/p\u003e\n\u003cp\u003eThe store is located inside a charming heritage building in Surry Hills, and feels more like a cosy, welcoming home than a traditional retail space. But co-founder Amanda Niu says that’s exactly what they were going for.\u003c/p\u003e\n\u003cp\u003e‘The concept [is to] make the furniture shine in its natural habitat — in other words the home,’ Amanda explains.\u003c/p\u003e\n\u003cp\u003eShe says the inspiration for Eva’s first Sydney location came after the success of their initial flagship Melbourne showroom, \u003ca href=\"https://eva.com.au/pages/carlton-house\" target=\"_blank\" rel=\"noopener\"\u003eEva Carlton House\u003c/a\u003e, which \u003ca href=\"https://thedesignfiles.wpenginepowered.com/2024/07/shopping-eva-carlton-house\" target=\"_blank\" rel=\"noopener\"\u003eopened just last year.\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eBut it took plenty of patience before they finally found the right building where they’ve created their latest bricks-and-mortar store, Surry Hills House.\u003c/p\u003e\n\u003cp\u003eAnd the inner-city neighbourhood’s rich cultural scene, complete with art galleries, cafes, and elegant period architecture, felt like a perfect fit.\u003c/p\u003e\n\u003cp\u003e‘We spent seven months searching for a space with history and heart, something heritage-protected, with character you can’t replicate,’ Amanda adds.\u003c/p\u003e\n\u003cp\u003e‘We’re drawn to spaces with a story, where we can honour the past while creating something new.’\u003c/p\u003e\n\u003cp\u003eWith help from architects \u003ca href=\"https://www.inaddition.studio/\" target=\"_blank\" rel=\"noopener\"\u003eIn Addition Studio\u003c/a\u003e, the showroom has become a perfect backdrop for Eva’s simple, yet, timeless designs. One area is laid out like a dreamy bedroom showcasing hero pieces like the \u003ca href=\"https://eva.com.au/products/eva-timber-bed-frame\" target=\"_blank\" rel=\"noopener\"\u003eEva Timber Bed Frame\u003c/a\u003e, surrounded by the brand’s homewares.\u003c/p\u003e\n\u003cp\u003eBrowsing the products in real life also means you can also see how the \u003ca href=\"https://eva.com.au/products/kin-dining-table\" target=\"_blank\" rel=\"noopener\"\u003eKin Dining Table\u003c/a\u003e and matching chairs look together, or try out the bestselling \u003ca href=\"https://eva.com.au/products/slideaway-sofa-bed\" target=\"_blank\" rel=\"noopener\"\u003eSlideaway Sofa Bed\u003c/a\u003e for yourself.\u003c/p\u003e\n\u003cp\u003ePlus, as an embodiment of Eva’s no-fuss ethos, the store is kid and pet-friendly too so you can come shop with the whole family.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003eVisit Eva’s Sydney store at 75 Fitzroy Street, Surry Hills, NSW now. \u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
