{
  "id": "7b0e2d81-016e-46b1-bc66-be1e05e88c2f",
  "title": "\"Transparency is omnipresent\" at Plan Plan's Brooklyn restaurant Nin Hao",
  "link": "https://www.dezeen.com/2024/12/07/nin-hao-chinese-restaurant-brooklyn-plan-plan/",
  "description": "Tall ceilings and large windows allow light to flood the interior of this Chinese restaurant in Brooklyn, designed by New York studio Plan Plan. Serving Fujianese cuisine to the Prospect Heights community, Nin Hao occupies a space with generous 16-foot-high (4.9-metre) ceilings and large glass curtain walls on its south and east facades. These expanses The post \"Transparency is omnipresent\" at Plan Plan's Brooklyn restaurant Nin Hao appeared first on Dezeen.",
  "author": "Dan Howarth",
  "published": "Sat, 07 Dec 2024 18:00:48 +0000",
  "source": "https://www.dezeen.com/interiors/feed/",
  "categories": [
    "Restaurants and bars",
    "all",
    "Interiors",
    "USA",
    "Restaurants",
    "Brooklyn",
    "New York City",
    "Chinese restaurants",
    "New York"
  ],
  "byline": "Dan Howarth",
  "length": 7765,
  "excerpt": "Tall ceilings and large windows allow light to flood the interior of this Chinese restaurant in Brooklyn, designed by New York studio Plan Plan.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Tall ceilings and large windows allow light to flood the interior of this Chinese restaurant in Brooklyn, designed by New York studio Plan Plan. Serving Fujianese cuisine to the Prospect Heights community, Nin Hao occupies a space with generous 16-foot-high (4.9-metre) ceilings and large glass curtain walls on its south and east facades. Plan Plan added translucent Austrian curtains over Nin Hao's large windows to soften the sunlight enteringThese expanses of glazing let in an abundance of sunlight, so \"the sense of transparency is omnipresent in this space\" according to Plan Plan. The studio, which was known as CLAS until this year, added translucent Austrian curtains to soften the harsh light entering. Concrete columns are left exposed and cement tiles are intended to mimic traditional Chinese bricks\"This filtered light, in turn, reflects off the polycarbonate-panelled wall on the opposite side, diffusing throughout the space and contributing to an atmosphere that feels airy, bright, and ever-changing,\" said the team. The layout is straightforward, with an open dining area facing the street filled with minimalist tables and pale wooden chairs. A large wall forms a canvas for a rotating series of artistsThis space is separated from the back-of-house area by a long bar that runs along a central axis beneath the polycarbonate panels. The counter front and other low partitions around the perimeter are wrapped in cement tiles designed to mimic traditional Chinese grey bricks. A long red table with matching stools encourages communal diningThick exposed concrete columns rise to a metal grid ceiling, lending the interior an industrial look, and a large wall is left intentionally blank so that it can provide a canvas for a rotating series of artists. Together, a spherical paper pendant, suspended linear fixtures, and cove lighting within the polycarbonate panels transform the restaurant into a glowing box at night, The bathrooms are lined with mosaics that depict famous paintings\"Opaque and translucent, rough and sleek, traditional and contemporary, a series of contrasting pairs in dialogue echoes Nin Hao's ethos, which embraces its cultural roots while embodying a contemporary spirit and a well to adventure,\" said Plan Plan. In the restaurant's two bathrooms, the studio took a different approach and modelled the spaces on iconic paintings. The first is enveloped in mosaic tiles to resemble Spring Morning in the Han Palace by Qiu Ying, while the other's custom mosaic depicts the Hudson River Valley from Fort Putnam by George Henry Boughton. One also features a two-way mirror that faces the dining area, \"heightening the sense of surprise and adventure in the restaurant\" according to Plan Plan. Polycarbonate panels installed over the bar reflect light during the day and softly glow at nightTo encourage interaction between guests, Plan Plan also included a green-topped circular table with a rotating tray for playing mahjong and a long red table with matching stools for communal dining. \"Nin Hao wants to be a welcoming place for the local communities and people with different cultural backgrounds,\" said the studio. \"With this spirit in mind, the dining space is also a canvas that invites engagement.\" The restaurant appears as a glowing box from the street after darkNew York City has no shortage of Chinese restaurants, and many have inventive and unexpected interiors that enhance the experience for diners. Examples include The Tang on the Upper West Side, which is lined with red herringbone brickwork, and nearby Atlas Kitchen where quirky illustrations line the walls. The photography is by Sean Davidson. Project credits: Interior design: Plan PlanSignage and graphic design: Yihuang Zhou, Yixuan CaoPlanting design: LivinFurniture fabrication: Big Sin Wood Subscribe to our newsletters Your email address New! Dezeen Agenda US Sent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events. New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_hero1-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2148045\" data-article-id=\"2148045\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_hero1.jpg\" id=\"preload-hero\"\u003e\n\t\t\n\n\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_hero1-852x479.jpg\" alt=\"Nin Hao by Plan Plan\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_hero1-852x479.jpg 1x, https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_hero1-1704x959.jpg 2x\" data-pin-nopin=\"true\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_hero1-852x479.jpg\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eTall ceilings and large windows allow light to flood the interior of this \u003ca href=\"https://www.dezeen.com/tag/chinese-restaurants\" target=\"_blank\" rel=\"noopener\"\u003eChinese restaurant\u003c/a\u003e in \u003ca href=\"https://www.dezeen.com/tag/brooklyn\"\u003eBrooklyn\u003c/a\u003e, designed by New York studio Plan Plan.\u003cspan id=\"more-2148045\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eServing Fujianese cuisine to the Prospect Heights community, \u003ca href=\"https://www.ninhaonyc.com/\" target=\"_blank\" rel=\"noopener\"\u003eNin Hao\u003c/a\u003e occupies a space with generous 16-foot-high (4.9-metre) ceilings and large glass curtain walls on its south and east facades.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2148066\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_4-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_4-852x1136.jpg\" alt=\"Restaurant with large windows covered with translucent Austrian curtains\" width=\"1773\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_4-852x1136.jpg 1x, https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_4-1704x2272.jpg 2x\" sizes=\"(max-width: 1773px) 100vw, 1773px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_4-852x1136.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2148066\"\u003ePlan Plan added translucent Austrian curtains over Nin Hao\u0026#39;s large windows to soften the sunlight entering\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThese expanses of glazing let in an abundance of sunlight, so \u0026#34;the sense of transparency is omnipresent in this space\u0026#34; according to \u003ca href=\"https://planplan.nyc/\" target=\"_blank\" rel=\"noopener\"\u003ePlan Plan\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThe studio, which was known as CLAS until this year, added translucent Austrian curtains to soften the harsh light entering.\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2148062\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_2-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_2-852x1136.jpg\" alt=\"Corner of a restaurant with a small table beside a concrete column\" width=\"1772\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_2-852x1136.jpg 1x, https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_2-1704x2273.jpg 2x\" sizes=\"(max-width: 1772px) 100vw, 1772px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_2-852x1136.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2148062\"\u003eConcrete columns are left exposed and cement tiles are intended to mimic traditional Chinese bricks\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;This filtered light, in turn, reflects off the polycarbonate-panelled wall on the opposite side, diffusing throughout the space and contributing to an atmosphere that feels airy, bright, and ever-changing,\u0026#34; said the team.\u003c/p\u003e\n\n\n\u003cp\u003eThe layout is straightforward, with an open dining area facing the street filled with minimalist tables and pale wooden chairs.\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2148068\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_5-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_5-852x1136.jpg\" alt=\"Restaurant with a large colourful mural across the back wall\" width=\"1773\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_5-852x1136.jpg 1x, https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_5-1704x2272.jpg 2x\" sizes=\"(max-width: 1773px) 100vw, 1773px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_5-852x1136.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2148068\"\u003eA large wall forms a canvas for a rotating series of artists\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThis space is separated from the back-of-house area by a long bar that runs along a central axis beneath the polycarbonate panels.\u003c/p\u003e\n\u003cp\u003eThe counter front and other low partitions around the perimeter are wrapped in cement tiles designed to mimic traditional Chinese grey bricks.\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2148070\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_6-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_6-852x1136.jpg\" alt=\"A long red tables with matching stools in front of glowing polycarbonate panels\" width=\"1773\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_6-852x1136.jpg 1x, https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_6-1704x2272.jpg 2x\" sizes=\"(max-width: 1773px) 100vw, 1773px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_6-852x1136.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2148070\"\u003eA long red table with matching stools encourages communal dining\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThick exposed concrete columns rise to a metal grid ceiling, lending the interior an industrial look, and a large wall is left intentionally blank so that it can provide a canvas for a rotating series of artists.\u003c/p\u003e\n\u003cp\u003eTogether, a spherical paper pendant, suspended linear fixtures, and cove lighting within the polycarbonate panels transform the restaurant into a glowing box at night,\u003c/p\u003e\n\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-2148080\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_11-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_11-852x1065.jpg\" alt=\"Bathroom lined with mosaic tiles, with a circular mirror over the basin\" width=\"1891\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_11-852x1065.jpg 1x, https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_11-1704x2130.jpg 2x\" sizes=\"(max-width: 1891px) 100vw, 1891px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_11-852x1065.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2148080\"\u003eThe bathrooms are lined with mosaics that depict famous paintings\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;Opaque and translucent, rough and sleek, traditional and contemporary, a series of contrasting pairs in dialogue echoes Nin Hao\u0026#39;s ethos, which embraces its cultural roots while embodying a contemporary spirit and a well to adventure,\u0026#34; said Plan Plan.\u003c/p\u003e\n\u003cp\u003eIn the restaurant\u0026#39;s two bathrooms, the studio took a different approach and modelled the spaces on iconic paintings.\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003eThe first is enveloped in mosaic tiles to resemble Spring Morning in the Han Palace by Qiu Ying, while the other\u0026#39;s custom mosaic depicts the Hudson River Valley from Fort Putnam by George Henry Boughton.\u003c/p\u003e\n\u003cp\u003eOne also features a two-way mirror that faces the dining area, \u0026#34;heightening the sense of surprise and adventure in the restaurant\u0026#34; according to Plan Plan.\u003c/p\u003e\n\u003cfigure id=\"preload-5\" aria-describedby=\"caption-attachment-2148072\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_7-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_7-852x1136.jpg\" alt=\"Bar counter with glowing polycarbonate panels overhead\" width=\"1774\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_7-852x1136.jpg 1x, https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_7-1704x2271.jpg 2x\" sizes=\"(max-width: 1774px) 100vw, 1774px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_7-852x1136.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2148072\"\u003ePolycarbonate panels installed over the bar reflect light during the day and softly glow at night\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eTo encourage interaction between guests, Plan Plan also included a green-topped circular table with a rotating tray for playing mahjong and a long red table with matching stools for communal dining.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Nin Hao wants to be a welcoming place for the local communities and people with different cultural backgrounds,\u0026#34; said the studio. \u0026#34;With this spirit in mind, the dining space is also a canvas that invites engagement.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-6\" aria-describedby=\"caption-attachment-2148087\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_15.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_15-852x628.jpg\" alt=\"Exterior of glass-wrapped restaurant glowing from inside\" width=\"2364\" height=\"1742\" srcset=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_15-852x628.jpg 1x, https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_15-1704x1256.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/12/nin-hao_plan-plan_dezeen_2364_col_15-852x628.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2148087\"\u003eThe restaurant appears as a glowing box from the street after dark\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eNew York City has no shortage of Chinese restaurants, and many have inventive and unexpected interiors that enhance the experience for diners.\u003c/p\u003e\n\u003cp\u003eExamples include \u003ca href=\"https://www.dezeen.com/2020/01/09/the-tang-new-practice-studio-new-york/\"\u003eThe Tang\u003c/a\u003e on the Upper West Side, which is lined with red herringbone brickwork, and nearby \u003ca href=\"https://www.dezeen.com/2019/01/12/atlas-kitchen-chinese-restaurant-new-practice-studio/\"\u003eAtlas Kitchen\u003c/a\u003e where quirky illustrations line the walls.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe photography is by \u003ca href=\"https://seandavidson.com/\" target=\"_blank\" rel=\"noopener\"\u003eSean Davidson\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cp\u003e\u003cstrong\u003eProject credits:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eInterior design:\u003c/strong\u003e Plan Plan\u003cbr/\u003e\u003cstrong\u003eSignage and graphic design:\u003c/strong\u003e Yihuang Zhou, Yixuan Cao\u003cbr/\u003e\u003cstrong\u003ePlanting design:\u003c/strong\u003e Livin\u003cbr/\u003e\u003cstrong\u003eFurniture fabrication:\u003c/strong\u003e Big Sin Wood\u003c/p\u003e\n\n                \n                \n                \n\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Agenda US\u003c/strong\u003e\n                \u003cp\u003eSent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#83f3f1eaf5e2e0fac3e7e6f9e6e6edade0ecee\"\u003e\u003cspan data-cfemail=\"bcccced5cadddfc5fcd8d9c6d9d9d292dfd3d1\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-12-07T18:00:48Z",
  "modifiedTime": "2024-12-07T03:42:09Z"
}
