{
  "id": "7ff883cb-a979-4bde-b2b3-cd01f1fac0d7",
  "title": "Eight homes with stylish shelves for book lovers",
  "link": "https://www.dezeen.com/2025/01/26/homes-stylish-bookshelves-lookbooks/",
  "description": "For our latest lookbook, we've gathered eight interiors where bookshelves and bookcases were used to create elegant storage solutions, ranging from a study in Berlin to a pied-à-terre in Mayfair, London. Not everyone has the space for a library, but adding bookshelves to a home – whether it's just for storing books or to also The post Eight homes with stylish shelves for book lovers appeared first on Dezeen.",
  "author": "Cajsa Carlson",
  "published": "Sun, 26 Jan 2025 10:00:04 +0000",
  "source": "https://www.dezeen.com/interiors/feed/",
  "categories": [
    "all",
    "Interiors",
    "Lookbooks",
    "Books",
    "Bookcases",
    "Roundups",
    "Residential architecture and interiors"
  ],
  "byline": "Cajsa Carlson",
  "length": 8543,
  "excerpt": "We've gathered eight interiors where bookshelves and bookcases were used to create elegant storage solutions, including a pied-à-terre in Mayfair, London.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "For our latest lookbook, we've gathered eight interiors where bookshelves and bookcases were used to create elegant storage solutions, ranging from a study in Berlin to a pied-à-terre in Mayfair, London. Not everyone has the space for a library, but adding bookshelves to a home – whether it's just for storing books or to also display artworks and sculptures – is an easy way to help create cosy, creative interiors. The bookshelves in this lookbook range from simple, low shelves that run along the floor to tall floor-to-ceiling book walls. This is the latest in our lookbooks series, which provides visual inspiration from Dezeen's archive. For more inspiration, see previous lookbooks featuring kitchens with splashes of blue, self-designed studio interiors and interiors with earthy finishes. Photo by Helen CathcartBelgravia townhouse, UK, by Child Studio A five-metre-tall, floor-to-ceiling bookcase made out of mahogany wood forms a striking backdrop in this home in Belgravia, London. Designed for an art collector and informed by late fashion designer Karl Lagerfeld's bookshelves in his Parisian studio, the roomy shelves hold a variety of art books and other titles. Find out more about the Belgravia townhouse › Photo by Fabian MartinezMérida home, Mexico, by Marc Perrotta Architect Marc Perrotta renovated this traditional home in Mérida, Mexico, which now has an office and dining room at the front. Here, a low wooden bookshelf curves around three walls and holds both books, paintings and photos. Its dark wood matches the dining room table and looks striking against the colourful tiled floor. Find out more about the Mérida home › Photo by Joe FletcherClear Oak Residence, Australia, by Woods + Dangaran This renovation of a mid-century modern house that once belonged to singer Bing Crosby's manager features teak wood, travertine stone and expansive glazing. The mid-century modern feel is underlined by the floating bookshelves that sit against wooden panelling in the living room and showcase books, sculptures and green plants. Find out more about Clear Oak Residence › Photo by Seth CaplanDumbo loft renovation, US, by Crystal Sinclair Designs Books peep out from their shelves on the mezzanine floor of this flat in Dumbo, Brooklyn, which also features a bedroom behind a glass partition. The L-shaped mezzanine floor was designed to hold the client's book collection, which is displayed in a library that covers almost the entire wall. The mezzanine, which is accessed by a ladder, also has a cosy chair for relaxed reading sessions. Find out more about Dumbo loft renovation › Photo by Robert RiegerBerlin apartment, Germany, by Gisbert Pöppler Interior design studio Gisbert Pöppler was given a lot of freedom to renovate this apartment in a glass pavilion on the roof of a 1930s residential building in the borough of Mitte, Berlin. In the study, dark teak walls are contrasted with pale, sage-green bookcases and a desk in the same hue. The practical shelving makes the space look both well-organised and stylish. Find out more about the Berlin apartment › Photo by Salva LópezCasa Vasto, Spain, by Mesura A white low-slung bookshelf sits close to the floor in Casa Vasto, which local studio Mesura designed in Barcelona. The space, which also functions as an art gallery, is located in a former factory. The bookshelf is flanked by other low-lying furnishings, including a comfy sofa, which underline the height of the space and its unique sculptural ceiling. Find out more about Casa Vasto › Photo by Felix Speller and Child StudioMayfair pied-à-terre, UK, by Child Studio Child Studio, which also designed the Belgravia townhouse in this article, had previously created a tall bookcase for this Mayfair home. The bookcase's ribbed dark wood is contrasted by veiny marble, which creates a luxurious patterned backdrop against the books and sculptures on display. Find out more about the Mayfair pied-à-terre › Photo by Peter BennettsWest Bend House, Australia, by Brand New Eco In the study of this Melbourne home, full-height timber bookshelves provide space for the family's books and are matched with a shelf in the same material displaying sculptures and toys. Local studio Brave New Eco used red bricks for the flooring, adding a tactile, rustic feel to the room. Find out more about West Bend House › This is the latest in our lookbooks series, which provides visual inspiration from Dezeen's archive. For more inspiration, see previous lookbooks featuring kitchens with splashes of blue, self-designed studio interiors and interiors with earthy finishes. Subscribe to our newsletters Your email address New! Dezeen Agenda US Sent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events. New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2025/01/mesura-vasto-gallery-apartment_dezeen_2364_col_hero.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2163826\" data-article-id=\"2163826\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/mesura-vasto-gallery-apartment_dezeen_2364_col_hero.jpg\" id=\"preload-hero\"\u003e\n\t\t\u003cimg width=\"852\" height=\"480\" src=\"https://static.dezeen.com/uploads/2025/01/mesura-vasto-gallery-apartment_dezeen_2364_col_hero-852x480.jpg\" alt=\"Gallery-like home in Barcelona\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2025/01/mesura-vasto-gallery-apartment_dezeen_2364_col_hero-852x480.jpg 1x, https://static.dezeen.com/uploads/2025/01/mesura-vasto-gallery-apartment_dezeen_2364_col_hero.jpg 2x\" data-pin-nopin=\"true\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eFor our latest \u003ca href=\"https://www.dezeen.com/lookbooks/\"\u003elookbook\u003c/a\u003e, we\u0026#39;ve gathered eight interiors where bookshelves and \u003ca href=\"https://www.dezeen.com/tag/bookcases/\"\u003ebookcases\u003c/a\u003e were used to create elegant storage solutions, ranging from a study in \u003ca href=\"https://www.dezeen.com/tag/berlin/\"\u003eBerlin\u003c/a\u003e to a pied-à-terre in \u003ca href=\"https://www.dezeen.com/tag/mayfair/\"\u003eMayfair\u003c/a\u003e, London.\u003cspan id=\"more-2163826\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eNot everyone has the space for a library, but adding bookshelves to a home – whether it\u0026#39;s just for storing books or to also display artworks and sculptures – is an easy way to help create cosy, creative interiors.\u003c/p\u003e\n\u003cp\u003eThe bookshelves in this lookbook range from simple, low shelves that run along the floor to tall floor-to-ceiling book walls.\u003c/p\u003e\n\u003cp\u003eThis is the latest in our lookbooks series, which provides visual inspiration from Dezeen\u0026#39;s archive. For more inspiration, see previous lookbooks featuring \u003ca href=\"https://www.dezeen.com/2025/01/19/kitchens-blue-splashes-lookbooks/\"\u003ekitchens with splashes of blue\u003c/a\u003e, \u003ca href=\"https://www.dezeen.com/2025/01/18/self-designed-studio-interiors-lookbook/\"\u003eself-designed studio interiors\u003c/a\u003e and \u003ca href=\"https://www.dezeen.com/2025/01/12/earthy-renders-plaster-walls-lookbooks/\"\u003einteriors with earthy finishes\u003c/a\u003e.\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2163328\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/child-studio-belgravia-townhouse_dezeen_2364_col_3-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003ca href=\"https://www.dezeen.com/2025/01/23/child-studio-belgravia-townhouse-modernist-villas/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/child-studio-belgravia-townhouse_dezeen_2364_col_3-852x1278.jpg\" alt=\"Detail of wooden bookshelf\" width=\"1576\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2025/01/child-studio-belgravia-townhouse_dezeen_2364_col_3-852x1278.jpg 1x, https://static.dezeen.com/uploads/2025/01/child-studio-belgravia-townhouse_dezeen_2364_col_3-1704x2556.jpg 2x\" sizes=\"(max-width: 1576px) 100vw, 1576px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2163328\"\u003ePhoto by Helen Cathcart\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2025/01/23/child-studio-belgravia-townhouse-modernist-villas/\"\u003e\u003cstrong\u003eBelgravia townhouse, UK, by Child Studio\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\u003cp\u003eA five-metre-tall, floor-to-ceiling bookcase made out of mahogany \u003ca href=\"https://www.dezeen.com/tag/wood/\"\u003ewood\u003c/a\u003e forms a striking backdrop in this home in Belgravia, London.\u003c/p\u003e\n\u003cp\u003eDesigned for an art collector and informed by late fashion designer \u003ca href=\"https://www.dezeen.com/tag/karl-lagerfeld/\"\u003eKarl Lagerfeld\u003c/a\u003e\u0026#39;s bookshelves in his Parisian studio, the roomy shelves hold a variety of art books and other titles.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2025/01/23/child-studio-belgravia-townhouse-modernist-villas/\"\u003e\u003cem\u003eFind out more about the Belgravia townhouse ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-1855116\" data-lightboximage=\"https://static.dezeen.com/uploads/2022/10/casa-san-cristobal-marc-perrotta-architecture_dezeen_2364_col_10-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003ca href=\"https://www.dezeen.com/2022/10/18/marc-perrotta-merida-home-courtyard-extension/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2022/10/casa-san-cristobal-marc-perrotta-architecture_dezeen_2364_col_10-852x1069.jpg\" alt=\"merida dining room\" width=\"1885\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2022/10/casa-san-cristobal-marc-perrotta-architecture_dezeen_2364_col_10-852x1069.jpg 1x, https://static.dezeen.com/uploads/2022/10/casa-san-cristobal-marc-perrotta-architecture_dezeen_2364_col_10-1704x2137.jpg 2x\" sizes=\"(max-width: 1885px) 100vw, 1885px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-1855116\"\u003ePhoto by Fabian Martinez\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.dezeen.com/2022/10/18/marc-perrotta-merida-home-courtyard-extension/\"\u003eMérida home, Mexico, by Marc Perrotta\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eArchitect Marc Perrotta renovated this traditional home in \u003ca href=\"https://www.dezeen.com/tag/merida/\"\u003eMérida\u003c/a\u003e, Mexico, which now has an office and dining room at the front.\u003c/p\u003e\n\u003cp\u003eHere, a low wooden bookshelf curves around three walls and holds both books, paintings and photos. Its dark wood matches the dining room table and looks striking against the colourful \u003ca href=\"https://www.dezeen.com/showroom/surfaces/tiles/\"\u003etiled\u003c/a\u003e floor.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2022/10/18/marc-perrotta-merida-home-courtyard-extension/\"\u003e\u003cem\u003eFind out more about the Mérida home ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-1854220\" data-lightboximage=\"https://static.dezeen.com/uploads/2022/10/clear-oak-residence-wood-dangaran_dezeen_2364_col_12-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003ca href=\"https://www.dezeen.com/2022/10/18/clear-oak-residence-woods-dangaran-mid-century-modern-renovation/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2022/10/clear-oak-residence-wood-dangaran_dezeen_2364_col_12-852x1136.jpg\" alt=\"Teak joinery in Clear Oak Residence by Woods + Dangaran\" width=\"1773\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2022/10/clear-oak-residence-wood-dangaran_dezeen_2364_col_12-852x1136.jpg 1x, https://static.dezeen.com/uploads/2022/10/clear-oak-residence-wood-dangaran_dezeen_2364_col_12-1704x2272.jpg 2x\" sizes=\"(max-width: 1773px) 100vw, 1773px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-1854220\"\u003ePhoto by Joe Fletcher\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2022/10/18/clear-oak-residence-woods-dangaran-mid-century-modern-renovation/\"\u003e\u003cstrong\u003eClear Oak Residence, Australia, by Woods + Dangaran\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThis renovation of a \u003ca href=\"https://www.dezeen.com/tag/mid-century-renovations/\"\u003emid-century modern\u003c/a\u003e house that once belonged to singer Bing Crosby\u0026#39;s manager features teak wood, travertine stone and expansive glazing.\u003c/p\u003e\n\u003cp\u003eThe mid-century modern feel is underlined by the floating bookshelves that sit against wooden panelling in the \u003ca href=\"https://www.dezeen.com/tag/living-rooms/\"\u003eliving room\u003c/a\u003e and showcase books, sculptures and green plants.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2022/10/18/clear-oak-residence-woods-dangaran-mid-century-modern-renovation/\"\u003e\u003cem\u003eFind out more about Clear Oak Residence ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-1883704\" data-lightboximage=\"https://static.dezeen.com/uploads/2023/01/dumbo-loft_crystal-sinclair-designs_dezeen_2364_col_0-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003ca href=\"https://www.dezeen.com/2023/01/14/dumbo-loft-renovation-crystal-sinclair-designs/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2023/01/dumbo-loft_crystal-sinclair-designs_dezeen_2364_col_0-852x1066.jpg\" alt=\"Dumbo loft with mezzanine\" width=\"1890\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2023/01/dumbo-loft_crystal-sinclair-designs_dezeen_2364_col_0-852x1066.jpg 1x, https://static.dezeen.com/uploads/2023/01/dumbo-loft_crystal-sinclair-designs_dezeen_2364_col_0-1704x2131.jpg 2x\" sizes=\"(max-width: 1890px) 100vw, 1890px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-1883704\"\u003ePhoto by Seth Caplan\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2023/01/14/dumbo-loft-renovation-crystal-sinclair-designs/\"\u003e\u003cstrong\u003eDumbo loft renovation, US, by Crystal Sinclair Designs\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eBooks peep out from their shelves on the \u003ca href=\"https://www.dezeen.com/tag/mezzanines/\"\u003emezzanine\u003c/a\u003e floor of this flat in \u003ca href=\"https://www.dezeen.com/tag/dumbo/\"\u003eDumbo\u003c/a\u003e, Brooklyn, which also features a bedroom behind a glass partition.\u003c/p\u003e\n\u003cp\u003eThe L-shaped mezzanine floor was designed to hold the client\u0026#39;s book collection, which is displayed in a library that covers almost the entire wall. The mezzanine, which is accessed by a ladder, also has a cosy chair for relaxed reading sessions.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2023/01/14/dumbo-loft-renovation-crystal-sinclair-designs/\"\u003e\u003cem\u003eFind out more about Dumbo loft renovation ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-1765282\" data-lightboximage=\"https://static.dezeen.com/uploads/2022/02/berlin-apartment-interiors-bespoke-gisbert-poppler-_dezeen_1704_col_20.jpg\" data-orientation=\"portrait\"\u003e\u003ca href=\"https://www.dezeen.com/2022/02/08/gisbert-poppler-berlin-apartment-interiors/#/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2022/02/berlin-apartment-interiors-bespoke-gisbert-poppler-_dezeen_1704_col_20-852x1136.jpg\" alt=\"Study inside Berlin apartment designed by Gisbert Poppler\" width=\"1704\" height=\"2272\" srcset=\"https://static.dezeen.com/uploads/2022/02/berlin-apartment-interiors-bespoke-gisbert-poppler-_dezeen_1704_col_20-852x1136.jpg 1x, https://static.dezeen.com/uploads/2022/02/berlin-apartment-interiors-bespoke-gisbert-poppler-_dezeen_1704_col_20.jpg 2x\" sizes=\"(max-width: 1704px) 100vw, 1704px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-1765282\"\u003ePhoto by Robert Rieger\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2022/02/08/gisbert-poppler-berlin-apartment-interiors/\"\u003e\u003cstrong\u003eBerlin apartment, Germany, by Gisbert Pöppler\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eInterior design studio \u003ca href=\"https://www.dezeen.com/tag/gisbert-poeppler/\"\u003eGisbert Pöppler\u003c/a\u003e was given a lot of freedom to renovate this apartment in a glass pavilion on the roof of a 1930s residential building in the borough of Mitte, Berlin.\u003c/p\u003e\n\u003cp\u003eIn the study, dark \u003ca href=\"https://www.dezeen.com/tag/teak/\"\u003eteak\u003c/a\u003e walls are contrasted with pale, sage-green bookcases and a desk in the same hue. The practical shelving makes the space look both well-organised and stylish.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2022/02/08/gisbert-poppler-berlin-apartment-interiors/\"\u003e\u003cem\u003eFind out more about the Berlin apartment ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-5\" aria-describedby=\"caption-attachment-1977929\" data-lightboximage=\"https://static.dezeen.com/uploads/2023/09/mesura-vasto-gallery-apartment_dezeen_2364_col_5-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003ca href=\"https://www.dezeen.com/2023/09/20/mesura-residential-art-gallery-casa-vasto-barcelona/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2023/09/mesura-vasto-gallery-apartment_dezeen_2364_col_5-852x1136.jpg\" alt=\"Vasto gallery by Mesura apartment interior\" width=\"1773\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2023/09/mesura-vasto-gallery-apartment_dezeen_2364_col_5-852x1136.jpg 1x, https://static.dezeen.com/uploads/2023/09/mesura-vasto-gallery-apartment_dezeen_2364_col_5-1704x2272.jpg 2x\" sizes=\"(max-width: 1773px) 100vw, 1773px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-1977929\"\u003ePhoto by Salva López\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2023/09/20/mesura-residential-art-gallery-casa-vasto-barcelona/\"\u003e\u003cstrong\u003eCasa Vasto, Spain, by Mesura\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eA white low-slung bookshelf sits close to the floor in Casa Vasto, which local studio \u003ca href=\"https://www.dezeen.com/tag/architecture-by-mesura/\"\u003eMesura\u003c/a\u003e designed in Barcelona. The space, which also functions as an art gallery, is located in a former \u003ca href=\"https://www.dezeen.com/tag/factories/\"\u003efactory\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThe bookshelf is flanked by other low-lying furnishings, including a comfy sofa, which underline the height of the space and its unique sculptural ceiling.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2023/09/20/mesura-residential-art-gallery-casa-vasto-barcelona/\"\u003e\u003cem\u003eFind out more about Casa Vasto ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-6\" aria-describedby=\"caption-attachment-1903305\" data-lightboximage=\"https://static.dezeen.com/uploads/2023/03/mayfair-residence-by-child-studio-london_dezeen_2364_col_13-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003ca href=\"https://www.dezeen.com/2023/03/07/child-studio-mayfair-home-mid-century-modern/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2023/03/mayfair-residence-by-child-studio-london_dezeen_2364_col_13-852x1277.jpg\" alt=\"Charlotte Perriand chairs in Mayfair dining room\" width=\"1577\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2023/03/mayfair-residence-by-child-studio-london_dezeen_2364_col_13-852x1277.jpg 1x, https://static.dezeen.com/uploads/2023/03/mayfair-residence-by-child-studio-london_dezeen_2364_col_13-1704x2555.jpg 2x\" sizes=\"(max-width: 1577px) 100vw, 1577px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-1903305\"\u003ePhoto by Felix Speller and Child Studio\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2023/03/07/child-studio-mayfair-home-mid-century-modern/\"\u003e\u003cstrong\u003eMayfair pied-à-terre, UK, by Child Studio\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/tag/child-studio/\"\u003eChild Studio\u003c/a\u003e, which also designed the Belgravia townhouse in this article, had previously created a tall bookcase for this Mayfair home.\u003c/p\u003e\n\u003cp\u003eThe bookcase\u0026#39;s ribbed dark wood is contrasted by veiny \u003ca href=\"https://www.dezeen.com/tag/marble/\"\u003emarble\u003c/a\u003e, which creates a luxurious patterned backdrop against the books and sculptures on display.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2023/03/07/child-studio-mayfair-home-mid-century-modern/\"\u003e\u003cem\u003eFind out more about the Mayfair pied-à-terre ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cfigure id=\"preload-7\" aria-describedby=\"caption-attachment-1865260\" data-lightboximage=\"https://static.dezeen.com/uploads/2022/11/west-bend-house-interiors-melbourne-brave-new-eco_dezeen_1704_col_1-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003ca href=\"https://www.dezeen.com/2022/11/15/brave-new-eco-west-bend-house-interiors/\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2022/11/west-bend-house-interiors-melbourne-brave-new-eco_dezeen_1704_col_1-852x1193.jpg\" alt=\"West Bend House in Melbourne, designed by Brave New Eco\" width=\"1689\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2022/11/west-bend-house-interiors-melbourne-brave-new-eco_dezeen_1704_col_1-852x1193.jpg 1x, https://static.dezeen.com/uploads/2022/11/west-bend-house-interiors-melbourne-brave-new-eco_dezeen_1704_col_1-scaled.jpg 2x\" sizes=\"(max-width: 1689px) 100vw, 1689px\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-1865260\"\u003ePhoto by Peter Bennetts\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.dezeen.com/2022/11/15/brave-new-eco-west-bend-house-interiors/\"\u003eWest Bend House, Australia, by Brand New Eco\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn the study of this \u003ca href=\"https://www.dezeen.com/tag/melbourne/\"\u003eMelbourne\u003c/a\u003e home, full-height timber bookshelves provide space for the family\u0026#39;s books and are matched with a shelf in the same material displaying sculptures and toys.\u003c/p\u003e\n\u003cp\u003eLocal studio Brave New Eco used red \u003ca href=\"https://www.dezeen.com/tag/bricks/\"\u003ebricks\u003c/a\u003e for the flooring, adding a tactile, rustic feel to the room.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.dezeen.com/2022/11/15/brave-new-eco-west-bend-house-interiors/\"\u003e\u003cem\u003eFind out more about West Bend House ›\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis is the latest in our lookbooks series, which provides visual inspiration from Dezeen\u0026#39;s archive. For more inspiration, see previous lookbooks featuring \u003ca href=\"https://www.dezeen.com/2025/01/19/kitchens-blue-splashes-lookbooks/\"\u003ekitchens with splashes of blue\u003c/a\u003e, \u003ca href=\"https://www.dezeen.com/2025/01/18/self-designed-studio-interiors-lookbook/\"\u003eself-designed studio interiors\u003c/a\u003e and \u003ca href=\"https://www.dezeen.com/2025/01/12/earthy-renders-plaster-walls-lookbooks/\"\u003einteriors with earthy finishes\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\n                \n                \n                \n\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Agenda US\u003c/strong\u003e\n                \u003cp\u003eSent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#2b5b59425d4a48526b4f4e514e4e4505484446\"\u003e\u003cspan data-cfemail=\"0e7e7c67786f6d774e6a6b746b6b60206d6163\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-01-26T10:00:04Z",
  "modifiedTime": "2025-01-24T20:39:09Z"
}
