{
  "id": "a121c7d0-7214-44f4-872b-e6f4849a3575",
  "title": "A Relaxed Suburban Garden With A Palm Springs Vibe",
  "link": "https://thedesignfiles.wpenginepowered.com/2025/06/gardens-frankston-love-of-green/",
  "description": "Melbourne’s outer suburbs is a far cry from Palm Springs, but that didn’t stop Love Of Green channelling details from the Californian desert city in this Frankston South garden. The retro-inspired landscaping is now the perfect counterpart to a charming mid-century modern home, complete with cacti and soft white pebbles underfoot.",
  "author": "The Design Files",
  "published": "Mon, 02 Jun 2025 04:00:34 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 1932,
  "excerpt": "Melbourne's outer suburbs are a long way from Palm Springs, but this lush garden has a refreshing retro personality.",
  "siteName": "",
  "favicon": "",
  "text": "Located in Frankston South, this garden was heavily influenced by the era of its accompanying mid-century modern house. The compact home was ‘all straight lines’, with a flat roof, stack bond brickwork, and plenty of retro personality — something Love of Green garden designer Lucy Bennett wanted to bring into the landscaping too. ‘The original garden was very sad and unloved, but there were some wonderful feature trees… including an amazing, established yucca (the largest I’ve ever seen) so I wanted that to remain as a feature as it suits the era of the property,’ Lucy says. This set the tone for both the material palette and resulting planting scheme. A feature wall of graphic tiles stretches out alongside an outdoor dining area, where grass meets steel edges, curved garden beds, and masses of white pebbles. ‘My client never wears shoes, and the [pebble mix] is soft underfoot, reflecting a lovely light in the garden,’ Lucy adds. In addition to planting three more Lagerstroemia indica ‘Natchez’ (white crepe myrtle) trees, the works created a new full border made up of Eucalyptus cinerea (silver dollar tree) that gives the client the privacy required from the busy street. ‘The silver, circular leaves reflect the light back into the garden and it wonderful for cutting for vases,’ she says. ‘I also love the San Pedro cactus along the western wall of the house — it adds to the “Palm Springs vibe.”‘ It stands in front of a wall of Parthenocissus tricuspidata (Boston ivy), providing a spectacular contrast when the leaves change in autumn. Other key plants were also selected for their colour. Euphorbia Wulfenii (Mediterranean spurge) brings a hint of line green; Salvia leucantha (Mexican sage) offers vibrant purple flowers; while silver and blues come through in succulents like Cotyledon orbiculata (Silver waves) and Curio repens (blue chalk sticks). ‘It’s a fun colour palette for a fun garden!’ Lucy says.",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2025/05/frankston-tdf-gardens-thv-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003eLocated in Frankston South, this garden was heavily influenced by the era of its accompanying mid-century modern house.\u003c/h3\u003e\n\u003cp\u003eThe compact home was ‘all straight lines’, with a flat roof, stack bond brickwork, and plenty of retro personality — something \u003ca href=\"https://www.instagram.com/_loveofgreen_/\" target=\"_blank\" rel=\"noopener\"\u003eLove of Green\u003c/a\u003e garden designer Lucy Bennett wanted to bring into the landscaping too.\u003c/p\u003e\n\u003cp\u003e‘The original garden was very sad and unloved, but there were some wonderful feature trees… including an amazing, established yucca (the largest I’ve ever seen) so I wanted that to remain as a feature as it suits the era of the property,’ Lucy says.\u003c/p\u003e\n\u003cp\u003eThis set the tone for both the material palette and resulting planting scheme. A feature wall of graphic tiles stretches out alongside an outdoor dining area, where grass meets steel edges, curved garden beds, and masses of white pebbles.\u003c/p\u003e\n\u003cp\u003e‘My client never wears shoes, and the [pebble mix] is soft underfoot, reflecting a lovely light in the garden,’ Lucy adds.\u003c/p\u003e\n\u003cp\u003eIn addition to planting three more \u003cem\u003eLagerstroemia indica ‘Natchez’\u003c/em\u003e (white crepe myrtle) trees, the works created a new full border made up of \u003cem\u003eEucalyptus cinerea\u003c/em\u003e (silver dollar tree) that gives the client the privacy required from the busy street.\u003c/p\u003e\n\u003cp\u003e‘The silver, circular leaves reflect the light back into the garden and it wonderful for cutting for vases,’ she says.\u003c/p\u003e\n\u003cp\u003e‘I also love the San Pedro cactus along the western wall of the house — it adds to the “Palm Springs vibe.”‘\u003c/p\u003e\n\u003cp\u003eIt stands in front of a wall of \u003cem\u003eParthenocissus tricuspidata\u003c/em\u003e (Boston ivy), providing a spectacular contrast when the leaves change in autumn.\u003c/p\u003e\n\u003cp\u003eOther key plants were also selected for their colour. \u003cem\u003eEuphorbia Wulfenii\u003c/em\u003e (Mediterranean spurge) brings a hint of line green; Salvia leucantha (Mexican sage) offers vibrant purple flowers; while silver and blues come through in succulents like Cotyledon orbiculata (Silver waves) and \u003cem\u003eCurio repens\u003c/em\u003e (blue chalk sticks).\u003c/p\u003e\n\u003cp\u003e‘It’s a fun colour palette for a fun garden!’ Lucy says.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
