{
  "id": "adf51e7b-72e1-4dba-8034-bd88c5832d5b",
  "title": "A Restored Mid-Century Townhouse With Lush Views At Every Turn",
  "link": "https://thedesignfiles.wpenginepowered.com/2025/01/architecture-sorrett-ave-pleysierperkins-eckersley/",
  "description": "This Graeme Gunn-designed home is an enduring example of the mid-century modern housing that’s so prevalent  throughout Melbourne’s suburbs. Originally built by Merchant Builders in 1967 as part of a townhouse development in Malvern, this textural townhouse was more recently masterfully restored by architects Pleysier Perkins and Eckersley Garden Architecture. Together, the two have celebrated the home’s architectural legacy and revived its enchanting garden outlooks, without losing any of its original charm.",
  "author": "The Design Files",
  "published": "Sun, 19 Jan 2025 19:00:27 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 2785,
  "excerpt": "Designed by Graeme Gunn and built by Merchant Builders, this Melbourne townhouse has been masterfully preserved for the next generation.",
  "siteName": "",
  "favicon": "",
  "text": "This mid-century modern townhouse and its gardens have both been carefully restored, but the beauty is, you can hardly tell. The Malvern residence is part of a development designed by acclaimed architect Graeme Gunn and was built by Merchant Builders in 1967 — two names who helped shape much of Melbourne’s architectural landscape across the ’60 and ’70s. So when the current owners bought the house in 2015, they were eager to preserve this legacy, engaging Pleysier Perkins and Eckersley Garden Architecture for an especially sympathetic renovation. ‘The house was in almost original condition, with all surfaces and wet areas showing typical signs of wear and tear,’ principal Ramon Pleysier says. ‘Our vision was to move through each area without placing our stamp on it! I don’t see these projects as a time for fleshing out our own design theories, more a time to repair and make good,’ he adds. ‘The best outcome would be for someone to ask: “So what did you actually do?”’ In fact, most of the works were focused on repairing the existing building fabric, replacing the cork floors ‘like for like’, the timber work and repairing dampness. The floorplan remains virtually unchanged, other than the addition of a laundry zone and a recessed workstation with views into the garden — which was an equally important part of the restoration. Because not only is Graeme Gunn lauded for his originality and materiality, but his approach to designing homes that embrace the landscape. Eckersley Garden Architecture director and principal Scott Leung says the architecture was the primary inspiration behind the planting selection, ensuring nothing was ‘dominant’ enough to take away from the building itself. In an update of the ‘tired’ looking entry garden, they planted Tetrapanax papyrifera (rice paper plant) to create an inviting canopy of foliage overhead with textural plants below. ‘The crazy paving really speaks to mid-century architecture, and the layers of lush green plants that flank the path create a sense of magic as you approach the front door,’ Scott says. The backyard on the other hand reveals ‘an usual shape’ with a split-level due to the jigsaw nature of the townhouse blocks. A set of steps connect the elevated stretch of lawn to a sunken entertaining zone, while renewed greenery borders the entire house, providing serene views from almost every window, in every room. ‘It’s a seasonal garden with lots of flowers through the spring and summer, and deciduous colour in autumn,’ Scott adds. Eight years since the project was completed, Ramon says he’s proud that the works still look timeless, respectful, and good as new. ‘Nothing has dated and I feel confident that the original architect and builder would be happy that we haven’t ruined their fine work!’",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2025/01/SorretAve-tdf-homes3-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003eThis mid-century modern townhouse and its gardens have both been carefully restored, but the beauty is, you can hardly tell.\u003c/h3\u003e\n\u003cp\u003eThe Malvern residence is part of a development designed by acclaimed architect Graeme Gunn and was built by Merchant Builders in 1967 — two names who helped shape much of Melbourne’s architectural landscape across the ’60 and ’70s.\u003c/p\u003e\n\u003cp\u003eSo when the current owners bought the house in 2015, they were eager to preserve this legacy, engaging \u003ca href=\"https://www.pleysierperkins.com/\" target=\"_blank\" rel=\"noopener\"\u003ePleysier Perkins\u003c/a\u003e and \u003ca href=\"https://e-ga.com.au/\" target=\"_blank\" rel=\"noopener\"\u003eEckersley Garden Architecture\u003c/a\u003e for an especially sympathetic renovation.\u003c/p\u003e\n\u003cp\u003e‘The house was in almost original condition, with all surfaces and wet areas showing typical signs of wear and tear,’ principal Ramon Pleysier says.\u003c/p\u003e\n\u003cp\u003e‘Our vision was to move through each area \u003cem\u003ewithout\u003c/em\u003e placing our stamp on it! I don’t see these projects as a time for fleshing out our own design theories, more a time to repair and make good,’ he adds.\u003c/p\u003e\n\u003cp\u003e‘The best outcome would be for someone to ask: “So what did you actually do?”’\u003c/p\u003e\n\u003cp\u003eIn fact, most of the works were focused on repairing the existing building fabric, replacing the cork floors ‘like for like’, the timber work and repairing dampness.\u003c/p\u003e\n\u003cp\u003eThe floorplan remains virtually unchanged, other than the addition of a laundry zone and a recessed workstation with views into the garden — which was an equally important part of the restoration. Because not only is Graeme Gunn lauded for his originality and materiality, but his approach to designing homes that embrace the landscape.\u003c/p\u003e\n\u003cp\u003eEckersley Garden Architecture director and principal Scott Leung says the architecture was the primary inspiration behind the planting selection, ensuring nothing was ‘dominant’ enough to take away from the building itself.\u003c/p\u003e\n\u003cp\u003eIn an update of the ‘tired’ looking entry garden, they planted \u003cem\u003eTetrapanax papyrifera\u003c/em\u003e (rice paper plant) to create an inviting canopy of foliage overhead with textural plants below.\u003c/p\u003e\n\u003cp\u003e‘The crazy paving really speaks to mid-century architecture, and the layers of lush green plants that flank the path create a sense of magic as you approach the front door,’ Scott says.\u003c/p\u003e\n\u003cp\u003eThe backyard on the other hand reveals ‘an usual shape’ with a split-level due to the jigsaw nature of the townhouse blocks. A set of steps connect the elevated stretch of lawn to a sunken entertaining zone, while renewed greenery borders the entire house, providing serene views from almost every window, in every room.\u003c/p\u003e\n\u003cp\u003e‘It’s a seasonal garden with lots of flowers through the spring and summer, and deciduous colour in autumn,’ Scott adds.\u003c/p\u003e\n\u003cp\u003eEight years since the project was completed, Ramon says he’s proud that the works still look timeless, respectful, and good as new. ‘Nothing has dated and I feel confident that the original architect and builder would be happy that we haven’t ruined their fine work!’\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
