{
  "id": "c403237f-f8b2-4517-abb2-97e408a35fb4",
  "title": "Style Scouting: Vol. 224",
  "link": "https://inmyownstyle.com/style-scouting-vol-224.html",
  "description": "This post is from the blog, InMyOwnStyle.com Thanks for stopping by for this week’s Style Scouting. My Sunday post where I share the random stuff that captured my attention or inspired me that I found online. I have had a very productive week. Ed and I spent most of the week getting the ceiling in the studioffice redone. We... If you enjoyed this post you may also enjoy the easy to follow DIY Decorating Tutorials and Creative Ideas on my blog, In My Own Style.com Republishing this article in full or in part is a violation of Copyright law @2009-2021, all rights reserved",
  "author": "Diane Henkler",
  "published": "Sun, 12 Jan 2025 10:00:00 +0000",
  "source": "https://inmyownstyle.com/feed",
  "categories": [
    "Drafts"
  ],
  "byline": "Diane Henkler",
  "length": 2594,
  "excerpt": "Thanks for stopping by for this week’s Style Scouting. My Sunday post where I share the random stuff that captured my attention or inspired me that I found online. photo: Lisa Furey Interiors I have had a",
  "siteName": "In My Own Style",
  "favicon": "",
  "text": "Thanks for stopping by for this week’s Style Scouting. My Sunday post where I share the random stuff that captured my attention or inspired me that I found online. I have had a very productive week. Ed and I spent most of the week getting the ceiling in the studioffice redone. We did this ourselves since it wasn’t hurricane damaged and covered by insurance like the kitchen ceiling was. Now I have to do a deep clean, clean-up to remove the mess that was made doing so, but the ceiling looks great. It has also been a very cold week here in the southeast, we are still dealing with the first floor heat pump problem and even got a dusting of snow that looked pretty on the deck before it was soon gone and turned into soft ice. Now the sun has returned and the temps are moving back up. :-) Posts You May Have Missed This Week: My kitchen has a new spacious look. (open in same tab) Something to Think About YES to this! (open in same tab) Life is too short! (open in same tab) As much as I have had to deal with from the aftermath of a hurricane damaging my home this past fall, it is teeny-tiny miniscule to the unimaginable loss of your entire home, all your belongings and the vibrant community you live in getting destroyed in a matter of hours. It is heartbreaking. Here are ways to help those who have lost everything this past week in the LA area. (open in same tab) “I have learned that our greatest blessings come when we are able to improve the lives of others.” – Jimmy Carter Oh… So Stylish Finds As an Amazon Associate I earn from qualifying purchases. Ed got me this for Christmas and I have it draped around me as I write this post. It sure has come in handy to keep me warm with our heat pump not working. (open in same tab) I also got a red cashmere scarf for Christmas and have been getting compliments about how the color looks nice with my coloring. Hearing this had me go in search of a top/shirt to wear in red. I found this one that is just my style. (open in same tab) Stacking baskets like this are the best when trying to organize your stuff. (open in same tab) Battery-operated candles just keep getting better and better like these that are rechargeable. (open in same tab) If you enjoy these posts – You can find past Style Scouting posts here. And… If you’re catching up on blog posts you may have missed, be sure to sign-up to get my newest posts via email to stay up to date with everything that’s happening here on the blog and more. Post navigation",
  "image": "https://inmyownstyle.com/wp-content/uploads/2025/01/wood-furniture-5.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\t\t\u003cmain id=\"main\" role=\"main\"\u003e\n\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003carticle id=\"post-99923\"\u003e\n\t\u003cdiv\u003e\n\t\n\u003cdiv\u003e\n\u003cp\u003eThanks for stopping by for this week’s Style Scouting. My Sunday post where I share the random stuff that captured my attention or inspired me that I found online.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eI have had a very productive week. Ed and I spent most of the week getting the ceiling in the studioffice redone. We did this ourselves since it wasn’t hurricane damaged and covered by insurance like the kitchen ceiling was.\u003c/p\u003e\n\n\n\n\u003cp\u003eNow I have to do a deep clean, clean-up to remove the mess that was made doing so, but the ceiling looks great.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt has also been a very cold week here in the southeast, we are still dealing with the first floor heat pump problem and even got a dusting of snow that looked pretty on the deck before it was soon gone and turned into soft ice. Now the sun has returned and the temps are moving back up. :-) \u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-posts-you-may-have-missed-this-week\"\u003ePosts You May Have Missed This Week:\u003c/h2\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eMy kitchen has \u003ca href=\"https://inmyownstyle.com/my-kitchen-has-a-spacious-new-look.html\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ea new spacious look\u003c/a\u003e. (\u003ca href=\"https://inmyownstyle.com/my-kitchen-has-a-spacious-new-look.html\"\u003eopen in same tab\u003c/a\u003e)\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003cdiv\u003e\n\u003ch2 id=\"something-to-think-about\"\u003eSomething to Think About\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://www.instagram.com/p/DDk-4oqOPOR/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eYES \u003c/a\u003eto this!  (\u003ca href=\"https://www.instagram.com/p/DDk-4oqOPOR/\"\u003eopen in same tab\u003c/a\u003e)\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://www.instagram.com/p/DEmOjrBuNRM/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eLife is\u003c/a\u003e too short! (\u003ca href=\"https://www.instagram.com/p/DEmOjrBuNRM/\"\u003eopen in same tab\u003c/a\u003e)\u003c/p\u003e\n\n\n\n\u003cp\u003eAs much as I have had to deal with from the aftermath of a hurricane damaging my home this past fall, it is teeny-tiny miniscule to\u003cem\u003e \u003c/em\u003ethe unimaginable loss of your entire home, all your belongings and the vibrant community you live in getting destroyed in a matter of hours. It is heartbreaking. Here are \u003ca href=\"https://www.latimes.com/california/story/2025-01-08/how-to-help-victims-of-pacific-palisades-eaton-and-hurst-fires\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eways to help\u003c/a\u003e those who have lost everything this past week in the LA area. (\u003ca href=\"https://www.latimes.com/california/story/2025-01-08/how-to-help-victims-of-pacific-palisades-eaton-and-hurst-fires\"\u003eopen in same tab\u003c/a\u003e)\u003c/p\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\u003cbr/\u003e“I have learned that our greatest blessings come when we are able to improve the lives of others.” – \u003cem\u003eJimmy Carter\u003c/em\u003e\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003ch3 data-kb-block=\"kb-adv-heading99923_1dbd91-a8\"\u003eOh… So Stylish Finds\u003c/h3\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eAs an Amazon Associate I earn from qualifying purchases.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eEd \u003ca href=\"https://amzn.to/424j3zX\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"\u003egot me this\u003c/a\u003e for Christmas and I have it draped around me as I write this post. It sure has come in handy to keep me warm with our heat pump not working. \u003ca href=\"https://amzn.to/424j3zX\" rel=\"nofollow\"\u003e(open in same tab\u003c/a\u003e)\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eI also got a red cashmere scarf for Christmas and have been getting compliments about how the color looks nice with my coloring. Hearing this had me go in search of a top/shirt to wear in red. I\u003ca href=\"https://amzn.to/42c7NBw\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"\u003e found this one\u003c/a\u003e that is just my style. (\u003ca href=\"https://amzn.to/42c7NBw\" rel=\"nofollow\"\u003eopen in same tab\u003c/a\u003e)\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://amzn.to/4acu18s\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"\u003eStacking baskets\u003c/a\u003e like this are the best when trying to organize your stuff. (\u003ca href=\"https://amzn.to/4acu18s\" rel=\"nofollow\"\u003eopen in same tab\u003c/a\u003e)\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eBattery-operated candles just keep getting better and better\u003ca href=\"https://amzn.to/4gUR4ra\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"\u003e like these\u003c/a\u003e that are rechargeable. (\u003ca href=\"https://amzn.to/4gUR4ra\"\u003eopen in same tab\u003c/a\u003e)\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\n\u003cp\u003eIf you enjoy these posts – You can find past \u003ca href=\"https://inmyownstyle.com/category/creative-stylish-ideas-for-home-and-living\"\u003e\u003cem\u003eStyle Scouting\u003c/em\u003e posts here\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eAnd…\u003c/strong\u003e If you’re catching up on blog posts you may have missed, be sure \u003cstrong\u003e\u003ca href=\"https://inmyownstyle.com/subscribe-to-in-my-own-style-blog\"\u003eto sign-up\u003c/a\u003e \u003c/strong\u003eto get my \u003cstrong\u003enewest posts via email \u003c/strong\u003eto stay up to date with everything that’s happening here on the blog and more.\u003c/p\u003e\n\u003c/div\u003e\n    \n\n\t\u003cnav aria-label=\"Posts\"\u003e\n\t\t\u003ch2\u003ePost navigation\u003c/h2\u003e\n\t\t\n\t\u003c/nav\u003e\u003c/div\u003e\n\u003c/article\u003e\n\n\n\n\t\t\t\t\t\u003c/div\u003e\u003c/main\u003e\n\t\t\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-12T10:00:00Z",
  "modifiedTime": "2025-01-11T12:33:23Z"
}
