{
  "id": "ca3c03ae-58f6-4b32-be5e-b42abe84e282",
  "title": "Uchronia gives London's Koibird store a colourful psychedelic revamp",
  "link": "https://www.dezeen.com/2025/01/13/uchronia-koibird-london-colourful-revamp/",
  "description": "Design studio Uchronia has overhauled womenswear boutique Koibird in London's Marylebone, introducing a gradient colour scheme and details including a giant planet sculpture and a floor made from painted lava stone. Uchronia designed the store, as well as its in-house nutrition bar Koi 11, with the aim of giving the interior an \"eclectic\" feel. \"The The post Uchronia gives London's Koibird store a colourful psychedelic revamp appeared first on Dezeen.",
  "author": "Cajsa Carlson",
  "published": "Mon, 13 Jan 2025 10:30:05 +0000",
  "source": "https://www.dezeen.com/interiors/feed/",
  "categories": [
    "Retail",
    "all",
    "Interiors",
    "Colour",
    "Uchronia",
    "London",
    "UK",
    "Boutiques",
    "Shops",
    "Refurbishments"
  ],
  "byline": "Cajsa Carlson",
  "length": 7349,
  "excerpt": "Design studio Uchronia has overhauled luxury womenswear boutique Koibird in London's Marylebone, introducing a gradient colour scheme and details including a giant planet sculpture and a floor made from painted lava stone.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Design studio Uchronia has overhauled womenswear boutique Koibird in London's Marylebone, introducing a gradient colour scheme and details including a giant planet sculpture and a floor made from painted lava stone. Uchronia designed the store, as well as its in-house nutrition bar Koi 11, with the aim of giving the interior an \"eclectic\" feel. Hand-painted lava stone tiles cover the floor at Koibird in Marylebone\"The concept for the Koibird renovation was to create an immersive and dynamic space that blends fashion, wellness and food into a seamless sensory experience,\" Uchrinia founder Julien Sebban told Dezeen. \"Our goal was to design a destination that embodies Koibird's eclectic identity, merging discovery and innovation in every element.\" Uchronia also designed Koibird's Koi 11 nutrition barTo do so, Uchronia used a bright palette of graduated colours, with green blending into pink and purple in the store's main room, which also features psychedelic green-and-purple flooring tiles made from hand-painted lava stone. \"The colour palette was inspired by Koibird's iconic brand hues and a desire to create an atmospheric gradient that would guide customers through different sensory zones,\" Sebban explained. \"We incorporated a spectrum from deep purples to vibrant greens on the walls, evoking a playful yet sophisticated ambience that mirrors the store's multifaceted offerings.\" A shimmering silver room is hidden in the backThe refurbishment also features a hidden back room, which Uchronia clad in shimmering silver tiles. Other playful details in the store include a shelf shaped like the letter K and amorphous furniture in silver and pink. \"Silver was chosen as a key accent because of its reflective, futuristic quality and its symbolic resonance with Koibird's otherworldly aesthetic,\" Sebban said. \"The metallic sheen adds a sense of discovery and surprise, especially in the central silver planet and the hidden silver-tiled room, both of which create captivating focal points,\" he added. \"Silver represents transformation, serving as a visual metaphor for the evolution and versatility that defines Koibird's identity.\" The giant planet sculpture is an eye-catching centrepieceUchronia created two eye-catching silver sculptures for the store – a spaceship in the window and a large planet on the main floor – designed as \"a nod to cosmic exploration\". \"The silver planet, which serves as a centrepiece for the store, was meticulously designed to be both sculptural and functional,\" Sebban said. \"Our goal was to create a central feature that would feel like a work of art – a nod to cosmic exploration – while seamlessly integrating the clothing display.\" Uchronia added amorphous furnitureThe studio hopes that the redesign will create an immersive feel and draw customers into the brand's world. \"By fusing contemporary design with artisanal craftsmanship, we sought to create an inspiring environment where visitors feel transported into the whimsical yet luxurious world of Koibird,\" Sebban concluded. \"The result is a hybrid universe where form, function and aesthetic pleasure intersect, reinforcing Koibird's bold, statement-making identity.\" Uchronia, which was named emerging interior design studio of the year at the 2023 Dezeen Awards, recently designed Cafe Shin in Paris to be \"halfway between Paris and Seoul\". The photography is by Félix Dol Maillot. Subscribe to our newsletters Your email address New! Dezeen Agenda US Sent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events. New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_social-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2159539\" data-article-id=\"2159539\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_hero.jpg\" id=\"preload-hero\"\u003e\n\t\t\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_hero-852x479.jpg\" alt=\"Purple Koibird storefront in London\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_hero-852x479.jpg 1x, https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_hero-1704x958.jpg 2x\" data-pin-nopin=\"true\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eDesign studio \u003ca href=\"https://www.dezeen.com/tag/uchronia/\"\u003eUchronia\u003c/a\u003e has overhauled womenswear \u003ca href=\"https://www.dezeen.com/tag/boutiques/\"\u003eboutique\u003c/a\u003e Koibird in \u003ca href=\"https://www.dezeen.com/tag/london/\"\u003eLondon\u003c/a\u003e\u0026#39;s Marylebone, introducing a gradient colour scheme and details including a giant planet sculpture and a floor made from painted lava stone.\u003cspan id=\"more-2159539\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://uchronia.fr/\"\u003eUchronia\u003c/a\u003e designed the store, as well as its in-house nutrition bar Koi 11, with the aim of giving the interior an \u0026#34;eclectic\u0026#34; feel.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2159752\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_22-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_22-852x1278.jpg\" alt=\"Interior by Uchronia in London\" width=\"1576\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_22-852x1278.jpg 1x, https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_22-1704x2557.jpg 2x\" sizes=\"(max-width: 1576px) 100vw, 1576px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2159752\"\u003eHand-painted lava stone tiles cover the floor at Koibird in Marylebone\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;The concept for the Koibird renovation was to create an immersive and dynamic space that blends fashion, wellness and food into a seamless sensory experience,\u0026#34; Uchrinia founder Julien Sebban told Dezeen.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Our goal was to design a destination that embodies Koibird\u0026#39;s eclectic identity, merging discovery and innovation in every element.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2159742\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_9-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_9-852x1278.jpg\" alt=\"Koi 11 nutrition bar by in purple hues\" width=\"1576\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_9-852x1278.jpg 1x, https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_9-1704x2556.jpg 2x\" sizes=\"(max-width: 1576px) 100vw, 1576px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2159742\"\u003eUchronia also designed Koibird\u0026#39;s Koi 11 nutrition bar\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eTo do so, Uchronia used a bright palette of graduated colours, with green blending into pink and purple in the store\u0026#39;s main room, which also features psychedelic green-and-purple flooring tiles made from hand-painted lava stone.\u003c/p\u003e\n\n\n\u003cp\u003e\u0026#34;The colour palette was inspired by Koibird\u0026#39;s iconic brand hues and a desire to create an atmospheric gradient that would guide customers through different sensory zones,\u0026#34; Sebban explained.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We incorporated a spectrum from deep purples to vibrant greens on the walls, evoking a playful yet sophisticated ambience that mirrors the store\u0026#39;s multifaceted offerings.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2159765\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_40-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_40-852x1278.jpg\" alt=\"Silber backroom in Koibird store\" width=\"1576\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_40-852x1278.jpg 1x, https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_40-1704x2556.jpg 2x\" sizes=\"(max-width: 1576px) 100vw, 1576px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2159765\"\u003eA shimmering silver room is hidden in the back\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe refurbishment also features a hidden back room, which Uchronia clad in shimmering silver tiles. Other playful details in the store include a shelf shaped like the letter K and amorphous furniture in silver and pink.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Silver was chosen as a key accent because of its reflective, futuristic quality and its symbolic resonance with Koibird\u0026#39;s otherworldly aesthetic,\u0026#34; Sebban said.\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003e\u0026#34;The metallic sheen adds a sense of discovery and surprise, especially in the central silver planet and the hidden silver-tiled room, both of which create captivating focal points,\u0026#34; he added.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Silver represents transformation, serving as a visual metaphor for the evolution and versatility that defines Koibird\u0026#39;s identity.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2159749\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_19-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_19-852x1278.jpg\" alt=\"Silver planet sculpture in colourful store\" width=\"1576\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_19-852x1278.jpg 1x, https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_19-1704x2556.jpg 2x\" sizes=\"(max-width: 1576px) 100vw, 1576px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2159749\"\u003eThe giant planet sculpture is an eye-catching centrepiece\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eUchronia created two eye-catching silver sculptures for the store – a spaceship in the window and a large planet on the main floor – designed as \u0026#34;a nod to cosmic exploration\u0026#34;.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The silver planet, which serves as a centrepiece for the store, was meticulously designed to be both sculptural and functional,\u0026#34; Sebban said.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Our goal was to create a central feature that would feel like a work of art – a nod to cosmic exploration – while seamlessly integrating the clothing display.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-2159736\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_3-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_3-852x1278.jpg\" alt=\"Pink and purple room at Koibird\" width=\"1576\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_3-852x1278.jpg 1x, https://static.dezeen.com/uploads/2025/01/koibird-uchronia-london_dezeen_2364_col_3-1704x2557.jpg 2x\" sizes=\"(max-width: 1576px) 100vw, 1576px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2159736\"\u003eUchronia added amorphous furniture\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe studio hopes that the redesign will create an immersive feel and draw customers into the brand\u0026#39;s world.\u003c/p\u003e\n\u003cp\u003e\u0026#34;By fusing contemporary design with artisanal craftsmanship, we sought to create an inspiring environment where visitors feel transported into the whimsical yet luxurious world of Koibird,\u0026#34; Sebban concluded.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The result is a hybrid universe where form, function and aesthetic pleasure intersect, reinforcing Koibird\u0026#39;s bold, statement-making identity.\u0026#34;\u003c/p\u003e\n\u003cp\u003eUchronia, which was named \u003ca href=\"https://www.dezeen.com/2023/12/04/dezeen-awards-2023-uchronia-emerging-interior-designer-video/\"\u003eemerging interior design studio of the year at the 2023 Dezeen Awards\u003c/a\u003e, recently designed \u003ca href=\"https://www.dezeen.com/2024/11/04/uchronia-cafe-shin-halfway-between-paris-seoul/\"\u003eCafe Shin in Paris to be \u0026#34;halfway between Paris and Seoul\u0026#34;\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe photography is by \u003ca href=\"http://www.felixdolmaillot.com/about\"\u003eFélix Dol Maillot\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\n                \n                \n                \n\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Agenda US\u003c/strong\u003e\n                \u003cp\u003eSent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#0676746f7067657f4662637c6363682865696b\"\u003e\u003cspan data-cfemail=\"5d2d2f342b3c3e241d393827383833733e3230\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-01-13T10:30:05Z",
  "modifiedTime": "2025-01-13T11:18:18Z"
}
