{
  "id": "d03cd81f-7a42-48ed-8c54-71dc4758edd5",
  "title": "Leopold Banchini creates \"all the elements\" of London bar from one oak tree",
  "link": "https://www.dezeen.com/2024/11/19/goodbye-horses-bar-de-beauvoir-leopold-banchini/",
  "description": "Swiss studio Leopold Banchini Architects used natural materials when creating the interior of the Goodbye Horses bar, with the bar, chairs, lights, handrails and changing table all made from a single tree. Located in east London's De Beauvoir neighbourhood, Goodbye Horses is a local wine and listening bar that was designed by Leopold Banchini Architects The post Leopold Banchini creates \"all the elements\" of London bar from one oak tree appeared first on Dezeen.",
  "author": "Cajsa Carlson",
  "published": "Tue, 19 Nov 2024 09:30:39 +0000",
  "source": "https://www.dezeen.com/interiors/feed/",
  "categories": [
    "Restaurants and bars",
    "all",
    "Interiors",
    "Bars",
    "Leopold Banchini Architects",
    "London",
    "Oak",
    "Wood",
    "UK"
  ],
  "byline": "Cajsa Carlson",
  "length": 7185,
  "excerpt": "Swiss studio Leopold Banchini Architects used natural materials when creating the interior of this London bar, which features a beaten-earth floor, oak furniture and painted hessian curtains.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Swiss studio Leopold Banchini Architects used natural materials when creating the interior of the Goodbye Horses bar, with the bar, chairs, lights, handrails and changing table all made from a single tree. Located in east London's De Beauvoir neighbourhood, Goodbye Horses is a local wine and listening bar that was designed by Leopold Banchini Architects to reference classic English pubs. The De Beauvoir bar features wooden furniture and details\"The aim was to create a contemporary space deeply rooted in the long-lasting tradition of English pubs,\" studio founder Leopold Banchini told Dezeen. \"As in most pubs, the space revolves around a central wooden bar,\" Banchini continued. \"In this case, the long wooden structure is a bar, a cooking counter and a table; thus, the relation between staff and customers is less constrained.\" The listening bar stores vinyl records on wooden shelvesThis nod to tradition can also be seen in the other materials chosen by Leopold Banchini Architects for the 95-square-metre bar, which also has a basement of the same size. Its walls were painted with limewash and roughcast render, while the ceiling was covered by a hand-textured lime plaster. \"The pub is mainly built with natural materials referring to the history of British pubs,\" Banchini said. \"The wooden elements are built using solid English oak.\" \"The natural textures, imperfections and oxidations create the atmosphere of the space,\" he continued. \"Over time and through their usage, these materials will only become more lively.\" One single oak tree was used to create all the furniture in the barThe ground-floor space features a ten-metre-long bar that has an unusually low design and which, together with the surrounding furniture, was built from the trunk of just one oak tree. \"In order to build the long table out of a single plank, we were looking for a tree with a circumference of about 120 centimetres,\" Banchini explained. \"Once we found it, the trunk was large enough to produce all the elements of the pub – the bar, chairs, lights, handrails and changing table,\" he added. \"The oak tree had been cut half a century ago in Croatia and was transformed by Italian carpenters.\" The listening bar also has custom-made shelves that hold vinyl records. Leopold Banchini Architects designed a beaten-earth floor for the barGoodbye Horses' floor was made from beaten earth – a mix of soil, straw and clay with a natural linseed oil coating. The material was chosen for both its sustainable and its acoustical properties. \"Beaten earth floors were traditionally used in rural pubs and we liked the idea to revive this amazing material,\" Banchini said. \"Clay floors are not only beautiful and ecological, they also have interesting acoustical properties,\" he added. \"Being a listening bar, all the materials – clay, cork, wood and textured lime plaster – were selected to create good acoustical conditions.\" Painted hessian curtains decorate the spaceIn the garden and the parts of the floor with the heaviest traffic, the studio added reclaimed Yorkstone slabs. The interior also features hessian curtains, which surround the space and were handpainted by artist Lucy Stein. \"Inspired by British folklore and mythology, the natural stain on the fabric filters the light entering the pub as stained glass windows in the past,\" the studio said. Other recent listening bar designs featured on Dezeen include Space Talk in London and a Sydney bar designed to feel like being \"inside a giant speaker\". The photography is by Rory Gardiner. Project credits: Architecture: Leopold Banchini ArchitectsCarpentry: DiSe Subscribe to our newsletters Your email address New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_hero-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2143077\" data-article-id=\"2143077\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_hero.jpg\" id=\"preload-hero\"\u003e\n\t\t\n\n\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_hero-852x479.jpg\" alt=\"Interior of Goodbye Horses bar\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_hero-852x479.jpg 1x, https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_hero-1704x958.jpg 2x\" data-pin-nopin=\"true\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_hero-852x479.jpg\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eSwiss studio \u003ca href=\"https://www.dezeen.com/tag/leopold-banchini/\"\u003eLeopold Banchini Architects\u003c/a\u003e used natural materials when creating the interior of the Goodbye Horses \u003ca href=\"https://www.dezeen.com/tag/bars/\"\u003ebar\u003c/a\u003e, with the bar, chairs, lights, handrails and changing table all made from a single tree.\u003cspan id=\"more-2143077\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eLocated in east London\u0026#39;s De Beauvoir neighbourhood, \u003ca href=\"https://www.goodbyehorses.london/\"\u003eGoodbye Horses\u003c/a\u003e is a local wine and listening bar that was designed by \u003ca href=\"http://leopoldbanchini.com/\"\u003eLeopold Banchini Architects\u003c/a\u003e to reference classic English pubs.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2143161\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_0-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_0-852x1065.jpg\" alt=\"Wooden furniture in London bar\" width=\"1891\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_0-852x1065.jpg 1x, https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_0-1704x2130.jpg 2x\" sizes=\"(max-width: 1891px) 100vw, 1891px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_0-852x1065.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2143161\"\u003eThe De Beauvoir bar features wooden furniture and details\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;The aim was to create a contemporary space deeply rooted in the long-lasting tradition of English pubs,\u0026#34; studio founder Leopold Banchini told Dezeen.\u003c/p\u003e\n\u003cp\u003e\u0026#34;As in most pubs, the space revolves around a central wooden bar,\u0026#34; Banchini continued. \u0026#34;In this case, the long wooden structure is a bar, a cooking counter and a table; thus, the relation between staff and customers is less constrained.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2143165\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_4-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_4-852x1065.jpg\" alt=\"Wooden shelf with records in listening bar\" width=\"1891\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_4-852x1065.jpg 1x, https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_4-1704x2130.jpg 2x\" sizes=\"(max-width: 1891px) 100vw, 1891px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_4-852x1065.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2143165\"\u003eThe listening bar stores vinyl records on wooden shelves\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThis nod to tradition can also be seen in the other materials chosen by Leopold Banchini Architects for the 95-square-metre bar, which also has a basement of the same size.\u003c/p\u003e\n\n\n\u003cp\u003eIts walls were painted with limewash and roughcast render, while the ceiling was covered by a hand-textured lime plaster.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The pub is mainly built with natural materials referring to the history of British pubs,\u0026#34; Banchini said. \u0026#34;The wooden elements are built using solid English oak.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;The natural textures, imperfections and oxidations create the atmosphere of the space,\u0026#34; he continued. \u0026#34;Over time and through their usage, these materials will only become more lively.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2143164\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_3-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_3-852x1065.jpg\" alt=\"Bar made from English oak\" width=\"1891\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_3-852x1065.jpg 1x, https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_3-1704x2130.jpg 2x\" sizes=\"(max-width: 1891px) 100vw, 1891px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_3-852x1065.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2143164\"\u003eOne single oak tree was used to create all the furniture in the bar\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe ground-floor space features a ten-metre-long bar that has an unusually low design and which, together with the surrounding furniture, was built from the trunk of just one oak tree.\u003c/p\u003e\n\u003cp\u003e\u0026#34;In order to build the long table out of a single plank, we were looking for a tree with a circumference of about 120 centimetres,\u0026#34; Banchini explained.\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003e\u0026#34;Once we found it, the trunk was large enough to produce all the elements of the pub – the bar, chairs, lights, handrails and changing table,\u0026#34; he added. \u0026#34;The oak tree had been cut half a century ago in Croatia and was transformed by Italian carpenters.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe listening bar also has custom-made shelves that hold vinyl records.\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2143166\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_5-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_5-852x1065.jpg\" alt=\"Beaten-earth floor inside Goodbye Horses in London\" width=\"1891\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_5-852x1065.jpg 1x, https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_5-1704x2130.jpg 2x\" sizes=\"(max-width: 1891px) 100vw, 1891px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_5-852x1065.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2143166\"\u003eLeopold Banchini Architects designed a beaten-earth floor for the bar\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eGoodbye Horses\u0026#39; floor was made from beaten earth – a mix of soil, straw and clay with a natural linseed oil coating. The material was chosen for both its sustainable and its acoustical properties.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Beaten earth floors were traditionally used in rural pubs and we liked the idea to revive this amazing material,\u0026#34; Banchini said.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Clay floors are not only beautiful and ecological, they also have interesting acoustical properties,\u0026#34; he added. \u0026#34;Being a listening bar, all the materials – clay, cork, wood and textured lime plaster – were selected to create good acoustical conditions.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-2143162\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_1-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_1-852x1065.jpg\" alt=\"Listening bar in De Beauvoir\" width=\"1891\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_1-852x1065.jpg 1x, https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_1-1704x2130.jpg 2x\" sizes=\"(max-width: 1891px) 100vw, 1891px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2024/11/goodbye-horses-leopold-banchini-london_dezeen_2364_col_1-852x1065.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2143162\"\u003ePainted hessian curtains decorate the space\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eIn the garden and the parts of the floor with the heaviest traffic, the studio added reclaimed Yorkstone slabs. The interior also features hessian curtains, which surround the space and were handpainted by artist \u003ca href=\"https://halesgallery.com/artists/171-lucy-stein/overview/\"\u003eLucy Stein\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Inspired by British folklore and mythology, the natural stain on the fabric filters the light entering the pub as stained glass windows in the past,\u0026#34; the studio said.\u003c/p\u003e\n\u003cp\u003eOther recent listening bar designs featured on Dezeen include \u003ca href=\"https://www.dezeen.com/2024/11/10/space-talks-listening-bar-london-ebba-charlotte-taylor/\"\u003eSpace Talk in London\u003c/a\u003e and \u003ca href=\"https://www.dezeen.com/2024/08/19/akin-atelier-jam-record-bar-sydney/\"\u003ea Sydney bar designed to feel like being \u0026#34;inside a giant speaker\u0026#34;\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe photography is by Rory Gardiner.\u003c/em\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cp\u003e\u003cstrong\u003eProject credits:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eArchitecture: \u003c/strong\u003eLeopold Banchini Architects\u003cbr/\u003e\u003cstrong\u003eCarpentry: \u003c/strong\u003eDiSe\u003c/p\u003e\n\n                \n                \n                \n\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#9bebe9f2edfaf8e2dbfffee1fefef5b5f8f4f6\"\u003e\u003cspan data-cfemail=\"9ceceef5eafdffe5dcf8f9e6f9f9f2b2fff3f1\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-11-19T09:30:39Z",
  "modifiedTime": "2024-11-19T09:55:48Z"
}
