{
  "id": "0f823235-e3b2-4bdc-8a1c-4870787c0cfb",
  "title": "DevSummit Boston: Key Lessons from Shipping AI Products Beyond the Hype",
  "link": "https://www.infoq.com/news/2025/07/devsummit-shipping-beyod-hype/?utm_campaign=infoq_content\u0026utm_source=infoq\u0026utm_medium=feed\u0026utm_term=global",
  "description": "Phil Calçado, CEO of Outropy, shared key insights at the InfoQ Dev Summit on scaling generative AI products. He highlighted the need for effective workflows and agents in AI development, advocating for iterative approaches that leverage proven software engineering principles. His insights promise to guide teams in building resilient AI systems without reinventing the wheel. By Andrew Hoblitzell",
  "author": "Andrew Hoblitzell",
  "published": "Wed, 02 Jul 2025 08:14:00 GMT",
  "source": "https://feed.infoq.com",
  "categories": [
    "InfoQ Dev Summit Boston 2025",
    "Artificial Intelligence",
    "InfoQ Dev Summit",
    "AI, ML \u0026 Data Engineering",
    "Development",
    "news"
  ],
  "byline": "Andrew Hoblitzell",
  "length": 4616,
  "excerpt": "Phil Calçado, CEO of Outropy, shared key insights at the InfoQ Dev Summit on scaling generative AI products. He highlighted the need for effective workflows and agents in AI development, advocating fo",
  "siteName": "InfoQ",
  "favicon": "https://cdn.infoq.com/statics_s1_20250605075448/apple-touch-icon.png",
  "text": "At the InfoQ Dev Summit in Boston, Phil Calçado, founder and CEO at Outropy, delivered a keynote aimed squarely at software leaders grappling with the realities of building and scaling generative AI products in production. Drawing on three years of hands-on experience and a 30-year career in software architecture, Calçado laid out concrete lessons on which traditional engineering patterns hold up when faced with the stochastic, stateful demands of AI systems. He opened by acknowledging the varied backgrounds in the room and the evolving nature of generative AI. Calçado contrasted the rich set of IDE automations available to individual engineers with the near-total lack of tooling for managers and reliability engineers. He recalled, “My initial idea back in 2021 was like, okay, can we automate this? Can I create basically VS Code for everything either the manager does or everything an engineer does?”  Despite early success in benchmarks Calçado candidly admitted that “this product failed miserably.” He pinpointed the core issue as a misalignment of incentives: users were more interested in reverse-engineering the assistant’s internal design than relying on it for day-to-day productivity gains. This insight, he explained, revealed the difference between tools that demonstrate technological novelty and those that actually deliver sustained user value. From these experiences, he distilled three dominant mindsets he’s observed in AI development. In the first, teams chase the latest model releases and funding cycles without addressing current limitations, waiting for “AGI next year” instead of iterating on today’s constraints. In the second, data-science labs undertake year-long projects to eke out incremental accuracy improvements with little product thinking, producing classifiers that only marginally outperform previous versions. In the third, teams adopt a software-engineering-centric workflow, emphasizing rapid, iterative development on lightweight, pluggable components that can be tested and refined in production. To structure these systems, Calçado introduced two core abstractions: workflows and agents. Workflows are static, predefined pipelines that execute a series of transformations, such as ingesting messages, deduplicating conversations, and generating summaries. Agents, by contrast, are semi-autonomous components endowed with memory, goal-orientation, and the ability to invoke tools or other services dynamically. “Agents have memory, they’re goal-oriented, dynamic, and they like to collaborate,” he said, likening them to stateful objects in traditional object-oriented design. He warned against treating agents as fine-grained microservices. The stateful, nondeterministic behavior inherent to LLM-driven agents undermines conventional service boundaries and leads to brittle coupling and operational fragility. Instead, he advocates for semantic event buses, where structured, intent-driven events—rather than raw database change streams—decouple components and enable discoverable, pluggable behaviors across the system. When it comes to assembling AI pipelines, Calçado stressed the importance of decomposing monolithic projects into small, well-defined slices with clear semantic interfaces. In Autopi’s daily-briefing feature, for example, separate components handled Slack ingestion, duplicate-conversation detection, semantic summarization, and calendar context enrichment.  Calçado also challenged the applicability of the Twelve-Factor App model to AI systems. He noted that configuration is no longer static, processes cannot remain stateless, and LLM calls introduce inherent latency bottlenecks. To address these challenges, he urged teams to explore durable-workflow frameworks, such as Temporal, that cleanly separate orchestration from side-effects, handle retries and timeouts transparently, and provide checkpointing for long-running, stateful processes. In closing, Calçado emphasized that while AI introduces new architectural demands, the core solution lies not in reinventing the wheel but in extending proven software-engineering principles to accommodate stochasticity and statefulness. “We don’t need to rebuild everything from scratch,” he argued. “We need better platforms that integrate these patterns so teams can iterate rapidly without reinventing the plumbing.” Developers looking to learn more can watch infoq.com in the coming weeks for videos from the event. About the Author Andrew Hoblitzell",
  "image": "https://cdn.infoq.com/statics_s1_20250605075448/styles/static/images/logo/logo-big.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\u003cp\u003eAt the InfoQ \u003ca href=\"http://devsummit.infoq.com\"\u003eDev Summit\u003c/a\u003e in \u003ca href=\"https://devsummit.infoq.com/conference/boston2025\"\u003eBoston\u003c/a\u003e, \u003ca href=\"https://philcalcado.com/about/\"\u003ePhil Calçado\u003c/a\u003e, founder and CEO at \u003ca href=\"https://www.linkedin.com/company/outropy/\"\u003eOutropy\u003c/a\u003e, delivered a \u003ca href=\"https://devsummit.infoq.com/keynote/boston2025/key-lessons-shipping-ai-products-beyond-hype\"\u003ekeynote\u003c/a\u003e aimed squarely at software leaders grappling with the realities of building and scaling generative AI products in production. Drawing on three years of hands-on experience and a 30-year career in software architecture, Calçado laid out concrete lessons on which traditional engineering patterns hold up when faced with the stochastic, stateful demands of AI systems.\u003c/p\u003e\n\n\u003cp\u003eHe opened by acknowledging the varied backgrounds in the room and the evolving nature of generative AI. Calçado contrasted the rich set of IDE automations available to individual engineers with the near-total lack of tooling for managers and reliability engineers. He recalled, “My initial idea back in 2021 was like, okay, can we automate this? Can I create basically VS Code for everything either the manager does or everything an engineer does?” \u003c/p\u003e\n\n\u003cp\u003e\u003cimg alt=\"\" data-src=\"news/2025/07/devsummit-shipping-beyod-hype/en/resources/1Screenshot 2025-07-01 at 4.31.07 AM-1751358944611.png\" src=\"https://imgopt.infoq.com/fit-in/3000x4000/filters:quality(85)/filters:no_upscale()/news/2025/07/devsummit-shipping-beyod-hype/en/resources/1Screenshot 2025-07-01 at 4.31.07 AM-1751358944611.png\" rel=\"share\"/\u003e\u003c/p\u003e\n\n\u003cp\u003eDespite early success in benchmarks Calçado candidly admitted that “this product failed miserably.” He pinpointed the core issue as a misalignment of incentives: users were more interested in reverse-engineering the assistant’s internal design than relying on it for day-to-day productivity gains. This insight, he explained, revealed the difference between tools that demonstrate technological novelty and those that actually deliver sustained user value.\u003c/p\u003e\n\n\u003cp\u003eFrom these experiences, he distilled three dominant mindsets he’s observed in AI development. In the first, teams chase the latest model releases and funding cycles without addressing current limitations, waiting for “AGI next year” instead of iterating on today’s constraints. In the second, data-science labs undertake year-long projects to eke out incremental accuracy improvements with little product thinking, producing classifiers that only marginally outperform previous versions. In the third, teams adopt a software-engineering-centric workflow, emphasizing rapid, iterative development on lightweight, pluggable components that can be tested and refined in production.\u003c/p\u003e\n\n\u003cp\u003eTo structure these systems, Calçado introduced two core abstractions: workflows and agents. Workflows are static, predefined pipelines that execute a series of transformations, such as ingesting messages, deduplicating conversations, and generating summaries. Agents, by contrast, are semi-autonomous components endowed with memory, goal-orientation, and the ability to invoke tools or other services dynamically. “Agents have memory, they’re goal-oriented, dynamic, and they like to collaborate,” he said, likening them to stateful objects in traditional object-oriented design.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg alt=\"\" data-src=\"news/2025/07/devsummit-shipping-beyod-hype/en/resources/1Screenshot 2025-07-01 at 4.32.40 AM-1751358944611.png\" src=\"https://imgopt.infoq.com/fit-in/3000x4000/filters:quality(85)/filters:no_upscale()/news/2025/07/devsummit-shipping-beyod-hype/en/resources/1Screenshot 2025-07-01 at 4.32.40 AM-1751358944611.png\" rel=\"share\"/\u003e\u003c/p\u003e\n\n\u003cp\u003eHe warned against treating agents as fine-grained microservices. The stateful, nondeterministic behavior inherent to LLM-driven agents undermines conventional service boundaries and leads to brittle coupling and operational fragility. Instead, he advocates for semantic event buses, where structured, intent-driven events—rather than raw database change streams—decouple components and enable discoverable, pluggable behaviors across the system.\u003c/p\u003e\n\n\u003cp\u003eWhen it comes to assembling AI pipelines, Calçado stressed the importance of decomposing monolithic projects into small, well-defined slices with clear semantic interfaces. In Autopi’s daily-briefing feature, for example, separate components handled Slack ingestion, duplicate-conversation detection, semantic summarization, and calendar context enrichment. \u003c/p\u003e\n\n\u003cp\u003eCalçado also challenged the applicability of the \u003ca href=\"https://12factor.net\"\u003eTwelve-Factor App\u003c/a\u003e model to AI systems. He noted that configuration is no longer static, processes cannot remain stateless, and LLM calls introduce inherent latency bottlenecks. To address these challenges, he urged teams to explore durable-workflow frameworks, such as \u003ca href=\"https://temporal.io\"\u003eTemporal\u003c/a\u003e, that cleanly separate orchestration from side-effects, handle retries and timeouts transparently, and provide checkpointing for long-running, stateful processes.\u003c/p\u003e\n\n\u003cp\u003eIn closing, Calçado emphasized that while AI introduces new architectural demands, the core solution lies not in reinventing the wheel but in extending proven software-engineering principles to accommodate stochasticity and statefulness. “We don’t need to rebuild everything from scratch,” he argued. “We need better platforms that integrate these patterns so teams can iterate rapidly without reinventing the plumbing.”\u003c/p\u003e\n\n\u003cp\u003eDevelopers looking to learn more can watch \u003ca href=\"https://www.infoq.com\"\u003einfoq.com\u003c/a\u003e in the coming weeks for videos from the event.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n  \n    \u003cdiv\u003e \n        \u003ch2\u003eAbout the Author\u003c/h2\u003e \n\n        \n            \n                \n            \n            \u003cdiv data-id=\"author-Andrew-Hoblitzell\"\u003e\n                    \u003ch4\u003e\u003cstrong\u003eAndrew Hoblitzell\u003c/strong\u003e\u003c/h4\u003e\n                    \n                \u003c/div\u003e\n        \n    \u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-02T00:00:00Z",
  "modifiedTime": null
}
