{
  "id": "16c2d016-2e99-406c-bcd6-8d5ce3cb80df",
  "title": "Celebrating Five Years of Backstage: From Open Source Project to Enterprise Business",
  "link": "https://engineering.atspotify.com/2025/04/celebrating-five-years-of-backstage/",
  "description": "Did you know that we sell Spotify’s developer productivity tools [...] The post Celebrating Five Years of Backstage: From Open Source Project to Enterprise Business appeared first on Spotify Engineering.",
  "author": "Spotify Engineering",
  "published": "Wed, 23 Apr 2025 14:23:12 +0000",
  "source": "https://labs.spotify.com/feed/",
  "categories": [
    "Backstage",
    "Developer Experience",
    "Developer Tools",
    "Open Source",
    "Platform",
    "engineering culture",
    "engineering leadership"
  ],
  "byline": "Spotify Engineering",
  "length": 7271,
  "excerpt": "Five years ago on March 16, 2020, we open sourced Backstage, a framework for building internal developer portals (IDPs) like the one we were using at Spotify. Despite being a very new idea — the term “IDP” didn’t even exist back then — the project took off on day one, and accelerated from there.",
  "siteName": "Spotify Engineering",
  "favicon": "https://storage.googleapis.com/production-eng/1/2021/03/cropped-Engineering-Icon-RGB-512x512-light-250x250.png",
  "text": "April 23, 2025 Did you know that we sell Spotify’s developer productivity tools and support to other companies, from online retailers and fashion brands to banks and automobile manufacturers? How did Spotify get into the business of selling enterprise developer software? And how does serving the open source community — not to mention paying corporate customers — improve our own internal software practices? Tyson Singer, Spotify’s head of technology and platforms, shares how our homegrown developer portal evolved from an open source project to our newest enterprise software product: Spotify Portal for Backstage. Five years ago on March 16, 2020, we open sourced Backstage, a framework for building internal developer portals (IDPs) like the one we were using at Spotify. Despite being a very new idea — the term “IDP” didn’t even exist back then — the project took off on day one, and accelerated from there.  Today, Backstage is the IDP platform of choice — with over 3,000 companies having adopted it to build IDPs of their own. Within Spotify, it’s still what our 700 R\u0026D squads rely on to help them ship every day. And, oh yeah, we’re also building an enterprise software business on top of it. So how did Spotify get here? And where will Backstage take us next? A platform for developer experience  Before open sourcing Backstage, we’d already been using it internally for years to help us solve a whole range of developer experience problems: context switching, fragmentation, cognitive load, silos, duplication, congestion, dependency management, tech health, compliance — you name it, Backstage could grow to help us address it. As a centralized platform, it contained the chaos of modern software development while making our whole engineering org more productive and more efficient. It became invaluable to how we work — and we didn’t want to lose it. How would we lose it? We’d recently gone through a painful migration before with another technology, where we had to move from our custom-built solution to a third-party one that had become the standard. We didn’t want to go through that again with Backstage. So we open sourced it.  Becoming the industry standard Backstage had become so valuable to us, we thought other companies would find it valuable, too. But we also had another motive for open sourcing it. It wasn’t just about sharing: Our ambition from the very start was for Backstage to become the standard for IDPs. Because if everyone else was using it, we wouldn’t have to migrate off it.  But you’re not going to become the standard just by being free. The product also has to be good. Even more than that, for us, Backstage had to be great. Because we’re an end user, too — probably the most demanding one. We depend on Backstage to improve the developer experience and productivity of our own teams, which has a direct impact on our business. As an open source project, we’d also get the benefit of outside contributions, addressing use cases we hadn’t even thought of yet. Sounds great, right?  But of course, be careful what you wish for. Now we were no longer building just for ourselves, now we were building for everyone. And sometimes it feels like those two things might be competing with each other. Could we meet the demands of the outside community while still serving the needs of our own developers? How building for others has benefited us Here’s an example of what it’s been like being both maintainer and end user of the Backstage project: We recently launched a complete rewrite of the entire backend system. This has been a really big endeavor for us. But we saw that adopters really needed an easier way to build and integrate plugins. So we did the work — building with the community and rewriting the whole backend over the course of a year. And when the 1.0 of the new backend launched, it was great. Here are just a few of the things we’ve heard from the community and our enterprise customers alike: “Makes things a lot easier to maintain.” “You used to have to wire things together across multiple files. Now adding a new plugin is a one-liner.” The new backend “was the game changer 🚀🧑‍💻.”  Everything about the new backend is simpler to work with — for the community and for us. So, of course, now we’re in the middle of completely rewriting the frontend, too. And guess what? That will be great for Spotify as end users, as well. If we hadn’t open sourced Backstage, I don’t know how long we would have kept living with our previous, more complicated backend system. Because of the community — both its needs and the way it enables us to build better solutions — we were pushed to build a much better version of Backstage for ourselves. And we could also quickly bring those improvements to our enterprise customers — through a no-code UI for installing and managing plugins — in Spotify Portal, our SaaS solution for Backstage adopters. Internal → open source → commercial: The best of all worlds Spotify Portal is a SaaS solution for Backstage that brings together the best of everything we know about building IDPs, both inside and outside Spotify. Apply to get the Portal beta. It’s been a lot of push and pull in how we balance internal priorities with external ones. But ultimately, this is a virtuous cycle. The ever-popular Notifications feature, the Events management plugin, and the API Docs plugin, which basically powers our entity pages for API entities — all of these are used in Spotify’s internal Backstage instance, and all were contributions from the community. Being part of a developer community beyond Spotify has put us in such a great position for continuing to invest in and grow the Backstage platform. The project has improved our own internal software practices. We’ve benefited from the innovation of the community at large. And we’ve been able to keep investing in the ecosystem in a way that improves our commercial Backstage products and brings more value to our enterprise customers. In five years, we’ve gone from basically just a thin framework for building an IDP, to a better IDP than we could have built by ourselves, and now to a SaaS product that we think is the best IDP for the future. This journey can be bumpy. But making that repo public back in 2020 has definitely brought us to a place we never could have imagined today. All of which proves out our original idea: Investing in the community has been an investment in ourselves, as well.  So, happy 5th birthday, Backstage! We’ve come far in a short time. But we’re expecting even bigger things ahead. Watch Tyson share Spotify’s Backstage journey with the open source community at KubeCon + CloudNativeCon Europe 2025 in London, April 3, 2025 Ready to try Backstage for yourself? Apply for the Spotify Portal beta — the fastest way to get up and running with a Backstage IDP of your own. Portal combines the best of open source with the best of Spotify’s developer experience and developer productivity practices. Tags: engineering culture, engineering leadership",
  "image": "https://storage.googleapis.com/production-eng/1/2025/04/backstage-5th-birthday-rnd.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n        \n        \n\n        \u003cdiv\u003e\n            \u003cp\u003e\u003cimg src=\"https://engineering.atspotify.com/wp-content/themes/theme-spotify/images/icon.png\" alt=\"\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eApril 23, 2025\u003c/span\u003e\n                \n            \u003c/p\u003e\n        \u003c/div\u003e\n        \n        \u003cp\u003e\u003ca href=\"https://engineering.atspotify.com/2025/04/celebrating-five-years-of-backstage/\" title=\"Celebrating Five Years of Backstage: From Open Source Project to Enterprise Business\"\u003e\n                        \u003cimg src=\"https://storage.googleapis.com/production-eng/1/2025/04/backstage-5th-birthday-1.png\" alt=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://storage.googleapis.com/production-eng/1/2025/04/backstage-5th-birthday-1.png 1200w, https://storage.googleapis.com/production-eng/1/2025/04/backstage-5th-birthday-1-250x123.png 250w, https://storage.googleapis.com/production-eng/1/2025/04/backstage-5th-birthday-1-700x344.png 700w, https://storage.googleapis.com/production-eng/1/2025/04/backstage-5th-birthday-1-768x378.png 768w, https://storage.googleapis.com/production-eng/1/2025/04/backstage-5th-birthday-1-120x59.png 120w\" sizes=\"(max-width: 1200px) 100vw, 1200px\"/\u003e                    \u003c/a\u003e\n                        \n        \u003c/p\u003e\n\n        \n\n        \n\u003cp\u003e\u003cem\u003e\u003cem\u003eDid you know that we sell Spotify’s developer productivity tools and support to other companies, from online retailers and fashion brands to banks and automobile manufacturers? How did Spotify get into the business of selling enterprise developer software? And how does serving the open source community — not to mention paying corporate customers — improve our own internal software practices? Tyson Singer, Spotify’s head of technology and platforms, shares how our homegrown developer portal evolved from an open source project to our newest enterprise software product: \u003c/em\u003e\u003ca href=\"https://backstage.spotify.com/products/portal/\"\u003e\u003cem\u003eSpotify Portal for Backstage\u003c/em\u003e\u003c/a\u003e\u003cem\u003e.\u003c/em\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eFive years ago on March 16, 2020, we open sourced Backstage, a framework for building \u003ca href=\"https://backstage.spotify.com/discover/backstage-101/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003einternal developer portals\u003c/a\u003e (IDPs) like the one we were using at Spotify. Despite being a very new idea — the term “IDP” didn’t even exist back then — the project took off on day one, and accelerated from there. \u003c/p\u003e\n\n\n\n\u003cp\u003eToday, Backstage is \u003ca href=\"https://newsletter.getdx.com/p/backstage-and-the-developer-portal-market\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ethe IDP platform of choice\u003c/a\u003e — with over \u003ca href=\"https://info.backstage.spotify.com/backstage-stories\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e3,000 companies\u003c/a\u003e having adopted it to build IDPs of their own. Within Spotify, it’s still what our 700 R\u0026amp;D squads rely on to help them ship every day. And, oh yeah, we’re also building an \u003ca href=\"https://backstage.spotify.com\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eenterprise software business\u003c/a\u003e on top of it. So how did Spotify get here? And where will Backstage take us next?\u003c/p\u003e\n\n\n\n\u003ch2\u003eA platform for developer experience \u003c/h2\u003e\n\n\n\n\u003cp\u003eBefore open sourcing Backstage, we’d already been using it internally for years to help us solve a whole range of developer experience problems: context switching, fragmentation, cognitive load, silos, duplication, congestion, dependency management, tech health, compliance — you name it, Backstage could grow to help us address it. As a centralized platform, it contained the chaos of modern software development while making our whole engineering org \u003ca href=\"https://leaddev.com/software-quality/bringing-internal-engineering-projects-world\" target=\"_blank\" rel=\"noreferrer noopener\"\u003emore productive and more efficient\u003c/a\u003e. It became invaluable to how we work — and we didn’t want to lose it.\u003c/p\u003e\n\n\n\n\u003cp\u003eHow would we lose it? We’d recently gone through a painful migration before with another technology, where we had to move from our custom-built solution to a third-party one that had become the standard. We didn’t want to go through that again with Backstage. So we open sourced it. \u003c/p\u003e\n\n\n\n\u003ch2\u003eBecoming the industry standard\u003c/h2\u003e\n\n\n\n\u003cp\u003eBackstage had become so valuable to us, we thought other companies would find it valuable, too. But we also had another motive for open sourcing it. It wasn’t just about sharing: Our ambition from the very start was for Backstage to become the standard for IDPs. Because if everyone else was using it, we wouldn’t have to migrate off it. \u003c/p\u003e\n\n\n\n\u003cp\u003eBut you’re not going to become the standard just by being free. The product also has to be good. Even more than that, for us, Backstage had to be great. Because we’re an end user, too — probably the most demanding one. We depend on Backstage to improve the developer experience and productivity of our own teams, which has a direct impact on our business. As an open source project, we’d also get the benefit of outside contributions, addressing use cases we hadn’t even thought of yet. Sounds great, right? \u003c/p\u003e\n\n\n\n\u003cp\u003eBut of course, be careful what you wish for. Now we were no longer building just for ourselves, now we were building for everyone. And sometimes it feels like those two things might be competing with each other. Could we meet the demands of the outside community while still serving the needs of our own developers?\u003c/p\u003e\n\n\n\n\u003ch2\u003eHow building for others has benefited us\u003c/h2\u003e\n\n\n\n\u003cp\u003eHere’s an example of what it’s been like being both maintainer and end user of the Backstage project: We recently launched a complete rewrite of the \u003ca href=\"https://backstage.io/blog/2024/12/18/backstage-wrapped-2024#1%EF%B8%8F⃣-version-10-of-the-future-of-backstage\"\u003eentire backend system\u003c/a\u003e. This has been a really big endeavor for us. But we saw that adopters really needed an easier way to build and integrate plugins. So we did the work — building with the community and rewriting the whole backend over the course of a year.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd when the 1.0 of the new backend launched, it was great. Here are just a few of the things we’ve heard from the community and our enterprise customers alike: “Makes things a lot easier to maintain.” “You used to have to wire things together across multiple files. Now adding a new plugin is \u003ca href=\"https://github.com/backstage/community-plugins/tree/main/workspaces/vault/plugins/vault-backend#new-backend-system\"\u003ea one-liner\u003c/a\u003e.” The new backend “\u003ca href=\"https://www.linkedin.com/feed/update/urn:li:activity:7279859356525854721?commentUrn=urn%3Ali%3Acomment%3A%28activity%3A7279859356525854721%2C7279898902089129984%29\u0026amp;dashCommentUrn=urn%3Ali%3Afsd_comment%3A%287279898902089129984%2Curn%3Ali%3Aactivity%3A7279859356525854721%29\"\u003ewas the game changer\u003c/a\u003e 🚀🧑‍💻.” \u003c/p\u003e\n\n\n\n\u003cp\u003eEverything about the new backend is simpler to work with — for the community and for us. So, of course, now we’re in the middle of completely rewriting the frontend, too. And guess what? That will be great for Spotify as end users, as well.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf we hadn’t open sourced Backstage, I don’t know how long we would have kept living with our previous, more complicated backend system. Because of the community — both its needs and the way it enables us to build better solutions — we were pushed to build a much better version of Backstage for ourselves. And we could also quickly bring those improvements to our enterprise customers — through a no-code UI for installing and managing plugins — in \u003ca href=\"https://backstage.spotify.com/products/portal/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eSpotify Portal\u003c/a\u003e, our SaaS solution for Backstage adopters.\u003c/p\u003e\n\n\n\n\u003ch2\u003eInternal → open source → commercial: The best of all worlds\u003c/h2\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"700\" height=\"394\" src=\"https://storage.googleapis.com/production-eng/1/2025/04/spotify-backstage-venn-700x394.png\" alt=\"\" srcset=\"https://storage.googleapis.com/production-eng/1/2025/04/spotify-backstage-venn-700x394.png 700w, https://storage.googleapis.com/production-eng/1/2025/04/spotify-backstage-venn-250x141.png 250w, https://storage.googleapis.com/production-eng/1/2025/04/spotify-backstage-venn-768x432.png 768w, https://storage.googleapis.com/production-eng/1/2025/04/spotify-backstage-venn-1536x864.png 1536w, https://storage.googleapis.com/production-eng/1/2025/04/spotify-backstage-venn-120x68.png 120w, https://storage.googleapis.com/production-eng/1/2025/04/spotify-backstage-venn.png 1920w\" sizes=\"(max-width: 700px) 100vw, 700px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eSpotify Portal is a SaaS solution for Backstage that brings together the best of everything we know about building IDPs, both inside and outside Spotify. \u003c/em\u003e\u003ca href=\"https://backstage.spotify.com/contact-us/try-portal\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eApply to get the Portal beta\u003c/em\u003e\u003c/a\u003e\u003cem\u003e.\u003c/em\u003e\u003cbr/\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s been a lot of push and pull in how we balance internal priorities with external ones. But ultimately, this is a virtuous cycle. The ever-popular \u003ca href=\"https://backstage.io/docs/notifications/#about-notifications\"\u003eNotifications feature\u003c/a\u003e, the \u003ca href=\"https://github.com/backstage/backstage/tree/master/plugins/events-backend\"\u003eEvents management plugin\u003c/a\u003e, and the \u003ca href=\"https://github.com/backstage/backstage/blob/master/plugins/api-docs/README.md\"\u003eAPI Docs plugin\u003c/a\u003e, which basically powers our entity pages for API entities — all of these are used in Spotify’s internal Backstage instance, and all were contributions from the community.\u003c/p\u003e\n\n\n\n\u003cp\u003eBeing part of a developer community beyond Spotify has put us in such a great position for continuing to invest in and grow the Backstage platform. The project has improved our own internal software practices. We’ve benefited from the innovation of the community at large. And we’ve been able to keep investing in the ecosystem in a way that improves our commercial Backstage products and brings more value to our enterprise customers.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn five years, we’ve gone from basically just a thin framework for building an IDP, to a better IDP than we could have built by ourselves, and now to a SaaS product that we think is the best IDP for the future. This journey can be bumpy. But making that repo public back in 2020 has definitely brought us to \u003ca href=\"https://thenewstack.io/five-years-in-backstage-is-just-getting-started/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ea place we never could have imagined today\u003c/a\u003e. All of which proves out our original idea: Investing in the community has been an investment in ourselves, as well. \u003c/p\u003e\n\n\n\n\u003cp\u003eSo, \u003ca href=\"https://www.youtube.com/watch?v=74ayHL1WHiE\u0026amp;list=PLf1KFlSkDLIBmA5TLXn2BzEHmwWzckP8y\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ehappy 5th birthday, Backstage\u003c/a\u003e! We’ve come far in a short time. But we’re expecting even bigger things ahead.\u003c/p\u003e\n\n\n\n\u003ciframe width=\"100%\" height=\"425\" src=\"https://www.youtube.com/embed/JqG1wey7-Ao?start=563\" title=\"Spotify at KubeCon Europe 2025 — Keynote: Mind the Gap: Bridging Cloud Native Innovation with Real-World Use\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eWatch Tyson share Spotify’s Backstage journey with the open source community at KubeCon + CloudNativeCon Europe 2025 in London, April 3, 2025\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eReady to try Backstage for yourself? \u003c/em\u003e\u003ca href=\"https://backstage.spotify.com/contact-us/try-portal/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eApply for the Spotify Portal beta\u003c/em\u003e\u003c/a\u003e\u003cem\u003e — the fastest way to get up and running with a Backstage IDP of your own. Portal combines the best of open source with the best of Spotify’s developer experience and developer productivity practices.\u003c/em\u003e\u003c/p\u003e\n        \u003cp\u003e\n\n        Tags: \u003ca href=\"https://engineering.atspotify.com/tag/engineering-culture/\" rel=\"tag\"\u003eengineering culture\u003c/a\u003e, \u003ca href=\"https://engineering.atspotify.com/tag/engineering-leadership/\" rel=\"tag\"\u003eengineering leadership\u003c/a\u003e\u003cbr/\u003e        \n            \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-04-23T14:23:12Z",
  "modifiedTime": "2025-04-28T15:56:34Z"
}
