{
  "id": "324014f3-cb47-4197-a6e3-e3656c04a3cb",
  "title": "I've been kidnapped by Robert Caro",
  "link": "https://martinfowler.com/articles/2025-caro.html",
  "description": "",
  "author": "",
  "published": "2025-04-01T17:22:00-04:00",
  "source": "https://martinfowler.com/feed.atom",
  "categories": null,
  "byline": "Martin Fowler",
  "length": 4082,
  "excerpt": "His books are huge, but I can't put them down.",
  "siteName": "martinfowler.com",
  "favicon": "",
  "text": "I've always enjoyed reading, and for most of my life I've particularly enjoyed reading history. My wife is a structural engineer (well “was”, as she's now retired) and long urged me to read one of her favorite books: The Power Broker, by Robert Caro. I'd heard great things about this book from other sources too, so was certainly inclined to. The problem was that it is a huge book, over 1200 pages, and I didn't want to lug it around in my carry-on baggage - and it wasn't available in electronic form. He's a highly regarded writer, so I might try something else, but his other work is a biography of Lyndon Johnson. Not one book, however, but four huge volumes - and he's only got up to 1964. Now Lyndon Johnson is a fascinating character, and I'd like to read more about him, but nobody is worth four-plus volumes. Then, last fall, The Power Broker because available electronically, so I finally decided to get to reading it, further encouraged by a wonderful series of podcasts on 99% invisible. The Power Broker is a biography of Robert Moses. Most readers are probably wondering who that is. Robert Moses was one of the most powerful officials in New York for four decades. While he never won any elected office, he had more power, and often access to more money, than either New York City's mayor or New York State's governor. He used this power to build highways, parks, bridges, and buildings - in the process displacing hundreds of thousands of people from their homes. His impact on New York is still apparent decades after he lost power in the 1960's as it shaped the physical structure of the city to this day. So Caro's book is interesting because it describes an otherwise little-known but highly influential figure. Further than that, the book is wonderful because it is so well written. I'm a professional writer of non-fiction, but reading this book reminds me how far I have yet to advance to consider myself anywhere close to mastery of my profession. Many times, I've had to stop after reading a section, just so I can catch my breath and fully admire the prose I've just read. He can take the arcane maneuverings of 1920's New York legislature and make it a page-turner. He has a superb knack of putting the reader into the story, making me feel how Moses's actions affected the lives of the people whose communities were lost to build those highways. It was the best book I've read for many years. So now the prospect of four volumes of Lyndon Johnson no longer filled me with apprehension. I dove right in. As I write this I'm half way through, and the quality of the writing hasn't stopped. The first book has memorable passages describing “the trap” that the Texas Hill Country set for its early settlers, the struggles for farmers working that land before Johnson's efforts brought them electricity, the way Johnson bullied those who worked for him, and how he flattered those men more powerful than him. Caro's reputation is built on the detailed research he and his wife do into these books. Many people had told stories on Johnson's early life, but the Caros went out and seemingly interviewed every living person who knew Johnson. These interviews revealed the true story behind these stories, making Johnson less benevolent, but even more fascinating. The second volume is forged from this kind of research, as the Caros realized that the story of Johnson's 1948 senate race was even more thrilling than a victory margin of 87 votes out of 988,295 might suggest. And like The Power Broker included a jaw-droppingly good mini-biography of New York governor Al Smith, this book painted an enthralling biography of Texas governor Coke Stevenson. It kept me up late several nights as I couldn't stop myself from just one more section. Reviewers I've read say the next in the series, Master of the Senate, is the best volume. I can't wait to get started.",
  "image": "https://martinfowler.com/articles/power-broker-card.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eI\u0026#39;ve always enjoyed reading, and for most of my life I\u0026#39;ve particularly\n    enjoyed reading history. My wife is a structural engineer (well “was”, as\n    she\u0026#39;s now retired) and long urged me to read one of her favorite books: \u003ca href=\"https://www.amazon.com/gp/product/0394720245/ref=as_li_tl?ie=UTF8\u0026amp;camp=1789\u0026amp;creative=9325\u0026amp;creativeASIN=0394720245\u0026amp;linkCode=as2\u0026amp;tag=martinfowlerc-20\"\u003eThe Power Broker\u003c/a\u003e, by Robert Caro. I\u0026#39;d heard great\n    things about this book from other sources too, so was certainly inclined to.\n    The problem was that it is a huge book, over 1200 pages, and I didn\u0026#39;t want\n    to lug it around in my carry-on baggage - and it wasn\u0026#39;t available in\n    electronic form.\u003c/p\u003e\n\n\u003cp\u003eHe\u0026#39;s a highly regarded writer, so I might try something else, but his\n    other work is a biography of \u003ca href=\"https://en.wikipedia.org/wiki/Lyndon_B._Johnson\"\u003eLyndon Johnson\u003c/a\u003e. Not one book, however, but four\n    huge volumes - and he\u0026#39;s only got up to 1964. Now Lyndon Johnson is a\n    fascinating character, and I\u0026#39;d like to read more about him, but nobody is\n    worth four-plus volumes.\u003c/p\u003e\n\n\u003cp\u003eThen, last fall, The Power Broker because available electronically, so I\n    finally decided to get to reading it, further encouraged by a wonderful \u003ca href=\"https://99percentinvisible.org/club/\"\u003eseries of podcasts on 99%\n    invisible\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe Power Broker is a biography of \u003ca href=\"https://en.wikipedia.org/wiki/Robert_Moses\"\u003eRobert Moses\u003c/a\u003e. Most readers are\n    probably wondering who that is. Robert Moses was one of the\n    most powerful officials in New York for four decades. While he never won any\n    elected office, he had more power, and often access to more money, than\n    either New York City\u0026#39;s mayor or New York State\u0026#39;s governor. He used this\n    power to build highways, parks, bridges, and buildings - in the process\n    displacing hundreds of thousands of people from their homes. His impact on\n    New York is still apparent decades after he lost power in the 1960\u0026#39;s \n    as it shaped the physical structure of the city to this day.\u003c/p\u003e\n\n\u003cp\u003eSo Caro\u0026#39;s book is interesting because it describes an otherwise\n    little-known but highly influential figure. Further than that, the book is\n    wonderful because it is so well written. I\u0026#39;m a professional writer of\n    non-fiction, but reading this book reminds me how far I have yet to\n    advance to consider myself anywhere close to mastery of my profession. Many\n    times, I\u0026#39;ve had to stop after reading a section, just so I can catch my\n    breath and fully admire the prose I\u0026#39;ve just read. He can take the arcane\n    maneuverings of 1920\u0026#39;s New York legislature and make it a page-turner. He\n    has a superb knack of putting the reader into the story, making me feel how\n    Moses\u0026#39;s actions affected the lives of the people whose communities were lost\n    to build those highways.\u003c/p\u003e\n\n\u003cp\u003eIt was the best book I\u0026#39;ve read for many years.\u003c/p\u003e\n\n\u003cp\u003eSo now the prospect of four volumes of Lyndon Johnson no longer filled me\n    with apprehension. I dove right in. As I write this I\u0026#39;m half way through,\n    and the quality of the writing hasn\u0026#39;t stopped. The \u003ca href=\"https://www.amazon.com/gp/product/0679729453/ref=as_li_tl?ie=UTF8\u0026amp;camp=1789\u0026amp;creative=9325\u0026amp;creativeASIN=0679729453\u0026amp;linkCode=as2\u0026amp;tag=martinfowlerc-20\"\u003efirst book\u003c/a\u003e has memorable passages describing “the\n    trap” that the Texas Hill Country set for its early settlers, the struggles\n    for farmers working that land before Johnson\u0026#39;s efforts brought them\n    electricity, the way Johnson bullied those who worked for him, and how\n    he flattered those men more powerful than him.\u003c/p\u003e\n\n\u003cp\u003eCaro\u0026#39;s reputation is built on the detailed research he and his wife do\n    into these books. Many people had told stories on Johnson\u0026#39;s early life, but\n    the Caros went out and seemingly interviewed every living person who knew\n    Johnson. These interviews revealed the true story behind these stories,\n    making Johnson less benevolent, but even more fascinating. The \u003ca href=\"https://www.amazon.com/gp/product/067973371X/ref=as_li_tl?ie=UTF8\u0026amp;camp=1789\u0026amp;creative=9325\u0026amp;creativeASIN=067973371X\u0026amp;linkCode=as2\u0026amp;tag=martinfowlerc-20\"\u003esecond volume\u003c/a\u003e is forged from this kind of research,\n    as the Caros realized that the story of Johnson\u0026#39;s 1948 senate race was even\n    more thrilling than a victory margin of 87 votes out of 988,295 might\n    suggest. And like The Power Broker included a jaw-droppingly good\n    mini-biography of New York governor Al Smith, this book painted an\n    enthralling biography of Texas governor Coke Stevenson. It kept me up late\n    several nights as I couldn\u0026#39;t stop myself from just one more section.\u003c/p\u003e\n\n\u003cp\u003eReviewers I\u0026#39;ve read say the next in the series, \u003ca href=\"https://www.amazon.com/gp/product/0394720954/ref=as_li_tl?ie=UTF8\u0026amp;camp=1789\u0026amp;creative=9325\u0026amp;creativeASIN=0394720954\u0026amp;linkCode=as2\u0026amp;tag=martinfowlerc-20\"\u003eMaster of the Senate\u003c/a\u003e, is the best volume. I can\u0026#39;t\n    wait to get started.\u003c/p\u003e\n\n\u003chr/\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": "2025-03-30T00:00:00Z"
}
