{
  "id": "6b1dcf82-55a9-4b4a-8444-9ffdd10b61e9",
  "title": "",
  "link": "http://scripting.com/2025/03/08.html#a145743",
  "description": "David Weinberger on WordLand. \"It's a web page that clears out all of WordPress's cruft and gives you an interface that's so simple that it's actually enjoyable.\"",
  "author": "",
  "published": "Sat, 08 Mar 2025 14:57:43 GMT",
  "source": "http://scripting.com/rss.xml",
  "categories": null,
  "byline": "",
  "length": 2082,
  "excerpt": "Dave Winer, OG blogger, podcaster, developed first apps in many categories. Old enough to know better. It's even worse than it appears.",
  "siteName": "Scripting News",
  "favicon": "",
  "text": "It's even worse than it appears.. David Weinberger on WordLand. \"It's a web page that clears out all of WordPress's cruft and gives you an interface that's so simple that it's actually enjoyable.\" # Praise from David, author of Small Pieces Loosely Joined and co-author of Cluetrain Manifesto, is the best. He picked up WordLand overnight, and he loves it, for the right reasons. WordLand is an editor for \"small pieces,\" maybe the first. Most of the really easy editors have been stuck in silos and thus are dead-ends. I'm sure the people who designed them wished they weren't locked up, but they had to work for billionaires-to-be, I don't. I called the locked-up editors tiny little text boxes. I created an editor that starts out slightly larger than the TLTBs, and grows as your idea grows. So David opened up WordLand and started typing. And it turned into a normal sized blog post. It flowed right into it. And unlike the TLTB's in twitter-like worlds, those bits live on the open web, and can use all the features of the web, and are fed out to software networks via RSS, which is a lot simpler than other protocols. It can grow faster because there already is a huge installed base of software and knowledge for RSS. Imho developers should build on existing standards, not try to replace them. They might be more alive than you think (or more accurately, wish). # I updated the screen shot on the WordLand docs page. It was really out of date. WordLand is the best editor for people to write in WordPress. I've been developing it over the last couple of years. I wanted to get a really nice editor into this slot. I felt WordPress deserved one. It's designed to feel like the editor in twitter-like services, but without the limits. I've been writing about this on my blog, while I was doing that, I was developing WordLand in the background. We have ignored the needs of writers for too long. It's time to remove the limits. People believed the formula Twitter arrived at was the right one. It is far too limited for writers. WordLand is the answer, in software. #",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"idPageTopText\"\u003e\n\t\n\t\u003cp\u003eIt\u0026#39;s even worse than it appears..\u003c/p\u003e\n\t\u003c/div\u003e\u003cdiv id=\"idDayContainer\"\u003e\n\t\t\t\t\n\u003cp\u003e\u003ca name=\"a145743\"\u003e\u003c/a\u003e\u003ca href=\"https://www.hyperorg.com/blogger/2025/03/08/trying-out-wordland-for-blogging/\"\u003eDavid Weinberger on WordLand\u003c/a\u003e. \u0026#34;It\u0026#39;s a web page that clears out all of WordPress\u0026#39;s cruft and gives you an interface  that\u0026#39;s so simple that it\u0026#39;s actually enjoyable.\u0026#34; \u003cspan\u003e\u003ca href=\"http://scripting.com/2025/03/08.html#a145743\" title=\"Direct link to this item.\"\u003e#\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca name=\"a151455\"\u003e\u003c/a\u003e\u003cimg src=\"https://s3.amazonaws.com/scripting.com/images/2018/10/04/gumby.png\"/\u003ePraise from David, author of \u003ca href=\"https://www.amazon.com/Small-Pieces-Loosely-Joined-Unified/dp/0738205435\"\u003eSmall Pieces Loosely Joined\u003c/a\u003e and co-author of \u003ca href=\"https://www.amazon.com/Cluetrain-Manifesto-End-Business-Usual/dp/0738204315\"\u003eCluetrain Manifesto\u003c/a\u003e, is the best. He picked up \u003ca href=\"https://wordland.social/\"\u003eWordLand\u003c/a\u003e overnight, and he loves it, for the right reasons. WordLand is an editor for \u0026#34;small pieces,\u0026#34; maybe the first. Most of the really easy editors have been stuck in silos and thus are dead-ends. I\u0026#39;m sure the people who designed them wished they weren\u0026#39;t locked up, but they had to work for billionaires-to-be, I don\u0026#39;t. I called the locked-up editors \u003ca href=\"http://scripting.com/2024/01/14/031201.html\"\u003etiny little text boxes\u003c/a\u003e. I created an editor that starts out slightly larger than the TLTBs, and grows as your idea grows. So David opened up \u003ca href=\"https://wordland.social/\"\u003eWordLand\u003c/a\u003e and started typing. And it turned into a \u003ca href=\"https://www.hyperorg.com/blogger/2025/03/08/trying-out-wordland-for-blogging/\"\u003enormal sized blog post\u003c/a\u003e. It flowed right into it. And unlike the TLTB\u0026#39;s in twitter-like worlds, those bits live on the open web, and can use all the features of the web, and are fed out to software networks via \u003ca href=\"https://cyber.harvard.edu/rss/rss.html\"\u003eRSS\u003c/a\u003e, which is a lot simpler than other protocols. It can grow faster because there already is a huge installed base of software and knowledge for RSS. Imho developers should \u003ca href=\"https://this.how/standards/\"\u003ebuild on existing standards\u003c/a\u003e, not try to replace them. They might be more \u003ca href=\"https://isrssdead.com/\"\u003ealive\u003c/a\u003e than you think (or more accurately, wish). \u003cspan\u003e\u003ca href=\"http://scripting.com/2025/03/08.html#a151455\" title=\"Direct link to this item.\"\u003e#\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca name=\"a144727\"\u003e\u003c/a\u003eI updated the \u003ca href=\"https://this.how/wordland/#1734985792000\"\u003escreen shot\u003c/a\u003e on the WordLand \u003ca href=\"https://this.how/wordland/\"\u003edocs page\u003c/a\u003e. It was really out of date. \u003ca href=\"https://wordland.social/\"\u003eWordLand\u003c/a\u003e is the best editor for people to write in WordPress. I\u0026#39;ve been developing it over the last couple of years. I wanted to get a really nice editor into this slot. I felt WordPress deserved one. It\u0026#39;s designed to feel like the editor in twitter-like services, but without the limits. I\u0026#39;ve been writing about this \u003ca href=\"https://daytona.scripting.com/search?q=textcasting\"\u003eon my blog\u003c/a\u003e, while I was doing that, I was developing WordLand in the background. We have ignored the needs of writers for too long. It\u0026#39;s time to remove the limits. People believed the formula Twitter arrived at was the right one. It is far too limited for writers. WordLand is the answer, in software. \u003cspan\u003e\u003ca href=\"http://scripting.com/2025/03/08.html#a144727\" title=\"Direct link to this item.\"\u003e#\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
