{
  "id": "8a5cb2e3-30be-47d6-a373-9e6b83d54987",
  "title": "Social Media Engagement in Early 2025",
  "link": "https://martinfowler.com/articles/2025-social-traffic.html",
  "description": "",
  "author": "",
  "published": "2025-04-03T09:41:00-04:00",
  "source": "https://martinfowler.com/feed.atom",
  "categories": null,
  "byline": "Martin Fowler",
  "length": 3783,
  "excerpt": "Comparing engagement on two dozen recent social media posts",
  "siteName": "martinfowler.com",
  "favicon": "",
  "text": "A few years ago, whenever I published a new article here, I would just announce it on Twitter, which seemed to help attract readers who would find the article worthwhile. Since the Muskover, Twitter's importance has declined sharply. It now doesn't take very much time at all for me to check posts of people I follow on X (Twitter), since most of them have left. Instead I'm looking at other social sites, and posting there too. Now when I announce a new article, I post on LinkedIn, Bluesky, Mastodon, as well as X (Twitter). (I also post into my RSS feed, which is still my favorite way to let people know of new material, but that may just reveal I'm stuck in an idyllic past.) While it's one thing to have a gut feel for the importance of these platforms, I'd rather gather some more objective data. One source of data is how many followers I have on the these platforms. Here X (Twitter) shows a notable lead, but I strongly suspect that many of my followers there are inactive (or bots). Considering I only joined LinkedIn about a year ago, it's developed a healthy number. Given that I decided to look at activity based on my recent posts. Most of my posts to social media I make across all these platforms, tweaking them a little bit depending upon their norms and constraints. For this exercise I took 24 recent posts and looked at what activity they generated on each platform. I'll start with reposts. Although some LinkedIn posts get reposted more often than X, the median is pretty close. Bluesky trails a bit behind, but nowhere near as far as the follower count would suggest. Mastodon, as we'll see with all three stats, is far smaller. Figure 2: Plot of reposts This plot is a combined strip chart and box plot. When visualizing data, I'm suspicious of using aggregates such as averages, as averages can often hide a lot of important information. I much prefer to plot every point, and in this case a stripchart does the trick. A strip chart plots every data point as a dot on a column for the category. So every dot in the linkedIn column is the value for one linkedin post. I add some horizontal jitter to these points so they don't print on top of each other. The strip charts allow me to see every point and thus get a good feel of the distribution. I then overlay a boxplot, which allows me to compare medians and quartiles. Shift over to likes however, and now LinkedIn is far above the others, X and Bluesky are about the same. Figure 3: Plot of likes With replies LinkedIn is again clearly averaging more, but bluesky does have a significant number of heavily replied posts that push its upper quartile far above the other two services. That's looking at the data, how might I interpret this in terms of the importance of the services? Of the three I'm more inclined to value the reposts - after all that is someone thinking the that post is valuable enough to send out to their own followers. That indicates a clear pecking order with LinkedIn \u003e X \u003e Bluesky \u003e Mastodon. It's interesting that LinkedIn is a more singular leader on likes, it seems both higher itself and X is lower. I guess that means LinkedIn people are more eager to hit the like button. As for replies, it's interesting to see that Bluesky has generated quite a few posts that have triggered lots of replies. But given that most replies aren't exactly insightful, I don't chalk that up as a positive. Overall, I'd say that LinkedIn has taken over as the number one social network for my posts, but X (Twitter) is still important. And Bluesky is by far the most active on a per-follower basis.",
  "image": "https://martinfowler.com/articles/2025-social-traffic/card.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eA few years ago, whenever I published a new article here, I would just\n    announce it on Twitter, which seemed to help attract readers who would find\n    the article worthwhile. Since the Muskover, Twitter\u0026#39;s importance has\n    declined sharply. It now doesn\u0026#39;t take very much time at all for me to check\n    posts of people I follow on X (Twitter), since most of them have left.\n    Instead I\u0026#39;m looking at other social sites, and posting there too. Now when I\n    announce a new article, I post on LinkedIn, Bluesky, Mastodon, as well as X\n    (Twitter). (I also post into my RSS feed, which is still my favorite way to\n    let people know of new material, but that may just reveal I\u0026#39;m stuck in an\n    idyllic past.)\u003c/p\u003e\n\n\u003cp\u003eWhile it\u0026#39;s one thing to have a gut feel for the importance of these\n    platforms, I\u0026#39;d rather gather some more objective data.\u003c/p\u003e\n\n\u003cp\u003eOne source of data is how many followers I have on the these\n    platforms.\u003c/p\u003e\n\n\u003cdiv id=\"followers.png\"\u003e\u003cp\u003e\u003cimg src=\"https://martinfowler.com/articles/2025-social-traffic/followers.png\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003eHere X (Twitter) shows a notable lead, but I strongly suspect that\n    many of my followers there are inactive (or bots). Considering I only joined\n    LinkedIn about a year ago, it\u0026#39;s developed a healthy number.\u003c/p\u003e\n\n\u003cp\u003eGiven that I decided to look at activity based on my recent posts. Most\n    of my posts to social media I make across all these platforms, tweaking them\n    a little bit depending upon their norms and constraints.\n    For this exercise I took 24 recent posts and looked at what activity they\n    generated on each platform.\u003c/p\u003e\n\n\u003cp\u003eI\u0026#39;ll start with reposts. Although some LinkedIn posts get\n    reposted more often than X, the median is pretty close. Bluesky trails a bit\n    behind, but nowhere near as far as the follower count would suggest.\n    Mastodon, as we\u0026#39;ll see with all three stats, is far smaller.\u003c/p\u003e\n\n\u003cdiv id=\"reposts-strip.png\"\u003e\u003cp\u003e\u003cimg src=\"https://martinfowler.com/articles/2025-social-traffic/reposts-strip.png\"/\u003e\u003c/p\u003e\u003cp\u003eFigure 2: Plot of reposts\u003c/p\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003eThis plot is a combined strip chart and box plot. When visualizing data,\n    I\u0026#39;m suspicious of using aggregates such as averages, as averages can often\n    \u003ca href=\"https://martinfowler.com/articles/dont-compare-averages.html\"\u003ehide a lot of important information\u003c/a\u003e. I much\n    prefer to plot every point, and in this case a \u003ca href=\"https://martinfowler.com/articles/dont-compare-averages.html#strip\"\u003estripchart\u003c/a\u003e does the trick. A strip chart plots\n    every data point as a dot on a column for the category. So every dot in the\n    linkedIn column is the value for one linkedin post. I add some horizontal\n    jitter to these points so they don\u0026#39;t print on top of each other. The strip\n    charts allow me to see every point and thus get a good feel of the\n    distribution. I then overlay a \u003ca href=\"https://martinfowler.com/articles/dont-compare-averages.html#boxplot\"\u003eboxplot\u003c/a\u003e, which\n    allows me to compare medians and quartiles.\u003c/p\u003e\n\n\u003cp\u003eShift over to likes however, and now LinkedIn is far above the others, X\n    and Bluesky are about the same. \u003c/p\u003e\n\n\u003cdiv id=\"likes-strip.png\"\u003e\u003cp\u003e\u003cimg src=\"https://martinfowler.com/articles/2025-social-traffic/likes-strip.png\"/\u003e\u003c/p\u003e\u003cp\u003eFigure 3: Plot of likes\u003c/p\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003eWith replies LinkedIn is again clearly\n    averaging more, but bluesky does have a significant number of heavily\n    replied posts that push its upper quartile far above the other two services.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eThat\u0026#39;s looking at the data, how might I interpret this in terms of the\n    importance of the services? Of the three I\u0026#39;m more inclined to value the\n    reposts - after all that is someone thinking the that post is valuable\n    enough to send out to their own followers. That indicates a clear pecking\n    order with LinkedIn \u0026gt; X \u0026gt; Bluesky \u0026gt; Mastodon. It\u0026#39;s interesting that LinkedIn\n    is a more singular leader on likes, it seems both higher itself and X is\n    lower. I guess that means LinkedIn people are more eager to hit the like button.\u003c/p\u003e\n\n\u003cp\u003eAs for replies, it\u0026#39;s interesting to see that Bluesky has generated quite\n    a few posts that have triggered lots of replies. But given that most replies\n    aren\u0026#39;t exactly insightful, I don\u0026#39;t chalk that up as a positive.\u003c/p\u003e\n\n\u003cp\u003eOverall, I\u0026#39;d say that LinkedIn has taken over as the number one social\n    network for my posts, but X (Twitter) is still important. And Bluesky is by\n    far the most active on a per-follower basis.\u003c/p\u003e\n\n\u003chr/\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": "2025-04-03T00:00:00Z"
}
