{
  "id": "a5bebfab-58eb-4735-8abe-2e7b0d63fd05",
  "title": "AlphaWrite: Improving AI Narratives Through Evolution",
  "link": "https://www.infoq.com/news/2025/06/alphawrite/?utm_campaign=infoq_content\u0026utm_source=infoq\u0026utm_medium=feed\u0026utm_term=global",
  "description": "AlphaWrite is a new framework designed to enhance creative writing with structure and measurable improvements. Developed by Toby Simonds, it employs an evolutionary process to iteratively boost storytelling quality during inference. By Robert Krzaczyński",
  "author": "Robert Krzaczyński",
  "published": "Sat, 21 Jun 2025 11:34:00 GMT",
  "source": "https://feed.infoq.com",
  "categories": [
    "Benchmark",
    "Large language models",
    "Writing",
    "AI, ML \u0026 Data Engineering",
    "news"
  ],
  "byline": "Robert Krzaczyński",
  "length": 3193,
  "excerpt": "AlphaWrite is a new framework designed to enhance creative writing with structure and measurable improvements. Developed by Toby Simonds, it employs an evolutionary process to iteratively boost storyt",
  "siteName": "InfoQ",
  "favicon": "https://cdn.infoq.com/statics_s2_20250605075544/apple-touch-icon.png",
  "text": "AlphaWrite is a new framework designed to enhance creative writing with structure and measurable improvements. Developed by Toby Simonds, it employs an evolutionary process to iteratively boost storytelling quality during inference. Creative generation has long been a challenge for large language models (LLMs), not due to a lack of fluency, but because of the difficulty in evaluating subjective qualities such as character development, emotional impact, and narrative cohesion. AlphaWrite addresses this by borrowing ideas from evolutionary algorithms and systems like AlphaEvolve, applying them to story generation. The system operates in iterative cycles. It first generates a broad population of diverse stories, varying in author style and theme. Then, an LLM-based judge conducts pairwise comparisons using a detailed narrative quality rubric and Elo rating system. Top-performing stories are selected to spawn variants with guided improvements in structure, dialogue, or prose, among other dimensions. This process is repeated across generations, aiming to refine stories over time. Source: tobysimonds.com As Toby Simonds, a creator of AlphaWrite, shared on X: The magic is in the evolutionary pressure. Stories don't just get generated once – they compete, mutate, and improve across generations. Top performers become ‘parents’ for the next generation, while weak stories get replaced by promising variants. Early experiments using Llama 3.1 8B suggest notable gains. Stories produced by AlphaWrite were preferred 72% of the time over initial single-shot generations and 62% over stories created through sequential prompting, both statistically significant. The system also supports recursive improvement: refined outputs are distilled into the base model, which can then undergo another round of evolution. Source: tobysimonds.com While the results are promising, not everyone welcomes the development. One user on Hacker News commented: If there is something that I would like AI to never touch, it's that. Please stop making the world worse. In response, another user added:  Not everyone shares your same worldview... You don't have to participate; ignore AI-generated or AI-assisted content... But you also don't have to devalue and dismiss the interests of others. These differing reactions reflect broader cultural tensions around AI’s role in creative domains—whether it enhances or erodes human expression. The AlphaWrite team acknowledges that evaluating story quality remains subjective and warns of risks like prompt bias and creative convergence. Nonetheless, AlphaWrite’s potential reaches beyond fiction. The authors note that the system helped draft parts of their paper and could be adapted to technical writing, marketing, and academic content. With suitable rubrics, the method could be applied to optimize specific writing tasks or even to improve foundation models themselves. The code is available in the AlphaWrite GitHub repository for developers and researchers to explore. About the Author Robert Krzaczyński",
  "image": "https://res.infoq.com/news/2025/06/alphawrite/en/headerimage/generatedHeaderImage-1750502513291.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://tobysimonds.com/research/2025/06/06/AlphaWrite.html\"\u003eAlphaWrite\u003c/a\u003e is a new framework designed to enhance creative writing with structure and measurable improvements. Developed by Toby Simonds, it employs an evolutionary process to iteratively boost storytelling quality during inference.\u003c/p\u003e\u003cp\u003e\n\nCreative generation has long been a challenge for large language models (LLMs), not due to a lack of fluency, but because of the difficulty in evaluating subjective qualities such as character development, emotional impact, and narrative cohesion. AlphaWrite addresses this by borrowing ideas from evolutionary algorithms and systems like \u003ca href=\"https://deepmind.google/discover/blog/alphaevolve-a-gemini-powered-coding-agent-for-designing-advanced-algorithms/\"\u003eAlphaEvolve\u003c/a\u003e, applying them to story generation.\u003c/p\u003e\u003cp\u003e\n\nThe system operates in iterative cycles. It first generates a broad population of diverse stories, varying in author style and theme. Then, an LLM-based judge conducts pairwise comparisons using a detailed narrative quality rubric and \u003ca href=\"https://deepmind.google/discover/blog/alphaevolve-a-gemini-powered-coding-agent-for-designing-advanced-algorithms/\"\u003eElo rating system\u003c/a\u003e. Top-performing stories are selected to spawn variants with guided improvements in structure, dialogue, or prose, among other dimensions. This process is repeated across generations, aiming to refine stories over time.\u003c/p\u003e\u003c/div\u003e\n\n\u003cp\u003e\u003cmeta charset=\"utf-8\"/\u003e\u003cb id=\"docs-internal-guid-7e397f04-7fff-3bec-5ac3-56dff1e7b280\"\u003e\u003cimg height=\"399\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXcxXKQGc2-NSmajIUdLMqLO9FTg8PExJGDXAOl8TkLnl6PScIdCBBjnENllFH264ssNRk29Q4Mnn-V57rwMplHkEbKuWR9Er-z0hZqQ6LgKjI4b6YCcZahCpK-ym7S1wmJH-qLMBA?key=y69FEy1LqHPV7pQCDGmmCA\" width=\"602\" rel=\"share\"/\u003e\u003c/b\u003e\u003c/p\u003e\n\n\u003cdiv\u003e\u003cp\u003e\u003cem\u003eSource: tobysimonds.com\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\n\nAs Toby Simonds, a creator of AlphaWrite, \u003ca href=\"https://x.com/tobyrsimonds/status/1932697425279660447\"\u003eshared\u003c/a\u003e on X:\u003c/p\u003e\u003c/div\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eThe magic is in the evolutionary pressure. Stories don\u0026#39;t just get generated once – they compete, mutate, and improve across generations. Top performers become ‘parents’ for the next generation, while weak stories get replaced by promising variants.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eEarly experiments using Llama 3.1 8B suggest notable gains. Stories produced by AlphaWrite were preferred 72% of the time over initial single-shot generations and 62% over stories created through sequential prompting, both statistically significant. The system also supports recursive improvement: refined outputs are distilled into the base model, which can then undergo another round of evolution.\u003c/p\u003e\n\n\u003cp\u003e\u003cmeta charset=\"utf-8\"/\u003e\u003cb id=\"docs-internal-guid-09521854-7fff-b8b0-ce6b-01b7662b3a2a\"\u003e\u003cimg height=\"307\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXfKdnBsCq3uieNHzPk4-W-dm4qW1TGyY1Vu7855YdMEcBs4aivzI65-PKbCSOnJIql1NAbhrxqHF9QPIkbwmsY6xmAkrnm06m1BsWY8lL9lL5jOIi1zJ1mTFO9fZEEwEWA9zZXnVw?key=y69FEy1LqHPV7pQCDGmmCA\" width=\"602\" rel=\"share\"/\u003e\u003c/b\u003e\u003c/p\u003e\n\n\u003cdiv\u003e\u003cp\u003e\u003cem\u003eSource: tobysimonds.com\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\n\nWhile the results are promising, not everyone welcomes the development. One user on Hacker News \u003ca href=\"https://news.ycombinator.com/item?id=44246506\"\u003ecommented\u003c/a\u003e:\u003c/p\u003e\u003c/div\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eIf there is something that I would like AI to never touch, it\u0026#39;s that. Please stop making the world worse.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eIn response, another user \u003ca href=\"https://news.ycombinator.com/item?id=44247699\"\u003eadded\u003c/a\u003e: \u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eNot everyone shares your same worldview... You don\u0026#39;t have to participate; ignore AI-generated or AI-assisted content... But you also don\u0026#39;t have to devalue and dismiss the interests of others.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cdiv\u003e\u003cp\u003eThese differing reactions reflect broader cultural tensions around AI’s role in creative domains—whether it enhances or erodes human expression. The AlphaWrite team acknowledges that evaluating story quality remains subjective and warns of risks like prompt bias and creative convergence.\u003c/p\u003e\u003cp\u003e\n\nNonetheless, AlphaWrite’s potential reaches beyond fiction. The authors note that the system helped draft parts of their paper and could be adapted to technical writing, marketing, and academic content. With suitable rubrics, the method could be applied to optimize specific writing tasks or even to improve foundation models themselves.\u003c/p\u003e\u003cp\u003e\n\nThe code is available in the \u003ca href=\"https://github.com/tamassimonds/AlphaEvolveWriting\"\u003eAlphaWrite GitHub repository\u003c/a\u003e for developers and researchers to explore.\u003c/p\u003e\u003c/div\u003e\n\n\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n  \n    \u003cdiv\u003e \n        \u003ch2\u003eAbout the Author\u003c/h2\u003e \n\n        \n            \n                \n            \n            \u003cdiv data-id=\"author-Robert-Krzaczyński\"\u003e\n                    \u003ch4\u003e\u003cstrong\u003eRobert Krzaczyński\u003c/strong\u003e\u003c/h4\u003e\n                    \n                \u003c/div\u003e\n        \n    \u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-21T00:00:00Z",
  "modifiedTime": null
}
