{
  "id": "ba0464d1-7136-4f54-ba55-7562cacc43e7",
  "title": "",
  "link": "http://scripting.com/2025/05/18.html#a232757",
  "description": "Does Joe Rogan know about what's happening with Medicaid?",
  "author": "",
  "published": "Sun, 18 May 2025 23:27:57 GMT",
  "source": "http://scripting.com/rss.xml",
  "categories": null,
  "byline": "",
  "length": 764,
  "excerpt": "Dave Winer, OG blogger, podcaster, developed first apps in many categories. Old enough to know better. It's even worse than it appears.",
  "siteName": "Scripting News",
  "favicon": "",
  "text": "It's even worse than it appears.. Not much to write, so impressed by the way the Knicks got past the Celtics. I don't know any Celtics fans, but I imagine there are some subscribers who are. Hard to imagine how hard the last series hit you all. I don't have anything against the Celtics these days although Paul Pierce is an asshole, and I hope you all know that. Just watched the OKC win over Denver. All around an incredible group in the final four, very diverse and inclusive. And btw now that I think of it, Jaylen Brown was grabbing Knicks players by the balls. I hope you all come to terms with that. We do love Kristaps in New York, a true gentleman. Maybe he and Giannis can come play for the Nets. We may have room for another great team in NY. #",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"idPageTopText\"\u003e\n\t\n\t\u003cp\u003eIt\u0026#39;s even worse than it appears..\u003c/p\u003e\n\t\u003c/div\u003e\u003cdiv id=\"idDayContainer\"\u003e\n\t\t\t\t\n\n\u003cp\u003e\u003ca name=\"a230830\"\u003e\u003c/a\u003e\u003cimg src=\"https://imgs.scripting.com/2018/10/15/knicks.png\"/\u003eNot much to write, so impressed by the way the Knicks got past the Celtics. I don\u0026#39;t know any Celtics fans, but I imagine there are some subscribers who are. Hard to imagine how hard the last series hit you all. I don\u0026#39;t have anything against the Celtics these days although Paul Pierce is an asshole, and I hope you all know that. Just watched the OKC win over Denver. All around an incredible group in the final four, very diverse and inclusive. And btw now that I think of it, Jaylen Brown was \u003ca href=\"https://www.youtube.com/watch?v=fSu9DYgvn1E\"\u003egrabbing\u003c/a\u003e Knicks players by the balls. I hope you all come to terms with that. We do love Kristaps in New York, a true gentleman. Maybe he and Giannis can come play for the Nets. We may have room for another great team in NY.  \u003cspan\u003e\u003ca href=\"http://scripting.com/2025/05/18.html#a230830\" title=\"Direct link to this item.\"\u003e#\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
