{
  "id": "c2fe7865-a26b-4808-a11c-1ce1cb724eaa",
  "title": "Cutting through the noise: How to prioritize Dependabot alerts",
  "link": "https://github.blog/security/application-security/cutting-through-the-noise-how-to-prioritize-dependabot-alerts/",
  "description": "Learn how to effectively prioritize alerts using severity (CVSS), exploitation likelihood (EPSS), and repository properties, so you can focus on the most critical vulnerabilities first. The post Cutting through the noise: How to prioritize Dependabot alerts appeared first on The GitHub Blog.",
  "author": "Andrea Griffiths",
  "published": "Tue, 29 Apr 2025 16:00:39 +0000",
  "source": "https://github.blog/feed/",
  "categories": [
    "Application security",
    "Security",
    "Supply chain security",
    "Vulnerability research",
    "Web application security",
    "advanced security",
    "Dependabot",
    "enterprise",
    "supply chain"
  ],
  "byline": "Andrea Griffiths, Carlin Cherry",
  "length": 11117,
  "excerpt": "Learn how to effectively prioritize alerts so you can focus on the most critical vulnerabilities first.",
  "siteName": "The GitHub Blog",
  "favicon": "https://github.blog/wp-content/uploads/2019/01/cropped-github-favicon-512.png?fit=192%2C192",
  "text": "Let’s be honest: that flood of security alerts in your inbox can feel completely overwhelming. We’ve been there too. As a developer advocate and a product manager focused on security at GitHub, we’ve seen firsthand how overwhelming it can be to triage vulnerability alerts. Dependabot is fantastic at spotting vulnerabilities, but without a smart way to prioritize them, you might be burning time on minor issues or (worse) missing the critical ones buried in the pile. So, we’ve combined our perspectives—one from the security trenches and one from the developer workflow side—to share how we use Exploit Prediction Scoring System (EPSS) scores and repository properties to transform the chaos into clarity and make informed prioritization decisions. Understanding software supply chain security If you’re building software today, you’re not just writing code—you’re assembling it from countless open source packages. In fact, 96% of modern applications are powered by open source software. With such widespread adoption, open source software has become a prime target for malicious actors looking to exploit vulnerabilities at scale. Attackers continuously probe these projects for weaknesses, contributing to the thousands of Common Vulnerabilities and Exposures (CVEs) reported each year. But not all vulnerabilities carry the same level of risk. The key question becomes not just how to address vulnerabilities, but how to intelligently prioritize them based on your specific application architecture, deployment context, and business needs. Understanding EPSS: probability of exploitation with severity if it happens When it comes to prioritization, many teams still rely solely on severity scores like the Common Vulnerability Scoring System (CVSS). But not all “critical” vulnerabilities are equally likely to be exploited. That’s where EPSS comes in—it tells you the probability that a vulnerability will actually be exploited in the wild within the next 30 days. Think of it this way: CVSS tells you how bad the damage could be if someone broke into your house, while EPSS tells you how likely it is that someone is actually going to try. Both pieces of information are crucial! This approach allows you to focus resources effectively. As security pro Daniel Miessler points out in Efficient Security Principle, “The security baseline of an offering or system faces continuous downward pressure from customer excitement about, or reliance on, the offering in question.” Translation? We’re always balancing security with usability, and we need to be smart about where we focus our limited time and energy. EPSS helps us spot the vulnerabilities with a higher likelihood of exploitation, allowing us to fix the most pressing risks first. Smart prioritization steps 1. Combine EPSS with CVSS One approach is to look at both likelihood (EPSS) and potential impact (CVSS) together. It’s like comparing weather forecasts—you care about both the chance of rain and how severe the storm might be. For example, when prioritizing what to fix first, a vulnerability with: EPSS: 85% (highly likelihood of exploitation) CVSS: 9.8 (critical severity) …should almost always take priority over one with: EPSS: 0.5% (much less likely to be exploited) CVSS: 9.0 (critical severity) Despite both having red-alert CVSS ratings, the first vulnerability is the one keeping us up at night. 2. Leverage repository properties for context-aware prioritization Not all code is created equal when it comes to security risk. Ask yourself: Is this repo public or private? (Public repositories expose vulnerabilities to potential attackers) Does it handle sensitive data like customer info or payments? How often do you deploy? (Frequent deployments face tighter remediation times) One way to provide context-aware prioritization systematically is with custom repository properties, which allow you to add contextual information about your repositories with information such as compliance frameworks, data sensitivity, or project details. By applying these custom properties to your repositories, you create a structured classification system that helps you identify the “repos that matter,” so you can prioritize Dependabot alerts for your production code rather than getting distracted by your totally-not-a-priority test-vulnerabilities-local repo. 3. Establish clear response Service Level Agreements (SLAs) based on risk levels Once you’ve done your homework on both the vulnerability characteristics and your repository context in your organization, you can establish clear timelines for responses that make sense for your organization resources and risk tolerance. Let’s see how this works in real life: Here’s an example risk matrix that combines both EPSS (likelihood of exploitation) and CVSS (severity of impact). EPSS ↓ / CVSS → Low Medium High Low ✅ When convenient ⏳ Next sprint ⚠️ Fix Soon Medium ⏳ Next sprint ⚠️ Fix soon 🔥 Fix soon High ⚠️ Fix Soon 🔥 Fix soon 🚨 Fix first Say you get an alert about a vulnerability in your payment processing library that has both a high EPSS score and high CVSS rating. Red alert! Looking at our matrix, that’s a “Fix first” situation. You’ll probably drop what you’re doing, and put in some quick mitigations while the team works on a proper fix. But what about that low-risk vulnerability in some testing utility that nobody even uses in production? Low EPSS, low CVSS… that can probably wait until “when convenient” within the next few weeks. No need to sound the alarm or pull developers off important feature work. This kind of prioritization just makes sense. Applying the same urgency to every single vulnerability just leads to alert fatigue and wasted resources, and having clear guidelines helps your team know where to focus first. Integration with enterprise governance For enterprise organizations, GitHub’s auto-triage rules help provide consistent management of security alerts at scale across multiple teams and repositories. Auto-triage rules allow you to create custom criteria for automatically handling alerts based on factors like severity, EPSS, scope, package name, CVE, ecosystem, and manifest location. You can create your own custom rules to control how Dependabot auto-dismisses and reopens alerts, so you can focus on the alerts that matter. These rules are particularly powerful because they: Apply to both existing and future alerts. Allow for proactive filtering of false positives. Enable “snooze until patch” functionality for vulnerabilities without a fix available. Provide visibility into automated decisions through the auto-dismiss alert resolution. GitHub-curated presets like auto-dismissal of false positives are free for everyone and all repositories, while custom auto-triage rules are available for free on public repositories and as part of GitHub Advanced Security for private repositories. The real-world impact of smart prioritization When teams get prioritization right, organizations can experience significant improvements in security management. Research firmly supports this approach: The comprehensive Cyentia EPSS study found teams could achieve 87% coverage of exploited vulnerabilities by focusing on just 10% of them, dramatically reducing necessary remediation efforts by 83% compared to traditional CVSS-based approaches. This isn’t just theoretical, it translates to real-world efficiency gains. This reduction is not just about numbers. When security teams provide clear reasoning behind prioritization decisions, developers gain a better understanding of security requirements. This transparency builds trust between teams, potentially leading to more efficient resolution processes and improved collaboration between security and development teams. The most successful security teams pair smart automation with human judgment and transparent communication. This shift from alert overload to smart filtering lets teams focus on what truly matters, turning security from a constant headache into a manageable, strategic advantage. Getting started Ready to tame that flood of alerts? Here’s how to begin: Enable Dependabot security updates: If you haven’t already, turn on Dependabot alerts and automatic security updates in your repository settings. This is your first line of defense! Set up auto-triage rules: Create custom rules based on severity, scope, package name, and other criteria to automatically handle low-priority alerts. Auto-triage rules are a powerful tool to help you reduce false positives and alert fatigue substantially, while better managing your alerts at scale. Establish clear prioritization criteria: Define what makes a vulnerability critical for your specific projects. Develop a clear matrix for identifying critical issues, considering factors like impact assessment, system criticality, and exploit likelihood. Consult your remediation workflow for priority alerts: Verify the vulnerability’s authenticity and develop a quick mitigation strategy based on your organization’s risk response matrix. By implementing these smart prioritization strategies, you’ll help focus your team’s energy where it matters most: keeping your code secure and your customers protected. No more security alert overload, just focused, effective prioritization. Want to streamline security alert management for your organization? Start using Dependabot for free or unlock advanced prioritization with GitHub Code Security today. Written by Andrea is a Senior Developer Advocate at GitHub with over a decade of experience in developer tools. She combines technical depth with a mission to make advanced technologies more accessible. After transitioning from Army service and construction management to software development, she brings a unique perspective to bridging complex engineering concepts with practical implementation. She lives in Florida with her Welsh partner, two sons, and two dogs, where she continues to drive innovation and support open source through GitHub's global initiatives. Find her online @alacolombiadev. Carlin is a Product Manager at GitHub working in GitHub Advanced Security, with a focus on Dependabot. Her background in software engineering and data science informs her data-driven approach to product management. She lives in Washington with her partner and their dog, Cookie, and spends her free time cycling and playing competitive board games. Explore more from GitHub Docs Everything you need to master GitHub, all in one place. Go to Docs GitHub Build what’s next on GitHub, the place for anyone from anywhere to build anything. Start building Customer stories Meet the companies and engineering teams that build with GitHub. Learn more Enterprise content Executive insights, curated just for you Get started",
  "image": "https://github.blog/wp-content/uploads/2024/02/Security-DarkMode-2-2.png?fit=1200%2C630",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection\u003e\n\t\n\u003cp\u003eLet’s be honest: that flood of security alerts in your inbox can feel completely overwhelming. We’ve been there too.\u003c/p\u003e\n\u003cp\u003eAs a developer advocate and a product manager focused on security at GitHub, we’ve seen firsthand how overwhelming it can be to triage vulnerability alerts. Dependabot is fantastic at spotting vulnerabilities, but without a smart way to prioritize them, you might be burning time on minor issues or (worse) missing the critical ones buried in the pile.\u003c/p\u003e\n\u003cp\u003eSo, we’ve combined our perspectives—one from the security trenches and one from the developer workflow side—to share how we use \u003ca href=\"https://www.first.org/epss/\"\u003eExploit Prediction Scoring System (EPSS)\u003c/a\u003e scores and repository properties to transform the chaos into clarity and make informed prioritization decisions.\u003c/p\u003e\n\u003ch2 id=\"understanding-software-supply-chain-security\" id=\"understanding-software-supply-chain-security\"\u003eUnderstanding software supply chain security\u003ca href=\"#understanding-software-supply-chain-security\" aria-label=\"Understanding software supply chain security\"\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eIf you’re building software today, you’re not just writing code—you’re assembling it from countless open source packages. In fact, \u003ca href=\"https://www.linuxfoundation.org/research/census-iii?hsLang=en\"\u003e96% of modern applications\u003c/a\u003e are powered by open source software. With such widespread adoption, open source software has become a prime target for malicious actors looking to exploit vulnerabilities at scale.\u003c/p\u003e\n\u003cp\u003eAttackers continuously probe these projects for weaknesses, contributing to the thousands of Common Vulnerabilities and Exposures (CVEs) \u003ca href=\"https://github.blog/security/supply-chain-security/securing-the-open-source-supply-chain-the-essential-role-of-cves/\"\u003ereported\u003c/a\u003e each year. But not all vulnerabilities carry the same level of risk. The key question becomes not just how to address vulnerabilities, but how to intelligently prioritize them based on your specific application architecture, deployment context, and business needs.\u003c/p\u003e\n\u003ch2 id=\"understanding-epss-probability-of-exploitation-with-severity-if-it-happens\" id=\"understanding-epss-probability-of-exploitation-with-severity-if-it-happens\"\u003eUnderstanding EPSS: probability of exploitation with severity if it happens\u003ca href=\"#understanding-epss-probability-of-exploitation-with-severity-if-it-happens\" aria-label=\"Understanding EPSS: probability of exploitation with severity if it happens\"\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eWhen it comes to prioritization, many teams still rely solely on severity scores like the Common Vulnerability Scoring System (CVSS). But not all “critical” vulnerabilities are equally likely to be exploited. That’s where EPSS comes in—it tells you the probability that a vulnerability will actually be exploited in the wild within the next 30 days.\u003c/p\u003e\n\u003cp\u003eThink of it this way: CVSS tells you how bad the damage could be if someone broke into your house, while EPSS tells you how likely it is that someone is actually going to try. Both pieces of information are crucial! This approach allows you to focus resources effectively.\u003c/p\u003e\n\u003cp\u003eAs security pro Daniel Miessler points out in \u003ca href=\"https://danielmiessler.com/blog/efficient-security-principle\"\u003eEfficient Security Principle\u003c/a\u003e, “The security baseline of an offering or system faces continuous downward pressure from customer excitement about, or reliance on, the offering in question.”\u003c/p\u003e\n\u003cp\u003eTranslation? We’re always balancing security with usability, and we need to be smart about where we focus our limited time and energy. EPSS helps us spot the vulnerabilities with a higher likelihood of exploitation, allowing us to fix the most pressing risks first.\u003c/p\u003e\n\u003ch2 id=\"smart-prioritization-steps\" id=\"smart-prioritization-steps\"\u003eSmart prioritization steps\u003ca href=\"#smart-prioritization-steps\" aria-label=\"Smart prioritization steps\"\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003ch3 id=\"1-combine-epss-with-cvss\" id=\"1-combine-epss-with-cvss\"\u003e1. Combine EPSS with CVSS\u003ca href=\"#1-combine-epss-with-cvss\" aria-label=\"1. Combine EPSS with CVSS\"\u003e\u003c/a\u003e\u003c/h3\u003e\n\u003cp\u003eOne approach is to look at both likelihood (EPSS) and potential impact (CVSS) together. It’s like comparing weather forecasts—you care about both the chance of rain \u003cem\u003eand\u003c/em\u003e how severe the storm might be.\u003c/p\u003e\n\u003cp\u003eFor example, when prioritizing what to fix first, a vulnerability with:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEPSS: 85% (highly likelihood of exploitation)  \u003c/li\u003e\n\u003cli\u003eCVSS: 9.8 (critical severity)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e…should almost always take priority over one with:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEPSS: 0.5% (much less likely to be exploited)  \u003c/li\u003e\n\u003cli\u003eCVSS: 9.0 (critical severity)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDespite both having red-alert CVSS ratings, the first vulnerability is the one keeping us up at night.\u003c/p\u003e\n\u003ch3 id=\"2-leverage-repository-properties-for-context-aware-prioritization\" id=\"2-leverage-repository-properties-for-context-aware-prioritization\"\u003e2. Leverage repository properties for context-aware prioritization\u003ca href=\"#2-leverage-repository-properties-for-context-aware-prioritization\" aria-label=\"2. Leverage repository properties for context-aware prioritization\"\u003e\u003c/a\u003e\u003c/h3\u003e\n\u003cp\u003eNot all code is created equal when it comes to security risk. Ask yourself:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIs this repo public or private? (Public repositories expose vulnerabilities to potential attackers)  \u003c/li\u003e\n\u003cli\u003eDoes it handle sensitive data like customer info or payments?  \u003c/li\u003e\n\u003cli\u003eHow often do you deploy? (Frequent deployments face tighter remediation times)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOne way to provide context-aware prioritization systematically is with \u003ca href=\"https://docs.github.com/en/organizations/managing-organization-settings/managing-custom-properties-for-repositories-in-your-organization#about-custom-properties\"\u003ecustom repository properties\u003c/a\u003e, which allow you to add contextual information about your repositories with information such as compliance frameworks, data sensitivity, or project details. By applying these custom properties to your repositories, you create a structured classification system that helps you identify the “repos that matter,” so you can prioritize Dependabot alerts for your production code rather than getting distracted by your totally-not-a-priority \u003ccode\u003etest-vulnerabilities-local\u003c/code\u003e repo.\u003c/p\u003e\n\u003ch3 id=\"3-establish-clear-response-service-level-agreements-slas-based-on-risk-levels\" id=\"3-establish-clear-response-service-level-agreements-slas-based-on-risk-levels\"\u003e3. Establish clear response Service Level Agreements (SLAs) based on risk levels\u003ca href=\"#3-establish-clear-response-service-level-agreements-slas-based-on-risk-levels\" aria-label=\"3. Establish clear response Service Level Agreements (SLAs) based on risk levels\"\u003e\u003c/a\u003e\u003c/h3\u003e\n\u003cp\u003eOnce you’ve done your homework on both the vulnerability characteristics and your repository context in your organization, you can establish clear timelines for responses that make sense for your organization resources and risk tolerance.\u003c/p\u003e\n\u003cp\u003eLet’s see how this works in real life: Here’s an example risk matrix that combines both EPSS (likelihood of exploitation) and CVSS (severity of impact).\u003c/p\u003e\n\u003cdiv\u003e\u003ctable\u003e\n\u003cthead\u003e\n\u003ctr\u003e\n\u003cth\u003eEPSS ↓ / CVSS →\u003c/th\u003e\n\u003cth\u003eLow\u003c/th\u003e\n\u003cth\u003eMedium\u003c/th\u003e\n\u003cth\u003eHigh\u003c/th\u003e\n\u003c/tr\u003e\n\u003c/thead\u003e\n\u003ctbody\u003e\n\u003ctr\u003e\n\u003ctd\u003e\u003cstrong\u003eLow\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003e✅ When convenient\u003c/td\u003e\n\u003ctd\u003e⏳ Next sprint\u003c/td\u003e\n\u003ctd\u003e⚠️ Fix Soon\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e\u003cstrong\u003eMedium\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003e⏳ Next sprint\u003c/td\u003e\n\u003ctd\u003e⚠️ Fix soon\u003c/td\u003e\n\u003ctd\u003e🔥 Fix soon\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e\u003cstrong\u003eHigh\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003e⚠️ Fix Soon\u003c/td\u003e\n\u003ctd\u003e🔥 Fix soon\u003c/td\u003e\n\u003ctd\u003e🚨 Fix first\u003c/td\u003e\n\u003c/tr\u003e\n\u003c/tbody\u003e\n\u003c/table\u003e\u003c/div\u003e\n\u003cp\u003eSay you get an alert about a vulnerability in your payment processing library that has both a high EPSS score and high CVSS rating. Red alert! Looking at our matrix, that’s a “Fix first” situation. You’ll probably drop what you’re doing, and put in some quick mitigations while the team works on a proper fix.\u003c/p\u003e\n\u003cp\u003eBut what about that low-risk vulnerability in some testing utility that nobody even uses in production? Low EPSS, low CVSS… that can probably wait until “when convenient” within the next few weeks. No need to sound the alarm or pull developers off important feature work.\u003c/p\u003e\n\u003cp\u003eThis kind of prioritization just makes sense. Applying the same urgency to every single vulnerability just leads to alert fatigue and wasted resources, and having clear guidelines helps your team know where to focus first.\u003c/p\u003e\n\u003ch2 id=\"integration-with-enterprise-governance\" id=\"integration-with-enterprise-governance\"\u003eIntegration with enterprise governance\u003ca href=\"#integration-with-enterprise-governance\" aria-label=\"Integration with enterprise governance\"\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eFor enterprise organizations, GitHub’s \u003ca href=\"https://docs.github.com/en/code-security/dependabot/dependabot-auto-triage-rules/about-dependabot-auto-triage-rules\"\u003eauto-triage rules\u003c/a\u003e help provide consistent management of security alerts at scale across multiple teams and repositories.\u003c/p\u003e\n\u003cp\u003eAuto-triage rules allow you to create custom criteria for automatically handling alerts based on factors like severity, EPSS, scope, package name, CVE, ecosystem, and manifest location. You can create your own custom rules to control how Dependabot auto-dismisses and reopens alerts, so you can focus on the alerts that matter.\u003c/p\u003e\n\u003cp\u003eThese rules are particularly powerful because they:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eApply to both existing and future alerts.  \u003c/li\u003e\n\u003cli\u003eAllow for proactive filtering of false positives.  \u003c/li\u003e\n\u003cli\u003eEnable “snooze until patch” functionality for vulnerabilities without a fix available.  \u003c/li\u003e\n\u003cli\u003eProvide visibility into automated decisions through the auto-dismiss alert resolution.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eGitHub-curated presets like auto-dismissal of false positives are free for everyone and all repositories, while custom auto-triage rules are available for free on public repositories and as part of GitHub Advanced Security for private repositories.\u003c/p\u003e\n\u003ch2 id=\"the-real-world-impact-of-smart-prioritization\" id=\"the-real-world-impact-of-smart-prioritization\"\u003eThe real-world impact of smart prioritization\u003ca href=\"#the-real-world-impact-of-smart-prioritization\" aria-label=\"The real-world impact of smart prioritization\"\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eWhen teams get prioritization right, organizations can experience significant improvements in security management. Research firmly supports this approach: The comprehensive \u003ca href=\"https://www.cyentia.com/epss-study/\"\u003eCyentia EPSS study\u003c/a\u003e found teams could achieve 87% coverage of exploited vulnerabilities by focusing on just 10% of them, dramatically reducing necessary remediation efforts by 83% compared to traditional CVSS-based approaches. This isn’t just theoretical, it translates to real-world efficiency gains.\u003c/p\u003e\n\u003cp\u003eThis reduction is not just about numbers. When security teams provide clear reasoning behind prioritization decisions, developers gain a better understanding of security requirements. This transparency builds trust between teams, potentially leading to more efficient resolution processes and improved collaboration between security and development teams.\u003c/p\u003e\n\u003cp\u003eThe most successful security teams pair smart automation with human judgment and transparent communication. This shift from alert overload to smart filtering lets teams focus on what truly matters, turning security from a constant headache into a manageable, strategic advantage.\u003c/p\u003e\n\u003ch2 id=\"getting-started\" id=\"getting-started\"\u003eGetting started\u003ca href=\"#getting-started\" aria-label=\"Getting started\"\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eReady to tame that flood of alerts? Here’s how to begin:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eEnable Dependabot security updates\u003c/strong\u003e: If you haven’t already, \u003ca href=\"https://www.youtube.com/watch?v=yvXKlDgiGHo\"\u003eturn on Dependabot alerts\u003c/a\u003e and automatic security updates in your repository settings. This is your first line of defense!\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eSet up auto-triage rules\u003c/strong\u003e: \u003ca href=\"https://docs.github.com/en/code-security/dependabot/dependabot-auto-triage-rules/about-dependabot-auto-triage-rules\"\u003eCreate custom rules\u003c/a\u003e based on severity, scope, package name, and other criteria to automatically handle low-priority alerts. Auto-triage rules are a powerful tool to help you reduce false positives and alert fatigue substantially, while better managing your alerts at scale.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eEstablish clear prioritization criteria\u003c/strong\u003e: Define what makes a vulnerability critical for your specific projects. Develop a clear matrix for identifying critical issues, considering factors like impact assessment, system criticality, and exploit likelihood.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eConsult your remediation workflow for priority alerts:\u003c/strong\u003e Verify the vulnerability’s authenticity and develop a quick mitigation strategy based on your organization’s risk response matrix.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBy implementing these smart prioritization strategies, you’ll help focus your team’s energy where it matters most: keeping your code secure and your customers protected. No more security alert overload, just focused, effective prioritization.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWant to streamline security alert management for your organization?\u003c/strong\u003e Start using Dependabot for free or unlock advanced prioritization with \u003ca href=\"https://github.com/security/advanced-security\"\u003eGitHub Code Security\u003c/a\u003e today.\u003c/p\u003e\n\n\t\n\n\t\u003cdiv\u003e\n\t\u003ch2\u003e\n\t\tWritten by\t\u003c/h2\u003e\n\t\n\t\t\t\u003carticle\u003e\n\t\u003cdiv\u003e\n\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cpicture\u003e\n\t\t\t\t\t\u003csource srcset=\"https://github.blog/wp-content/uploads/2025/03/cropped-IMG_1971-200x200.jpeg\" width=\"120\" height=\"120\" media=\"(min-width: 768px)\"/\u003e\n\t\t\t\t\t\u003cimg src=\"https://github.blog/wp-content/uploads/2025/03/cropped-IMG_1971-200x200.jpeg\" alt=\"Andrea Griffiths\" width=\"80\" height=\"80\" loading=\"lazy\" decoding=\"async\"/\u003e\n\t\t\t\t\u003c/picture\u003e\n\t\t\t\u003c/div\u003e\n\t\t\t\t\n\t\t\t\t\t\u003cp\u003eAndrea is a Senior Developer Advocate at GitHub with over a decade of experience in developer tools. She combines technical depth with a mission to make advanced technologies more accessible. After transitioning from Army service and construction management to software development, she brings a unique perspective to bridging complex engineering concepts with practical implementation. She lives in Florida with her Welsh partner, two sons, and two dogs, where she continues to drive innovation and support open source through GitHub\u0026#39;s global initiatives. Find her online @alacolombiadev.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\u003c/article\u003e\n\t\t\t\u003carticle\u003e\n\t\u003cdiv\u003e\n\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cpicture\u003e\n\t\t\t\t\t\u003csource srcset=\"https://avatars.githubusercontent.com/u/61124041?v=4\u0026amp;s=200\" width=\"120\" height=\"120\" media=\"(min-width: 768px)\"/\u003e\n\t\t\t\t\t\u003cimg src=\"https://avatars.githubusercontent.com/u/61124041?v=4\u0026amp;s=200\" alt=\"Carlin Cherry\" width=\"80\" height=\"80\" loading=\"lazy\" decoding=\"async\"/\u003e\n\t\t\t\t\u003c/picture\u003e\n\t\t\t\u003c/div\u003e\n\t\t\t\t\n\t\t\t\t\t\u003cp\u003eCarlin is a Product Manager at GitHub working in GitHub Advanced Security, with a focus on Dependabot. Her background in software engineering and data science informs her data-driven approach to product management. She lives in Washington with her partner and their dog, Cookie, and spends her free time cycling and playing competitive board games.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\u003c/article\u003e\n\t\u003c/div\u003e\n\u003c/section\u003e\u003cdiv\u003e\n\t\u003ch2\u003e\n\t\tExplore more from GitHub\t\u003c/h2\u003e\n\t\u003cdiv\u003e\n\t\t\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cimg src=\"https://github.blog/wp-content/uploads/2024/07/Icon-Circle.svg\" width=\"44\" height=\"44\" alt=\"Docs\"/\u003e\u003c/p\u003e\u003ch3\u003e\n\t\t\tDocs\t\t\u003c/h3\u003e\n\t\t\u003cp\u003eEverything you need to master GitHub, all in one place.\u003c/p\u003e\n\t\t\t\t\t\u003cp\u003e\n\t\t\t\t\u003ca data-analytics-click=\"Blog, click on module, text: Go to Docs; ref_location:bottom recirculation;\" href=\"https://docs.github.com/\" target=\"_blank\" aria-label=\"Go to Docs\"\u003e\n\t\t\t\t\tGo to Docs\t\t\t\t\t\t\t\t\t\t\t\u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 16 16\" width=\"16\" height=\"16\"\u003e\u003cpath fill-rule=\"evenodd\" d=\"M10.604 1h4.146a.25.25 0 01.25.25v4.146a.25.25 0 01-.427.177L13.03 4.03 9.28 7.78a.75.75 0 01-1.06-1.06l3.75-3.75-1.543-1.543A.25.25 0 0110.604 1zM3.75 2A1.75 1.75 0 002 3.75v8.5c0 .966.784 1.75 1.75 1.75h8.5A1.75 1.75 0 0014 12.25v-3.5a.75.75 0 00-1.5 0v3.5a.25.25 0 01-.25.25h-8.5a.25.25 0 01-.25-.25v-8.5a.25.25 0 01.25-.25h3.5a.75.75 0 000-1.5h-3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\n\t\t\t\t\t\t\t\t\t\u003c/a\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cimg src=\"https://github.blog/wp-content/uploads/2024/07/Icon_95220f.svg\" width=\"44\" height=\"44\" alt=\"GitHub\"/\u003e\u003c/p\u003e\u003ch3\u003e\n\t\t\tGitHub\t\t\u003c/h3\u003e\n\t\t\u003cp\u003eBuild what’s next on GitHub, the place for anyone from anywhere to build anything.\u003c/p\u003e\n\t\t\t\t\t\u003cp\u003e\n\t\t\t\t\u003ca data-analytics-click=\"Blog, click on module, text: Start building; ref_location:bottom recirculation;\" href=\"https://github.blog/developer-skills/github/\" target=\"_blank\" aria-label=\"Start building\"\u003e\n\t\t\t\t\tStart building\t\t\t\t\t\t\t\t\t\t\t\u003csvg xmlns=\"http://www.w3.org/2000/svg\" width=\"16\" height=\"16\" viewBox=\"0 0 16 16\" fill=\"none\"\u003e\u003cpath fill=\"currentColor\" d=\"M7.28033 3.21967C6.98744 2.92678 6.51256 2.92678 6.21967 3.21967C5.92678 3.51256 5.92678 3.98744 6.21967 4.28033L7.28033 3.21967ZM11 8L11.5303 8.53033C11.8232 8.23744 11.8232 7.76256 11.5303 7.46967L11 8ZM6.21967 11.7197C5.92678 12.0126 5.92678 12.4874 6.21967 12.7803C6.51256 13.0732 6.98744 13.0732 7.28033 12.7803L6.21967 11.7197ZM6.21967 4.28033L10.4697 8.53033L11.5303 7.46967L7.28033 3.21967L6.21967 4.28033ZM10.4697 7.46967L6.21967 11.7197L7.28033 12.7803L11.5303 8.53033L10.4697 7.46967Z\"\u003e\u003c/path\u003e\u003cpath stroke=\"currentColor\" d=\"M1.75 8H11\" stroke-width=\"1.5\" stroke-linecap=\"round\"\u003e\u003c/path\u003e\u003c/svg\u003e\n\t\t\t\t\t\t\t\t\t\u003c/a\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cimg src=\"https://github.blog/wp-content/uploads/2024/07/Icon_da43dc.svg\" width=\"44\" height=\"44\" alt=\"Customer stories\"/\u003e\u003c/p\u003e\u003ch3\u003e\n\t\t\tCustomer stories\t\t\u003c/h3\u003e\n\t\t\u003cp\u003eMeet the companies and engineering teams that build with GitHub.\u003c/p\u003e\n\t\t\t\t\t\u003cp\u003e\n\t\t\t\t\u003ca data-analytics-click=\"Blog, click on module, text: Learn more; ref_location:bottom recirculation;\" href=\"https://github.com/customer-stories\" target=\"_blank\" aria-label=\"Learn more\"\u003e\n\t\t\t\t\tLearn more\t\t\t\t\t\t\t\t\t\t\t\u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 16 16\" width=\"16\" height=\"16\"\u003e\u003cpath fill-rule=\"evenodd\" d=\"M10.604 1h4.146a.25.25 0 01.25.25v4.146a.25.25 0 01-.427.177L13.03 4.03 9.28 7.78a.75.75 0 01-1.06-1.06l3.75-3.75-1.543-1.543A.25.25 0 0110.604 1zM3.75 2A1.75 1.75 0 002 3.75v8.5c0 .966.784 1.75 1.75 1.75h8.5A1.75 1.75 0 0014 12.25v-3.5a.75.75 0 00-1.5 0v3.5a.25.25 0 01-.25.25h-8.5a.25.25 0 01-.25-.25v-8.5a.25.25 0 01.25-.25h3.5a.75.75 0 000-1.5h-3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\n\t\t\t\t\t\t\t\t\t\u003c/a\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cimg src=\"https://github.blog/wp-content/uploads/2022/05/careers.svg\" width=\"44\" height=\"44\" alt=\"Enterprise content\"/\u003e\u003c/p\u003e\u003ch3\u003e\n\t\t\tEnterprise content\t\t\u003c/h3\u003e\n\t\t\u003cp\u003eExecutive insights, curated just for you\u003c/p\u003e\n\t\t\t\t\t\u003cp\u003e\n\t\t\t\t\u003ca data-analytics-click=\"Blog, click on module, text: Get started; ref_location:bottom recirculation;\" href=\"https://github.com/solutions/executive-insights\" target=\"_blank\" aria-label=\"Get started\"\u003e\n\t\t\t\t\tGet started\t\t\t\t\t\t\t\t\t\t\t\u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 16 16\" width=\"16\" height=\"16\"\u003e\u003cpath fill-rule=\"evenodd\" d=\"M10.604 1h4.146a.25.25 0 01.25.25v4.146a.25.25 0 01-.427.177L13.03 4.03 9.28 7.78a.75.75 0 01-1.06-1.06l3.75-3.75-1.543-1.543A.25.25 0 0110.604 1zM3.75 2A1.75 1.75 0 002 3.75v8.5c0 .966.784 1.75 1.75 1.75h8.5A1.75 1.75 0 0014 12.25v-3.5a.75.75 0 00-1.5 0v3.5a.25.25 0 01-.25.25h-8.5a.25.25 0 01-.25-.25v-8.5a.25.25 0 01.25-.25h3.5a.75.75 0 000-1.5h-3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\n\t\t\t\t\t\t\t\t\t\u003c/a\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\t\u003c/div\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2025-04-29T16:00:39Z",
  "modifiedTime": null
}
