{
  "id": "d8225cf5-5f82-47bd-a415-40453e516110",
  "title": "Enhancing Cloud Usage Forecasting, Monitoring \u0026 Optimizing",
  "link": "https://www.etsy.com/codeascraft/enhancing-cloud-usage-forecasting-monitoring--optimizing?utm_source=OpenGraph\u0026utm_medium=PageTools\u0026utm_campaign=Share",
  "description": "In 2020, Etsy concluded its migration from an on-premise data center to the Google Cloud Platform (GCP). During this transition, a dedicated team of program managers ensured the migration's success. Post-migration, this team evolved into the Etsy FinOps team, dedicated to maximizing the organization's cloud value by fostering collaborations within and outside the organization, particularly with our Cloud Providers. Positioned within the Engineering organization under the Chief Architect, the FinOps team operates independently of any one Engineering org or function and optimizes globally rather than locally. This positioning, combined with Etsy's robust engineering culture focused on efficiency and craftsmanship, has fostered what we believe is a mature and successful FinOps practice at Etsy. Forecast Methodology A critical aspect of our FinOps approach is a strong forecasting methodology. A reliable forecast establishes an expected spending baseline against which we track actual spending, enabling us to identify deviations. We classify costs into distinct buckets: Core Infrastructure: Includes the costs of infrastructure and services essential for operating the Etsy.com website. Machine Learning \u0026 Product Enablement: Encompasses costs related to services supporting machine learning initiatives like search, recommendations, and advertisements. Data Enablement: Encompasses costs related to shared platforms for data collection, data processing and workflow orchestration. Dev: Encompasses non-production resources. The FinOps forecasting model relies on a trailing Cost Per Visit (CPV) metric. While CPV provides valuable insights into changes, it's not without limitations: A meaningful portion of web traffic to Etsy involves non-human activity, like web crawlers that’s not accounted for in CPV. Some services have weaker correlations to user visits. Dev, data, and ML training costs lack direct correlations to visits and are susceptible to short-term spikes during POCs, experiments or big data workflows. A/B tests for new features can lead to short-term CPV increases, potentially resulting in long-term CPV changes upon successful feature launches. Periodically, we run regression tests to validate if CPV should drive our forecasts. In addition to visits we have looked into headcount, GMV(Gross Merchandise Value) and revenue as independent variables. Thus far, visits have consistently exhibited the highest correlation to costs. Monitoring and Readouts We monitor costs using internal tools built on BigQuery and Looker. Customized dashboards for all of our Engineering teams display cost trends, CPV, and breakdowns by labels and workflows. Additionally, we've set up alerts to identify sudden spikes or gradual week-over-week/month-over-month growth. Collaboration with the Finance department occurs weekly to compare actual costs against forecasts, identifying discrepancies for timely corrections. Furthermore, the FinOps team conducts recurring meetings with major cost owners and monthly readouts for Engineering and Product leadership to review forecasted figures and manage cost variances. While we track costs at the organization/cost center level, we don't charge costs back to the teams. This both lowers our overhead and more importantly, provides flexibility to make tradeoffs that enable Engineering velocity. Cost Increase Detection \u0026 Mitigation Maintaining a healthy CPV involves swiftly identifying and mitigating cost increases, to achieve this we: Analysis: Gather information on the increase's source, whether from specific cloud products, workflows, or usage pattern changes (ie variance in resource utilization). Collaboration: Engage relevant teams, sharing insights and seeking additional context. Validation: Validate cost increases from product launches or internal changes, securing buy-in from leadership if needed. Mitigation: Unexpected increases undergo joint troubleshooting, where we outline and assign action items to owners, until issues are resolved. Communication: Inform our finance partners about recent cost trends and their incorporation into the expected spend forecast post-confirmation or resolution with teams and engineering leadership. Cost Optimization Initiatives Another side of maintaining a healthy CPV involves cost optimization, offsetting increases from product launches. Ideas for cost-saving come as a result of collaboration between FinOps and engineering teams, with the Architecture team validating and implementing efficiency improvements. Notably we focus on the engineering or business impact of the cost optimization rather than solely on savings, recognizing that inefficiencies often signal larger problems. Based on effort vs. value evaluations, some ideas are added to backlogs, while major initiatives warrant dedicated squads.Below is a breakout of some of the major wins we have had in the last year or so. GCS Storage Optimization - In 2023 we stood up a squad focused on optimizing Etsy’s use of GCS, as it has been one of the largest growth areas for us over the past few years. The squad delivered a number of improvements including improved monitoring of usage, automation features for Data engineers, implementation of TTLs that match data access patterns/business needs and the adoption of Intelligent tiering. Due to these efforts, Etsy’s GCS usage is now less than it was 2 years ago. Compute Optimization - Migrated over 90% of Etsy infrastructure that is serving traffic to the latest and greatest CPU platform. This improved our serving latency while reducing cost. Increased Automation for model deployment - In an effort to improve the developer experience, our machine learning enablement team developed a tool to automate the compute configurations for new models being deployed, which also ended up saving us money. Network Compression - Enabling network compression between our high throughput services both improved the latency profile and drastically reduced the networking cost. What's Next While our core infrastructure spend is well understood, our focus is on improving visibility into our Machine Learning platform's spend. As these systems are shared across teams, dissecting costs tied to individual product launches is challenging. Enhanced visibility will help us refine our ROI analysis of product experiments and pinpoint future areas of opportunity for optimization.",
  "author": "Anthony Tambasco",
  "published": "Mon, 17 Jun 2024 09:58:16 -0400",
  "source": "https://codeascraft.com/feed/atom/",
  "categories": null,
  "byline": "By Anthony Tambasco, Dany Daya Jun 17, 2024",
  "length": 6424,
  "excerpt": "In 2020, Etsy concluded its migration from an on-premise data center to the Google Cloud Platform (GCP). During this transition,...",
  "siteName": "Etsy Engineering",
  "favicon": "",
  "text": "In 2020, Etsy concluded its migration from an on-premise data center to the Google Cloud Platform (GCP). During this transition, a dedicated team of program managers ensured the migration's success. Post-migration, this team evolved into the Etsy FinOps team, dedicated to maximizing the organization's cloud value by fostering collaborations within and outside the organization, particularly with our Cloud Providers. Positioned within the Engineering organization under the Chief Architect, the FinOps team operates independently of any one Engineering org or function and optimizes globally rather than locally. This positioning, combined with Etsy's robust engineering culture focused on efficiency and craftsmanship, has fostered what we believe is a mature and successful FinOps practice at Etsy. Forecast Methodology A critical aspect of our FinOps approach is a strong forecasting methodology. A reliable forecast establishes an expected spending baseline against which we track actual spending, enabling us to identify deviations. We classify costs into distinct buckets: Core Infrastructure: Includes the costs of infrastructure and services essential for operating the Etsy.com website. Machine Learning \u0026 Product Enablement: Encompasses costs related to services supporting machine learning initiatives like search, recommendations, and advertisements. Data Enablement: Encompasses costs related to shared platforms for data collection, data processing and workflow orchestration. Dev: Encompasses non-production resources. The FinOps forecasting model relies on a trailing Cost Per Visit (CPV) metric. While CPV provides valuable insights into changes, it's not without limitations: A meaningful portion of web traffic to Etsy involves non-human activity, like web crawlers that’s not accounted for in CPV. Some services have weaker correlations to user visits. Dev, data, and ML training costs lack direct correlations to visits and are susceptible to short-term spikes during POCs, experiments or big data workflows. A/B tests for new features can lead to short-term CPV increases, potentially resulting in long-term CPV changes upon successful feature launches. Periodically, we run regression tests to validate if CPV should drive our forecasts. In addition to visits we have looked into headcount, GMV(Gross Merchandise Value) and revenue as independent variables. Thus far, visits have consistently exhibited the highest correlation to costs. Monitoring and Readouts We monitor costs using internal tools built on BigQuery and Looker. Customized dashboards for all of our Engineering teams display cost trends, CPV, and breakdowns by labels and workflows. Additionally, we've set up alerts to identify sudden spikes or gradual week-over-week/month-over-month growth. Collaboration with the Finance department occurs weekly to compare actual costs against forecasts, identifying discrepancies for timely corrections. Furthermore, the FinOps team conducts recurring meetings with major cost owners and monthly readouts for Engineering and Product leadership to review forecasted figures and manage cost variances. While we track costs at the organization/cost center level, we don't charge costs back to the teams. This both lowers our overhead and more importantly, provides flexibility to make tradeoffs that enable Engineering velocity. Cost Increase Detection \u0026 Mitigation Maintaining a healthy CPV involves swiftly identifying and mitigating cost increases, to achieve this we: Analysis: Gather information on the increase's source, whether from specific cloud products, workflows, or usage pattern changes (ie variance in resource utilization). Collaboration: Engage relevant teams, sharing insights and seeking additional context. Validation: Validate cost increases from product launches or internal changes, securing buy-in from leadership if needed. Mitigation: Unexpected increases undergo joint troubleshooting, where we outline and assign action items to owners, until issues are resolved. Communication: Inform our finance partners about recent cost trends and their incorporation into the expected spend forecast post-confirmation or resolution with teams and engineering leadership. Cost Optimization Initiatives Another side of maintaining a healthy CPV involves cost optimization, offsetting increases from product launches. Ideas for cost-saving come as a result of collaboration between FinOps and engineering teams, with the Architecture team validating and implementing efficiency improvements. Notably we focus on the engineering or business impact of the cost optimization rather than solely on savings, recognizing that inefficiencies often signal larger problems. Based on effort vs. value evaluations, some ideas are added to backlogs, while major initiatives warrant dedicated squads.Below is a breakout of some of the major wins we have had in the last year or so. GCS Storage Optimization - In 2023 we stood up a squad focused on optimizing Etsy’s use of GCS, as it has been one of the largest growth areas for us over the past few years. The squad delivered a number of improvements including improved monitoring of usage, automation features for Data engineers, implementation of TTLs that match data access patterns/business needs and the adoption of Intelligent tiering. Due to these efforts, Etsy’s GCS usage is now less than it was 2 years ago. Compute Optimization - Migrated over 90% of Etsy infrastructure that is serving traffic to the latest and greatest CPU platform. This improved our serving latency while reducing cost. Increased Automation for model deployment - In an effort to improve the developer experience, our machine learning enablement team developed a tool to automate the compute configurations for new models being deployed, which also ended up saving us money. Network Compression - Enabling network compression between our high throughput services both improved the latency profile and drastically reduced the networking cost. What's Next While our core infrastructure spend is well understood, our focus is on improving visibility into our Machine Learning platform's spend. As these systems are shared across teams, dissecting costs tied to individual product launches is challenging. Enhanced visibility will help us refine our ROI analysis of product experiments and pinpoint future areas of opportunity for optimization.",
  "image": "https://i.etsystatic.com/inv/7d00e0/6105945055/inv_fullxfull.6105945055_eg5ja1ce.jpg?version=0",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\" role=\"main\"\u003e\n                                \n\n\u003cdiv id=\"article-content\"\u003e\n    \u003cp\u003e\u003cimg src=\"https://i.etsystatic.com/inv/7d00e0/6105945055/inv_fullxfull.6105945055_eg5ja1ce.jpg?version=0\" aria-label=\"Enhancing Cloud Usage Forecasting, Monitoring \u0026amp; Optimizing main image\" alt=\"Enhancing Cloud Usage Forecasting, Monitoring \u0026amp; Optimizing main image\" fetchpriority=\"high\"/\u003e\n    \u003c/p\u003e\n\n    \n    \n\n    \u003cdiv\u003e\n    \u003cdiv\u003e\n            \u003cp\u003e\u003cimg src=\"https://i.etsystatic.com/iusa/26d5df/93311402/iusa_75x75.93311402_7314.jpg?version=0\" alt=\"  image\" aria-label=\"  image\"/\u003e\n    \u003c/p\u003e\n\n\n    \u003c/div\u003e\n    \u003cp\u003eIn 2020, Etsy concluded its migration from an on-premise data center to the Google Cloud Platform (GCP). During this transition, a dedicated team of program managers ensured the migration\u0026#39;s success. Post-migration, this team evolved into the Etsy FinOps team, dedicated to maximizing the organization\u0026#39;s cloud value by fostering collaborations within and outside the organization, particularly with our Cloud Providers.\u003c/p\u003e\n\u003cp\u003ePositioned within the Engineering organization under the Chief Architect, the FinOps team operates independently of any one Engineering org or function and optimizes globally rather than locally. This positioning, combined with Etsy\u0026#39;s robust engineering culture focused on efficiency and craftsmanship, has fostered what we believe is a mature and successful FinOps practice at Etsy.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eForecast Methodology\n\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eA critical aspect of our FinOps approach is a strong forecasting methodology. A reliable forecast establishes an expected spending baseline against which we track actual spending, enabling us to identify deviations. We classify costs into distinct buckets:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCore Infrastructure: Includes the costs of infrastructure and services essential for operating the Etsy.com website.\u003c/li\u003e\n\u003cli\u003eMachine Learning \u0026amp; Product Enablement: Encompasses costs related to services supporting machine learning initiatives like search, recommendations, and advertisements.\u003c/li\u003e\n\u003cli\u003eData Enablement: Encompasses costs related to shared platforms for data collection, data processing and workflow orchestration.\u003c/li\u003e\n\u003cli\u003eDev: Encompasses non-production resources.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe FinOps forecasting model relies on a trailing Cost Per \u003ca href=\"https://support.google.com/analytics/answer/2731565?hl=en#zippy=%252Cin-this-article\"\u003eVisit\u003c/a\u003e (CPV) metric. While CPV provides valuable insights into changes, it\u0026#39;s not without limitations:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA meaningful portion of web traffic to Etsy involves non-human activity, like web crawlers that’s not accounted for in CPV.\u003c/li\u003e\n\u003cli\u003eSome services have weaker correlations to user visits.\u003c/li\u003e\n\u003cli\u003eDev, data, and ML training costs lack direct correlations to visits and are susceptible to short-term spikes during POCs, experiments or big data workflows.\u003c/li\u003e\n\u003cli\u003eA/B tests for new features can lead to short-term CPV increases, potentially resulting in long-term CPV changes upon successful feature launches.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePeriodically, we run regression tests to validate if CPV should drive our forecasts. In addition to visits we have looked into headcount, GMV(Gross Merchandise Value) and revenue as independent variables. Thus far, visits have consistently exhibited the highest correlation to costs.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMonitoring and Readouts\n\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe monitor costs using internal tools built on BigQuery and Looker. Customized dashboards for all of our Engineering teams display cost trends, CPV, and breakdowns by labels and workflows. Additionally, we\u0026#39;ve set up alerts to identify sudden spikes or gradual week-over-week/month-over-month growth.\u003c/p\u003e\n\u003cp\u003eCollaboration with the Finance department occurs weekly to compare actual costs against forecasts, identifying discrepancies for timely corrections. Furthermore, the FinOps team conducts recurring meetings with major cost owners and monthly readouts for Engineering and Product leadership to review forecasted figures and manage cost variances.\u003c/p\u003e\n\u003cp\u003eWhile we track costs at the organization/cost center level, we don\u0026#39;t charge costs back to the teams. This both lowers our overhead and more importantly, provides flexibility to make tradeoffs that enable Engineering velocity. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCost Increase Detection \u0026amp; Mitigation\n\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMaintaining a healthy CPV involves swiftly identifying and mitigating cost increases, to achieve this we:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAnalysis: Gather information on the increase\u0026#39;s source, whether from specific cloud products, workflows, or usage pattern changes (ie variance in resource utilization).\u003c/li\u003e\n\u003cli\u003eCollaboration: Engage relevant teams, sharing insights and seeking additional context.\u003c/li\u003e\n\u003cli\u003eValidation: Validate cost increases from product launches or internal changes, securing buy-in from leadership if needed. \u003c/li\u003e\n\u003cli\u003eMitigation: Unexpected increases undergo joint troubleshooting, where we outline and assign action items to owners, until issues are resolved.\u003c/li\u003e\n\u003cli\u003eCommunication: Inform our finance partners about recent cost trends and their incorporation into the expected spend forecast post-confirmation or resolution with teams and engineering leadership.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eCost Optimization Initiatives\n\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAnother side of maintaining a healthy CPV involves cost optimization, offsetting increases from product launches. Ideas for cost-saving come as a result of collaboration between FinOps and engineering teams, with the Architecture team validating and implementing efficiency improvements. Notably we focus on the engineering or business impact of the cost optimization rather than solely on savings, recognizing that inefficiencies often signal larger problems.  \u003c/p\u003e\n\u003cp\u003eBased on effort vs. value evaluations, some ideas are added to backlogs, while major initiatives warrant dedicated squads.Below is a breakout of some of the major wins we have had in the last year or so.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGCS Storage Optimization - In 2023 we stood up a squad focused on optimizing Etsy’s use of GCS, as it has been one of the largest growth areas for us over the past few years. The squad delivered a number of improvements including improved monitoring of usage, automation features for Data engineers, implementation of TTLs that match data access patterns/business needs and the adoption of Intelligent tiering.  Due to these efforts, Etsy’s GCS usage is now less than it was 2 years ago. \u003c/li\u003e\n\u003cli\u003eCompute Optimization - Migrated over 90% of Etsy infrastructure that is serving traffic to the latest and greatest CPU platform.  This improved our serving latency while reducing cost.\u003c/li\u003e\n\u003cli\u003eIncreased Automation for model deployment - In an effort to improve the developer experience, our machine learning enablement team developed a tool to automate the compute configurations for new models being deployed, which also ended up saving us money.\u003c/li\u003e\n\u003cli\u003eNetwork Compression - Enabling network compression between our high throughput services both improved the  latency profile and drastically reduced the networking cost. \u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat\u0026#39;s Next\n\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhile our core infrastructure spend is well understood, our focus is on improving visibility into our Machine Learning platform\u0026#39;s spend. As these systems are shared across teams, dissecting costs tied to individual product launches is challenging. Enhanced visibility will help us refine our ROI analysis of product experiments and pinpoint future areas of opportunity for optimization.\u003c/p\u003e\n    \n\n\u003c/div\u003e\n\n    \n\u003c/div\u003e\n\n\n\n\n\n\n\n\n\n            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-12-03T01:11:21Z",
  "modifiedTime": "2024-12-03T01:11:21Z"
}
