{
  "id": "e4869779-5513-4a76-9962-247e4426df8e",
  "title": "Hugging Face to Democratize Robotics with Open-Source Reachy 2 Robot",
  "link": "https://www.infoq.com/news/2025/05/huggingface-reachy-robot/?utm_campaign=infoq_content\u0026utm_source=infoq\u0026utm_medium=feed\u0026utm_term=global",
  "description": "Hugging Face has acquired Pollen Robotics, a French startup that developed the humanoid robot Reachy 2. The acquisition aims to make robotics more accessible by open-sourcing the robot’s design and allowing developers to modify and improve its code. By Daniel Dominguez",
  "author": "Daniel Dominguez",
  "published": "Sat, 10 May 2025 10:45:00 GMT",
  "source": "https://feed.infoq.com",
  "categories": [
    "Open Source",
    "Large language models",
    "Hugging Face",
    "Artificial Intelligence",
    "Robotics",
    "AI, ML \u0026 Data Engineering",
    "news"
  ],
  "byline": "Daniel Dominguez",
  "length": 2959,
  "excerpt": "Hugging Face has acquired Pollen Robotics, a French startup that developed the humanoid robot Reachy 2. The acquisition aims to make robotics more accessible by open-sourcing the robot’s design and al",
  "siteName": "InfoQ",
  "favicon": "https://cdn.infoq.com/statics_s1_20250506220057/apple-touch-icon.png",
  "text": "Hugging Face has acquired Pollen Robotics, a French startup that developed the humanoid robot Reachy 2. The acquisition aims to make robotics more accessible by open-sourcing the robot’s design and allowing developers to modify and improve its code. Reachy 2 is a friendly, open-source humanoid robot designed for intuitive human-robot interaction. It features expressive movement through its Orbita joint system and 7-DoF arms, can manipulate objects up to 3 kg, and navigates using omniwheels and LiDAR. With VR teleoperation, users can control it remotely in first-person view. Fully compatible with modern AI frameworks, Reachy 2 is ideal for research and development, and is supported by comprehensive open-source resources provided by Pollen Robotics. It’s already in use at institutions like Cornell and Carnegie Mellon. Open-sourcing hardware typically involves releasing designs, component details, and 3D models, enabling developers to manufacture parts more easily or modify them if necessary. The acquisition aligns with a broader trend of increasing interest in open-source AI and robotics. For example, companies like Meta and OpenAI have released their own open-source AI models in recent years, reflecting a growing movement to democratize access to cutting-edge technologies. The move also comes as interest in robotics has surged alongside the AI boom, driven by advancements in AI that improve hardware capabilities. Robotics researchers, particularly in academia, have expressed support for open-source approaches, arguing that they can accelerate technological progress and encourage creativity in hardware development. The open-source approach is expected to make progress in robotics more transparent, avoiding misleading claims often seen in marketing hype. Clem Delangue emphasized the importance of trust and transparency in physical robotics, pointing to the accountability open-source technology: You can’t cheat; you can’t hide. Community reactions provide insight into the acquisition’s reception. AI enthusiasts Boardy Boardman commented: Open-source robotics is the future! Love seeing Hugging Face expand beyond just ML models. The robotics space needs this kind of democratization. And software architect Vishal Gargco commented: This is a big move for open-source robotics. Bringing robots like Reachy 2 to labs and researchers will definitely open up more possibilities in AI and robotics. The acquisition signifies Hugging Face’s growing role in advancing open-source technologies beyond AI models into hardware, potentially unlocking new capabilities for robotics. Use of Hugging Face’s existing open-source robotics code has already spiked, reflecting the growing interest in robotics and the desire for more accessible, collaborative development. About the Author Daniel Dominguez",
  "image": "https://res.infoq.com/news/2025/05/huggingface-reachy-robot/en/headerimage/generatedHeaderImage-1746823729933.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\u003cp\u003e\u003ca href=\"https://huggingface.co/blog/hugging-face-pollen-robotics-acquisition\"\u003eHugging Face\u003c/a\u003e has acquired \u003ca href=\"https://www.pollen-robotics.com/\"\u003ePollen Robotics\u003c/a\u003e, a French startup that developed the humanoid robot \u003ca href=\"https://www.pollen-robotics.com/reachy/\"\u003eReachy 2\u003c/a\u003e. The acquisition aims to make robotics more accessible by open-sourcing the robot’s design and allowing developers to modify and improve its code.\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://huggingface.co/blog/hugging-face-pollen-robotics-acquisition#about-reachy-2\"\u003eReachy 2\u003c/a\u003e is a friendly, open-source humanoid robot designed for intuitive human-robot interaction. It features expressive movement through its Orbita joint system and 7-DoF arms, can manipulate objects up to 3 kg, and navigates using omniwheels and LiDAR. With VR teleoperation, users can control it remotely in first-person view. Fully compatible with modern AI frameworks, \u003ca href=\"https://huggingface.co/blog/hugging-face-pollen-robotics-acquisition#about-reachy-2\"\u003eReachy 2\u003c/a\u003e is ideal for research and development, and is supported by comprehensive open-source resources provided by Pollen Robotics. It’s already in use at institutions like Cornell and Carnegie Mellon.\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://en.wikipedia.org/wiki/Open-source_hardware\"\u003eOpen-sourcing hardware\u003c/a\u003e typically involves releasing designs, component details, and 3D models, enabling developers to manufacture parts more easily or modify them if necessary. The acquisition aligns with a broader trend of increasing interest in open-source AI and robotics. For example, companies like Meta and OpenAI have released their own open-source AI models in recent years, reflecting a growing movement to democratize access to cutting-edge technologies.\u003c/p\u003e\n\n\u003cp\u003eThe move also comes as interest in robotics has surged alongside the AI boom, driven by advancements in AI that improve hardware capabilities. Robotics researchers, particularly in academia, have expressed support for open-source approaches, arguing that they can accelerate technological progress and encourage creativity in hardware development.\u003c/p\u003e\n\n\u003cp\u003eThe open-source approach is expected to make progress in robotics more transparent, avoiding misleading claims often seen in marketing hype. \u003ca href=\"https://x.com/ClementDelangue/status/1820790760419053696\"\u003eClem Delangue\u003c/a\u003e emphasized the importance of trust and transparency in physical robotics, pointing to the accountability open-source technology:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eYou can’t cheat; you can’t hide.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eCommunity reactions provide insight into the acquisition’s reception. AI enthusiasts \u003ca href=\"https://x.com/Boardy_ai/status/1911795998080348561\"\u003eBoardy Boardman\u003c/a\u003e commented:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eOpen-source robotics is the future! Love seeing Hugging Face expand beyond just ML models. The robotics space needs this kind of democratization.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eAnd software architect \u003ca href=\"https://x.com/vishalgargco/status/1911824497075785790\"\u003eVishal Gargco\u003c/a\u003e commented:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eThis is a big move for open-source robotics. Bringing robots like Reachy 2 to labs and researchers will definitely open up more possibilities in AI and robotics.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eThe acquisition signifies Hugging Face’s growing role in advancing open-source technologies beyond AI models into hardware, potentially unlocking new capabilities for robotics. Use of Hugging Face’s existing open-source robotics code has already spiked, reflecting the growing interest in robotics and the desire for more accessible, collaborative development.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n  \n    \u003cdiv\u003e \n        \u003ch2\u003eAbout the Author\u003c/h2\u003e \n\n        \n            \n                \n            \n            \u003cdiv data-id=\"author-Daniel-Dominguez\"\u003e\n                    \u003ch4\u003e\u003cstrong\u003eDaniel Dominguez\u003c/strong\u003e\u003c/h4\u003e\n                    \n                \u003c/div\u003e\n        \n    \u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-05-10T00:00:00Z",
  "modifiedTime": null
}
