{
  "id": "4d2b629a-64a1-4461-affe-457c344a0282",
  "title": "Sunsetting Writerside IDE",
  "link": "https://blog.jetbrains.com/writerside/2025/03/sunsetting-writerside-ide/",
  "description": "In October 2023, we launched the Early Access Program for Writerside – a tool for authoring, testing, and publishing documentation. Built on the IntelliJ Platform, Writerside was available in two versions: a standalone tool and a plugin for JetBrains IDEs. Our goal was to serve two key audiences – developers who document their work and […]",
  "author": "Sasha Maximova",
  "published": "Tue, 11 Mar 2025 12:16:48 +0000",
  "source": "https://blog.jetbrains.com/feed",
  "categories": null,
  "byline": "Anna Gasparyan",
  "length": 3396,
  "excerpt": "In October 2023, we launched the Early Access Program for Writerside – a tool for authoring, testing, and publishing documentation. Built on the IntelliJ Platform, Writerside was available in two vers",
  "siteName": "The JetBrains Blog",
  "favicon": "https://blog.jetbrains.com/wp-content/uploads/2024/01/cropped-mstile-310x310-1-180x180.png",
  "text": "In October 2023, we launched the Early Access Program for Writerside – a tool for authoring, testing, and publishing documentation. Built on the IntelliJ Platform, Writerside was available in two versions: a standalone tool and a plugin for JetBrains IDEs. Our goal was to serve two key audiences – developers who document their work and professional technical writers. Since then, we’ve published 14 EAP releases, run tests and surveys, and continuously analyzed your feedback and usage statistics. Unfortunately, the results did not align with our expectations.  Despite strong adoption among developers and some technical writers, it became apparent that the overall market size was not large enough to sustain Writerside as a standalone product.  For these reasons, we have made the difficult decision to sunset Writerside. Writerside plugin support remains You can use the Writerside IDE until March 20, 2025. After that date, your license will expire. However, the plugin will remain available for free on JetBrains Marketplace, and you can continue using it with your JetBrains IDE. If you currently use the standalone version, you can start using the Writerside plugin with your JetBrains IDE, regardless of whether you have a commercial or non-commercial IDE license. If you don’t currently use a JetBrains IDE, you can download IntelliJ IDEA Community Edition to continue using Writerside for free. While we do not plan any major changes to the functionality, we plan to continue providing support, updates, and bug fixes for the foreseeable future, as the Writerside plugin is used internally by JetBrains technical writers.  Thank you 💜 Our team would like to thank all of you for the tremendous support and feedback you have provided along the way. While it is always sad when a product’s life ends, we’ll take everything we’ve learned with us as we move forward. We still believe that documentation tools deserve better, so maybe another way lies ahead in the future.  Thank you for being part of this journey!  Always on the writers’ side, Your Writerside team FAQ What is happening with the documentation builder? No action is required. All previously set-up CI/CD integrations, GitHub actions, and Docker images will continue to work as before.  Will you support EAP versions of JetBrains IDEs? The plugin will be compatible with all upcoming IDE versions, including EAP builds.  What will happen to my existing Writerside project? Can I still use your frontend reliably? You can continue working with your existing Writerside project, and the frontend should function as expected.  Do I need to migrate my projects from the Writerside IDE to the plugin? No migration is needed. Just open your Writerside project with the plugin, and everything will work as it did before.  Will all Writerside IDE features be available via the plugin? The standalone version of Writerside and the plugin have the same set of features. Moreover, the plugin provides additional editor support for code samples supported by your IDE and the ability to validate them. Where can I provide my feedback or get support? You can share your feedback or get support in the Writerside Slack community.  Have you considered open-sourcing the Writerside IDE? At this point, we have no plans to open-source the Writerside IDE.",
  "image": "https://blog.jetbrains.com/wp-content/uploads/2025/03/wrs-social_share_blog_1280x720_en.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                                                            \n                    \n\u003cp\u003eIn October 2023, we launched the Early Access Program for Writerside – a tool for authoring, testing, and publishing documentation. Built on the IntelliJ Platform, Writerside was available in two versions: a standalone tool and a plugin for JetBrains IDEs. Our goal was to serve two key audiences – developers who document their work and professional technical writers.\u003c/p\u003e\n\n\n\n\u003cp\u003eSince then, we’ve published 14 EAP releases, run tests and surveys, and continuously analyzed your feedback and usage statistics. Unfortunately, the results did not align with our expectations. \u003c/p\u003e\n\n\n\n\u003cp\u003eDespite strong adoption among developers and some technical writers, it became apparent that the overall market size was not large enough to sustain Writerside as a standalone product. \u003c/p\u003e\n\n\n\n\u003cp\u003eFor these reasons, we have made the difficult decision to sunset Writerside.\u003c/p\u003e\n\n\n\n\u003ch2\u003eWriterside plugin support remains\u003c/h2\u003e\n\n\n\n\u003cp\u003eYou can use the Writerside IDE until March 20, 2025. After that date, your license will expire. However, the \u003ca href=\"https://plugins.jetbrains.com/plugin/20158-writerside\" target=\"_blank\" rel=\"noopener\"\u003eplugin will remain available for free\u003c/a\u003e on JetBrains Marketplace, and you can continue using it with your JetBrains IDE.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you currently use the standalone version, you can start using the Writerside plugin with your JetBrains IDE, regardless of whether you have a commercial or non-commercial IDE license.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you don’t currently use a JetBrains IDE, you can download \u003ca href=\"https://www.jetbrains.com/idea/download/\" target=\"_blank\" rel=\"noopener\"\u003eIntelliJ IDEA Community Edition\u003c/a\u003e to continue using Writerside for free.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhile we do not plan any major changes to the functionality, we plan to continue providing support, updates, and bug fixes for the foreseeable future, as the Writerside plugin is used internally by JetBrains technical writers. \u003c/p\u003e\n\n\n\n\u003ch2\u003eThank you 💜\u003c/h2\u003e\n\n\n\n\u003cp\u003eOur team would like to thank all of you for the tremendous support and feedback you have provided along the way. While it is always sad when a product’s life ends, we’ll take everything we’ve learned with us as we move forward. We still believe that documentation tools deserve better, so maybe another way lies ahead in the future. \u003c/p\u003e\n\n\n\n\u003cp\u003eThank you for being part of this journey! \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eAlways on the writers’ side,\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eYour Writerside team\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003ch2\u003eFAQ\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWhat is happening with the documentation builder?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eNo action is required. All previously set-up CI/CD integrations, GitHub actions, and Docker images will continue to work as before. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWill you support EAP versions of JetBrains IDEs?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe plugin will be compatible with all upcoming IDE versions, including EAP builds. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWhat will happen to my existing Writerside project? Can I still use your frontend reliably?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eYou can continue working with your existing Writerside project, and the frontend should function as expected. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eDo I need to migrate my projects from the Writerside IDE to the plugin?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eNo migration is needed. Just open your Writerside project with the plugin, and everything will work as it did before. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWill all Writerside IDE features be available via the plugin?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe standalone version of Writerside and the plugin have the same set of features. Moreover, the plugin provides additional editor support for code samples supported by your IDE and the ability to validate them.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWhere can I provide my feedback or get support?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eYou can share your feedback or get support in the Writerside \u003ca href=\"https://jb.gg/WRS_Slack\" target=\"_blank\" rel=\"noopener\"\u003eSlack community\u003c/a\u003e. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eHave you considered open-sourcing the Writerside IDE?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eAt this point, we have no plans to open-source the Writerside IDE.\u003c/p\u003e\n                    \n                                                                                                                                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
