{
  "id": "721d6822-7dea-4475-8726-6ab1b0108375",
  "title": "Three MarTech solutions putting generative AI in marketing",
  "link": "https://developers.googleblog.com/en/google-martech-solutions-putting-generative-ai-in-marketing/",
  "description": "Three generative AI-powered MarTech solutions from Google designed to help developers streamline marketing material creation, personalize campaigns, and enhance ad performance. Discover ViGenAiR for video ad creation, Adios for image asset management and generation, and Copycat for on-brand ad copy generation.",
  "author": "",
  "published": "",
  "source": "http://feeds.feedburner.com/GDBcode",
  "categories": null,
  "byline": "Christoph Scherf, Mohab Fekry",
  "length": 5915,
  "excerpt": "Three generative AI-powered MarTech solutions from Google designed to help developers streamline marketing material creation, personalize campaigns, and enhance ad performance. Discover ViGenAiR for video ad creation, Adios for image asset management and generation, and Copycat for on-brand ad copy generation.",
  "siteName": "",
  "favicon": "https://storage.googleapis.com/gweb-developer-goog-blog-assets/meta/apple-touch-icon.png",
  "text": "Marketing isn't just about big ideas, it's about the code that brings them to life. As demand for personalized campaigns and customer experiences grows, developers play a crucial role in turning creative vision into scalable, measurable solutions. To bridge the gap between marketing and engineering, Google has introduced a range of generative AI-powered, open-source MarTech solutions— that can be used for Google campaigns and beyond.Whether you’re transforming video into new formats, creating and managing images at scale, or generating high-quality written text for ads, developers can streamline the generation and management of marketing materials with these three innovative tools.ViGenAiRRecraft video ads for wider impact with gen AIFrom YouTube ads to social media clips, video is one of the most powerful ways to build awareness and connect with audiences. But creating multiple versions for different platforms and audiences can be expensive and time-consuming.ViGenAiR harnesses multimodal generative AI models on Google Cloud to automatically turn long-form video ads into shorter, format-specific versions, while extracting key information to target different audiences. Choose from Al-suggested variants or take full creative control with manual editing—and generate video, image, and text assets to power Demand Gen and YouTube video campaigns.With ViGenAiR, you’ll have access to:Asset variety: Broaden your asset inventory with multiple vertical and square videos, including Demand Gen image and text assets.Personalization: Reach and engage the right audience with personalized videos and storylines.Quality: Generate videos that follow YouTube’s ABCDs (Attention, Branding, Connection, Direction), and automatically reframe for vertical and square formats.Efficiency: Easily create new iterations and reduce the time and cost to produce video.How ViGenAiR uses gen AI video editing for adsViGenAiR uses Gemini on Vertex AI to understand the storyline of a video, before splitting it into separate audio and video segments. Once broken into sections like spoken dialogue, visual shots, on-screen text, and background music, ViGenAiR uses the information to combine sections of the video that are semantically and contextually related, so the video won't be cut mid-dialogue nor mid-scene. These coherent A/V segments serve as the building blocks for both gen AI and user-driven recombination. AdiosManage and generate personalized advertising with AICreating the right visuals for every ad group is essential—but managing thousands, or even millions, of images can quickly create operational bottlenecks for marketers.Adios, powered by Gemini, is an open-source solution that makes it easy for marketers to upload and manage image assets for thousands of ad groups. No images? No problems. Adios uses the Imagen model, on Google Cloud's Vertex AI platform, to generate personalized, high-quality images tailored to your specific ad group context—boosting your campaign's look and performance.Adios helps your marketing teams:Generate at scale: Create millions of images tailored to your ad groups and integrate almost any gen AI API with minimal code adjustments.Automate asset management: Upload and manage image assets in Google Ads, whether you've generated them with Adios or not.Review generated images: Ensure optimal quality by manually reviewing generated images before they go live.Test A/B experiments: Create Google Ads experiments to compare the performance of new image assets against existing ones.Adios for AI-driven content creationThe latest version of Adios offers increased configuration flexibility, so you can easily change AI models, GCP region, and other settings without editing the code. Recent updates include improved stability and reliability of gen API interactions, and automatic retrying of failed requests for a smoother and more robust experience. Text-to-image prompt generation uses Gemini 1.5 Flash, while the Google Ads API uses version 17. CopycatGenerate on-brand ad copy for Google Search campaignsSearch campaigns put your brand in front of consumers exactly when they're looking for a product or service. However, writing Search ads can take time and the current tools available often produce generic ad copy that lack a brand’s unique tone and style.Copycat is a Python package that uses Gemini models to analyze your top-performing ads and brand guidelines. The tool learns your unique tone of voice and style, and generates high-quality, on-brand ad copy using new keywords. Whether you need to rewrite, expand, or generate new Responsive Search Ads and Text Ads, Copycat offers:Efficiency: Generate compelling ad copy quickly for various campaigns, saving time and resources.Quality: Maintain high ad standards that reflect your brand's unique style.Scalability: Expand your Google Ads reach without compromising quality or brand consistency.How Copycat uses AI for ad copywritingCopycat should be trained with high-quality search ads from your Google Ads account. Using Affinity Propagation, it reduces the training ads to a smaller set of \"exemplar ads\" to ensure diversity and minimize redundancy. Gemini then generates a style guide from the exemplar ads, and you can also include your own guidelines. Copycat combines the style guide with your keywords and instructions to create a prompt for Gemini that generates the new ad copy. And if you have existing headlines or descriptions, Copycat can fill in the remaining slots in your ads. Explore MarTech toolsExcited by the possibilities of these gen Al solutions?We're highlighting even more tools to help developers bring big marketing ideas to life. Keep an eye out for more updates in our MarTech series on the Google for Developers blog, or check out our MarTech solutions guide to keep exploring even more innovative tools you can implement, today.",
  "image": "https://storage.googleapis.com/gweb-developer-goog-blog-assets/images/MarchTech-Blog1-A-Meta.2e16d0ba.fill-1200x600.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n    \n      \n    \n\n    \n\n    \n\n    \n\n    \n    \u003cdiv\u003e\n          \n\n\u003cdiv\u003e\n    \u003cp data-block-key=\"a1j1a\"\u003eMarketing isn\u0026#39;t just about big ideas, it\u0026#39;s about the code that brings them to life. As demand for personalized campaigns and customer experiences grows, developers play a crucial role in turning creative vision into scalable, measurable solutions. To bridge the gap between marketing and engineering, Google has introduced a range of generative AI-powered, open-source MarTech solutions— that can be used for Google campaigns and beyond.\u003c/p\u003e\u003cp data-block-key=\"23gm7\"\u003eWhether you’re transforming video into new formats, creating and managing images at scale, or generating high-quality written text for ads, developers can streamline the generation and management of marketing materials with these three innovative tools.\u003c/p\u003e\u003ch2 data-block-key=\"be9bc\"\u003e\u003ci\u003e\u003cbr/\u003e\u003c/i\u003eViGenAiR\u003c/h2\u003e\u003ch3 data-block-key=\"964oq\"\u003e\u003cb\u003eRecraft video ads for wider impact with gen AI\u003c/b\u003e\u003c/h3\u003e\u003cp data-block-key=\"b9ok5\"\u003eFrom YouTube ads to social media clips, video is one of the most powerful ways to build awareness and connect with audiences. But creating multiple versions for different platforms and audiences can be expensive and time-consuming.\u003c/p\u003e\u003cp data-block-key=\"615jo\"\u003e\u003ca href=\"https://github.com/google-marketing-solutions/vigenair\"\u003eViGenAiR\u003c/a\u003e harnesses multimodal generative AI models on Google Cloud to automatically turn long-form video ads into shorter, format-specific versions, while extracting key information to target different audiences. Choose from Al-suggested variants or take full creative control with manual editing—and generate video, image, and text assets to power \u003ca href=\"https://support.google.com/google-ads/answer/13695777?hl=en\"\u003eDemand Gen\u003c/a\u003e and \u003ca href=\"https://support.google.com/youtube/answer/2375497?hl=en\"\u003eYouTube video campaigns\u003c/a\u003e.\u003c/p\u003e\u003cp data-block-key=\"dlbl8\"\u003eWith ViGenAiR, you’ll have access to:\u003c/p\u003e\u003cul\u003e\u003cli data-block-key=\"1d0pt\"\u003e\u003cb\u003eAsset variety\u003c/b\u003e: Broaden your asset inventory with multiple vertical and square videos, including Demand Gen image and text assets.\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\u003cli data-block-key=\"cl1oe\"\u003e\u003cb\u003ePersonalization\u003c/b\u003e: Reach and engage the right audience with personalized videos and storylines.\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\u003cli data-block-key=\"ccbd8\"\u003e\u003cb\u003eQuality\u003c/b\u003e: Generate videos that follow YouTube’s ABCDs (Attention, Branding, Connection, Direction), and automatically reframe for vertical and square formats.\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\u003cli data-block-key=\"1vcqa\"\u003e\u003cb\u003eEfficiency:\u003c/b\u003e Easily create new iterations and reduce the time and cost to produce video.\u003c/li\u003e\u003c/ul\u003e\u003ch3 data-block-key=\"9pbua\"\u003e\u003cb\u003e\u003cbr/\u003eHow ViGenAiR uses gen AI video editing for ads\u003c/b\u003e\u003c/h3\u003e\u003cp data-block-key=\"5ica1\"\u003eViGenAiR uses Gemini on Vertex AI to understand the storyline of a video, before splitting it into separate audio and video segments. Once broken into sections like spoken dialogue, visual shots, on-screen text, and background music, ViGenAiR uses the information to combine sections of the video that are semantically and contextually related, so the video won\u0026#39;t be cut mid-dialogue nor mid-scene. These coherent A/V segments serve as the building blocks for both gen AI and user-driven recombination.\u003c/p\u003e\n\u003c/div\u003e   \n\n\n  \u003cdiv\u003e\n    \u003ch2 data-block-key=\"xbfra\"\u003eAdios\u003c/h2\u003e\u003ch3 data-block-key=\"4gqhh\"\u003e\u003cb\u003eManage and generate personalized advertising with AI\u003c/b\u003e\u003c/h3\u003e\u003cp data-block-key=\"eesrn\"\u003eCreating the right visuals for every ad group is essential—but managing thousands, or even millions, of images can quickly create operational bottlenecks for marketers.\u003c/p\u003e\u003cp data-block-key=\"12b0n\"\u003eAdios, powered by Gemini, is an open-source solution that makes it easy for marketers to upload and manage image assets for thousands of ad groups. No images? No problems. Adios uses the \u003ca href=\"https://cloud.google.com/vertex-ai/docs/generative-ai/image/overview\"\u003eImagen\u003c/a\u003e model, on Google Cloud\u0026#39;s \u003ca href=\"https://cloud.google.com/vertex-ai/\"\u003eVertex AI\u003c/a\u003e platform, to generate personalized, high-quality images tailored to your specific ad group context—boosting your campaign\u0026#39;s look and performance.\u003c/p\u003e\u003cp data-block-key=\"2jts5\"\u003eAdios helps your marketing teams:\u003c/p\u003e\u003cul\u003e\u003cli data-block-key=\"bi1sf\"\u003e\u003cb\u003eGenerate at scale:\u003c/b\u003e Create millions of images tailored to your ad groups and integrate almost any gen AI API with minimal code adjustments.\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\u003cli data-block-key=\"dag4m\"\u003e\u003cb\u003eAutomate asset management:\u003c/b\u003e Upload and manage image assets in Google Ads, whether you\u0026#39;ve generated them with Adios or not.\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\u003cli data-block-key=\"emnmf\"\u003e\u003cb\u003eReview generated images:\u003c/b\u003e Ensure optimal quality by manually reviewing generated images before they go live.\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\u003cli data-block-key=\"fl747\"\u003e\u003cb\u003eTest A/B experiments:\u003c/b\u003e Create Google Ads experiments to compare the performance of new image assets against existing ones.\u003c/li\u003e\u003c/ul\u003e\u003ch3 data-block-key=\"2bsp3\"\u003e\u003cb\u003e\u003cbr/\u003eAdios for AI-driven content creation\u003c/b\u003e\u003c/h3\u003e\u003cp data-block-key=\"2l1ti\"\u003eThe latest version of Adios offers increased configuration flexibility, so you can easily change AI models, GCP region, and other settings without editing the code. Recent updates include improved stability and reliability of gen API interactions, and automatic retrying of failed requests for a smoother and more robust experience. Text-to-image prompt generation uses Gemini 1.5 Flash, while the Google Ads API uses version 17.\u003c/p\u003e\n\u003c/div\u003e   \n\n\n  \u003cdiv\u003e\n    \u003ch2 data-block-key=\"xbfra\"\u003eCopycat\u003c/h2\u003e\u003ch3 data-block-key=\"6g3d1\"\u003e\u003cb\u003eGenerate on-brand ad copy for Google Search campaigns\u003c/b\u003e\u003c/h3\u003e\u003cp data-block-key=\"ct95c\"\u003eSearch campaigns put your brand in front of consumers exactly when they\u0026#39;re looking for a product or service. However, writing Search ads can take time and the current tools available often produce generic ad copy that lack a brand’s unique tone and style.\u003c/p\u003e\u003cp data-block-key=\"fb9kg\"\u003eCopycat is a Python package that uses Gemini models to analyze your top-performing ads and brand guidelines. The tool learns your unique tone of voice and style, and generates high-quality, on-brand ad copy using new keywords. Whether you need to rewrite, expand, or generate new \u003ca href=\"https://support.google.com/google-ads/answer/12159142?hl=en-GB\"\u003eResponsive Search Ads\u003c/a\u003e and \u003ca href=\"https://support.google.com/google-ads/answer/1704389?hl=en-GB\"\u003eText Ads\u003c/a\u003e, Copycat offers:\u003c/p\u003e\u003cul\u003e\u003cli data-block-key=\"3tbas\"\u003e\u003cb\u003eEfficiency:\u003c/b\u003e Generate compelling ad copy quickly for various campaigns, saving time and resources.\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\u003cli data-block-key=\"acsno\"\u003e\u003cb\u003eQuality:\u003c/b\u003e Maintain high ad standards that reflect your brand\u0026#39;s unique style.\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\u003cli data-block-key=\"atldu\"\u003e\u003cb\u003eScalability:\u003c/b\u003e Expand your Google Ads reach without compromising quality or brand consistency.\u003c/li\u003e\u003c/ul\u003e\u003ch3 data-block-key=\"d8ke1\"\u003e\u003cb\u003eHow Copycat uses AI for ad copywriting\u003c/b\u003e\u003c/h3\u003e\u003cp data-block-key=\"av2g7\"\u003eCopycat should be trained with high-quality search ads from your Google Ads account. Using Affinity Propagation, it reduces the training ads to a smaller set of \u0026#34;exemplar ads\u0026#34; to ensure diversity and minimize redundancy. Gemini then generates a style guide from the exemplar ads, and you can also include your own guidelines. Copycat combines the style guide with your keywords and instructions to create a prompt for Gemini that generates the new ad copy. And if you have existing headlines or descriptions, Copycat can fill in the remaining slots in your ads.\u003c/p\u003e\n\u003c/div\u003e   \n\n\n  \u003cdiv\u003e\n    \u003ch2 data-block-key=\"xbfra\"\u003eExplore MarTech tools\u003c/h2\u003e\u003cp data-block-key=\"16ibv\"\u003eExcited by the possibilities of these gen Al solutions?\u003c/p\u003e\u003cp data-block-key=\"38bmk\"\u003eWe\u0026#39;re highlighting even more tools to help developers bring big marketing ideas to life. Keep an eye out for more updates in our MarTech series on the \u003ca href=\"https://developers.googleblog.com/en/\"\u003eGoogle for Developers blog\u003c/a\u003e, or check out our \u003ca href=\"https://services.google.com/fh/files/misc/google_martech_github.pdf\"\u003eMarTech solutions guide\u003c/a\u003e to keep exploring even more innovative tools you can implement, today.\u003c/p\u003e\n\u003c/div\u003e \n      \u003c/div\u003e\n    \n\n    \n\n    \n    \n    \n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-04-16T00:00:00Z",
  "modifiedTime": null
}
