{
  "id": "80545421-708d-4a7f-9ac0-3b09ed2e9aeb",
  "title": "Title Launch Observability at Netflix Scale",
  "link": "https://netflixtechblog.com/title-launch-observability-at-netflix-scale-19ea916be1ed?source=rss----2615bd06b42e---4",
  "description": "",
  "author": "Netflix Technology Blog",
  "published": "Tue, 07 Jan 2025 01:25:58 GMT",
  "source": "https://netflixtechblog.com/feed",
  "categories": [
    "staff-engineering",
    "netflix",
    "ambiguity",
    "observability"
  ],
  "byline": "Netflix Technology Blog",
  "length": 8486,
  "excerpt": "Building on the foundation laid in Part 1, where we explored the “what” behind the challenges of title launch observability at Netflix, this post shifts focus to the “how.” How do we ensure every…",
  "siteName": "Netflix TechBlog",
  "favicon": "https://miro.medium.com/v2/resize:fill:1000:1000/7*GAOKVe--MXbEJmV9230oOQ.png",
  "text": "Part 2: Navigating AmbiguityBy: Varun KhaitanWith special thanks to my stunning colleagues: Mallika Rao, Esmir Mesic, Hugo MarquesBuilding on the foundation laid in Part 1, where we explored the “what” behind the challenges of title launch observability at Netflix, this post shifts focus to the “how.” How do we ensure every title launches seamlessly and remains discoverable by the right audience?In the dynamic world of technology, it’s tempting to leap into problem-solving mode. But the key to lasting success lies in taking a step back — understanding the broader context before diving into solutions. This thoughtful approach doesn’t just address immediate hurdles; it builds the resilience and scalability needed for the future. Let’s explore how this mindset drives results.Understanding the Bigger PictureLet’s take a comprehensive look at all the elements involved and how they interconnect. We should aim to address questions such as: What is vital to the business? Which aspects of the problem are essential to resolve? And how did we arrive at this point?This process involves:Identifying Stakeholders: Determine who is impacted by the issue and whose input is crucial for a successful resolution. In this case, the main stakeholders are:- Title Launch OperatorsRole: Responsible for setting up the title and its metadata into our systems.Challenge: Don’t understand the cascading effects of their setup on these perceived black box personalization systems- Personalization System Engineers Role: Develop and operate the personalization systems.Challenge: End up spending unplanned cycles on title launch and personalization investigations.- Product Managers Role: Ensure we put forward the best experience for our members.Challenge: Members may not connect with the most relevant title.- Creative Representatives Role: Mediator between the content creators and Netflix.Challenge: Build trust in the Netflix brand with content creators.Mapping the Current Landscape: By charting the existing landscape, we can pinpoint areas ripe for improvement and steer clear of redundant efforts. Beyond the scattered solutions and makeshift scripts, it became evident that there was no established solution for title launch observability. This suggests that this area has been neglected for quite some time and likely requires significant investment. This situation presents both challenges and opportunities; while it may be more difficult to make initial progress, there are plenty of easy wins to capitalize on.Clarifying the Core Problem: By clearly defining the problem, we can ensure that our solutions address the root cause rather than just the symptoms. While there were many issues and problems we could address, the core problem here was to make sure every title was treated fairly by our personalization stack. If we can ensure fair treatment with confidence and bring that visibility to all our stakeholders, we can address all their challenges.Assessing Business Priorities: Understanding what is most important to the organization helps prioritize actions and resources effectively. In this context, we’re focused on developing systems that ensure successful title launches, build trust between content creators and our brand, and reduce engineering operational overhead. While this is a critical business need and we definitely should solve it, it’s essential to evaluate how it stacks up against other priorities across different areas of the organization.Defining Title HealthNavigating such an ambiguous space required a shared understanding to foster clarity and collaboration. To address this, we introduced the term “Title Health,” a concept designed to help us communicate effectively and capture the nuances of maintaining each title’s visibility and performance. This shared language became a foundation for discussing the complexities of this domain.“Title Health” encompasses various metrics and indicators that reflect how well a title is performing, in terms of discoverability and member engagement. The three main questions we try to answer are:Is this title visible at all to any member?Is this title visible to an appropriate audience size?Is this title reaching all the appropriate audiences?Defining Title Health provided a framework to monitor and optimize each title’s lifecycle. It allowed us to align with partners on principles and requirements before building solutions, ensuring every title reaches its intended audience seamlessly. This common language not only introduced the problem space effectively but also accelerated collaboration and decision-making across teams.Categories of issuesTo build a robust plan for title launch observability, we first needed to categorize the types of issues we encounter. This structured approach allows us to address all aspects of title health comprehensively.Currently, these issues are grouped into three primary categories:1. Title SetupA title’s setup includes essential attributes like metadata (e.g., launch dates, audio and subtitle languages, editorial tags) and assets (e.g., artwork, trailers, supplemental messages). These elements are critical for a title’s eligibility in a row, accurate personalization, and an engaging presentation. Since these attributes feed directly into algorithms, any delays or inaccuracies can ripple through the system.The observability system must ensure that title setup is complete and validated in a timely manner, identify potential bottlenecks and ensure a smooth launch process.2. Personalization SystemsTitles are eligible to be recommended across multiple canvases on product — HomePage, Coming Soon, Messaging, Search and more. Personalization systems handle the recommendation and serving of titles on these canvases, leveraging a vast ecosystem of microservices, caches, databases, code, and configurations to build these product canvases.We aim to validate that titles are eligible in all appropriate product canvases across the end to end personalization stack during all of the title’s launch phases.3. AlgorithmsComplex algorithms drive each personalized product experience, recommending titles tailored to individual members. Observability here means validating the accuracy of algorithmic recommendations for all titles.Algorithmic performance can be affected by various factors, such as model shortcomings, incomplete or inaccurate input signals, feature anomalies, or interactions between titles. Identifying and addressing these issues ensures that recommendations remain precise and effective.By categorizing issues into these areas, we can systematically address challenges and deliver a reliable, personalized experience for every title on our platform.Issue AnalysisLet’s also learn more about how often we see each of these types of issues and how much effort it takes to fix them once they come up.From the above chart, we see that setup issues are the most common but they are also easy to fix since it’s relatively straightforward to go back and rectify a title’s metadata. System issues, which mostly manifest as bugs in our personalization microservices are not uncommon, and they take moderate effort to address. Algorithm issues, while rare, are really difficult to address since these often involve interpreting and retraining complex machine learning models.Evaluating Our OptionsNow that we understand more deeply about the problems we want to address and how we should go about prioritizing our resources. Lets go back to the two options we discussed in Part 1, and make an informed decision.Ultimately, we realized this space demands the full spectrum of features we’ve discussed. But the question remained: Where do we start? After careful consideration, we chose to focus on proactive issue detection first. Catching problems before launch offered the greatest potential for business impact, ensuring smoother launches, better member experiences, and stronger system reliability.This decision wasn’t just about solving today’s challenges — it was about laying the foundation for a scalable, robust system that can grow with the complexities of our ever-evolving platform.Up nextIn the next iteration we will talk about how to design an observability endpoint that works for all personalization systems. What are the main things to keep in mind while creating a microservice API endpoint? How do we ensure standardization? What is the architecture of the systems involved?Keep an eye out for our next binge-worthy episode!",
  "image": "https://miro.medium.com/v2/da:true/resize:fit:1200/0*YyCLwVKiGE_L6fWb",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003ch2 id=\"af30\"\u003ePart 2: Navigating Ambiguity\u003c/h2\u003e\u003cdiv\u003e\u003cdiv aria-hidden=\"false\"\u003e\u003ca href=\"https://netflixtechblog.medium.com/?source=post_page---byline--19ea916be1ed--------------------------------\" rel=\"noopener follow\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Netflix Technology Blog\" src=\"https://miro.medium.com/v2/resize:fill:88:88/1*BJWRqfSMf9Da9vsXG9EBRQ.jpeg\" width=\"44\" height=\"44\" loading=\"lazy\" data-testid=\"authorPhoto\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv aria-hidden=\"false\"\u003e\u003ca href=\"https://netflixtechblog.com/?source=post_page---byline--19ea916be1ed--------------------------------\" rel=\"noopener  ugc nofollow\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Netflix TechBlog\" src=\"https://miro.medium.com/v2/resize:fill:48:48/1*ty4NvNrGg4ReETxqU2N3Og.png\" width=\"24\" height=\"24\" loading=\"lazy\" data-testid=\"publicationPhoto\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003cp id=\"77d1\"\u003e\u003cstrong\u003eBy:\u003c/strong\u003e \u003ca href=\"https://www.linkedin.com/in/varun-khaitan/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eVarun Khaitan\u003c/a\u003e\u003c/p\u003e\u003cp id=\"72bf\"\u003eWith special thanks to my stunning colleagues: \u003ca href=\"https://www.linkedin.com/in/mallikarao/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eMallika Rao\u003c/a\u003e, \u003ca href=\"https://www.linkedin.com/in/esmir-mesic/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eEsmir Mesic\u003c/a\u003e, \u003ca href=\"https://www.linkedin.com/in/hugodesmarques/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eHugo Marques\u003c/a\u003e\u003c/p\u003e\u003cp id=\"90f9\"\u003eBuilding on the foundation laid in \u003ca href=\"https://medium.com/netflix-techblog/title-launch-observability-at-netflix-scale-c88c586629eb\" rel=\"noopener\"\u003ePart 1\u003c/a\u003e, where we explored the “what” behind the challenges of title launch observability at Netflix, this post shifts focus to the “how.” How do we ensure every title launches seamlessly and remains discoverable by the right audience?\u003c/p\u003e\u003cp id=\"8c5c\"\u003eIn the dynamic world of technology, it’s tempting to leap into problem-solving mode. But the key to lasting success lies in taking a step back — understanding the broader context before diving into solutions. This thoughtful approach doesn’t just address immediate hurdles; it builds the resilience and scalability needed for the future. Let’s explore how this mindset drives results.\u003c/p\u003e\u003ch2 id=\"afff\"\u003eUnderstanding the Bigger Picture\u003c/h2\u003e\u003cp id=\"1ecd\"\u003eLet’s take a comprehensive look at all the elements involved and how they interconnect. We should aim to address questions such as: What is vital to the business? Which aspects of the problem are essential to resolve? And how did we arrive at this point?\u003c/p\u003e\u003cp id=\"b0f8\"\u003eThis process involves:\u003c/p\u003e\u003col\u003e\u003cli id=\"bdf3\"\u003e\u003cstrong\u003eIdentifying Stakeholders: \u003c/strong\u003eDetermine who is impacted by the issue and whose input is crucial for a successful resolution. In this case, the main stakeholders are:\u003cp\u003e-\u003cstrong\u003e\u003cem\u003e Title Launch Operators\u003cbr/\u003eRole:\u003c/em\u003e\u003c/strong\u003e\u003cem\u003e Responsible for setting up the title and its metadata into our systems.\u003cbr/\u003e\u003c/em\u003e\u003cstrong\u003e\u003cem\u003eChallenge:\u003c/em\u003e\u003c/strong\u003e\u003cem\u003e Don’t understand the cascading effects of their setup on these perceived black box personalization systems\u003cp\u003e-\u003c/p\u003e\u003c/em\u003e\u003cstrong\u003e\u003cem\u003e Personalization System Engineers\u003c/em\u003e\u003c/strong\u003e\u003cem\u003e\u003cbr/\u003e \u003c/em\u003e\u003cstrong\u003e\u003cem\u003eRole: \u003c/em\u003e\u003c/strong\u003e\u003cem\u003eDevelop and operate the personalization systems.\u003cbr/\u003e\u003c/em\u003e\u003cstrong\u003e\u003cem\u003eChallenge:\u003c/em\u003e\u003c/strong\u003e\u003cem\u003e End up spending unplanned cycles on title launch and personalization investigations.\u003cp\u003e- \u003c/p\u003e\u003c/em\u003e\u003cstrong\u003e\u003cem\u003eProduct Managers \u003c/em\u003e\u003c/strong\u003e\u003cem\u003e\u003cbr/\u003e\u003c/em\u003e\u003cstrong\u003e\u003cem\u003eRole: \u003c/em\u003e\u003c/strong\u003e\u003cem\u003eEnsure we put forward the best experience for our members.\u003cbr/\u003e\u003c/em\u003e\u003cstrong\u003e\u003cem\u003eChallenge: \u003c/em\u003e\u003c/strong\u003e\u003cem\u003eMembers may not connect with the most relevant title.\u003cp\u003e- \u003c/p\u003e\u003c/em\u003e\u003cstrong\u003e\u003cem\u003eCreative Representatives\u003c/em\u003e\u003c/strong\u003e\u003cem\u003e \u003cbr/\u003e\u003c/em\u003e\u003cstrong\u003e\u003cem\u003eRole:\u003c/em\u003e\u003c/strong\u003e\u003cem\u003e Mediator between the content creators and Netflix.\u003cbr/\u003e\u003c/em\u003e\u003cstrong\u003e\u003cem\u003eChallenge: \u003c/em\u003e\u003c/strong\u003e\u003cem\u003eBuild trust in the Netflix brand with content creators.\u003c/em\u003e\u003c/p\u003e\u003c/li\u003e\u003cli id=\"fb92\"\u003e\u003cstrong\u003eMapping the Current Landscape:\u003c/strong\u003e By charting the existing landscape, we can pinpoint areas ripe for improvement and steer clear of redundant efforts. Beyond the scattered solutions and makeshift scripts, it became evident that there was no established solution for title launch observability. This suggests that this area has been neglected for quite some time and likely requires significant investment. This situation presents both challenges and opportunities; while it may be more difficult to make initial progress, there are plenty of easy wins to capitalize on.\u003c/li\u003e\u003cli id=\"d0ea\"\u003e\u003cstrong\u003eClarifying the Core Problem:\u003c/strong\u003e By clearly defining the problem, we can ensure that our solutions address the root cause rather than just the symptoms. While there were many issues and problems we could address, the core problem here was to make sure every title was treated fairly by our personalization stack. If we can ensure fair treatment with confidence and bring that visibility to all our stakeholders, we can address all their challenges.\u003c/li\u003e\u003cli id=\"3881\"\u003e\u003cstrong\u003eAssessing Business Priorities: \u003c/strong\u003eUnderstanding what is most important to the organization helps prioritize actions and resources effectively. In this context, we’re focused on developing systems that ensure successful title launches, build trust between content creators and our brand, and reduce engineering operational overhead. While this is a critical business need and we definitely should solve it, it’s essential to evaluate how it stacks up against other priorities across different areas of the organization.\u003c/li\u003e\u003c/ol\u003e\u003ch2 id=\"4208\"\u003eDefining Title Health\u003c/h2\u003e\u003cp id=\"2dfd\"\u003eNavigating such an ambiguous space required a shared understanding to foster clarity and collaboration. To address this, we introduced the term “Title Health,” a concept designed to help us communicate effectively and capture the nuances of maintaining each title’s visibility and performance. This shared language became a foundation for discussing the complexities of this domain.\u003c/p\u003e\u003cp id=\"70a0\"\u003e\u003cstrong\u003e“Title Health”\u003c/strong\u003e encompasses various metrics and indicators that reflect how well a title is performing, in terms of discoverability and member engagement. The three main questions we try to answer are:\u003c/p\u003e\u003col\u003e\u003cli id=\"7e75\"\u003eIs this title visible at all to \u003cstrong\u003eany\u003c/strong\u003e \u003cstrong\u003emember\u003c/strong\u003e?\u003c/li\u003e\u003cli id=\"777c\"\u003eIs this title visible to an appropriate \u003cstrong\u003eaudience size\u003c/strong\u003e?\u003c/li\u003e\u003cli id=\"0cf3\"\u003eIs this title reaching \u003cstrong\u003eall the appropriate audiences\u003c/strong\u003e?\u003c/li\u003e\u003c/ol\u003e\u003cp id=\"b2dd\"\u003eDefining Title Health provided a framework to monitor and optimize each title’s lifecycle. It allowed us to align with partners on principles and requirements before building solutions, ensuring every title reaches its intended audience seamlessly. This common language not only introduced the problem space effectively but also accelerated collaboration and decision-making across teams.\u003c/p\u003e\u003ch2 id=\"b793\"\u003eCategories of issues\u003c/h2\u003e\u003cp id=\"0431\"\u003eTo build a robust plan for title launch observability, we first needed to categorize the types of issues we encounter. This structured approach allows us to address all aspects of title health comprehensively.\u003c/p\u003e\u003cp id=\"86be\"\u003eCurrently, these issues are grouped into three primary categories:\u003c/p\u003e\u003cp id=\"62b5\"\u003e\u003cstrong\u003e1. Title Setup\u003c/strong\u003e\u003c/p\u003e\u003cp id=\"1422\"\u003eA title’s setup includes essential attributes like metadata (e.g., launch dates, audio and subtitle languages, editorial tags) and assets (e.g., artwork, trailers, supplemental messages). These elements are critical for a title’s eligibility in a row, accurate personalization, and an engaging presentation. Since these attributes feed directly into algorithms, any delays or inaccuracies can ripple through the system.\u003c/p\u003e\u003cp id=\"c1fa\"\u003eThe observability system must ensure that title setup is complete and validated in a timely manner, identify potential bottlenecks and ensure a smooth launch process.\u003c/p\u003e\u003cp id=\"551b\"\u003e\u003cstrong\u003e2. Personalization Systems\u003c/strong\u003e\u003c/p\u003e\u003cp id=\"4456\"\u003eTitles are eligible to be recommended across multiple canvases on product — HomePage, Coming Soon, Messaging, Search and more. Personalization systems handle the recommendation and serving of titles on these canvases, leveraging a vast ecosystem of microservices, caches, databases, code, and configurations to build these product canvases.\u003c/p\u003e\u003cp id=\"d32b\"\u003eWe aim to validate that titles are eligible in all appropriate product canvases across the end to end personalization stack during all of the title’s launch phases.\u003c/p\u003e\u003cp id=\"928f\"\u003e\u003cstrong\u003e3. Algorithms\u003c/strong\u003e\u003c/p\u003e\u003cp id=\"3751\"\u003eComplex algorithms drive each personalized product experience, recommending titles tailored to individual members. Observability here means validating the accuracy of algorithmic recommendations for all titles.\u003cbr/\u003eAlgorithmic performance can be affected by various factors, such as model shortcomings, incomplete or inaccurate input signals, feature anomalies, or interactions between titles. Identifying and addressing these issues ensures that recommendations remain precise and effective.\u003c/p\u003e\u003cp id=\"a466\"\u003eBy categorizing issues into these areas, we can systematically address challenges and deliver a reliable, personalized experience for every title on our platform.\u003c/p\u003e\u003ch2 id=\"7b81\"\u003eIssue Analysis\u003c/h2\u003e\u003cp id=\"a29f\"\u003eLet’s also learn more about how often we see each of these types of issues and how much effort it takes to fix them once they come up.\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003cp id=\"030a\"\u003eFrom the above chart, we see that setup issues are the most common but they are also easy to fix since it’s relatively straightforward to go back and rectify a title’s metadata. System issues, which mostly manifest as bugs in our personalization microservices are not uncommon, and they take moderate effort to address. Algorithm issues, while rare, are really difficult to address since these often involve interpreting and retraining complex machine learning models.\u003c/p\u003e\u003ch2 id=\"c0e1\"\u003eEvaluating Our Options\u003c/h2\u003e\u003cp id=\"473f\"\u003eNow that we understand more deeply about the problems we want to address and how we should go about prioritizing our resources. Lets go back to the two options we discussed in Part 1, and make an informed decision.\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003cp id=\"64d2\"\u003eUltimately, we realized this space demands the full spectrum of features we’ve discussed. But the question remained: \u003cem\u003eWhere do we start?\u003c/em\u003e \u003cbr/\u003eAfter careful consideration, we chose to focus on proactive issue detection first. Catching problems before launch offered the greatest potential for business impact, ensuring smoother launches, better member experiences, and stronger system reliability.\u003c/p\u003e\u003cp id=\"84b9\"\u003eThis decision wasn’t just about solving today’s challenges — it was about laying the foundation for a scalable, robust system that can grow with the complexities of our ever-evolving platform.\u003c/p\u003e\u003ch2 id=\"ab95\"\u003eUp next\u003c/h2\u003e\u003cp id=\"f46c\"\u003eIn the next iteration we will talk about how to design an observability endpoint that works for all personalization systems. What are the main things to keep in mind while creating a microservice API endpoint? How do we ensure standardization? What is the architecture of the systems involved?\u003c/p\u003e\u003cp id=\"a208\"\u003eKeep an eye out for our next binge-worthy episode!\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-01-07T01:25:58.105Z",
  "modifiedTime": null
}
