{
  "id": "82858c9d-5963-41b2-9658-23c9919027af",
  "title": "Top Java Blogs for Experienced Programmers",
  "link": "https://blog.jetbrains.com/idea/2024/11/top-java-blogs-for-experienced-programmers/",
  "description": "Following up on our previous article in which we shared some great multi-author blogs to follow, today we have a curated selection of personal blogs from top Java experts. These experts aren’t just the best at what they do – they’re also great at sharing their knowledge in ways that are easy to understand and […]",
  "author": "Irina Mariasova",
  "published": "Fri, 01 Nov 2024 15:32:59 +0000",
  "source": "https://blog.jetbrains.com/feed",
  "categories": [
    "coding",
    "community",
    "idea",
    "java",
    "tutorials",
    "experts",
    "tips-tricks"
  ],
  "byline": "Irina Mariasova",
  "length": 15929,
  "excerpt": "Following up on our previous article in which we shared some great multi-author blogs to follow, today we have a curated selection of personal blogs from top Java experts. These experts aren’t just",
  "siteName": "The JetBrains Blog",
  "favicon": "https://blog.jetbrains.com/wp-content/uploads/2024/01/cropped-mstile-310x310-1-180x180.png",
  "text": "IntelliJ IDEA – the Leading Java and Kotlin IDE, by JetBrains Coding Community IntelliJ IDEA Java TutorialsTop Java Blogs for Experienced Programmers  Following up on our previous article in which we shared some great multi-author blogs to follow, today we have a curated selection of personal blogs from top Java experts. These experts aren’t just the best at what they do – they’re also great at sharing their knowledge in ways that are easy to understand and fun to read. By following these blogs, you will always be ahead of the game, learning the newest tricks, and loving every moment of it.  Happy reading, and may your code always compile on the first try! Vlad Mihalcea, a Java Champion and outstanding developer, has dedicated years to perfecting the craft of high-performance coding. He literally wrote the book High-Performance Java Persistence, which is crushing it on Amazon’s bestseller list! For over eleven years, Vlad’s been sharing valuable insights about Spring, JPA, and Hibernate in clear, practical ways. And when it comes to databases? If there was a database superhero, it would be Vlad.  But wait, there’s more! This isn’t just a blog, it’s a complete learning playground for developers: Want regular expert tips? Subscribe to his High-Performance Java Persistence Newsletter. Ready to practice? Jump into his step-by-step tutorials conveniently organized by topics.  Want to improve your skills? Try his courses.  Interested in open source? Experiment with his Hypersistence Optimizer.  Articles to start with:  Why and when you should use JPA A beginner’s guide to MongoDB performance turbocharging Testcontainers Database Integration Testing When it comes to Spring and Java, Josh Long needs no introduction. As the first Spring Developer Advocate and a Java Champion, Josh has built a rich repository of content that is suitable for developers of every level and features diverse formats for any learning style:  Books on Java, Spring, and reactive programming. Live tutorial videos for hands-on learning. Conference schedules for attending sessions with Josh live. Coffee + Software and Spring Tips YouTube series for practical insights. A Bootiful Podcast for fascinating discussions on Java and Spring technology. Articles to start with:  Go, Go, Modern Java in 2023! Easy and Secure Microservices with Spring Security and Auth0 Java 21: Threads at Bargain Basement Prices! Nicolas Fränkel shares his deep knowledge of Java and software development through his blog. Having consulted for numerous industries – including telecoms, banking, insurance, and retail – he brings a wealth of real-world expertise to his writing. His technical focus is primarily on Java and Spring, Kotlin, Rust, rich internet applications, testing strategies, CI/CD, and DevOps practices.  But Nicolas doesn’t just write code – he shares his knowledge in many ways: Clear, practical blog posts. Published books.  Regular talks at conferences. Articles to start with:  Kotlin Coroutines and OpenTelemetry tracing Fixing duplicate API requests API versioning Want to learn from the creator of Eclipse Collections? Donald Raab is a Java Champion, blogger, and international conference speaker with over 40 years of programming experience. What’s in his tech toolbox? He writes a lot about Eclipse Collections (his famous Java library), JavaFX tips and tricks, and code quality and productivity secrets that actually work.  He is also the creator of the BNY Mellon Code Katas, designed to help developers practice their coding skills through problem-solving. His contributions to the Java community go beyond just technical innovations, as he’s played a key role as a JCP Executive Committee Representative.  Articles to start with:  My first JavaFX application My weird and wonderful first adventures with JavaFX Own Your IDE Thorben Janssen is a Java expert with over 15 years of experience using Hibernate and JPA in various projects, from fast-paced, small ones to large-scale applications. His blog focuses on sharing practical solutions to common Hibernate issues, drawing from his extensive knowledge. In addition to his blog, Janssen manages The Persistence Hub, a platform offering premium video courses, expert sessions, and learning paths tailored to different skill levels. He also keeps developers up to date with the Java Persistence Newsletter. Janssen’s book, Hibernate Tips, and his workshops provide even more in-depth guidance for developers looking to master Java persistence. Articles to start with: Hibernate Best Practices Hibernate Performance Tuning – 2024 Edition JPQL – How to Define Queries in JPA and Hibernate Nicolai Parlog, aka nipafx, is a passionate Java enthusiast who makes learning Java fun and accessible. His blog focuses on various Java versions and their key features. He explains Java concepts in simple terms and often adds a dash of humor, keeping his content engaging and relatable. Here’s what else you can find on his blog: His book The Java Module System provides clear examples and intuitive diagrams, making even complex topics easy to grasp.  His talks from conferences.  Videos with various tutorials. Demo projects related to his posts and videos, so you can try out the code and enhance your hands-on learning experience.  His Random Musings newsletter, where he writes about Java, content creation, sci-fi, LEGO, and more.  Articles to start with:  How To Use switch In Modern Java JUnit 5 Basics: @Test, Lifecycle, Assertions, Assumptions, And More Code-First Java Module System Tutorial Trisha Gee is a software engineer, Java Champion, and author. She was a Java advocate at JetBrains and now works as a Lead Developer Advocate at Gradle. Her passion for helping developers succeed shines through in everything she creates. Trisha is also a well-known speaker at international conferences, covering topics from Java and Spring to career advice on staying happy and productive in tech. Her work resonates within the community, particularly through her books and courses, such as Head First Java, Getting to Know IntelliJ IDEA, and 97 Things Every Java Developer Should Know. That makes you wonder – how can anyone think of 97 things? If you can name at least 10, you’re on the right track! Articles to start with: Gradle Gradle Gradle, with Gradle we’re going to play Are Developer Productivity and Developer Joy opposites? Flaky tests are poisoning your productivity Daniel Ciocîrlan, the founder of Rock the JVM, turns complex Scala, Kotlin, and Java concepts into manageable, bite-sized chunks of information. No boring lectures here – just clear explanations that click! Check out his blog posts when you want a deep dive, or hop over to his YouTube channel when you need to see code in action.  Articles to start with: The Big Kotlin Tutorial The Ultimate Guide to Java Virtual Threads HTTP Authentication with Scala and Http4s Meet Hanno Embregts, a Java Champion and Oracle ACE Pro who mixes code with creativity! When he’s not crafting Java solutions or speaking at conferences, you might find him jamming on his guitar or flute.  His blog is a well-organized playlist of Java knowledge, sorted by year so you can easily find your favorite tracks! From fresh Java features to battle-tested best practices, Hanno shares stories from his journey as a developer, consultant, and educator. There is also a special section for his talks at Java events that include his keynotes.  His blog offers both technical expertise and a personal touch, connecting with readers on multiple levels. Articles to start with: Java 23 Has Arrived, And It Brings a Truckload of Changes Java 22 Is Here, And It’s Ready To Rock Java 21 is Available Today, And It’s Quite the Update Marit van Dijk, a Java Champion and a JetBrains Developer Advocate, has been in software development for more than 20 years.  What’s in Marit’s tech toolbox? There’s Java (she’s a Champion for a reason), Kotlin with all of the modern tricks, Git for mastering version control, dependency management to keep projects clean, and insider tips on IntelliJ IDEA from someone who knows it inside out. On her blog, you’ll find clear tutorials that simplify complex topics, testing tips that actually work, blog posts solving real problems, and helpful videos for when you’d rather watch than read. Her blog keeps track of where she’ll be speaking next, from tech conferences to webinars, and is perfect for catching her live presentations or saying hi at events! Articles to start with: Reading Code like a pro Tips for reading code Pair programming in Java with an 8 year old Sebastian Daschner’s blog focuses on Java, cloud-native technologies, and enterprise software development. As a consultant, trainer, and developer, he’s dedicated to making software development more effective and enjoyable by explaining not just how concepts work but why they matter. A Java Champion and Oracle Developer Champion, Sebastian shares insights on topics like Kubernetes, Quarkus, Docker, and developer productivity.  On his blog, you can find your own learning adventure: Blog posts. Video courses.  A regular Java tips newsletter. His YouTube channel.  Podcasts for learning on the go. Articles to start with: 13 Cool IntelliJ Features (You Probably Didn’t Know) How to Become Better at the Keyboard Effective Developer Workflows With Quarkus Tom Cools’ blog is basically a handbook of lessons learned from the ever-changing world of IT because, let’s face it, you never stop learning in this field! As a Java consultant, licensed high school teacher, trainer, and mentor, Tom doesn’t just focus on code but on keeping the learning going, whether he’s sharing advice online or in the classroom. His main topics cover Java, tips on learning programming, presentation skills, and more, making his blog a go-to resource for anyone looking to level up their IT game. He runs the Belgian Java User Group and organizes monthly meetups where Java enthusiasts gather to geek out. If you’d love to hear more from him, you’re in luck – he’s a regular at conferences. Head over to his Talks page for the full lineup of where he’s speaking next. Articles to start with: Java related things I want to see more of in 2023 Use Testcontainers to create a Docker Test Image Jumping into Kotlin Holly Cummins, a Senior Principal Software Engineer on the Red Hat Quarkus team, brings a wealth of experience and a knack for innovation to the Java community. Her journey from IBM, where she wore multiple hats, including full-stack JavaScript developer, WebSphere Liberty build architect, and innovation leader in the IBM Garage, is just the start. Holly has worked with tech at all scales, from startups to banking giants, and even used cloud power for some cool projects like guiding a blind athlete through ultra-marathons and tackling climate risks. Her blog is the perfect mix of tech and thrill, diving into AI, Quarkus, and Java with a playful edge. She’s all about making software development not just doable, but fun. Articles to start with: Zombie Menace, Vampire Peril Will Generative AI Kill Developer Jobs Is Efficiency A Good Thing? Part I: What is Efficiency, and Are We Any Good At It? Marco Behler’s blog is where Java developers find complex topics made simple and fun. Marco breaks down tricky Java and JVM concepts into easy-to-follow guides and courses, helping developers save time and frustration while getting better at their craft. Currently working as a product manager at JetBrains, Marco has a background in running his own consultancy in Munich and working with big companies like BMW. His love for coding started at a young age – back in school when a friend handed him a CD full of hacking tools. From those early days of cracking code to now giving Java and Spring training across Germany, Austria, and Switzerland, Marco shares his passion through his blog, making it a must-visit for any developer wanting a fresh, engaging take on programming. Articles to start with: Java \u0026 Databases: An Overview of Libraries \u0026 APIs Java Microservices: A Practical Guide What is Kubernetes? An Unorthodox Guide for Developers Siva Katamreddy’s blog is for anyone passionate about Java, microservices, and cloud-native development. With over 18 years of experience as a software engineer, Siva dives deep into topics like building scalable applications using Java, Kotlin, Spring Boot, and GoLang. His hands-on expertise extends to microservices, event-driven systems using Kafka and AWS SQS, and infrastructure automation with tools like Jenkins and Terraform. Siva’s blog doesn’t just stick to written content – he also shares video tutorials via his YouTube channel, making complex topics accessible for developers of any level.  Articles to start with: Getting Started with Spring Boot Spring Boot REST API Best Practices – Part 1 SpringBoot Best Practices Ever wondered what it takes to build high-performance, scalable, and resilient Java applications? Look no further than Ionut Balosin’s blog. A software architect with over 15 years of hands-on experience in software development across various business applications, Ionut shares his deep technical knowledge in a way that’s both practical and engaging. As an Oracle ACE Associate, security champion, and frequent speaker at major software development conferences, he knows what it takes to create production-ready systems. On his blog, you’ll find trending articles and updates on where you can catch his next live talk. If you’re into practical, real-world insights on building robust applications, this blog is a must-follow. Who knows, you might even book him for a training session after exploring his compelling content! Articles to start with: JVM Performance Comparison for JDK 21 Logging patterns and their performance impact JVM Performance Comparison for JDK 17 Summary In this article, we’ve curated a list of top personal blogs from some of the most influential Java experts out there. From JVM performance tuning to real-life software architecture lessons, these authors bring their years of experience straight to your screen. Whether you’re interested in hands-on tutorials, conference talks, or exploring the cutting-edge corners of Java, there’s something here for every developer. Who do you follow? Are there any Java gurus or blogs you swear by? Drop their names in the comments and let’s expand the list! Subscribe to IntelliJ IDEA Blog updates Discover more",
  "image": "https://blog.jetbrains.com/wp-content/uploads/2024/11/ij-social_share_blog_1280x720_en-1.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n    \u003cdiv\u003e\n                        \u003ca href=\"https://blog.jetbrains.com/idea/\"\u003e\n                            \u003cimg src=\"https://blog.jetbrains.com/wp-content/uploads/2019/01/IntelliJ-IDEA-1.svg\" alt=\"Idea logo\"/\u003e\n                                                                                                \n                                                                                    \u003c/a\u003e\n                                                    \u003cp\u003eIntelliJ IDEA – the Leading Java and Kotlin IDE, by JetBrains\u003c/p\u003e\n                                            \u003c/div\u003e\n                            \u003csection data-clarity-region=\"article\"\u003e\n                \u003cdiv\u003e\n                    \t\t\t\t\u003cp\u003e\u003ca href=\"https://blog.jetbrains.com/idea/category/coding/\"\u003eCoding\u003c/a\u003e\n\t\t\t\u003ca href=\"https://blog.jetbrains.com/idea/category/community/\"\u003eCommunity\u003c/a\u003e\n\t\t\t\u003ca href=\"https://blog.jetbrains.com/idea/category/idea/\"\u003eIntelliJ IDEA\u003c/a\u003e\n\t\t\t\u003ca href=\"https://blog.jetbrains.com/idea/category/java/\"\u003eJava\u003c/a\u003e\n\t\t\t\u003ca href=\"https://blog.jetbrains.com/idea/category/tutorials/\"\u003eTutorials\u003c/a\u003e\u003c/p\u003e\u003ch2 id=\"major-updates\"\u003eTop Java Blogs for Experienced Programmers \u003c/h2\u003e                    \n                    \n\u003cp\u003eFollowing up on our previous article in which we shared some great multi-author blogs to follow, today we have a curated selection of personal blogs from top Java experts.\u003c/p\u003e\n\n\n\n\u003cp\u003eThese experts aren’t just the best at what they do – they’re also great at sharing their knowledge in ways that are easy to understand and fun to read. By following these blogs, you will always be ahead of the game, learning the newest tricks, and loving every moment of it. \u003c/p\u003e\n\n\n\n\u003cp\u003eHappy reading, and may your code always compile on the first try!\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003ca href=\"https://vladmihalcea.com\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXd4pajXJFBdJhZ7rY_i8kgGVDD_Rqs7jL7xj0YaDDBhiob3yZ8iIEPMGlnORf4XncvxBE3U4zK_htaCETEKPQ6Dbi8SpfM22QKXRUj2qOWPcscyR4LYKA7Gaih5VFpo_bQzlEAfpD686grd9fsuHbPZ-TA?key=hlUA5cEPDeyD3frq0F0ciA\" alt=\"\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eVlad Mihalcea, a Java Champion and outstanding developer, has dedicated years to perfecting the craft of high-performance coding. He literally wrote the book \u003cem\u003eHigh-Performance Java Persistence\u003c/em\u003e, which is crushing it on Amazon’s bestseller list!\u003c/p\u003e\n\n\n\n\u003cp\u003eFor over eleven years, Vlad’s been sharing valuable insights about Spring, JPA, and Hibernate in clear, practical ways. And when it comes to databases? If there was a database superhero, it would be Vlad. \u003c/p\u003e\n\n\n\n\u003cp\u003eBut wait, there’s more! This isn’t just a blog, it’s a complete learning playground for developers:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eWant regular expert tips? Subscribe to his \u003ca href=\"https://vladmihalcea.com/follow-me/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cem\u003eHigh-Performance Java Persistence Newsletter\u003c/em\u003e\u003c/a\u003e\u003cem\u003e.\u003c/em\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eReady to practice? Jump into his \u003ca href=\"https://vladmihalcea.com/tutorials/\" target=\"_blank\" rel=\"noopener\"\u003estep-by-step tutorials\u003c/a\u003e conveniently organized by topics. \u003c/li\u003e\n\n\n\n\u003cli\u003eWant to improve your skills? Try \u003ca href=\"https://vladmihalcea.com/trainings/\" target=\"_blank\" rel=\"noopener\"\u003ehis courses\u003c/a\u003e. \u003c/li\u003e\n\n\n\n\u003cli\u003eInterested in open source? Experiment with his \u003ca href=\"https://vladmihalcea.com/hypersistence-optimizer/\" target=\"_blank\" rel=\"noopener\"\u003eHypersistence Optimizer\u003c/a\u003e. \u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch3\u003eArticles to start with: \u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://vladmihalcea.com/why-and-when-use-jpa/\" target=\"_blank\" rel=\"noopener\"\u003eWhy and when you should use JPA\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://vladmihalcea.com/a-beginners-guide-to-mongodb-performance-turbocharging/\" target=\"_blank\" rel=\"noopener\"\u003eA beginner’s guide to MongoDB performance turbocharging\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://vladmihalcea.com/testcontainers-database-integration-testing/\" target=\"_blank\" rel=\"noopener\"\u003eTestcontainers Database Integration Testing\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cfigure\u003e\u003ca href=\"https://joshlong.com\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" fetchpriority=\"high\" width=\"1500\" height=\"400\" src=\"https://blog.jetbrains.com/wp-content/uploads/2024/11/Screenshot-2024-11-01-at-14.04.59.png\" alt=\"\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eWhen it comes to Spring and Java, Josh Long needs no introduction. As the first Spring Developer Advocate and a Java Champion, Josh has built a rich repository of content that is suitable for developers of every level and features diverse formats for any learning style: \u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eBooks on Java, Spring, and reactive programming.\u003c/li\u003e\n\n\n\n\u003cli\u003eLive tutorial videos for hands-on learning.\u003c/li\u003e\n\n\n\n\u003cli\u003eConference schedules for attending sessions with Josh live.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cem\u003eCoffee + Software\u003c/em\u003e and \u003cem\u003eSpring Tips\u003c/em\u003e YouTube series for practical insights.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cem\u003eA Bootiful Podcast\u003c/em\u003e for fascinating discussions on Java and Spring technology.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch3\u003eArticles to start with: \u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://joshlong.com/jl/blogPost/go-go-modern-java-in-2023.html\" target=\"_blank\" rel=\"noopener\"\u003eGo, Go, Modern Java in 2023!\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://joshlong.com/jl/blogPost/auth0-and-spring-security.html\" target=\"_blank\" rel=\"noopener\"\u003eEasy and Secure Microservices with Spring Security and Auth0\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://joshlong.com/jl/blogPost/async-await-was-a-mistake.html\" target=\"_blank\" rel=\"noopener\"\u003eJava 21: Threads at Bargain Basement Prices!\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cfigure\u003e\u003ca href=\"https://blog.frankel.ch\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXdRWSIWpXWxFfpI8TRqNoES2f8OhQt3GwRUrPlTZ_dkWDZbn5aZ1W3ut3YP88OwSdaPkZtELNY2JEHqA6LEzZ-Px1eqxxvYBC_Y62stF4P8FvtvrFPn7yFQxG6hXUZFbxEttVrrXU3TmHN95GwQiKxHAyUT?key=hlUA5cEPDeyD3frq0F0ciA\" alt=\"\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eNicolas Fränkel shares his deep knowledge of Java and software development through his blog. Having consulted for numerous industries – including telecoms, banking, insurance, and retail – he brings a wealth of real-world expertise to his writing. His technical focus is primarily on Java and Spring, Kotlin, Rust, rich internet applications, testing strategies, CI/CD, and DevOps practices. \u003c/p\u003e\n\n\n\n\u003cp\u003eBut Nicolas doesn’t just write code – he shares his knowledge in many ways:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eClear, practical \u003ca href=\"https://blog.frankel.ch/\" target=\"_blank\" rel=\"noopener\"\u003eblog posts\u003c/a\u003e.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://blog.frankel.ch/books/\" target=\"_blank\" rel=\"noopener\"\u003ePublished books\u003c/a\u003e. \u003c/li\u003e\n\n\n\n\u003cli\u003eRegular talks at \u003ca href=\"https://blog.frankel.ch/speaking/\" target=\"_blank\" rel=\"noopener\"\u003econferences\u003c/a\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch3\u003eArticles to start with: \u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://blog.frankel.ch/kotlin-coroutines-otel-tracing/\" target=\"_blank\" rel=\"noopener\"\u003eKotlin Coroutines and OpenTelemetry tracing\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://blog.frankel.ch/fix-duplicate-api-requests/\" target=\"_blank\" rel=\"noopener\"\u003eFixing duplicate API requests\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://blog.frankel.ch/api-versioning/\" target=\"_blank\" rel=\"noopener\"\u003eAPI versioning\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cfigure\u003e\u003ca href=\"https://donraab.medium.com\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXdZ75VxWZ-Me8P-6MdhKroWXCeozzN8OxYHTfVUG7-Gxgec5cm2StQ0QKYYBqKacPiE8hPwIA9_xtTNMMe0jhdSZsK1mwDEkILJ5DkXoNMzZf1uYHcMlAa1_fp1toae0DLt-D8gQioJtmAZRJYdd36LDGA?key=hlUA5cEPDeyD3frq0F0ciA\" alt=\"\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eWant to learn from the creator of Eclipse Collections? Donald Raab is a Java Champion, blogger, and international conference speaker with over 40 years of programming experience. What’s in his tech toolbox? He writes a lot about Eclipse Collections (his famous Java library), JavaFX tips and tricks, and code quality and productivity secrets that actually work. \u003c/p\u003e\n\n\n\n\u003cp\u003eHe is also the creator of the BNY Mellon Code Katas, designed to help developers practice their coding skills through problem-solving. His contributions to the Java community go beyond just technical innovations, as he’s played a key role as a JCP Executive Committee Representative. \u003c/p\u003e\n\n\n\n\u003ch3\u003eArticles to start with: \u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://medium.com/javarevisited/my-first-javafx-application-ee70a1d48cb3\" target=\"_blank\" rel=\"noopener\"\u003eMy first JavaFX application\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://medium.com/javarevisited/my-weird-and-wonderful-first-adventures-with-javafx-6efe3b1923c8\" target=\"_blank\" rel=\"noopener\"\u003eMy weird and wonderful first adventures with JavaFX\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://donraab.medium.com/own-your-ide-5ebc54e5709a\" target=\"_blank\" rel=\"noopener\"\u003eOwn Your IDE\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cfigure\u003e\u003ca href=\"https://thorben-janssen.com/about/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" width=\"1500\" height=\"400\" src=\"https://blog.jetbrains.com/wp-content/uploads/2024/11/Screenshot-2024-11-01-at-14.05.21.png\" alt=\"\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThorben Janssen is a Java expert with over 15 years of experience using Hibernate and JPA in various projects, from fast-paced, small ones to large-scale applications. His blog focuses on sharing practical solutions to common Hibernate issues, drawing from his extensive knowledge.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn addition to his blog, Janssen manages \u003ca href=\"https://thorben-janssen.com/join-persistence-hub/\" target=\"_blank\" rel=\"noopener\"\u003eThe Persistence Hub\u003c/a\u003e, a platform offering premium video courses, expert sessions, and learning paths tailored to different skill levels. He also keeps developers up to date with the \u003ca href=\"https://thorben-janssen.com/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cem\u003eJava Persistence Newsletter\u003c/em\u003e\u003c/a\u003e. Janssen’s book, \u003ca href=\"https://thorben-janssen.com/hibernate-tips-book/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cem\u003eHibernate Tips\u003c/em\u003e\u003c/a\u003e, and \u003ca href=\"https://thorben-janssen.com/workshops/\" target=\"_blank\" rel=\"noopener\"\u003ehis workshops\u003c/a\u003e provide even more in-depth guidance for developers looking to master Java persistence.\u003c/p\u003e\n\n\n\n\u003ch3\u003eArticles to start with:\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://thorben-janssen.com/hibernate-best-practices/\" target=\"_blank\" rel=\"noopener\"\u003eHibernate Best Practices\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://thorben-janssen.com/tips-to-boost-your-hibernate-performance/\" target=\"_blank\" rel=\"noopener\"\u003eHibernate Performance Tuning – 2024 Edition\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://thorben-janssen.com/jpql/\" target=\"_blank\" rel=\"noopener\"\u003eJPQL – How to Define Queries in JPA and Hibernate\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cfigure\u003e\u003ca href=\"https://nipafx.dev\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" width=\"1500\" height=\"400\" src=\"https://blog.jetbrains.com/wp-content/uploads/2024/11/Screenshot-2024-11-01-at-14.05.45.png\" alt=\"\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eNicolai Parlog, aka nipafx, is a passionate Java enthusiast who makes learning Java fun and accessible. His blog focuses on various Java versions and their key features. He explains Java concepts in simple terms and often adds a dash of humor, keeping his content engaging and relatable.\u003c/p\u003e\n\n\n\n\u003cp\u003eHere’s what else you can find on his blog:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eHis \u003ca href=\"https://www.manning.com/books/the-java-module-system?a_aid=nipa\u0026amp;a_bid=869915cb\" target=\"_blank\" rel=\"noopener\"\u003ebook\u003c/a\u003e \u003cem\u003eThe Java Module System\u003c/em\u003e provides clear examples and intuitive diagrams, making even complex topics easy to grasp. \u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://nipafx.dev/talks/\" target=\"_blank\" rel=\"noopener\"\u003eHis talks\u003c/a\u003e from conferences. \u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://nipafx.dev/#channels~~videos\" target=\"_blank\" rel=\"noopener\"\u003eVideos\u003c/a\u003e with various tutorials.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://nipafx.dev/demos/\" target=\"_blank\" rel=\"noopener\"\u003eDemo projects\u003c/a\u003e related to his posts and videos, so you can try out the code and enhance your hands-on learning experience. \u003c/li\u003e\n\n\n\n\u003cli\u003eHis \u003ca href=\"https://nipafx.dev/news/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cem\u003eRandom Musings\u003c/em\u003e\u003c/a\u003e newsletter, where he writes about Java, content creation, sci-fi, LEGO, and more. \u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch3\u003eArticles to start with: \u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://nipafx.dev/java-switch/\" target=\"_blank\" rel=\"noopener\"\u003eHow To Use switch In Modern Java\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://nipafx.dev/junit-5-basics/\" target=\"_blank\" rel=\"noopener\"\u003eJUnit 5 Basics: @Test, Lifecycle, Assertions, Assumptions, And More\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://nipafx.dev/java-module-system-tutorial/\" target=\"_blank\" rel=\"noopener\"\u003eCode-First Java Module System Tutorial\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cfigure\u003e\u003ca href=\"https://trishagee.com/blog/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXeFEj-mvzzWlPeQ9D_t4gJBoxxLEpxdeH-SIDfYDw0IBVd5RaU2lU-pVLHYg0zPCFkRs5G9DwF75trSQHxNwZmQX54_coijM_lURiV5ly87pfatZgkflQSX7Ug8ggjFq2mhtTW19fVozz54RaauKBA-aZI?key=hlUA5cEPDeyD3frq0F0ciA\" alt=\"\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eTrisha Gee is a software engineer, Java Champion, and author. She was a Java advocate at JetBrains and now works as a Lead Developer Advocate at Gradle. Her passion for helping developers succeed shines through in everything she creates.\u003c/p\u003e\n\n\n\n\u003cp\u003eTrisha is also a well-known speaker at international conferences, covering topics from Java and Spring to career advice on staying happy and productive in tech.\u003c/p\u003e\n\n\n\n\u003cp\u003eHer work resonates within the community, particularly through her books and courses, such as \u003cem\u003eHead First Java\u003c/em\u003e, \u003cem\u003eGetting to Know IntelliJ IDEA\u003c/em\u003e, and \u003cem\u003e97 Things Every Java Developer Should Know\u003c/em\u003e. That makes you wonder – how can anyone think of 97 things? If you can name at least 10, you’re on the right track!\u003c/p\u003e\n\n\n\n\u003ch3\u003eArticles to start with:\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://trishagee.com/2023/02/13/with-gradle-were-going-to-play/\" target=\"_blank\" rel=\"noopener\"\u003eGradle Gradle Gradle, with Gradle we’re going to play\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://trishagee.com/2024/06/30/are-developer-productivity-and-developer-joy-opposites/\" target=\"_blank\" rel=\"noopener\"\u003eAre Developer Productivity and Developer Joy opposites?\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://trishagee.com/2024/06/07/flaky-tests-are-poisoning-your-productivity/\" target=\"_blank\" rel=\"noopener\"\u003eFlaky tests are poisoning your productivity\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cfigure\u003e\u003ca href=\"https://blog.rockthejvm.com\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXf1BAN2KjUIoZSAEztaVDvFeVcKcbtUNTqc7HFiWczVSc-t5uBqsDbpkkjD6tw00X4qLhFkK6AkVnwlV2E3zs96ejOU677LQDiSbtpI4nEHkW9-TlndsjA5stD0c8wstcYIOx3fpw-ibmc5yDRKTvP2Zgk?key=hlUA5cEPDeyD3frq0F0ciA\" alt=\"\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eDaniel Ciocîrlan, the founder of Rock the JVM, turns complex Scala, Kotlin, and Java concepts into manageable, bite-sized chunks of information. No boring lectures here – just clear explanations that click!\u003c/p\u003e\n\n\n\n\u003cp\u003eCheck out his blog posts when you want a deep dive, or hop over to his \u003ca href=\"https://www.youtube.com/rockthejvm\" target=\"_blank\" rel=\"noopener\"\u003eYouTube channel\u003c/a\u003e when you need to see code in action. \u003c/p\u003e\n\n\n\n\u003ch3\u003eArticles to start with:\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://blog.rockthejvm.com/big-kotlin-tutorial/\" target=\"_blank\" rel=\"noopener\"\u003eThe Big Kotlin Tutorial\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://blog.rockthejvm.com/ultimate-guide-to-java-virtual-threads/\" target=\"_blank\" rel=\"noopener\"\u003eThe Ultimate Guide to Java Virtual Threads\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://blog.rockthejvm.com/scala-http4s-authentication/\" target=\"_blank\" rel=\"noopener\"\u003eHTTP Authentication with Scala and Http4s\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cfigure\u003e\u003ca href=\"https://hanno.codes/about-me/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXecewDnpabKgk4iDy-aszpRD-5dlLZnIqztUDYS5a6Ed-5DdtzA38Ek7xAEkO8y_kItHNoYrAxLnpvSzq6VrhFBqXkgjk1O-yrAQH94EC2Tc-ncL5efnYWPQDEMSNG1QbJt3kVFzKaNJpHJaRNhPqx08fU?key=hlUA5cEPDeyD3frq0F0ciA\" alt=\"\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eMeet Hanno Embregts, a Java Champion and Oracle ACE Pro who mixes code with creativity! When he’s not crafting Java solutions or speaking at conferences, you might find him jamming on his guitar or flute. \u003c/p\u003e\n\n\n\n\u003cp\u003eHis blog is a well-organized playlist of Java knowledge, sorted by year so you can easily find your favorite tracks! From fresh Java features to battle-tested best practices, Hanno shares stories from his journey as a developer, consultant, and educator.\u003c/p\u003e\n\n\n\n\u003cp\u003eThere is also a special section for his talks at Java events that include his keynotes. \u003c/p\u003e\n\n\n\n\u003cp\u003eHis blog offers both technical expertise and a personal touch, connecting with readers on multiple levels.\u003c/p\u003e\n\n\n\n\u003ch3\u003eArticles to start with:\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://hanno.codes/2024/09/17/java-23-has-arrived/\" target=\"_blank\" rel=\"noopener\"\u003eJava 23 Has Arrived, And It Brings a Truckload of Changes\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://hanno.codes/2024/03/19/java-22-is-here/\" target=\"_blank\" rel=\"noopener\"\u003eJava 22 Is Here, And It’s Ready To Rock\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://hanno.codes/2023/09/19/java-21-release-day/\" target=\"_blank\" rel=\"noopener\"\u003eJava 21 is Available Today, And It’s Quite the Update\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cfigure\u003e\u003ca href=\"https://maritvandijk.com\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" loading=\"lazy\" width=\"1500\" height=\"400\" src=\"https://blog.jetbrains.com/wp-content/uploads/2024/11/Screenshot-2024-11-01-at-14.06.12.png\" alt=\"\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eMarit van Dijk, a Java Champion and a JetBrains Developer Advocate, has been in software development for more than 20 years. \u003c/p\u003e\n\n\n\n\u003cp\u003eWhat’s in Marit’s tech toolbox? There’s Java (she’s a Champion for a reason), Kotlin with all of the modern tricks, Git for mastering version control, dependency management to keep projects clean, and insider tips on IntelliJ IDEA from someone who knows it inside out.\u003c/p\u003e\n\n\n\n\u003cp\u003eOn her blog, you’ll find clear tutorials that simplify complex topics, testing tips that actually work, blog posts solving real problems, and helpful videos for when you’d rather watch than read.\u003c/p\u003e\n\n\n\n\u003cp\u003eHer blog keeps track of where she’ll be speaking next, from tech conferences to webinars, and is perfect for catching her live presentations or saying hi at events!\u003c/p\u003e\n\n\n\n\u003ch3\u003eArticles to start with:\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://maritvandijk.com/reading-code-like-pro/\" target=\"_blank\" rel=\"noopener\"\u003eReading Code like a pro\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://maritvandijk.com/tips-reading-code/\" target=\"_blank\" rel=\"noopener\"\u003eTips for reading code\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://maritvandijk.com/java-with-kids/\" target=\"_blank\" rel=\"noopener\"\u003ePair programming in Java with an 8 year old\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cfigure\u003e\u003ca href=\"https://blog.sebastian-daschner.com\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" loading=\"lazy\" width=\"1500\" height=\"400\" src=\"https://blog.jetbrains.com/wp-content/uploads/2024/11/Screenshot-2024-11-01-at-14.06.31.png\" alt=\"\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eSebastian Daschner’s blog focuses on Java, cloud-native technologies, and enterprise software development. As a consultant, trainer, and developer, he’s dedicated to making software development more effective and enjoyable by explaining not just how concepts work but why they matter. A Java Champion and Oracle Developer Champion, Sebastian shares insights on topics like Kubernetes, Quarkus, Docker, and developer productivity. \u003c/p\u003e\n\n\n\n\u003cp\u003eOn his blog, you can find your own learning adventure:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://blog.sebastian-daschner.com/\" target=\"_blank\" rel=\"noopener\"\u003eBlog posts\u003c/a\u003e.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.sebastian-daschner.com/courses/\" target=\"_blank\" rel=\"noopener\"\u003eVideo courses. \u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003eA regular Java tips \u003ca href=\"https://www.sebastian-daschner.com/news/\" target=\"_blank\" rel=\"noopener\"\u003enewsletter\u003c/a\u003e.\u003c/li\u003e\n\n\n\n\u003cli\u003eHis \u003ca href=\"https://www.youtube.com/channel/UCG21GE2Go3vkj7mrs675ysA\" target=\"_blank\" rel=\"noopener\"\u003eYouTube channel\u003c/a\u003e.\u003ca href=\"https://www.youtube.com/channel/UCG21GE2Go3vkj7mrs675ysA\" target=\"_blank\" rel=\"noopener\"\u003e \u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://podcasters.spotify.com/pod/show/effective-developer\" target=\"_blank\" rel=\"noopener\"\u003ePodcasts\u003c/a\u003e for learning on the go.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch3\u003eArticles to start with:\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://blog.sebastian-daschner.com/entries/13-lesser-known-intellij-features\" target=\"_blank\" rel=\"noopener\"\u003e13 Cool IntelliJ Features (You Probably Didn’t Know)\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://blog.sebastian-daschner.com/entries/better-keyboard-developers\" target=\"_blank\" rel=\"noopener\"\u003eHow to Become Better at the Keyboard\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://blog.sebastian-daschner.com/entries/effective-developer-workflows-quarkus\" target=\"_blank\" rel=\"noopener\"\u003eEffective Developer Workflows With Quarkus\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cfigure\u003e\u003ca href=\"https://tomcools.be\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXe1Sy9XA8dBrgDfP4ymPE6TGEEGQA3a733Khy3qkjIjvrFPKZDNlvl1QGXsL-heF2TgK6JAZU4bZ0ugNqLBz7lOeFJ4SAyhvq4-3X8LNdbuDkP7Gf5jRpMH0OuVssxOG63NLBqmaPpQR7DrRSeDsgeINkVA?key=hlUA5cEPDeyD3frq0F0ciA\" alt=\"\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eTom Cools’ blog is basically a handbook of lessons learned from the ever-changing world of IT because, let’s face it, you never stop learning in this field! As a Java consultant, licensed high school teacher, trainer, and mentor, Tom doesn’t just focus on code but on keeping the learning going, whether he’s sharing advice online or in the classroom.\u003c/p\u003e\n\n\n\n\u003cp\u003eHis main topics cover Java, tips on learning programming, presentation skills, and more, making his blog a go-to resource for anyone looking to level up their IT game.\u003c/p\u003e\n\n\n\n\u003cp\u003eHe runs the Belgian Java User Group and organizes monthly meetups where Java enthusiasts gather to geek out.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you’d love to hear more from him, you’re in luck – he’s a regular at conferences. Head over to his \u003ca href=\"https://www.tomcools.be/talks/\" target=\"_blank\" rel=\"noopener\"\u003eTalks\u003c/a\u003e page for the full lineup of where he’s speaking next.\u003c/p\u003e\n\n\n\n\u003ch3\u003eArticles to start with:\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://www.tomcools.be/post/jan-2023-what-i-want-to-see-more/\" target=\"_blank\" rel=\"noopener\"\u003eJava related things I want to see more of in 2023\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.tomcools.be/post/june-2022-testcontainer-imagebuilder/\" target=\"_blank\" rel=\"noopener\"\u003eUse Testcontainers to create a Docker Test Image\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.tomcools.be/post/april-2021-favorite-kotlin/\" target=\"_blank\" rel=\"noopener\"\u003eJumping into Kotlin\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cfigure\u003e\u003ca href=\"https://hollycummins.com\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXdlvgVuozHMaqDxOlTLAUiJFca0mS5hGwEq2JJIE1ARhp8MbNbT5mtEqTFQueAVsJnzvH8dVkahcJk0K4t8hFct2Xka-wzK_nJ3ZrxG61abFLf5UY00CUlY1bgbcJ0pcwwxkVao80UNwuUqIUJFGCw6V6PQ?key=hlUA5cEPDeyD3frq0F0ciA\" alt=\"\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eHolly Cummins, a Senior Principal Software Engineer on the Red Hat Quarkus team, brings a wealth of experience and a knack for innovation to the Java community. Her journey from IBM, where she wore multiple hats, including full-stack JavaScript developer, WebSphere Liberty build architect, and innovation leader in the IBM Garage, is just the start. Holly has worked with tech at all scales, from startups to banking giants, and even used cloud power for some cool projects like guiding a blind athlete through ultra-marathons and tackling climate risks.\u003c/p\u003e\n\n\n\n\u003cp\u003eHer blog is the perfect mix of tech and thrill, diving into AI, Quarkus, and Java with a playful edge. She’s all about making software development not just doable, but \u003cem\u003efun\u003c/em\u003e.\u003c/p\u003e\n\n\n\n\u003ch3\u003eArticles to start with:\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://hollycummins.com/vampires-and-zombies/\" target=\"_blank\" rel=\"noopener\"\u003eZombie Menace, Vampire Peril\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://hollycummins.com/will-ai-take-our-jobs/\" target=\"_blank\" rel=\"noopener\"\u003eWill Generative AI Kill Developer Jobs\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://hollycummins.com/is-efficiency-a-good-thing-part-i/\" target=\"_blank\" rel=\"noopener\"\u003eIs Efficiency A Good Thing? Part I: What is Efficiency, and Are We Any Good At It?\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cfigure\u003e\u003ca href=\"https://marcobehler.com\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" loading=\"lazy\" width=\"1500\" height=\"400\" src=\"https://blog.jetbrains.com/wp-content/uploads/2024/11/Screenshot-2024-11-01-at-14.06.48.png\" alt=\"\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eMarco Behler’s blog is where Java developers find complex topics made simple and fun. Marco breaks down tricky Java and JVM concepts into easy-to-follow guides and courses, helping developers save time and frustration while getting better at their craft.\u003c/p\u003e\n\n\n\n\u003cp\u003eCurrently working as a product manager at JetBrains, Marco has a background in running his own consultancy in Munich and working with big companies like BMW. His love for coding started at a young age – back in school when a friend handed him a CD full of hacking tools. From those early days of cracking code to now giving Java and Spring training across Germany, Austria, and Switzerland, Marco shares his passion through his blog, making it a must-visit for any developer wanting a fresh, engaging take on programming.\u003c/p\u003e\n\n\n\n\u003ch3\u003eArticles to start with:\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://www.marcobehler.com/guides/java-databases\" target=\"_blank\" rel=\"noopener\"\u003eJava \u0026amp; Databases: An Overview of Libraries \u0026amp; APIs\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.marcobehler.com/guides/java-microservices-a-practical-guide\" target=\"_blank\" rel=\"noopener\"\u003eJava Microservices: A Practical Guide\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.marcobehler.com/guides/kubernetes\" target=\"_blank\" rel=\"noopener\"\u003eWhat is Kubernetes? An Unorthodox Guide for Developers\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cfigure\u003e\u003ca href=\"https://sivalabs.in\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXcjrb_il-ezihjKoRhqRy8yu9ZeIL_XYcaBBAlgRSZqmDtwnbJRIAyTypLBVawdS-VylT-b5cOnq08VzhEgWj8jJZZM6bMmOOZt403Biwz7NjKQYfrDwIT0pm5OkigQBZ-7B3KjWcxsVqQCrB0w9iMbDmg?key=hlUA5cEPDeyD3frq0F0ciA\" alt=\"\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eSiva Katamreddy’s blog is for anyone passionate about Java, microservices, and cloud-native development. With over 18 years of experience as a software engineer, Siva dives deep into topics like building scalable applications using Java, Kotlin, Spring Boot, and GoLang. His hands-on expertise extends to microservices, event-driven systems using Kafka and AWS SQS, and infrastructure automation with tools like Jenkins and Terraform.\u003c/p\u003e\n\n\n\n\u003cp\u003eSiva’s blog doesn’t just stick to written content – he also shares video tutorials via his YouTube channel, making complex topics accessible for developers of any level. \u003c/p\u003e\n\n\n\n\u003ch3\u003eArticles to start with:\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://www.sivalabs.in/getting-started-with-spring-boot/\" target=\"_blank\" rel=\"noopener\"\u003eGetting Started with Spring Boot\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.sivalabs.in/spring-boot-rest-api-best-practices-part-1/\" target=\"_blank\" rel=\"noopener\"\u003eSpring Boot REST API Best Practices – Part 1\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.sivalabs.in/spring-boot-best-practices/\" target=\"_blank\" rel=\"noopener\"\u003eSpringBoot Best Practices\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cfigure\u003e\u003ca href=\"https://ionutbalosin.com\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXc7ufE5BiLy-KTtQud8BSNJ-hEhxmcvXpk9ArKepfoi_Yhc5BcaJ-egGJea6HPVOd7oMUFNqqLj5I1G3rs0lpMyCRpaG-I5ULRHkfhM6yv3HSKYabDpj_6lBTGA7f5hC6K2J8erBs-gIH4MQAReZ5X_cvOY?key=hlUA5cEPDeyD3frq0F0ciA\" alt=\"\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eEver wondered what it takes to build high-performance, scalable, and resilient Java applications? Look no further than Ionut Balosin’s blog. A software architect with over 15 years of hands-on experience in software development across various business applications, Ionut shares his deep technical knowledge in a way that’s both practical and engaging. As an Oracle ACE Associate, security champion, and frequent speaker at major software development conferences, he knows what it takes to create production-ready systems.\u003c/p\u003e\n\n\n\n\u003cp\u003eOn his blog, you’ll find trending articles and updates on where you can catch his next live talk. If you’re into practical, real-world insights on building robust applications, this blog is a must-follow. Who knows, you might even book him for a training session after exploring his compelling content!\u003c/p\u003e\n\n\n\n\u003ch3\u003eArticles to start with:\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://ionutbalosin.com/2024/02/jvm-performance-comparison-for-jdk-21/\" target=\"_blank\" rel=\"noopener\"\u003eJVM Performance Comparison for JDK 21\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://ionutbalosin.com/2019/11/logging-patterns-and-their-performance-impact/\" target=\"_blank\" rel=\"noopener\"\u003eLogging patterns and their performance impact\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://ionutbalosin.com/2023/03/jvm-performance-comparison-for-jdk-17/\" target=\"_blank\" rel=\"noopener\"\u003eJVM Performance Comparison for JDK 17\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2\u003eSummary\u003c/h2\u003e\n\n\n\n\u003cp\u003eIn this article, we’ve curated a list of top personal blogs from some of the most influential Java experts out there. From JVM performance tuning to real-life software architecture lessons, these authors bring their years of experience straight to your screen. Whether you’re interested in hands-on tutorials, conference talks, or exploring the cutting-edge corners of Java, there’s something here for every developer.\u003c/p\u003e\n\n\n\n\u003cp\u003eWho do you follow? Are there any Java gurus or blogs you swear by? Drop their names in the comments and let’s expand the list!\u003c/p\u003e\n                    \n                                                                \n                                                                                                                                \u003cdiv\u003e\n                                \u003cdiv\u003e\n                                                                            \u003ch4\u003eSubscribe to IntelliJ IDEA Blog updates\u003c/h4\u003e\n                                                                                                            \n                                \u003c/div\u003e\n                                \n                                \u003cp\u003e\u003cimg src=\"https://blog.jetbrains.com/wp-content/themes/jetbrains/assets/img/img-form.svg\" alt=\"image description\"/\u003e\n                                                                    \u003c/p\u003e\n                            \u003c/div\u003e\n                                                            \u003c/div\u003e\n                \u003ca href=\"#\"\u003e\u003c/a\u003e\n                \n                \n            \u003c/section\u003e\n                    \u003cdiv\u003e\n                \u003cp\u003e\n                    \u003ch2\u003eDiscover more\u003c/h2\u003e\n                \u003c/p\u003e\n                \n            \u003c/div\u003e\n                \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "17 min read",
  "publishedTime": null,
  "modifiedTime": null
}
