{
  "id": "895c5ee7-6a1c-40d5-b272-953ebcfca1c1",
  "title": "Building a Better Developer Experience: A Collaboration Between Gradle, Google, and JetBrains",
  "link": "https://blog.jetbrains.com/idea/2025/02/building-a-better-developer-experience-a-collaboration-between-gradle-google-and-jetbrains/",
  "description": "The original blog post was published here. Developers are at the heart of everything we do. You are the ones who create all of those new things to make the world better. To do that effectively, you need tools to rely on that are powerful yet easy to use. That’s why Kotlin was created. But […]",
  "author": "Dmitriy Smirnov",
  "published": "Wed, 26 Feb 2025 14:30:21 +0000",
  "source": "https://blog.jetbrains.com/feed",
  "categories": [
    "news",
    "collaboration",
    "google",
    "gradle",
    "intellij-idea",
    "jetbrains"
  ],
  "byline": "Dmitriy Smirnov",
  "length": 7477,
  "excerpt": "The original blog post was published here. Developers are at the heart of everything we do. You are the ones who create all of those new things to make the world better. To do that effectively, yo",
  "siteName": "The JetBrains Blog",
  "favicon": "https://blog.jetbrains.com/wp-content/uploads/2024/01/cropped-mstile-310x310-1-180x180.png",
  "text": "IntelliJ IDEA – the IDE for Professional Development in Java and Kotlin NewsBuilding a Better Developer Experience: A Collaboration Between Gradle, Google, and JetBrains The original blog post was published here. Developers are at the heart of everything we do. You are the ones who create all of those new things to make the world better. To do that effectively, you need tools to rely on that are powerful yet easy to use. That’s why Kotlin was created. But the language is only a part of the story – you need an entire ecosystem to make things actually work together. That includes various developer tools and, among others, a build system, and an IDE. For Kotlin projects, the Gradle Build Tool, also known as Gradle, is often the build system of choice. Gradle, as a powerful and flexible build system, has become a key part of many development processes. Nowadays it is at the core of many server-side, frontend, and mobile projects. It is also the default build system for Android projects. However, great flexibility comes with challenges. Complexity, a steep learning curve, and friction between the IDE, language, and build system can make everyday development harder than it should be. These are not just technical hurdles – they affect your productivity, creativity, and satisfaction. At Google, Gradle, and JetBrains, we recognize this and want to deliver the best possible developer experience. Hence, even before the Kotlin Foundation was created, we worked closely on key ecosystem components and their integrations. Several parties are involved, each playing a unique role in the developer ecosystem: JetBrains creates the IntelliJ Platform, the foundation for many IDEs, including Google’s Android Studio. JetBrains also develops Kotlin, which is the language of choice for Android and also targets multiple other platforms. Google extends the IntelliJ Platform into Android Studio and develops multiple other tools and technologies, tailoring them to the needs of mobile and cloud developers. Gradle powers the build processes that bring your code to life, enabling smooth workflows for testing, packaging, and deployment. Our tools are deeply interconnected, and the quality of the developer experience depends on how well they work together. By aligning our efforts, we can solve shared problems more effectively and deliver a seamless experience across the entire development stack. That’s why JetBrains, Gradle, and Google have joined forces to address these challenges head-on: to simplify configuration, minimize friction between the parts involved, and make development more enjoyable. By working together, we’re not just aiming for incremental fixes – we’re rethinking how our tools interact to create a smoother, faster, and more intuitive experience for developers everywhere. Joining forces means bringing together feedback and knowledge about user needs. While our audiences intersect, each company still gets unique feedback, so combining our perspectives allows us to see the bigger picture in the industry. Our expertise in specific areas allows us to come up with different ideas and make sure our efforts are aligned and address user needs.  Collaboration in action This partnership isn’t just theoretical – it’s a hands-on collaboration. We established regular syncs to discuss technical challenges, from build performance to IDE integration and simple bugs. We share knowledge about developer pain points, prioritize solutions, and align on the best approaches. For the last three years, we’ve brought our teams together for intensive, in-person annual summits. These gatherings are opportunities to brainstorm, prototype solutions, reflect on progress, and plan the future of the involved ecosystems, such as Android, Kotlin, Gradle, and software development in general. Beyond technical fixes, we’re aligning on ways to improve the user experience across all of our tools, making sure developers spend less time struggling with configuration and more time building. This collaboration is already delivering real results, including: Kotlin DSL as the default for new builds in the Gradle Build Tool since 2023. Better IDE Integration – Gradle sync in IntelliJ IDEA and Android Studio has become faster and more reliable, with clearer feedback when something goes wrong. With the upcoming configuration cache and Isolated Projects, we anticipate further speed increases for end users. Declarative Gradle initiative – A shift towards simpler, more readable, developer-first build configurations that reduce complexity and improve maintainability. Gradle Daemon toolchain support – A common way to define the JVM for the Gradle Daemon and make sure it always starts and does so with the same JVM. Project isolation initiative, which is bringing significant performance gains for large projects, thanks to Gradle’s improvements in isolating subprojects and optimizing caching. A lot of other small Improvements, from better error messaging to faster default configurations. Various ecosystem and educational programs to gather more feedback and share best practices, driven or developed by the Kotlin Foundation committees. There are other things in the works which we expect to bring a lot of value for developers. Stay tuned for more announcements! Areas of focus While we’re proud of what we’ve achieved, there are a lot of things to work on. The priorities for future improvements include: The in-IDE experience – Making Gradle and Kotlin integrations seamless, responsive, and intuitive within IDEs.  Performance – Reducing sync and build times and ensuring smooth scalability for large, complex projects. Clarity – Simplifying configurations, improving error messaging, providing help, and making tools easier to use. We’re listening: Your feedback matters Everything we do is based on user the needs and pain points we recognize. The source of this knowledge is your feedback, so please keep it coming! We are listening! Whether through surveys, issue trackers, or community discussions, we want to hear from you. What’s working? What isn’t? Where can the experience be improved? We encourage you to keep sharing your thoughts, ideas, and experiences with us whenever you want. You are welcome to join the relevant channels (e.g. #gradle) inside Kotlin Slack. Let’s build something better together! Subscribe to IntelliJ IDEA Blog updates Discover more",
  "image": "https://blog.jetbrains.com/wp-content/uploads/2025/02/ij-social_share_blog_1280x720_en-6.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n    \u003cdiv\u003e\n                        \u003ca href=\"https://blog.jetbrains.com/idea/\"\u003e\n                            \u003cimg src=\"https://blog.jetbrains.com/wp-content/uploads/2019/01/IntelliJ-IDEA-1.svg\" alt=\"Idea logo\"/\u003e\n                                                                                                \n                                                                                    \u003c/a\u003e\n                                                    \u003cp\u003eIntelliJ IDEA – the IDE for Professional Development in Java and Kotlin\u003c/p\u003e\n                                            \u003c/div\u003e\n                            \u003csection data-clarity-region=\"article\"\u003e\n                \u003cdiv\u003e\n                    \t\t\t\t\u003cp\u003e\u003ca href=\"https://blog.jetbrains.com/idea/category/news/\"\u003eNews\u003c/a\u003e\u003c/p\u003e\u003ch2 id=\"major-updates\"\u003eBuilding a Better Developer Experience: A Collaboration Between Gradle, Google, and JetBrains\u003c/h2\u003e                    \n                    \n\u003cp\u003e\u003cem\u003eThe original blog post was published \u003ca href=\"https://kotlinfoundation.org/news/building-better-developer-experience/\" target=\"_blank\" rel=\"noopener\"\u003ehere\u003c/a\u003e. \u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eDevelopers are at the heart of everything we do. You are the ones who create all of those new things to make the world better. To do that effectively, you need tools to rely on that are powerful yet easy to use.\u003c/p\u003e\n\n\n\n\u003cp\u003eThat’s why \u003ca href=\"https://kotlinlang.org/\" target=\"_blank\" rel=\"noopener\"\u003eKotlin\u003c/a\u003e was created. But the language is only a part of the story – you need an entire ecosystem to make things actually work together. That includes various developer tools and, among others, a build system, and an IDE.\u003c/p\u003e\n\n\n\n\u003cp\u003eFor Kotlin projects, the \u003ca href=\"https://gradle.org/\" target=\"_blank\" rel=\"noopener\"\u003eGradle Build Tool\u003c/a\u003e, also known as Gradle, is often the build system of choice. Gradle, as a powerful and flexible build system, has become a key part of many development processes. Nowadays it is at the core of many server-side, frontend, and mobile projects. It is also the default build system for Android projects.\u003c/p\u003e\n\n\n\n\u003cp\u003eHowever, great flexibility comes with challenges. Complexity, a steep learning curve, and friction between the IDE, language, and build system can make everyday development harder than it should be. These are not just technical hurdles – they affect your productivity, creativity, and satisfaction. At Google, Gradle, and JetBrains, we recognize this and want to deliver the best possible developer experience. Hence, even before the \u003ca href=\"https://kotlinfoundation.org/\" target=\"_blank\" rel=\"noopener\"\u003eKotlin Foundation\u003c/a\u003e was created, we worked closely on key ecosystem components and their integrations.\u003c/p\u003e\n\n\n\n\u003cp\u003eSeveral parties are involved, each playing a unique role in the developer ecosystem:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eJetBrains\u003c/strong\u003e creates the IntelliJ Platform, the foundation for many IDEs, including Google’s Android Studio. JetBrains also develops Kotlin, which is the language of choice for Android and also targets multiple other platforms.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eGoogle\u003c/strong\u003e extends the IntelliJ Platform into Android Studio and develops multiple other tools and technologies, tailoring them to the needs of mobile and cloud developers.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eGradle\u003c/strong\u003e powers the build processes that bring your code to life, enabling smooth workflows for testing, packaging, and deployment.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eOur tools are deeply interconnected, and the quality of the developer experience depends on how well they work together. By aligning our efforts, we can solve shared problems more effectively and deliver a seamless experience across the entire development stack.\u003c/p\u003e\n\n\n\n\u003cp\u003eThat’s why JetBrains, Gradle, and Google have joined forces\u003cstrong\u003e \u003c/strong\u003eto address these challenges head-on: to simplify configuration, minimize friction between the parts involved, and make development more enjoyable. By working together, we’re not just aiming for incremental fixes – we’re rethinking how our tools interact to create a smoother, faster, and more intuitive experience for developers everywhere.\u003cimg decoding=\"async\" fetchpriority=\"high\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXczHJdLfZeL0uf9XVwygifd-mPTA_gQUydC_MS4wZ6Zfmzv_V74FmfWjLRDjf1Kod__EsSRyLm2wnCs371hBlsP6tPyKTKTEujnsrr8LLvOvXTbpZinftRQT_1F7b4XyjFYs98nqA?key=r1ESLqWGvjeXMQ2JjJAmSyvj\" width=\"624\" height=\"185\"/\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eJoining forces means bringing together feedback and knowledge about user needs. While our audiences intersect, each company still gets unique feedback, so combining our perspectives allows us to see the bigger picture in the industry. Our expertise in specific areas allows us to come up with different ideas and make sure our efforts are aligned and address user needs. \u003c/p\u003e\n\n\n\n\u003ch3\u003e\u003cstrong\u003eCollaboration in action\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eThis partnership isn’t just theoretical – it’s a hands-on collaboration.\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eWe established regular syncs to discuss technical challenges, from build performance to IDE integration and simple bugs. We share knowledge about developer pain points, prioritize solutions, and align on the best approaches.\u003c/li\u003e\n\n\n\n\u003cli\u003eFor the last three years, we’ve brought our teams together for intensive, in-person annual summits. These gatherings are opportunities to brainstorm, prototype solutions, reflect on progress, and plan the future of the involved ecosystems, such as Android, Kotlin, Gradle, and software development in general.\u003c/li\u003e\n\n\n\n\u003cli\u003eBeyond technical fixes, we’re aligning on ways to improve the user experience across all of our tools, making sure developers spend less time struggling with configuration and more time building.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eThis collaboration is already delivering real results, including:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://blog.gradle.org/kotlin-dsl-is-now-the-default-for-new-gradle-builds\" target=\"_blank\" rel=\"noopener\"\u003eKotlin DSL as the default for new builds in the Gradle Build Tool\u003c/a\u003e since 2023.\u003c/li\u003e\n\n\n\n\u003cli\u003eBetter IDE Integration – Gradle sync in IntelliJ IDEA and Android Studio has become faster and more reliable, with clearer feedback when something goes wrong. With the upcoming configuration cache and Isolated Projects, we anticipate further speed increases for end users.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://declarative.gradle.org/\" target=\"_blank\" rel=\"noopener\"\u003eDeclarative Gradle initiative\u003c/a\u003e – A shift towards simpler, more readable, developer-first build configurations that reduce complexity and improve maintainability.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://docs.gradle.org/current/userguide/gradle_daemon.html#sec:daemon_jvm_criteria\" target=\"_blank\" rel=\"noopener\"\u003eGradle Daemon toolchain support\u003c/a\u003e – A common way to define the JVM for the Gradle Daemon and make sure it always starts and does so with the same JVM.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://docs.gradle.org/current/userguide/isolated_projects.html\" target=\"_blank\" rel=\"noopener\"\u003eProject isolation initiative\u003c/a\u003e, which is bringing significant performance gains for large projects, thanks to Gradle’s improvements in isolating subprojects and optimizing caching.\u003c/li\u003e\n\n\n\n\u003cli\u003eA lot of other small Improvements, from better error messaging to faster default configurations.\u003c/li\u003e\n\n\n\n\u003cli\u003eVarious ecosystem and educational programs to gather more feedback and share best practices, driven or developed by the \u003ca href=\"https://kotlinfoundation.org/structure/\" target=\"_blank\" rel=\"noopener\"\u003eKotlin Foundation committees\u003c/a\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eThere are other things in the works which we expect to bring a lot of value for developers. Stay tuned for more announcements!\u003c/p\u003e\n\n\n\n\u003ch3\u003e\u003cstrong\u003eAreas of focus\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eWhile we’re proud of what we’ve achieved, there are a lot of things to work on. The priorities for future improvements include:\u003c/p\u003e\n\n\n\n\u003col\u003e\n\u003cli\u003e\u003cstrong\u003eThe in-IDE experience\u003c/strong\u003e – Making Gradle and Kotlin integrations seamless, responsive, and intuitive within IDEs. \u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003ePerformance\u003c/strong\u003e – Reducing sync and build times and ensuring smooth scalability for large, complex projects.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eClarity\u003c/strong\u003e – Simplifying configurations, improving error messaging, providing help, and making tools easier to use.\u003c/li\u003e\n\u003c/ol\u003e\n\n\n\n\u003ch3\u003e\u003cstrong\u003eWe’re listening: Your feedback matters\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eEverything we do is based on user the needs and pain points we recognize. The source of this knowledge is your feedback, so please keep it coming! We are listening!\u003c/p\u003e\n\n\n\n\u003cp\u003eWhether through surveys, issue trackers, or community discussions, we want to hear from you. What’s working? What isn’t? Where can the experience be improved?\u003c/p\u003e\n\n\n\n\u003cp\u003eWe encourage you to keep sharing your thoughts, ideas, and experiences with us whenever you want. You are welcome to join the relevant channels (e.g. #gradle) inside \u003ca href=\"https://surveys.jetbrains.com/s3/kotlin-slack-sign-up\" target=\"_blank\" rel=\"noopener\"\u003eKotlin Slack\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eLet’s build something better together!\u003c/strong\u003e\u003c/p\u003e\n                    \n                                                                \n                                                                                                                                \u003cdiv\u003e\n                                \u003cdiv\u003e\n                                                                            \u003ch4\u003eSubscribe to IntelliJ IDEA Blog updates\u003c/h4\u003e\n                                                                                                            \n                                \u003c/div\u003e\n                                \n                                \u003cp\u003e\u003cimg src=\"https://blog.jetbrains.com/wp-content/themes/jetbrains/assets/img/img-form.svg\" alt=\"image description\"/\u003e\n                                                                    \u003c/p\u003e\n                            \u003c/div\u003e\n                                                            \u003c/div\u003e\n                \u003ca href=\"#\"\u003e\u003c/a\u003e\n                \n                \n            \u003c/section\u003e\n                    \u003cdiv\u003e\n                \u003cp\u003e\n                    \u003ch2\u003eDiscover more\u003c/h2\u003e\n                \u003c/p\u003e\n                \n            \u003c/div\u003e\n                \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": null,
  "modifiedTime": null
}
