{
  "id": "afc8f7e7-4936-42c0-ba14-9e2915bc7e20",
  "title": "",
  "link": "http://scripting.com/2025/07/24.html#a125149",
  "description": "When trying to \"work\" with ChatGPT, realize that it's mistakes could be much worse than you could possibly imagine. It could be leading you down a blind alley. You must always consider how full of shit it is. It may not just be making things up, but it could not understand something very basic about what you're doing. There's no limit to the ways it can be wrong. And you can waste whole programming sessions chasing a solution where none could possibly every under any circumstances be found. The level of bullshit is sometimes hard to fathom.",
  "author": "",
  "published": "Thu, 24 Jul 2025 12:51:49 GMT",
  "source": "http://scripting.com/rss.xml",
  "categories": null,
  "byline": "",
  "length": 1904,
  "excerpt": "Dave Winer, OG blogger, podcaster, developed first apps in many categories. Old enough to know better. It's even worse than it appears.",
  "siteName": "Scripting News",
  "favicon": "",
  "text": "It's even worse than it appears.. BTW, this business with Trump and the Fed is almost exactly what I wanted Obama to do with Garland when McConnell refused to hold hearings. Walk him over to the Supreme Court, unlock his office, swear him in and get back to work. Sometimes you just do it. The Dems weren't pragmatic that way.# When trying to \"work\" with ChatGPT, realize that it's mistakes could be much worse than you could possibly imagine. It could be leading you down a blind alley. You must always consider how full of shit it is. It may not just be making things up, but it could not understand something very basic about what you're doing. There's no limit to the ways it can be wrong. And you can waste whole programming sessions chasing a solution where none could possibly every under any circumstances be found. The level of bullshit is sometimes hard to fathom.# You can see from this Bluesky post that I do copy-edit my linkblog items, but not enough. The web isn't a write-only medium, so to say that Bluesky is part of the web, well in this way it isn't. # Question: I have a site with a well developed set of categories, I've added to it carefully over a few months, it covers most of the topics I write about. Another site has a small set of categories. I write all my WordPress posts in the same editor, and could easily set it up so that all categories were available to me in every site I post to. The question: Is that a good practice in the world of WordPress? I noticed that categories are given global ID's so if I use a category like \"movies\" it will have the same ID as yours has on your sites. I love this idea of a global namespace for categories, and see it as something that could be adopted by sites written in any other writing environment. Anyway, if you have a moment to comment, I'd appreciate your ideas. Update: Jeremy Herve, a WordPress developer explains. #",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"idPageTopText\"\u003e\n\t\n\t\u003cp\u003eIt\u0026#39;s even worse than it appears..\u003c/p\u003e\n\t\u003c/div\u003e\u003cdiv id=\"idDayContainer\"\u003e\n\t\t\t\t\n\u003cp\u003e\u003ca name=\"a142158\"\u003e\u003c/a\u003eBTW, this \u003ca href=\"https://www.cnn.com/2025/07/24/politics/trump-powell-federal-reserve-visit-renovation\"\u003ebusiness\u003c/a\u003e with Trump and the Fed is almost exactly what I \u003ca href=\"http://scripting.com/2025/04/17.html#a164921\"\u003ewanted\u003c/a\u003e Obama to do with Garland when McConnell refused to hold hearings. Walk him over to the Supreme Court, unlock his office, swear him in and get back to work. Sometimes you just do it. The Dems weren\u0026#39;t pragmatic that way.\u003cspan\u003e\u003ca href=\"http://scripting.com/2025/07/24.html#a142158\" title=\"Direct link to this item.\"\u003e#\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca name=\"a125149\"\u003e\u003c/a\u003eWhen trying to \u0026#34;work\u0026#34; with ChatGPT, realize that it\u0026#39;s mistakes could be much worse than you could possibly imagine. It could be leading you down a blind alley. You must always consider how full of shit it is. It may not just be making things up, but it could not understand something very basic about what you\u0026#39;re doing. There\u0026#39;s no limit to the ways it can be wrong. And you can waste whole programming sessions chasing a solution where none could possibly every under any circumstances be found. The level of bullshit is sometimes hard to fathom.\u003cspan\u003e\u003ca href=\"http://scripting.com/2025/07/24.html#a125149\" title=\"Direct link to this item.\"\u003e#\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca name=\"a115719\"\u003e\u003c/a\u003eYou can \u003ca href=\"https://imgs.scripting.com/2025/07/24/postscreenshot.png\"\u003esee\u003c/a\u003e from \u003ca href=\"https://bsky.app/profile/scripting.com/post/3luph4rdgrw23\"\u003ethis Bluesky post\u003c/a\u003e that I do copy-edit my linkblog items, but not enough. The web isn\u0026#39;t a write-only medium, so to say that Bluesky is part of the web, well in this way it isn\u0026#39;t. \u003cspan\u003e\u003ca href=\"http://scripting.com/2025/07/24.html#a115719\" title=\"Direct link to this item.\"\u003e#\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca name=\"a111750\"\u003e\u003c/a\u003e\u003cimg src=\"https://imgs.scripting.com/2020/08/29/hope.png\"/\u003e\u003ca href=\"https://mastodon.social/@scripting@daveverse.org/114907962089898612\"\u003eQuestion\u003c/a\u003e: I have a site with a well developed set of categories, I\u0026#39;ve added to it carefully over a few months, it covers most of the topics I write about. Another site has a small set of categories. I write all my WordPress posts in the same editor, and could easily set it up so that all categories were available to me in every site I post to. The question: Is that a good practice in the world of WordPress? I noticed that categories are given global ID\u0026#39;s so if I use a category like \u0026#34;movies\u0026#34; it will have the same ID as yours has on your sites. I love this idea of a global namespace for categories, and see it as something that could be adopted by sites written in any other writing environment. Anyway, if you have a moment to comment, I\u0026#39;d appreciate your ideas. Update: Jeremy Herve, a WordPress developer \u003ca href=\"https://mastodon.social/@jeremy@herve.bzh/114910020439748559\"\u003eexplains\u003c/a\u003e. \u003cspan\u003e\u003ca href=\"http://scripting.com/2025/07/24.html#a111750\" title=\"Direct link to this item.\"\u003e#\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
