{
  "id": "c03dfeb1-569b-49d0-a98e-3a6f663ee59f",
  "title": "Kodee’s Kotlin Roundup: A Carefully Curated June Edition",
  "link": "https://blog.jetbrains.com/kotlin/2025/07/kodees-kotlin-roundup-june-edition/",
  "description": "It’s time for another edition of Kodee’s Kotlin Roundup! If June flew by while you were deep in development, don’t worry – I’ve gathered all the ecosystem highlights for you in one handy digest. Here’s what you might have missed. Kotlin YouTube highlights That’s all for June! While you’re rewatching conference talks or experimenting with […]",
  "author": "Kodee",
  "published": "Thu, 03 Jul 2025 13:44:44 +0000",
  "source": "https://blog.jetbrains.com/feed",
  "categories": [
    "news",
    "kotlin-news-2"
  ],
  "byline": "Kodee",
  "length": 10130,
  "excerpt": "If June flew by while you were deep in development, don’t worry – Kodee has gathered all the ecosystem highlights for you in one handy digest.",
  "siteName": "The JetBrains Blog",
  "favicon": "https://blog.jetbrains.com/wp-content/uploads/2024/01/cropped-mstile-310x310-1-180x180.png",
  "text": "A concise multiplatform language developed by JetBrains NewsKodee’s Kotlin Roundup: A Carefully Curated June Edition It’s time for another edition of Kodee’s Kotlin Roundup! If June flew by while you were deep in development, don’t worry – I’ve gathered all the ecosystem highlights for you in one handy digest. Here’s what you might have missed. Kodee-approved monthly spotlight Kotlin 2.2.0 released Kotlin 2.2.0 is here! This release brings in new and stable language features, tooling updates, performance boosts across platforms, and a bunch of important fixes. I’ve got the official blog post right here – give it a read! Read the full blog post Rich errors in Kotlin During KotlinConf 2025, Michail Zarečenskij, Kotlin’s Lead Language Designer, explored a smarter way of handling errors. In his talk, he looked at how Kotlin’s nullability model can be generalized to restricted union types for better error handling. Watch now KotlinConf 2025 talks and photos are now available Couldn’t make it to KotlinConf 2025? No worries – all session recordings and event snapshots are now online. It’s like reliving the whole thing all over again! We’ll also be uploading all the talk recordings to our YouTube channel, so stay tuned and prepare to explore the latest in Kotlin from wherever you are! Browse and enjoy Kotlin for AI-powered app development AI in Kotlin projects? You bet! We’ve launched a new documentation page showcasing how Kotlin is used in real-world AI scenarios. Peek into the Kotlin-AI-Examples repository and learn more about Koog, the Kotlin-based AI agentic framework. Explore Kotlin for AI Kotlin for server-side development Ktor 3.2.0 The newest Ktor release adds some serious firepower: two new modules for dependency injection and HTMX, support for Gradle version catalogs, automatic configuration deserialization, Unix domain socket support for CIO, and much more. Read on Kotlin Multiplatform with Compose Multiplatform Implementing Compose Hot Reload With Compose Hot Reload, you can edit code and see changes live – no app restart needed. A great talk at KotlinConf shows how it works and how you can use it in your projects to make iterating on UI code faster, more convenient, and more exciting. Watch now Get answers to your KMP questions The KotlinConf 2025 Closing Panel couldn’t cover everything live, so we gathered answers to some of the most popular Kotlin Multiplatform questions in a follow-up blog post (because good questions deserve good answers). Explore the Q\u0026A New Kotlin Multiplatform course on LinkedIn Learning A shiny new LinkedIn Learning course is here to help you master Kotlin Multiplatform. Learn how to make smart architectural choices between Compose Multiplatform and native UIs, create shared networking layers with Ktor, persist data with SQLDelight, and more. Start learning What else is new Gradle 9.0.0-rc-1 Our friends over at Gradle have been busy – Gradle 9.0.0 RC1 is out and ready for testing! The highlights include an update to Kotlin 2.1, which means new language features in the DSLs. Want all the details? I’ve got the link! Check out Gradle 9.0.0-rc-1 Guessing developers’ incomes (KotlinConf 2025 edition) What do Kotlin developers really earn? At KotlinConf 2025, we played a salary guessing game – some guesses were spot on, others were hilariously off. Would you like to test your instincts? Watch and guess with us Kotlin YouTube highlights Kotlin Notebook Upgrade: Smoother UI and More Stability Kotlin Multiplatform (KMP) at McDonald’s Build your own NES Emulator with Kotlin | Artur Skowroński Kotlin Clean Architecture for Serverless: Business Logic You Can Take Anywhere | Elena van Engelen Compose Multiplatform for iOS: Ready for Production Use | Sebastian Aigner Klibs.io – The Dream of Creating a Kotlin Package Index | Ignat Beresnev Coroutines and Structured Concurrency in Ktor | Simon Vergauwen IoT Development With Kotlin | Erik Hellman That’s all for June! While you’re rewatching conference talks or experimenting with new features, I’ll be right here keeping an eye on the Kotlin ecosystem for next time. Until then – happy coding! Subscribe to Kotlin Blog updates Discover more",
  "image": "https://blog.jetbrains.com/wp-content/uploads/2025/07/Social-share.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n    \n\u003cmain id=\"main\"\u003e\n    \u003cdiv\u003e\n                        \u003ca href=\"https://blog.jetbrains.com/kotlin/\"\u003e\n                            \u003cimg src=\"https://blog.jetbrains.com/wp-content/uploads/2019/01/Kotlin-5.svg\" alt=\"Kotlin logo\"/\u003e\n                                                                                                \n                                                                                    \u003c/a\u003e\n                                                    \u003cp\u003eA concise multiplatform language developed by JetBrains\u003c/p\u003e\n                                            \u003c/div\u003e\n                            \u003csection data-clarity-region=\"article\"\u003e\n                \u003cdiv\u003e\n                    \t\t\t\t\u003cp\u003e\u003ca href=\"https://blog.jetbrains.com/kotlin/category/news/\"\u003eNews\u003c/a\u003e\u003c/p\u003e\u003ch2 id=\"major-updates\"\u003eKodee’s Kotlin Roundup: A Carefully Curated June Edition\u003c/h2\u003e                    \n                    \n\u003cp\u003eIt’s time for another edition of Kodee’s Kotlin Roundup! If June flew by while you were deep in development, don’t worry – I’ve gathered all the ecosystem highlights for you in one handy digest. Here’s what you might have missed.\u003c/p\u003e\n\n\n            \u003cdiv\u003e\n                            \u003ch2\u003eKodee-approved monthly spotlight\u003c/h2\u003e\n                                                            \u003carticle\u003e\n                                                                                    \u003cimg decoding=\"async\" src=\"https://blog.jetbrains.com/wp-content/uploads/2025/06/Twitter-2.png\" alt=\"Kotlin 2.2.0 release\"/\u003e\n                                                                            \u003cdiv\u003e\n                                                            \u003ch3\u003eKotlin 2.2.0 released\u003c/h3\u003e\n                                                        \u003cp\u003eKotlin 2.2.0 is here! This release brings in new and stable language features, tooling updates, performance boosts across platforms, and a bunch of important fixes. I’ve got the official blog post right here – give it a read!\u003c/p\u003e\n                                                            \u003cp\u003e\u003ca href=\"https://blog.jetbrains.com/kotlin/2025/06/kotlin-2-2-0-released/\" target=\"_blank\"\u003eRead the full blog post\u003c/a\u003e\n                                                    \u003c/p\u003e\u003c/div\u003e\n                    \u003c/article\u003e\n                                    \u003carticle\u003e\n                                                                                    \u003cimg decoding=\"async\" src=\"https://blog.jetbrains.com/wp-content/uploads/2025/07/Rich-Errors-2.png\" alt=\"KotlinConf\u0026#39;25 Talk: Rich Errors in Kotlin\"/\u003e\n                                                                            \u003cdiv\u003e\n                                                            \u003ch3\u003eRich errors in Kotlin\u003c/h3\u003e\n                                                        \u003cp\u003eDuring KotlinConf 2025, Michail Zarečenskij, Kotlin’s Lead Language Designer, explored a smarter way of handling errors. In his talk, he looked at how Kotlin’s nullability model can be generalized to restricted union types for better error handling.\u003c/p\u003e\n                                                            \u003cp\u003e\u003ca href=\"https://youtu.be/IUrA3mDSWZQ?si=X2oRjuBpM-NZrZTI\" target=\"_blank\" rel=\"noopener\"\u003eWatch now\u003c/a\u003e\n                                                    \u003c/p\u003e\u003c/div\u003e\n                    \u003c/article\u003e\n                                    \u003carticle\u003e\n                                                                                    \u003cimg decoding=\"async\" src=\"https://blog.jetbrains.com/wp-content/uploads/2025/07/KotlinConf-Talks-and-Photos.png\" alt=\"KotlinConf\u0026#39;25 Photos and Sessions\"/\u003e\n                                                                            \u003cdiv\u003e\n                                                            \u003ch3\u003eKotlinConf 2025 talks and photos are now available\u003c/h3\u003e\n                                                        \u003cp\u003eCouldn’t make it to KotlinConf 2025? No worries – all session recordings and event snapshots are now online. It’s like reliving the whole thing all over again! We’ll also be uploading all the talk recordings to our \u003ca href=\"https://www.youtube.com/c/kotlin\" target=\"_blank\" rel=\"noopener\"\u003eYouTube channel\u003c/a\u003e, so stay tuned and prepare to explore the latest in Kotlin from wherever you are!\u003c/p\u003e\n                                                            \u003cp\u003e\u003ca href=\"https://kotlinconf.com/talks/\" target=\"_blank\" rel=\"noopener\"\u003eBrowse and enjoy\u003c/a\u003e\n                                                    \u003c/p\u003e\u003c/div\u003e\n                    \u003c/article\u003e\n                                    \u003carticle\u003e\n                                                                                    \u003cimg decoding=\"async\" src=\"https://blog.jetbrains.com/wp-content/uploads/2025/07/KT-social-BlogSocialShare-1280x720-2x.png\" alt=\"Kotlin for AI-powered app development\"/\u003e\n                                                                            \u003cdiv\u003e\n                                                            \u003ch3\u003eKotlin for AI-powered app development\u003c/h3\u003e\n                                                        \u003cp\u003eAI in Kotlin projects? You bet! We’ve launched a new documentation page showcasing how Kotlin is used in real-world AI scenarios. Peek into the \u003ca href=\"https://github.com/Kotlin/Kotlin-AI-Examples\" target=\"_blank\" rel=\"noopener\"\u003eKotlin-AI-Examples\u003c/a\u003e repository and learn more about Koog, the Kotlin-based AI agentic framework.\u003c/p\u003e\n                                                            \u003cp\u003e\u003ca href=\"https://kotlinlang.org/docs/kotlin-ai-apps-development-overview.html\" target=\"_blank\" rel=\"noopener\"\u003eExplore Kotlin for AI\u003c/a\u003e\n                                                    \u003c/p\u003e\u003c/div\u003e\n                    \u003c/article\u003e\n                                    \u003c/div\u003e\n    \n\n            \u003cdiv\u003e\n                            \u003ch2\u003eKotlin for server-side development\u003c/h2\u003e\n                                                            \u003carticle\u003e\n                                                                                    \u003cimg decoding=\"async\" src=\"https://blog.jetbrains.com/wp-content/uploads/2025/06/Blog-Featured-1280x720-2.png\" alt=\"Ktor 3.2.0 release\"/\u003e\n                                                                            \u003cdiv\u003e\n                                                            \u003ch3\u003eKtor 3.2.0\u003c/h3\u003e\n                                                        \u003cp\u003eThe newest Ktor release adds some serious firepower: two new modules for \u003ca href=\"https://blog.jetbrains.com/kotlin/2024/03/ktor-2024-roadmap-di-update/\"\u003edependency injection\u003c/a\u003e and \u003ca href=\"https://htmx.org/\" target=\"_blank\" rel=\"noopener\"\u003eHTMX\u003c/a\u003e, support for Gradle version catalogs, automatic configuration deserialization, Unix domain socket support for CIO, and much more.\u003c/p\u003e\n                                                            \u003cp\u003e\u003ca href=\"https://blog.jetbrains.com/kotlin/2025/06/ktor-3-2-0-is-now-available/\" target=\"_blank\"\u003eRead on\u003c/a\u003e\n                                                    \u003c/p\u003e\u003c/div\u003e\n                    \u003c/article\u003e\n                                    \u003c/div\u003e\n    \n\n            \u003cdiv\u003e\n                            \u003ch2\u003eKotlin Multiplatform with Compose Multiplatform\u003c/h2\u003e\n                                                            \u003carticle\u003e\n                                                                                    \u003cimg decoding=\"async\" src=\"https://blog.jetbrains.com/wp-content/uploads/2025/07/Compose-Hot-Reload.jpg\" alt=\"KotlinConf\u0026#39;25 Session: Implementing Compose Hot Reload\"/\u003e\n                                                                            \u003cdiv\u003e\n                                                            \u003ch3\u003eImplementing Compose Hot Reload\u003c/h3\u003e\n                                                        \u003cp\u003eWith Compose Hot Reload, you can edit code and see changes live – no app restart needed. A great talk at KotlinConf shows how it works and how you can use it in your projects to make iterating on UI code faster, more convenient, and more exciting.\u003c/p\u003e\n                                                            \u003cp\u003e\u003ca href=\"https://youtu.be/UebhKUdO2sQ?si=s3w7hPt6yJx4FSHA\" target=\"_blank\" rel=\"noopener\"\u003eWatch now\u003c/a\u003e\n                                                    \u003c/p\u003e\u003c/div\u003e\n                    \u003c/article\u003e\n                                    \u003carticle\u003e\n                                                                                    \u003cimg decoding=\"async\" src=\"https://blog.jetbrains.com/wp-content/uploads/2025/05/Social-Share-1280x720-1-2.png\" alt=\"KotlinConf\u0026#39;25 Closing Panel: KMP Questions\"/\u003e\n                                                                            \u003cdiv\u003e\n                                                            \u003ch3\u003eGet answers to your KMP questions\u003c/h3\u003e\n                                                        \u003cp\u003eThe KotlinConf 2025 Closing Panel couldn’t cover everything live, so we gathered answers to some of the most popular Kotlin Multiplatform questions in a follow-up blog post (because good questions deserve good answers).\u003c/p\u003e\n                                                            \u003cp\u003e\u003ca href=\"https://blog.jetbrains.com/kotlin/2025/06/get-answers-to-your-kmp-questions/\" target=\"_blank\"\u003eExplore the Q\u0026amp;A\u003c/a\u003e\n                                                    \u003c/p\u003e\u003c/div\u003e\n                    \u003c/article\u003e\n                                    \u003carticle\u003e\n                                                                                    \u003cimg decoding=\"async\" src=\"https://blog.jetbrains.com/wp-content/uploads/2025/07/KT-social-BlogSocialShare-1280x720-2x-1.png\" alt=\"New Kotlin Multiplatform course on LinkedIn Learning\"/\u003e\n                                                                            \u003cdiv\u003e\n                                                            \u003ch3\u003eNew Kotlin Multiplatform course on LinkedIn Learning \u003c/h3\u003e\n                                                        \u003cp\u003eA shiny new LinkedIn Learning course is here to help you master Kotlin Multiplatform. Learn how to make smart architectural choices between Compose Multiplatform and native UIs,  create shared networking layers with Ktor, persist data with SQLDelight, and more.\u003c/p\u003e\n                                                            \u003cp\u003e\u003ca href=\"https://t.co/XHRgyCBA2n\" target=\"_blank\"\u003eStart learning\u003c/a\u003e\n                                                    \u003c/p\u003e\u003c/div\u003e\n                    \u003c/article\u003e\n                                    \u003c/div\u003e\n    \n\n            \u003cdiv\u003e\n                            \u003ch2\u003eWhat else is new\u003c/h2\u003e\n                                                            \u003carticle\u003e\n                                                                                    \u003cimg decoding=\"async\" src=\"https://blog.jetbrains.com/wp-content/uploads/2025/07/Gradle.png\" alt=\"Gradle 9.0.0-rc-1 release\"/\u003e\n                                                                            \u003cdiv\u003e\n                                                            \u003ch3\u003eGradle 9.0.0-rc-1 \u003c/h3\u003e\n                                                        \u003cp\u003eOur friends over at Gradle have been busy – Gradle 9.0.0 RC1 is out and ready for testing! The highlights include an update to Kotlin 2.1, which means new language features in the DSLs. Want all the details? I’ve got the link!\u003c/p\u003e\n                                                            \u003cp\u003e\u003ca href=\"https://docs.gradle.org/9.0.0-rc-1/release-notes.html\" target=\"_blank\" rel=\"noopener\"\u003eCheck out Gradle 9.0.0-rc-1\u003c/a\u003e\n                                                    \u003c/p\u003e\u003c/div\u003e\n                    \u003c/article\u003e\n                                    \u003carticle\u003e\n                                                                                    \u003cimg decoding=\"async\" src=\"https://blog.jetbrains.com/wp-content/uploads/2025/07/Kotlin-Salaries.jpg\" alt=\"Guessing Developers’ Incomes. KotlinConf’25 Edition\"/\u003e\n                                                                            \u003cdiv\u003e\n                                                            \u003ch3\u003eGuessing developers’ incomes (KotlinConf 2025 edition)\u003c/h3\u003e\n                                                        \u003cp\u003eWhat do Kotlin developers really earn? At KotlinConf 2025, we played a salary guessing game – some guesses were spot on, others were hilariously off. Would you like to test your instincts?\u003c/p\u003e\n                                                            \u003cp\u003e\u003ca href=\"https://youtu.be/7feD8XfDaGQ?si=C8UaqQQYNpApXTEg\" target=\"_blank\" rel=\"noopener\"\u003eWatch and guess with us\u003c/a\u003e\n                                                    \u003c/p\u003e\u003c/div\u003e\n                    \u003c/article\u003e\n                                    \u003c/div\u003e\n    \n\n\n\u003ch2\u003eKotlin YouTube highlights\u003c/h2\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://youtu.be/4JnS4ZWVrpo?si=H5T57_FHCQvBmUEn\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eKotlin Notebook Upgrade: Smoother UI and More Stability\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://youtu.be/6bCZEYTq5Eg?si=_9LzSUFa2k3tAFRP\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eKotlin Multiplatform (KMP) at McDonald’s\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://youtu.be/4A6aLK2KznU?si=EFmmuQ9iGtRY6hXU\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBuild your own NES Emulator with Kotlin\u003c/a\u003e | Artur Skowroński\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://youtu.be/6jZa4B-If-I?si=uHBWxhlNQgdaPz98\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eKotlin Clean Architecture for Serverless: Business Logic You Can Take Anywhere\u003c/a\u003e | Elena van Engelen\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://youtu.be/YKTlW8Qkj0w?si=v9YbBD5E__fklmkX\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eCompose Multiplatform for iOS: Ready for Production Use\u003c/a\u003e | Sebastian Aigner\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://youtu.be/rKbM3e0OidI?si=pXfdGj-_SL-lCOXK\" target=\"_blank\" data-type=\"link\" data-id=\"https://youtu.be/rKbM3e0OidI?si=pXfdGj-_SL-lCOXK\" rel=\"noreferrer noopener\"\u003eKlibs.io – The Dream of Creating a Kotlin Package Index\u003c/a\u003e | Ignat Beresnev\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://youtu.be/JxTIZAEos8Y?si=nSPW4iQyc4Drs97W\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eCoroutines and Structured Concurrency in Ktor\u003c/a\u003e | Simon Vergauwen\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://youtu.be/bKwdgMKyFOY?si=AbvDesHNfLL3M3O9\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eIoT Development With Kotlin\u003c/a\u003e | Erik Hellman\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eThat’s all for June! While you’re rewatching conference talks or experimenting with new features, I’ll be right here keeping an eye on the Kotlin ecosystem for next time. Until then – happy coding!\u003c/p\u003e\n                    \n                                                                                                                                                                                                                            \u003cdiv\u003e\n                                \u003cdiv\u003e\n                                                                            \u003ch4\u003eSubscribe to Kotlin Blog updates\u003c/h4\u003e\n                                                                                                            \n                                \u003c/div\u003e\n                                \n                                \u003cp\u003e\u003cimg src=\"https://blog.jetbrains.com/wp-content/themes/jetbrains/assets/img/img-form.svg\" alt=\"image description\"/\u003e\n                                                                    \u003c/p\u003e\n                            \u003c/div\u003e\n                                                            \u003c/div\u003e\n                \u003ca href=\"#\"\u003e\u003c/a\u003e\n                \n                \n            \u003c/section\u003e\n                    \u003cdiv\u003e\n                \u003cp\u003e\n                    \u003ch2\u003eDiscover more\u003c/h2\u003e\n                \u003c/p\u003e\n                \n            \u003c/div\u003e\n                \u003c/main\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": null,
  "modifiedTime": null
}
