{
  "id": "ccca0462-8905-4eea-ae74-4942eef4444b",
  "title": "GitLab Duo Chat gets agentic AI makeover",
  "link": "https://about.gitlab.com/blog/2025/05/29/gitlab-duo-chat-gets-agentic-ai-makeover",
  "description": "",
  "author": "Torsten Linz",
  "published": "2025-05-29T00:00:00.000Z",
  "source": "https://about.gitlab.com/atom.xml",
  "categories": null,
  "byline": "Torsten Linz",
  "length": 6542,
  "excerpt": "Our new Duo Chat experience, currently an experimental release, helps developers onboard to projects, understand assignments, implement changes, and more.",
  "siteName": "GitLab",
  "favicon": "https://about.gitlab.com/blog/nuxt-images/ico/favicon-192x192.png?cache=2022041",
  "text": "Generative AI chat assistants have become standard in software development, helping create and fix code just to start. But what if your chat assistant could understand the artifacts of your entire development process, not just your code? What if that chat assistant could help you work through issues and project documentation before it helps you write code, and could access CI/CD pipelines and merge requests to help you finish coding tasks properly? Meet the next generation of GitLab Duo Chat – GitLab Duo Agentic Chat, a significant evolution in AI-native development assistance and the newest addition to our platform, now in experimental release. GitLab Duo Agentic Chat is available to all GitLab.com users with GitLab’s Workflow extension in VS Code. Agentic Chat transforms chat from traditional conversational AI to a chat experience that takes action on your behalf, breaking down complex problems into discrete tasks that it can complete. Instead of simply responding to questions with the context you provide, Agentic Chat can: Autonomously determine what information it needs to answer your questions Execute a sequence of operations to gather that information from multiple sources Formulate comprehensive responses by combining insights from across your project Create and modify files to help you implement solutions And all of this is done while keeping the human developer within the loop. Agentic Chat is built on the Duo Workflow architecture, which is currently in private beta. The architecture comprises agents and tools that take on specific tasks like finding the right context for a given question or editing files. Use cases for GitLab Duo Agentic Chat Here are some real-world and common use cases for Agentic Chat: Onboard to new projects faster by having AI help you familiarize yourself with a new codebase. Jump into assigned work immediately, even when issue descriptions are unclear, because Agentic Chat can help you connect the dots between requirements and existing implementations. When it's time to make changes, Agentic Chat can handle the implementation work by creating and editing multiple files across your project. At release time, Agentic Chat can help you verify that your solution actually addresses the original requirements by analyzing your merge requests against the initial issue or task. Agentic Chat making code edits From learning to shipping: A complete workflow demonstration in four steps To show how Agentic Chat transforms the development experience, let's walk through a real scenario from our engineering teams. Imagine you're a new team member who's been assigned an issue but knows nothing about the codebase. You can follow along with this video demonstration: Step 1: Understand the project Instead of manually exploring files and documentation, you can prompt Agentic Chat: I am new to this project. Could you read the project structure and explain it to me? Agentic Chat provides a comprehensive project overview by: Exploring the directory structure Reading README files and documentation Identifying key components and applications Step 2: Understand your assigned task Next, you need to understand your specific assignment, so you can enter this prompt: I have been assigned Issue 1119. Could you help me understand this task, specifically where do I need to apply the refactoring? Agentic Chat explains the task and proposes a refactoring approach by: Retrieving and analyzing the issue details from the remote GitLab server Examining relevant project files Identifying the specific locations requiring changes Step 3: Implement the solution Rather than doing the work manually, you can request: Could you make the edits for me? Please start with steps one, two, three. Agentic Chat then: Creates new directories and files as needed Extracts and refactors code across multiple locations Ensures consistency across all modified files Provides a summary of all changes made Step 4: Verify completion Finally, after creating your merge request, you can verify your work: Does my MR fully address Issue 1119? Agentic Chat confirms whether all requirements have been met by analyzing both your merge request and the original issue. GitLab Duo Agentic Chat is currently available as an experimental feature in VS Code for GitLab Duo Pro and Enterprise users. See our setup documentation for prerequisites and configuration steps. As an experimental feature, Agentic Chat has some known limitations we're actively addressing, including slower response times due to multiple API calls, keyword-based rather than semantic search, and limited support for new local folders or non-GitLab projects. Your feedback is crucial in helping us prioritize improvements and bring Agentic Chat to general availability so please share your experience in this issue. What's next? We are fully focused on improving Agentic Chat, including bringing it to general availability. In the meantime, we are aiming to improve response times and are adding capabilities that GitLab Duo Chat currently has, such as using self-hosted models or supporting JetBrains and Visual Studio in addition to VS Code. Once we have switched Duo Chat to this new architecture we plan to also bring Agentic Chat to the chat in the GitLab web application. We also plan to add a lot more functionality, such as editing GitLab artifacts, supporting context from custom Model Context Protocol, or MCP, servers, and offering commands to run in the terminal. Ready to experience autonomous development assistance but not yet a GitLab customer? Try Agentic Chat today as part of a free, 60-day trial of GitLab Ultimate with Duo Enterprise and help shape the future of AI-powered development. Follow these setup steps for VS Code. And make sure to join the GitLab 18 virtual launch event to learn about our agentic AI plans and more. Register today! Disclaimer: This blog contains information related to upcoming products, features, and functionality. It is important to note that the information in this blog post is for informational purposes only. Please do not rely on this information for purchasing or planning purposes. As with all projects, the items mentioned in this blog and linked pages are subject to change or delay. The development, release, and timing of any products, features, or functionality remain at the sole discretion of GitLab. Learn more GitLab Duo Workflow: Enterprise visibility and control for agentic AI What is agentic AI? Agentic AI guides and resources",
  "image": "https://images.ctfassets.net/r9o86ar0p03f/2bJGC5ZP3WheoqzlLT05C5/c40a43a78da3f749c8b27e7f41e7b39e/blog-image-template-1800x945__20_.png?fm=webp\u0026w=820\u0026h=500",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-v-67d56f21=\"\" data-v-53094866=\"\" data-v-74bd29c6=\"\"\u003e\u003cp\u003eGenerative AI chat assistants have become standard in software development, helping create and fix code just to start. But what if your chat assistant could understand the artifacts of your entire development process, not just your code? What if that chat assistant could help you work through issues and project documentation before it helps you write code, and could access CI/CD pipelines and merge requests to help you finish coding tasks properly?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMeet the next generation of GitLab Duo Chat – GitLab Duo Agentic Chat, a significant evolution in AI-native development assistance and the newest addition to our platform, now in \u003ca href=\"https://docs.gitlab.com/policy/development_stages_support/#experiment\"\u003eexperimental release\u003c/a\u003e.\u003c/strong\u003e GitLab Duo Agentic Chat is available to all GitLab.com users with GitLab’s Workflow extension in VS Code.\u003c/p\u003e\n\u003cp\u003eAgentic Chat transforms chat from traditional conversational AI to a chat experience that takes action on your behalf, breaking down complex problems into discrete tasks that it can complete. Instead of simply responding to questions with the context you provide, Agentic Chat can:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eAutonomously determine\u003c/strong\u003e what information it needs to answer your questions\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eExecute a sequence of operations\u003c/strong\u003e to gather that information from multiple sources\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eFormulate comprehensive responses\u003c/strong\u003e by combining insights from across your project\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eCreate and modify files\u003c/strong\u003e to help you implement solutions\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAnd all of this is done while keeping the human developer within the loop.\u003c/p\u003e\n\u003cp\u003eAgentic Chat is built on the Duo Workflow architecture, which is \u003ca href=\"https://about.gitlab.com/blog/2025/02/24/gitlab-duo-workflow-enterprise-visibility-and-control-for-agentic-ai/\"\u003ecurrently in private beta\u003c/a\u003e. The architecture comprises agents and tools that take on specific tasks like finding the right context for a given question or editing files.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUse cases for GitLab Duo Agentic Chat\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHere are some real-world and common use cases for Agentic Chat:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eOnboard to new projects faster by having AI help you familiarize yourself with a new codebase.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eJump into assigned work immediately, even when issue descriptions are unclear, because Agentic Chat can help you connect the dots between requirements and existing implementations.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWhen it\u0026#39;s time to make changes, Agentic Chat can handle the implementation work by creating and editing multiple files across your project.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAt release time, Agentic Chat can help you verify that your solution actually addresses the original requirements by analyzing your merge requests against the initial issue or task.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://images.ctfassets.net/r9o86ar0p03f/7jntaQbatreXVD46onipCq/fd3309c207c17a3fd9a5fa94be6bdcc8/image4.png\" alt=\"agentic chat - example\"/\u003e\u003c/p\u003e\n\u003ccenter\u003e\u003ci\u003eAgentic Chat making code edits\u003c/i\u003e\u003c/center\u003e\n\u003ch2 id=\"from-learning-to-shipping-a-complete-workflow-demonstration-in-four-steps\" tabindex=\"-1\"\u003eFrom learning to shipping: A complete workflow demonstration in four steps \u003ca href=\"#from-learning-to-shipping-a-complete-workflow-demonstration-in-four-steps\"\u003e\u003csvg width=\"24\" height=\"24\" viewBox=\"0 0 16 16\" fill=\"none\" xmlns=\"http://www.w3.org/2000/svg\"\u003e\u003cpath d=\"M12.2426 3.75736C11.4615 2.97631 10.1952 2.97631 9.41416 3.75736L7.99995 5.17157C7.60942 5.56209 6.97626 5.56209 6.58573 5.17157C6.19521 4.78105 6.19521 4.14788 6.58573 3.75736L7.99995 2.34314C9.56205 0.781046 12.0947 0.781046 13.6568 2.34314C15.2189 3.90524 15.2189 6.4379 13.6568 8L12.2426 9.41421C11.8521 9.80473 11.2189 9.80473 10.8284 9.41421C10.4379 9.02369 10.4379 8.39052 10.8284 8L12.2426 6.58578C13.0236 5.80473 13.0236 4.5384 12.2426 3.75736Z\" fill=\"#333333\"\u003e\u003c/path\u003e\u003cpath d=\"M10.5355 5.4645C10.926 5.85502 10.926 6.48819 10.5355 6.87871L6.87863 10.5356C6.4881 10.9261 5.85494 10.9261 5.46441 10.5356C5.07389 10.145 5.07389 9.51188 5.46441 9.12135L9.12127 5.4645C9.51179 5.07397 10.145 5.07397 10.5355 5.4645Z\" fill=\"#333333\"\u003e\u003c/path\u003e\u003cpath d=\"M3.75742 9.41422C2.97637 10.1953 2.97637 11.4616 3.75742 12.2426C4.53847 13.0237 5.8048 13.0237 6.58584 12.2426L8.00006 10.8284C8.39058 10.4379 9.02375 10.4379 9.41427 10.8284C9.8048 11.219 9.8048 11.8521 9.41427 12.2426L8.00006 13.6569C6.43796 15.219 3.9053 15.219 2.3432 13.6569C0.781107 12.0948 0.781107 9.56211 2.3432 8.00001L3.75742 6.5858C4.14794 6.19527 4.78111 6.19527 5.17163 6.5858C5.56216 6.97632 5.56215 7.60948 5.17163 8.00001L3.75742 9.41422Z\" fill=\"#333333\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eTo show how Agentic Chat transforms the development experience, let\u0026#39;s walk through a real scenario from our engineering teams. Imagine you\u0026#39;re a new team member who\u0026#39;s been assigned an issue but knows nothing about the codebase. You can follow along with this video demonstration:\u003c/p\u003e\n\n\u003cfigure\u003e\n  \u003ciframe src=\"https://www.youtube.com/embed/uG9-QLAJrrg?si=kaOhYylMIaWkIuG8j\" frameborder=\"0\" allowfullscreen=\"\"\u003e \u003c/iframe\u003e\n\u003c/figure\u003e\n\n\u003cp\u003e\u003cstrong\u003eStep 1: Understand the project\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eInstead of manually exploring files and documentation, you can prompt Agentic Chat:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003eI am new to this project. Could you read the project structure and explain it to me?\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eAgentic Chat provides a comprehensive project overview by:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExploring the directory structure\u003c/li\u003e\n\u003cli\u003eReading README files and documentation\u003c/li\u003e\n\u003cli\u003eIdentifying key components and applications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eStep 2: Understand your assigned task\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eNext, you need to understand your specific assignment, so you can enter this prompt:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003eI have been assigned Issue 1119. Could you help me understand this task, specifically where do I need to apply the refactoring?\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eAgentic Chat explains the task and proposes a refactoring approach by:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eRetrieving and analyzing the issue details from the remote GitLab server\u003c/li\u003e\n\u003cli\u003eExamining relevant project files\u003c/li\u003e\n\u003cli\u003eIdentifying the specific locations requiring changes\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eStep 3: Implement the solution\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRather than doing the work manually, you can request:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003eCould you make the edits for me? Please start with steps one, two, three.\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eAgentic Chat then:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCreates new directories and files as needed\u003c/li\u003e\n\u003cli\u003eExtracts and refactors code across multiple locations\u003c/li\u003e\n\u003cli\u003eEnsures consistency across all modified files\u003c/li\u003e\n\u003cli\u003eProvides a summary of all changes made\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eStep 4: Verify completion\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFinally, after creating your merge request, you can verify your work:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003eDoes my MR fully address Issue 1119? \n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eAgentic Chat confirms whether all requirements have been met by analyzing both your merge request and the original issue.\u003c/p\u003e\n\n\u003cp\u003eGitLab Duo Agentic Chat is currently available as an experimental feature in VS Code for GitLab Duo Pro and Enterprise users. See our \u003ca href=\"https://docs.gitlab.com/user/gitlab_duo_chat/agentic_chat/\"\u003esetup documentation\u003c/a\u003e for prerequisites and configuration steps.\u003c/p\u003e\n\u003cp\u003eAs an experimental feature, Agentic Chat has some known limitations we\u0026#39;re actively addressing, including slower response times due to multiple API calls, keyword-based rather than semantic search, and limited support for new local folders or non-GitLab projects. \u003cstrong\u003eYour feedback is crucial in helping us prioritize improvements and bring Agentic Chat to general availability so please share your experience in \u003ca href=\"https://gitlab.com/gitlab-org/gitlab/-/issues/542198\"\u003ethis issue\u003c/a\u003e.\u003c/strong\u003e\u003c/p\u003e\n\u003ch2 id=\"what\u0026#39;s-next%3F\" tabindex=\"-1\"\u003eWhat\u0026#39;s next? \u003ca href=\"#what\u0026#39;s-next%3F\"\u003e\u003csvg width=\"24\" height=\"24\" viewBox=\"0 0 16 16\" fill=\"none\" xmlns=\"http://www.w3.org/2000/svg\"\u003e\u003cpath d=\"M12.2426 3.75736C11.4615 2.97631 10.1952 2.97631 9.41416 3.75736L7.99995 5.17157C7.60942 5.56209 6.97626 5.56209 6.58573 5.17157C6.19521 4.78105 6.19521 4.14788 6.58573 3.75736L7.99995 2.34314C9.56205 0.781046 12.0947 0.781046 13.6568 2.34314C15.2189 3.90524 15.2189 6.4379 13.6568 8L12.2426 9.41421C11.8521 9.80473 11.2189 9.80473 10.8284 9.41421C10.4379 9.02369 10.4379 8.39052 10.8284 8L12.2426 6.58578C13.0236 5.80473 13.0236 4.5384 12.2426 3.75736Z\" fill=\"#333333\"\u003e\u003c/path\u003e\u003cpath d=\"M10.5355 5.4645C10.926 5.85502 10.926 6.48819 10.5355 6.87871L6.87863 10.5356C6.4881 10.9261 5.85494 10.9261 5.46441 10.5356C5.07389 10.145 5.07389 9.51188 5.46441 9.12135L9.12127 5.4645C9.51179 5.07397 10.145 5.07397 10.5355 5.4645Z\" fill=\"#333333\"\u003e\u003c/path\u003e\u003cpath d=\"M3.75742 9.41422C2.97637 10.1953 2.97637 11.4616 3.75742 12.2426C4.53847 13.0237 5.8048 13.0237 6.58584 12.2426L8.00006 10.8284C8.39058 10.4379 9.02375 10.4379 9.41427 10.8284C9.8048 11.219 9.8048 11.8521 9.41427 12.2426L8.00006 13.6569C6.43796 15.219 3.9053 15.219 2.3432 13.6569C0.781107 12.0948 0.781107 9.56211 2.3432 8.00001L3.75742 6.5858C4.14794 6.19527 4.78111 6.19527 5.17163 6.5858C5.56216 6.97632 5.56215 7.60948 5.17163 8.00001L3.75742 9.41422Z\" fill=\"#333333\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cp\u003eWe are fully focused on improving Agentic Chat, including bringing it to general availability. In the meantime, we are aiming to improve response times and are adding capabilities that GitLab Duo Chat currently has, such as using self-hosted models or supporting JetBrains and Visual Studio in addition to VS Code. Once we have switched Duo Chat to this new architecture we plan to also bring Agentic Chat to the chat in the GitLab web application. We also plan to add a lot more functionality, such as editing GitLab artifacts, supporting context from custom Model Context Protocol, or MCP, servers, and offering commands to run in the terminal.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eReady to experience autonomous development assistance but not yet a GitLab customer? Try Agentic Chat today as part of \u003ca href=\"https://about.gitlab.com/free-trial/\"\u003ea free, 60-day trial of GitLab Ultimate with Duo Enterprise\u003c/a\u003e and help shape the future of AI-powered development. Follow these \u003ca href=\"https://docs.gitlab.com/user/gitlab_duo_chat/agentic_chat/#use-agentic-chat-in-vs-code\"\u003esetup steps for VS Code\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eAnd make sure to join the GitLab 18 virtual launch event to learn about our agentic AI plans and more. \u003ca href=\"https://about.gitlab.com/eighteen/\"\u003eRegister today!\u003c/a\u003e\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003eDisclaimer: This blog contains information related to upcoming products, features, and functionality. It is important to note that the information in this blog post is for informational purposes only. Please do not rely on this information for purchasing or planning purposes. As with all projects, the items mentioned in this blog and linked pages are subject to change or delay. The development, release, and timing of any products, features, or functionality remain at the sole discretion of GitLab.\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\n\u003ch2 id=\"learn-more\" tabindex=\"-1\"\u003eLearn more \u003ca href=\"#learn-more\"\u003e\u003csvg width=\"24\" height=\"24\" viewBox=\"0 0 16 16\" fill=\"none\" xmlns=\"http://www.w3.org/2000/svg\"\u003e\u003cpath d=\"M12.2426 3.75736C11.4615 2.97631 10.1952 2.97631 9.41416 3.75736L7.99995 5.17157C7.60942 5.56209 6.97626 5.56209 6.58573 5.17157C6.19521 4.78105 6.19521 4.14788 6.58573 3.75736L7.99995 2.34314C9.56205 0.781046 12.0947 0.781046 13.6568 2.34314C15.2189 3.90524 15.2189 6.4379 13.6568 8L12.2426 9.41421C11.8521 9.80473 11.2189 9.80473 10.8284 9.41421C10.4379 9.02369 10.4379 8.39052 10.8284 8L12.2426 6.58578C13.0236 5.80473 13.0236 4.5384 12.2426 3.75736Z\" fill=\"#333333\"\u003e\u003c/path\u003e\u003cpath d=\"M10.5355 5.4645C10.926 5.85502 10.926 6.48819 10.5355 6.87871L6.87863 10.5356C6.4881 10.9261 5.85494 10.9261 5.46441 10.5356C5.07389 10.145 5.07389 9.51188 5.46441 9.12135L9.12127 5.4645C9.51179 5.07397 10.145 5.07397 10.5355 5.4645Z\" fill=\"#333333\"\u003e\u003c/path\u003e\u003cpath d=\"M3.75742 9.41422C2.97637 10.1953 2.97637 11.4616 3.75742 12.2426C4.53847 13.0237 5.8048 13.0237 6.58584 12.2426L8.00006 10.8284C8.39058 10.4379 9.02375 10.4379 9.41427 10.8284C9.8048 11.219 9.8048 11.8521 9.41427 12.2426L8.00006 13.6569C6.43796 15.219 3.9053 15.219 2.3432 13.6569C0.781107 12.0948 0.781107 9.56211 2.3432 8.00001L3.75742 6.5858C4.14794 6.19527 4.78111 6.19527 5.17163 6.5858C5.56216 6.97632 5.56215 7.60948 5.17163 8.00001L3.75742 9.41422Z\" fill=\"#333333\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/a\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://about.gitlab.com/blog/2025/02/24/gitlab-duo-workflow-enterprise-visibility-and-control-for-agentic-ai/\"\u003eGitLab Duo Workflow: Enterprise visibility and control for agentic AI\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://about.gitlab.com/topics/agentic-ai/\"\u003eWhat is agentic AI?\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://about.gitlab.com/blog/2025/05/07/agentic-ai-guides-and-resources/\"\u003eAgentic AI guides and resources\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-05-29T00:00:00Z",
  "modifiedTime": null
}
