{
  "id": "d1602465-db28-4f50-bb6f-b689bb16c1a5",
  "title": "",
  "link": "http://scripting.com/2025/01/18.html#a195750",
  "description": "Then, I got a response from Nick Weaver and the Madison story continues: \"Here’s a roundabout Madison connection for you. I started working at UW 28 years ago today as the World Wide Web Editor in the Office of News and Public Affairs. My first project was to implement Userland Frontier for the university news page.\" Now Nick is in my Madison story too. And he mentions Frontier. With Frontier, we not only had the internet over networks, we also had networks on our computers because Frontier could send tasks to scriptable apps, and get back results. So databases could be hooked up to page layout programs, and people could use their writing tool of choice, and didn't have to use some teeny little excuse for an editor provided by a company that doesn't cater to or care about writers. Imagine writing with software that was designed to hobble writers instead of glorify them! That's the horror of the world as proposed by Mastodon, Threads, Bluesky, all of them. It's like no one stopped to think about what they are doing, half their product is writing, and they suck at writing and have no plans to improve the situation. Geez Louise, it's as if we collectively lost our minds.",
  "author": "",
  "published": "Sat, 18 Jan 2025 19:57:50 GMT",
  "source": "http://scripting.com/rss.xml",
  "categories": null,
  "byline": "",
  "length": 2831,
  "excerpt": "Dave Winer, OG blogger, podcaster, developed first apps in many categories. Old enough to know better. It's even worse than it appears.",
  "siteName": "Scripting News",
  "favicon": "",
  "text": "It's even worse than it appears.. I posted something to my linkblog this morning that really should have been on my blog. Here's what it said. \"Every blog should have a nice search engine like mine. I can search for ideas and it creates a story, like this search for 'Madison' where I had love, fun, creativity, friends, youth, music, strength, health, sex, and could see the future clearly. Best time of my life, I had everything anyone could want. Pick another term get another synthetic story.\" Ironically, since my linkblog doesn't flow through the search engine, I would have lost this post. Which makes a bigger point. All the ideas we throw into the silo'd social web are basically trash, not part of our collection, that we might use tools in the future to find value in (as my Madison posts surely did, for me at least). # Then, I got a response from Nick Weaver and the Madison story continues: \"Here’s a roundabout Madison connection for you. I started working at UW 28 years ago today as the World Wide Web Editor in the Office of News and Public Affairs. My first project was to implement Userland Frontier for the university news page.\" Now Nick is in my Madison story too. And he mentions Frontier. With Frontier, we not only had the internet over networks, we also had networks on our computers because Frontier could send tasks to scriptable apps, and get back results. So databases could be hooked up to page layout programs, and people could use their writing tool of choice, and didn't have to use some teeny little excuse for an editor provided by a company that doesn't cater to or care about writers. Imagine writing with software that was designed to hobble writers instead of glorify them! That's the horror of the world as proposed by Mastodon, Threads, Bluesky, all of them. It's like no one stopped to think about what they are doing, half their product is writing, and they suck at writing and have no plans to improve the situation. Geez Louise, it's as if we collectively lost our minds. # Anyway, today I hooked up BingeWorthy to WordLand. Bingeworthy doesn't have a text editor, and it doesn't need one, because when it wants to offer a user a chance to explain their rating, like \"seasons 1 and 2 were great, but season 3 sucked, but I gave it a high rating anyway,\" they can use WordLand which loves writers and strives to serve them better and better. Why should I put a bullshit editor in a product (Bingeworthy) that isn't about writing. Its job is very different from WordLand's. Let them work together. That's the big idea, that's why you bother having interop, so you can use more than one tool on the same data.# Use WordLand to write a \"program review\" for Bingeworthy 3?# There's more to the story, but this is already a lot to ask you to digest. I'll get a demo together soon. 😄#",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"idPageTopText\"\u003e\n\t\n\t\u003cp\u003eIt\u0026#39;s even worse than it appears..\u003c/p\u003e\n\t\u003c/div\u003e\u003cdiv id=\"idDayContainer\"\u003e\n\t\t\t\t\n\u003cp\u003e\u003ca name=\"a195403\"\u003e\u003c/a\u003e\u003cimg src=\"https://imgs.scripting.com/2017/09/01/mrFrog.png\"/\u003eI posted something to my \u003ca href=\"https://bsky.app/profile/feediverse.bsky.social/post/3lfywyfwlci2x\"\u003elinkblog\u003c/a\u003e this morning that really should have been on my \u003ca href=\"http://scripting.com/\"\u003eblog\u003c/a\u003e. Here\u0026#39;s what it said. \u0026#34;Every blog should have a nice search engine like mine. I can search for ideas and it creates a story, like this \u003ca href=\"https://daytona.scripting.com/search?q=Madison\"\u003esearch\u003c/a\u003e for \u0026#39;Madison\u0026#39; where I had love, fun, creativity, friends, youth, music, strength, health, sex, and could see the future clearly. Best time of my life, I had everything anyone could want. Pick another term get another synthetic story.\u0026#34; Ironically, since my linkblog doesn\u0026#39;t flow through the search engine, I would have lost this post. Which makes a bigger point. All the ideas we throw into the silo\u0026#39;d \u003ca href=\"https://oursocialweb.org/\"\u003esocial web\u003c/a\u003e are basically trash, not part of our collection, that we might use tools in the future to find value in (as my Madison posts surely did, for me at least). \u003cspan\u003e\u003ca href=\"http://scripting.com/2025/01/18.html#a195403\" title=\"Direct link to this item.\"\u003e#\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca name=\"a195750\"\u003e\u003c/a\u003eThen, I got a response from \u003ca href=\"https://x.com/nickweaver/status/1880601723330506958\"\u003eNick Weaver\u003c/a\u003e and the Madison story continues: \u0026#34;Here’s a roundabout Madison connection for you. I started working at UW 28 years ago today as the World Wide Web Editor in the Office of News and Public Affairs. My first project was to implement Userland Frontier for the university news page.\u0026#34; Now Nick is in \u003ca href=\"https://daytona.scripting.com/search?q=Madison\"\u003emy Madison story\u003c/a\u003e too. And he mentions \u003ca href=\"https://daytona.scripting.com/search?q=UserLand%20Frontier\"\u003eFrontier\u003c/a\u003e. With Frontier, we not only had the internet over networks, we also had networks on our computers because Frontier could send tasks to scriptable apps, and get back results. So databases could be hooked up to page layout programs, and people could use their writing tool of choice, and didn\u0026#39;t have to use some teeny little excuse for an editor provided by a company that doesn\u0026#39;t cater to or care about writers. Imagine writing with software that was designed to hobble writers instead of glorify them! That\u0026#39;s the horror of the world as proposed by Mastodon, Threads, Bluesky, all of them. It\u0026#39;s like no one stopped to think about what they are doing, half their product is writing, and they suck at writing and have no plans to improve the situation. Geez Louise, it\u0026#39;s as if we collectively lost our minds. \u003cspan\u003e\u003ca href=\"http://scripting.com/2025/01/18.html#a195750\" title=\"Direct link to this item.\"\u003e#\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca name=\"a200139\"\u003e\u003c/a\u003eAnyway, today I hooked up \u003ca href=\"https://tv.bingeworthy.org/\"\u003eBingeWorthy\u003c/a\u003e to \u003ca href=\"https://this.how/wordland/\"\u003eWordLand\u003c/a\u003e. Bingeworthy doesn\u0026#39;t have a text editor, and it doesn\u0026#39;t need one, because when it wants to offer a user a chance to explain their rating, like \u0026#34;seasons 1 and 2 were great, but season 3 sucked, but I gave it a high rating anyway,\u0026#34; they can use WordLand which loves writers and strives to serve them better and better. Why should I put a bullshit editor in a product (Bingeworthy) that isn\u0026#39;t about writing. Its job is very different from WordLand\u0026#39;s. Let them work together. That\u0026#39;s the big idea, that\u0026#39;s why you bother having \u003ca href=\"https://daytona.scripting.com/search?q=interop\"\u003einterop\u003c/a\u003e, so you can use more than one tool on the same data.\u003cspan\u003e\u003ca href=\"http://scripting.com/2025/01/18.html#a200139\" title=\"Direct link to this item.\"\u003e#\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cdiv data-type=\"outline\" data-inlineimage=\"https://imgs.scripting.com/2025/01/18/useWordland.png\" data-flincalendar=\"true\"\u003e\u003ccenter\u003e\u003cimg src=\"https://imgs.scripting.com/2025/01/18/useWordland.png\"/\u003e\u003c/center\u003e\u003cp\u003eUse WordLand to write a \u0026#34;program review\u0026#34; for Bingeworthy 3?\u003cspan\u003e\u003ca href=\"http://scripting.com/2025/01/18.html#a204719\" title=\"Direct link to this item.\"\u003e#\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\u003ca name=\"a204143\"\u003e\u003c/a\u003eThere\u0026#39;s more to the story, but this is already a lot to ask you to digest. I\u0026#39;ll get a demo together soon. \u003cspan\u003e😄\u003c/span\u003e\u003cspan\u003e\u003ca href=\"http://scripting.com/2025/01/18.html#a204143\" title=\"Direct link to this item.\"\u003e#\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
