{
  "id": "f1098bf4-1c47-4c86-bc3b-35f7b17e2039",
  "title": "Podcast: Building Human-Centered Engineering Cultures with Leadership, Diversity, and Trust",
  "link": "https://www.infoq.com/podcasts/building-human-centered-engineering-cultures/?utm_campaign=infoq_content\u0026utm_source=infoq\u0026utm_medium=feed\u0026utm_term=global",
  "description": "In this podcast, Shane Hastie, Lead Editor for Culture \u0026 Methods, spoke to Tara Hernandez about the importance of building generative cultures with strong leadership development, psychological safety, diversity, and transparency over simply chasing new technologies. Technology should be a means to solve meaningful human problems rather than an end in itself. By Tara Hernandez",
  "author": "Tara Hernandez",
  "published": "Fri, 25 Jul 2025 09:00:00 GMT",
  "source": "https://feed.infoq.com",
  "categories": [
    "learning",
    "Creativity",
    "Psychological Safety",
    "Productivity",
    "Engineering Culture Podcast",
    "Teamwork",
    "Culture \u0026 Methods",
    "podcast"
  ],
  "byline": "Shane Hastie",
  "length": 26795,
  "excerpt": "In this podcast, Shane Hastie, spoke to Tara Hernandez about the importance of building generative cultures with strong leadership development, and transparency over simply chasing new technologies.",
  "siteName": "InfoQ",
  "favicon": "https://cdn.infoq.com/statics_s2_20250724113909/apple-touch-icon.png",
  "text": "Transcript Shane Hastie: Good day, folks. This is Shane Hastie for the InfoQ Engineering Culture Podcast. Today I get the privilege to sit down and chat with Tara Hernandez. Tara, welcome. Thank you for taking the time to talk to us today. Introductions [00:50] Tara Hernandez: Oh, well thank you so much for having me. Shane Hastie: So my starting point for these conversations is who's Tara? Tara Hernandez: Oh gosh, how much time do we have for that? I have spent my career, over 30 years now, primarily focused on helping organizations evolve how they develop software. All the way back to my very earliest days at Netscape Communications Corporation where we invented the earliest web-based developer tools through today, where I'm now at MongoDB and I run an organization of developers who do all that work for me now, I just organize them. Shane Hastie: We were chatting earlier and you made the point, you really don't like technology. Technology is a means to an end, not an end in itself [01:37] Tara Hernandez: I think there's a tendency to over-index on technology. Some people talk about how when they're not at work, they spent their weekends investigating some new thing on the computer and I'm like, \"Oh, please go ride a bike, pick up a game, walk your dog, something\". Technology to me is a means to an end. But ultimately as an industry, I think we're in the business of solving interesting problems and the technology that we use to solve those problems has and will change dramatically and sometimes quite swiftly. I feel like the rate of change in some ways just continuously gets faster and faster. So getting attached to one particular technology is I think a good way to paint yourself into a corner. We always need to think about the adaptation of those emerging technologies and think about is it about the technology or is it about the problem we're trying to solve? Because at the end of the day, I think the problem we're trying to solve is the most interesting challenge and sometimes it's not a technical problem. Shane Hastie: We're in the Engineering Culture Podcast. Culture is something that we, again, from our conversation earlier, we both care deeply about. But what makes a good engineering culture? What makes a good engineering culture? [02:53] Tara Hernandez: That's a fantastic question. So I'm a bit of a DevOps nerd, and I always loved how Jez Humble described DevOps as a community of practice. It's not a tool or a set of tools, it's an agreement to have a shared ownership to a good business outcome. And if you build out from that, you can kind of extrapolate and think about a good culture is one that enables every member of the team to have the ability to share in the ownership of the final outcome and to feel empowered to contribute to it in a very real and tangible way. In the book Accelerate, Jez and Nicole Forsgren and Gene Kim, they talked about the capabilities that describe elite organizations and they introduced a lot of us to the concept of Westrum's culture hierarchies. And so this concept of a generative culture that I think is so incredible because it honors the individual and the value that they can bring. And I really believe in that. I believe that a good culture fosters better outcomes, business outcomes, and if you read some of my blog posts and writings, you'll also know that a good culture is also a diverse culture as far as backgrounds, educational histories, all the different types of ways that people's experience can contribute to this idea of shared experience leading to innovation. It's always an interesting challenge to me to see where does a team struggle? And part of it could be do they have the right tools that they need? But part of it could be is do they have the right environment to thrive? And I think both of those from my perspective, are the responsibility of the leadership of that organization. So you were asking me earlier what's my biggest passion? And it really is about facilitating good leadership development within that organization as part of that cultural evolution. So if there's a problem, people feel empowered to fix it. If there's an idea, people feel able to explore it. Shane Hastie: Leadership development, there is a stereotype, and we do it and it exists because it happens. We take the best technologist, we tell them, \"You're now going to lead a team\", and we give them absolutely no guidance on what this new job is. How do we develop good leaders? The importance of leadership development [05:28] Tara Hernandez: Oh my goodness, I have so many thoughts about this. You're right. It is so prevalent. We think someone is a stupendous developer. Clearly they must be put in charge. So full disclosure, I became a manager quite early in my career. I was still at Netscape. I think I was the ripe old age of 26. And someone decided, \"Oh, we'll put her in charge\". The fools. But I loved it. I found that I loved it more than anything else because I found my greatest satisfaction in defining my success through the success of those who work for me. And so when people tell me that they wanted get into management, that's the first thing I ask them, \"Why do you want to get into management?\" In a lot of cases, they think it's because they think that is the easier path to promotion. And so we talk about that, and I've talked many people out of going into people management for that reason. And in fact, I take that as a signal that we have not done our due diligence as an organization to provide good career paths for the individual contributors. But going back to your original question of how do we develop leadership skills for people who are put in a leadership position? I think we do have to quickly answer, is this actually the right thing for that person, first of all? And if the answer is yes, and they say, \"Yes, I really love coaching\", that's a very good way to get started. I love the concept of mentoring. Maybe they had interns that they worked with. That's a good answer. Another good answer is \"I want to be able to have more influence in what happens to my team\". That was actually my answer, and I think those are all good reasons to get into leadership. And then you absolutely must invest. When I was at Netscape, I actually was sent to a two-week course with three ring binders, the whole thing, and that was the last time I ever saw anything like that happen. Most companies might have some kind of learning and development video course that you might watch, but that's kind of about it. And so I think, again, as senior leaders, then we have to be on the lookout. If we've recently put someone in a new management role, how are we supporting them? Do they have a mentor? Do they have clarity about what the expectations are? Do they get reminded on the regular about what expectations have changed? Do they understand that rather than being perhaps in many cases, the one who implemented the most features and fixed the most bugs, and now they need to be the one who enables that in their reports? And some people discover, \"Wow, I hate that\". In fact, I have someone right now who is I think coming to that realization and may decide to go back. Charity Majors, if you're familiar with her, she writes a great blog on leadership and she has that whole concept of the engineering pendulum, which I love. I think people can and should go back and forth. Sometimes they want to do it, sometimes they don't. And I think that should be also a supported thing. Another aspect of good culture is to not put people in a box. That variability, that flexibility, that agency can extend to role, it can extend to organizational structure and the whole nine yards. But I think that the other most important thing about the development of people management in leadership roles is that it's not a point in time. There's no point when all of a sudden you're done, you know everything. It's recognizing that it's an endless cycle of learning and you'll do well and you'll do poorly, and you just have to learn from doing poorly and build on doing well and have an environment around you that recognizes that process and doesn't overly penalize you for it. Shane Hastie: How do we create that environment? Creating supportive learning environments [09:11] Tara Hernandez: It starts at the top. In most cases, I think culture should be bottoms up because it can't be imposed, but a value proposition around leadership has to be led from the front. If the CEO is saying, \"Yes, we have a good culture\", all of these things, but is seen to be punitive and angry and all the things that are negative and holding people in accountable in ways that are disrespectful or otherwise negative, the culture doesn't persist. You have to reward it and incentivize it at all levels. I am a vice president, I've been doing this for 30 years. I make plenty of mistakes. I could not be successful at my job if I didn't give myself grace and I didn't work in an organization where I was given grace. Right now that's different than perpetually being incompetent. I also expect and should be held to a very high bar of accountability and performance. But going back to Westrum's generative culture, mistakes are not the death penalty. Mistakes are learned from. I think it's true for projects, if you do as any good organization I think should do and have things like blameless postmortems. That's also true for people. The very important difference of course, is there's a difference between screwing up software and screwing up a human. So I think that they're not exactly equivalent, but a good culture recognizes and can be safely forgiving of mistakes versus a culture where HR is the enemy, the managers are the enemy, us, them, every man for himself, so to speak. Those are terrible and those businesses will not succeed in my opinion. I think there's some data, but I can't quote you right off the top of my head. Shane Hastie: One of the things that we do see is organizations want to adopt new technologies, new ways of working, and the knee-jerk reaction to the sort of modernisation is to go and hire and often the incumbents are left behind. Modernisation without leaving people behind [11:23] Tara Hernandez: I think there is just an element of human nature that we come to understand something and then that understanding has a hard time evolving. And it's interesting because at the same time, I've seen this many times in senior leadership at companies, we also tend to think of our engineering organizations or employees as interchangeable, which is sort of in conflict of that. So both of them are not ideal, but I think that part of what it means to give agency and to empower and promote the concept of a shared ownership to a common outcome is to invest particularly in your high performers and to give them the opportunity to grow their skillsets, presumably because they've proved that they can. Here at MongoDB, MongoDB has been around for a while. The core database is in C++. The number of companies that work in C++ is steadily going down. At some point we may decide we want to do Rust or we want to do a language that somebody hasn't fully produced yet. And it is completely, I think, reasonable even if that time is not now, that we would give space for some of our performers, especially our top performers, to go experiment. At Google, you call it a 20% project perhaps, to go do an experimentation for a product. But I think even doing experimentation for skills growth, this is something that I've done certainly when containers were starting to become a thing. I was like, well, who knows anything about containers? Not much. Let's go figure it out. AI is another one. Who knows anything about AI? Well, not much. Let's go figure it out. I think the AI thing has the added difficulty though, where there's so much hype around it and so many people saying very ridiculous things like, \"Oh, well, you'll never need software developers again if you just use our AI agents\". And I don't think that incentivizes some suspicious developers to want to participate, which is unfortunate. But it's again, humans are humans and our business as people managers and as leaders is to recognize that fact and then figure out how to build on it. Because humans are also ambitious or motivated or curious or any of these other things that could really lend them to taking opportunities and just going crazy with them. And I think that's the thing that you really want to inspire because they could turn around. I don't know, somebody right now might be thinking, gosh, I think we could take this module out of the core database and replace it with Rust and get a 40% performance intake. No leader worth their salt is going to say, \"That's a terrible idea. Why would you waste your time on that?\" We want people to think about things like that. Shane Hastie: One of the things that you mentioned earlier on is the more diverse the team, the better the outcomes. And yes, there are studies that have definitely shown that. It also is hard to create that diversity or it can be hard to create that diversity. The business case for diversity [14:35] Tara Hernandez: It absolutely can. And it has been so politicized, especially in the United States where the idea of diversity is equated with under-qualified. And I will not go down that path. I will not bore you with my rants there, but I will say that studies going back to, I think the seminal McKinsey study was back in 2012, over a decade ago, and Boston Consulting and Google actually did studies about this. So many studies have proved this over and over again that a diverse employee base that is supported by an inclusive culture. Now that's a really important concept. We talk about diversity and inclusion, and there's many phrases around it. Diversity is asking everybody to the dance, but inclusion is asking them to dance is one fun way I've heard it described. But think about an example of a diverse employee base could include retired members of the armed forces. If I have a team that is struggling to get organized, they have not figured out a structure that allows them to succeed, well, gosh, who gets a lot of very proactive, consistent training around leadership and structure? Non-comms and officers. So there's an example. If you're trying to sell into a new customer demographic, I give this example a lot. I talk about the racist soap dispenser. I don't know if you've ever seen this video. It's on YouTube. This poor man who has very dark skin is trying to use an automated soap dispenser to wash his hands in a bathroom, and he can't because keeps putting his hand under it and nothing happens. And then his co-worker, who happens to be Caucasian, puts his hand under and it works just fine. So eventually he gets a paper towel, a white one, and puts his hand in so he can get soap because the sensor cannot understand dark skin. Imagine if there was one person with dark skin who tested that sensor, and then this company would not have made a product that cannot be used by billions of people. I mean, that's an example of diversity. Another example that I'm personally familiar with is virtual reality hardware. You think like an Oculus or any of the rigs, even Apple's product, I tried it. A study came out that estimated that as many as 78% of women would be subject to motion sickness because their physical structure and their physiology was just different enough that it gave them a significantly harder experience than the average man. These are examples of where diversity is fundamentally critical to your eventual success. All these companies made products that basically ruled out half of their potential customer base. That's not good business. If you're selling a lot of B2C consumer software, there's a million different demographics that could come into play. Location, country, cultural norms. There was a big thing that you probably remember about how certain emojis started coming out. And in some countries it's like, oh, that's an emoji. In other countries, that's a deadly insult. And if you don't have representatives of those cultures, you're going to make those mistakes. Imagine being all Americans and trying to sell in Taipei or Japan. No company of course would do that now. We've learned our lesson the hard way. We hire local people to help us with language and culture. Shane Hastie: Circling back around to developer trust and developer experience, how do we improve the relationships in our organizations, in our teams? Building developer trust and relationships [18:21] Tara Hernandez: Oh gosh, there's so many answers to that. But to me, the thing that I was always reached to first is transparency. So my job in my view is to make sure that my team is crystal clear on what we need to get done, and that when we do it correctly, they are rewarded. And when they do it incorrectly, they're coached. And that if somebody is choosing or unable to actually do the job, then they're respectfully managed out. And feedback loops are constant and circular. I always accept feedback. It's that investment that you have to make every day that starts to build the human trust. And with the human trust, then you can start feeling more ambitious about everything else. Going back to Westrum generative culture, now you're willing to take risks. What Google described as psychological safety is the first of five key things that make for successful teams. Psychological safety is also very critical to having an inclusive culture. The willingness to take risks because you know that you'll not be unduly penalized, and that comes through transparency and consistency. And it sounds simple and it's terribly difficult to maintain. Especially one of the things I love about where I work now with MongoDB is we are still committed to our hybrid and remote workforce. The people who report up to me go from Sydney to Berlin, and most of them are not based in a central office. And so it is exceedingly critical that I over-communicate and I don't think I communicate enough. So this is always a challenge that I have. Am I being as transparent as I need to be? Am I passing down the information? Am I reinforcing the messages and the values that I want to make is something I worry about all the time. And I think any good leader should be thinking about that. You never want to take your people for granted because then eventually they'll notice and then you lose that trust. Shane Hastie: Another thing that we were chatting about before we started recording was you build it, you run it, you use it, the dogfooding approach, although I much prefer drink our own champagne to eat our own dog food. The value of dogfooding your own products [20:37] Tara Hernandez: Yes, we've tried to use that one too. It hasn't stuck quite as much, but I think it's just because very rude. Eating your own pizza is another one. Yes. One of the things I really love about working at a company that makes developer tools is exactly that. My very first company was a company called Borland. It was compilers and databases, and Netscape of course was browsers that was very easy to dog food, but a lot of the companies I've worked at have made products that we could use, and I think it serves two purposes. Well, maybe more than two, but definitely it serves two purposes. The first one, of course, what I think is the most important is it helps develop customer empathy. We should be using as much as possible the products that our customers are using so that we can understand what our customer pain points are. And we actually recently, one of my engineers got a blog post posted for our engineering blog talking about how the most recent version of MongoDB was ... We have a proprietary continuous integration system. Don't judge us. It is purpose-built to test a distributed document database. It's very specialized and runs 10 engineer years worth of compute volume of tasks every day. That's how much we test. And so it's built on top of MongoDB, it's on Atlas, and we rolled onto version eight and we found two stopship bugs on that. And because I'm like, if it's good enough for our customers, it's good enough for us and vice versa. And my engineers had previously not had been as aware of that value opportunity. But boy, after we found those bugs, everybody was just walking around chest out, proud. We helped the business, we did something valuable. And the other thing is, which I think is also important, but maybe a little more subtle, is it keeps the business honest. When AWS was still very early, a lot of people would ask them, a new service would come out, \"Well, what is Amazon running on this service?\" And for a while the answer was, \"Not much\". I think Google is rightly asked something similar. How much of Google is run on Google Cloud? How much of MongoDB is run on Atlas? I think any business that's providing those types of services should expect to be asked and we should be able to provide that answer. Otherwise, what's the point? If you're not building something that you yourself would use, you're clearly doing something wrong. Your priorities are not correct for this category. Obviously that doesn't work for ... I would not personally find any use for most of Salesforce, for example. Slightly different. Shane Hastie: What's the important question I haven't asked you? The future of software engineering and AI hype [23:21] Tara Hernandez: I think the one that everybody is asking right now is what is the future of our industry? What is the future of the world in the face of AI? Personally, I think that's giving AI a little bit too much credit, to be honest. I live on LinkedIn quite a bit. I'm always hiring. So keeping an eye out for folks. I remember seeing some posts someone shared about how Marc Andreessen, who I actually know from my Netscape days, we're not friends or anything, but he was commenting that AI is going to become so dominant that the only humans that will still need to be involved are the venture capitalists. Everybody was like, \"Okay, Marc\". But then not two days later, there was another article where a venture capital firm was using AI to do the evaluation. So if you have AI generating the ideas and AI doing the evaluations, what's the point of humans? And I think it's that level of silliness. We can't help ourselves. We as humans I think are inclined to be fascinated by the fantastical, but I do think that there's an element of the quote that's coming to mind was from the first Jurassic Park movie, Jeff Goldblum's character. \"You were so busy thinking about how you can do a thing, you never stopped to think about whether or not you should\". Now, I think a lot of people could argue dinosaurs are cool, all right, they eat a couple of people, but still dinosaurs. But I think there's this element of what is our purpose as an industry? What is our purpose as a human? What problems are we solving? And I think going back to what I was saying earlier, the technology is an interesting implementation detail. If AI goes in the direction that some people say it's going to go, are we solving a problem or are we just making humans irrelevant? And in which case your business probably isn't going to go very far. You've lost your customer base. We're all just going to be gone. So I think it's important to remember the human element. We talk about those who think in these terms. The most important thing about a company is its culture, but you could also say, is the culture that you're facilitating through your products good? Can you be proud of it? Are you contributing to our existence? Are you solving amazing things? When we were at Netscape, we speculated so much about information freedom. People can know anything anywhere. And then we started to realize, but what if the internet turns into TV but worse? And well, one could argue that kind of happened, but still, I'll never forget when during the Arab Spring, people were putting the Google DNS server as graffiti on walls, 8.8.8.8, because countries were trying to shut down the internet and people bypassed it and were able to talk to each other and communicate and get information. And despite everything terrible that can happen on the internet, I'll never forget that because the internet, much like many technologies, is just enabling people to be more who they are, but faster and at scale. And I think that ethical companies remember that and think about the products that they develop and why are they developing and what problems are they actually solving. At least I hope that they are. I like to think that we are, and others I worry about, but we can never forget. And it comes into our leadership values and how we bring up the leaders behind us. I think if we're doing it right, now, you've got me really going off on a tangent here. Shane Hastie: A lot of deep good conversations in here. If people want to continue the conversation, where do they find you? Tara Hernandez: Well, I definitely am on LinkedIn. I've kind of gotten off most of the other social media just because they're deadly places. I've promised myself to start writing again. I've got some blogs on Medium, mostly talking about engineering, management, leadership and diversity and inclusion. I love doing things like this. I love nerding out with people about these types of topics and I hope they find those as well and maybe think about their own message and what they bring. Because if the tech industry has taught us anything in the past decades is that everybody has the potential of having a huge impact. A lot of it is luck, but there's a lot of really smart people who get into this space, and I think everybody has the opportunity to do something amazing, and I hope they feel the responsibility of doing it amazingly good. Shane Hastie: Inspiring words. Thank you so much for taking the time to talk to us today. Tara Hernandez: Thank you so much for having me. Mentioned: Book: Accelerate Charity Majors on the Engineer/Manager Pendulum Google Team Effectiveness studies Tara Hernandez on LinkedIn About the Author Tara Hernandez You can keep up-to-date with the podcasts via our RSS Feed, and they are available via SoundCloud, Apple Podcasts, Spotify, Overcast and YouTube. From this page you also have access to our recorded show notes. They all have clickable links that will take you directly to that part of the audio.",
  "image": "https://res.infoq.com/podcasts/building-human-centered-engineering-cultures/en/card_header_image/tara-hernandez-twitter-card-1753099043614.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t \t\u003ch2\u003eTranscript\u003c/h2\u003e\n\n\u003cp\u003e\u003cstrong\u003eShane Hastie\u003c/strong\u003e: Good day, folks. This is Shane Hastie for the InfoQ Engineering Culture Podcast. Today I get the privilege to sit down and chat with Tara Hernandez. Tara, welcome. Thank you for taking the time to talk to us today.\u003c/p\u003e\n\n\u003ch2\u003eIntroductions [00:50]\u003c/h2\u003e\n\n\u003cp\u003e\u003cstrong\u003eTara Hernandez\u003c/strong\u003e: Oh, well thank you so much for having me.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eShane Hastie\u003c/strong\u003e: So my starting point for these conversations is who\u0026#39;s Tara?\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eTara Hernandez\u003c/strong\u003e: Oh gosh, how much time do we have for that? I have spent my career, over 30 years now, primarily focused on helping organizations evolve how they develop software. All the way back to my very earliest days at Netscape Communications Corporation where we invented the earliest web-based developer tools through today, where I\u0026#39;m now at MongoDB and I run an organization of developers who do all that work for me now, I just organize them.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eShane Hastie\u003c/strong\u003e: We were chatting earlier and you made the point, you really don\u0026#39;t like technology.\u003c/p\u003e\n\n\u003ch2\u003eTechnology is a means to an end, not an end in itself [01:37]\u003c/h2\u003e\n\n\u003cp\u003e\u003cstrong\u003eTara Hernandez\u003c/strong\u003e: I think there\u0026#39;s a tendency to over-index on technology. Some people talk about how when they\u0026#39;re not at work, they spent their weekends investigating some new thing on the computer and I\u0026#39;m like, \u0026#34;Oh, please go ride a bike, pick up a game, walk your dog, something\u0026#34;.\u003c/p\u003e\n\n\u003cp\u003eTechnology to me is a means to an end. But ultimately as an industry, I think we\u0026#39;re in the business of solving interesting problems and the technology that we use to solve those problems has and will change dramatically and sometimes quite swiftly. I feel like the rate of change in some ways just continuously gets faster and faster. So getting attached to one particular technology is I think a good way to paint yourself into a corner. We always need to think about the adaptation of those emerging technologies and think about is it about the technology or is it about the problem we\u0026#39;re trying to solve? Because at the end of the day, I think the problem we\u0026#39;re trying to solve is the most interesting challenge and sometimes it\u0026#39;s not a technical problem.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eShane Hastie\u003c/strong\u003e: We\u0026#39;re in the Engineering Culture Podcast. Culture is something that we, again, from our conversation earlier, we both care deeply about. But what makes a good engineering culture?\u003c/p\u003e\n\n\u003ch2\u003eWhat makes a good engineering culture? [02:53]\u003c/h2\u003e\n\n\u003cp\u003e\u003cstrong\u003eTara Hernandez\u003c/strong\u003e: That\u0026#39;s a fantastic question. So I\u0026#39;m a bit of a DevOps nerd, and I always loved how Jez Humble described DevOps as a community of practice. It\u0026#39;s not a tool or a set of tools, it\u0026#39;s an agreement to have a shared ownership to a good business outcome. And if you build out from that, you can kind of extrapolate and think about a good culture is one that enables every member of the team to have the ability to share in the ownership of the final outcome and to feel empowered to contribute to it in a very real and tangible way. In the book Accelerate, Jez and Nicole Forsgren and Gene Kim, they talked about the capabilities that describe elite organizations and they introduced a lot of us to the concept of Westrum\u0026#39;s culture hierarchies.\u003c/p\u003e\n\n\u003cp\u003eAnd so this concept of a generative culture that I think is so incredible because it honors the individual and the value that they can bring. And I really believe in that. I believe that a good culture fosters better outcomes, business outcomes, and if you read some of my blog posts and writings, you\u0026#39;ll also know that a good culture is also a diverse culture as far as backgrounds, educational histories, all the different types of ways that people\u0026#39;s experience can contribute to this idea of shared experience leading to innovation.\u003c/p\u003e\n\n\u003cp\u003eIt\u0026#39;s always an interesting challenge to me to see where does a team struggle? And part of it could be do they have the right tools that they need? But part of it could be is do they have the right environment to thrive? And I think both of those from my perspective, are the responsibility of the leadership of that organization. So you were asking me earlier what\u0026#39;s my biggest passion? And it really is about facilitating good leadership development within that organization as part of that cultural evolution. So if there\u0026#39;s a problem, people feel empowered to fix it. If there\u0026#39;s an idea, people feel able to explore it.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eShane Hastie\u003c/strong\u003e: Leadership development, there is a stereotype, and we do it and it exists because it happens. We take the best technologist, we tell them, \u0026#34;You\u0026#39;re now going to lead a team\u0026#34;, and we give them absolutely no guidance on what this new job is. How do we develop good leaders?\u003c/p\u003e\n\n\u003ch2\u003eThe importance of leadership development [05:28]\u003c/h2\u003e\n\n\u003cp\u003e\u003cstrong\u003eTara Hernandez\u003c/strong\u003e: Oh my goodness, I have so many thoughts about this. You\u0026#39;re right. It is so prevalent. We think someone is a stupendous developer. Clearly they must be put in charge. So full disclosure, I became a manager quite early in my career. I was still at Netscape. I think I was the ripe old age of 26. And someone decided, \u0026#34;Oh, we\u0026#39;ll put her in charge\u0026#34;. The fools. But I loved it. I found that I loved it more than anything else because I found my greatest satisfaction in defining my success through the success of those who work for me.\u003c/p\u003e\n\n\u003cp\u003eAnd so when people tell me that they wanted get into management, that\u0026#39;s the first thing I ask them, \u0026#34;Why do you want to get into management?\u0026#34; In a lot of cases, they think it\u0026#39;s because they think that is the easier path to promotion. And so we talk about that, and I\u0026#39;ve talked many people out of going into people management for that reason. And in fact, I take that as a signal that we have not done our due diligence as an organization to provide good career paths for the individual contributors. But going back to your original question of how do we develop leadership skills for people who are put in a leadership position? I think we do have to quickly answer, is this actually the right thing for that person, first of all? And if the answer is yes, and they say, \u0026#34;Yes, I really love coaching\u0026#34;, that\u0026#39;s a very good way to get started. I love the concept of mentoring. Maybe they had interns that they worked with. That\u0026#39;s a good answer.\u003c/p\u003e\n\n\u003cp\u003eAnother good answer is \u0026#34;I want to be able to have more influence in what happens to my team\u0026#34;. That was actually my answer, and I think those are all good reasons to get into leadership.\u003c/p\u003e\n\n\u003cp\u003eAnd then you absolutely must invest. When I was at Netscape, I actually was sent to a two-week course with three ring binders, the whole thing, and that was the last time I ever saw anything like that happen. Most companies might have some kind of learning and development video course that you might watch, but that\u0026#39;s kind of about it. And so I think, again, as senior leaders, then we have to be on the lookout. If we\u0026#39;ve recently put someone in a new management role, how are we supporting them? Do they have a mentor? Do they have clarity about what the expectations are? Do they get reminded on the regular about what expectations have changed? Do they understand that rather than being perhaps in many cases, the one who implemented the most features and fixed the most bugs, and now they need to be the one who enables that in their reports?\u003c/p\u003e\n\n\u003cp\u003eAnd some people discover, \u0026#34;Wow, I hate that\u0026#34;. In fact, I have someone right now who is I think coming to that realization and may decide to go back. Charity Majors, if you\u0026#39;re familiar with her, she writes a great blog on leadership and she has that whole concept of the engineering pendulum, which I love. I think people can and should go back and forth. Sometimes they want to do it, sometimes they don\u0026#39;t. And I think that should be also a supported thing. Another aspect of good culture is to not put people in a box. That variability, that flexibility, that agency can extend to role, it can extend to organizational structure and the whole nine yards.\u003c/p\u003e\n\n\u003cp\u003eBut I think that the other most important thing about the development of people management in leadership roles is that it\u0026#39;s not a point in time. There\u0026#39;s no point when all of a sudden you\u0026#39;re done, you know everything. It\u0026#39;s recognizing that it\u0026#39;s an endless cycle of learning and you\u0026#39;ll do well and you\u0026#39;ll do poorly, and you just have to learn from doing poorly and build on doing well and have an environment around you that recognizes that process and doesn\u0026#39;t overly penalize you for it.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eShane Hastie\u003c/strong\u003e: How do we create that environment?\u003c/p\u003e\n\n\u003ch2\u003eCreating supportive learning environments [09:11]\u003c/h2\u003e\n\n\u003cp\u003e\u003cstrong\u003eTara Hernandez\u003c/strong\u003e: It starts at the top. In most cases, I think culture should be bottoms up because it can\u0026#39;t be imposed, but a value proposition around leadership has to be led from the front. If the CEO is saying, \u0026#34;Yes, we have a good culture\u0026#34;, all of these things, but is seen to be punitive and angry and all the things that are negative and holding people in accountable in ways that are disrespectful or otherwise negative, the culture doesn\u0026#39;t persist. You have to reward it and incentivize it at all levels. I am a vice president, I\u0026#39;ve been doing this for 30 years. I make plenty of mistakes. I could not be successful at my job if I didn\u0026#39;t give myself grace and I didn\u0026#39;t work in an organization where I was given grace. Right now that\u0026#39;s different than perpetually being incompetent. I also expect and should be held to a very high bar of accountability and performance.\u003c/p\u003e\n\n\u003cp\u003eBut going back to Westrum\u0026#39;s generative culture, mistakes are not the death penalty. Mistakes are learned from. I think it\u0026#39;s true for projects, if you do as any good organization I think should do and have things like blameless postmortems. That\u0026#39;s also true for people. The very important difference of course, is there\u0026#39;s a difference between screwing up software and screwing up a human. So I think that they\u0026#39;re not exactly equivalent, but a good culture recognizes and can be safely forgiving of mistakes versus a culture where HR is the enemy, the managers are the enemy, us, them, every man for himself, so to speak. Those are terrible and those businesses will not succeed in my opinion. I think there\u0026#39;s some data, but I can\u0026#39;t quote you right off the top of my head.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eShane Hastie\u003c/strong\u003e: One of the things that we do see is organizations want to adopt new technologies, new ways of working, and the knee-jerk reaction to the sort of modernisation is to go and hire and often the incumbents are left behind.\u003c/p\u003e\n\n\u003ch2\u003eModernisation without leaving people behind [11:23]\u003c/h2\u003e\n\n\u003cp\u003e\u003cstrong\u003eTara Hernandez\u003c/strong\u003e: I think there is just an element of human nature that we come to understand something and then that understanding has a hard time evolving. And it\u0026#39;s interesting because at the same time, I\u0026#39;ve seen this many times in senior leadership at companies, we also tend to think of our engineering organizations or employees as interchangeable, which is sort of in conflict of that. So both of them are not ideal, but I think that part of what it means to give agency and to empower and promote the concept of a shared ownership to a common outcome is to invest particularly in your high performers and to give them the opportunity to grow their skillsets, presumably because they\u0026#39;ve proved that they can.\u003c/p\u003e\n\n\u003cp\u003eHere at MongoDB, MongoDB has been around for a while. The core database is in C++. The number of companies that work in C++ is steadily going down. At some point we may decide we want to do Rust or we want to do a language that somebody hasn\u0026#39;t fully produced yet. And it is completely, I think, reasonable even if that time is not now, that we would give space for some of our performers, especially our top performers, to go experiment. At Google, you call it a 20% project perhaps, to go do an experimentation for a product. But I think even doing experimentation for skills growth, this is something that I\u0026#39;ve done certainly when containers were starting to become a thing. I was like, well, who knows anything about containers? Not much. Let\u0026#39;s go figure it out.\u003c/p\u003e\n\n\u003cp\u003eAI is another one. Who knows anything about AI? Well, not much. Let\u0026#39;s go figure it out. I think the AI thing has the added difficulty though, where there\u0026#39;s so much hype around it and so many people saying very ridiculous things like, \u0026#34;Oh, well, you\u0026#39;ll never need software developers again if you just use our AI agents\u0026#34;. And I don\u0026#39;t think that incentivizes some suspicious developers to want to participate, which is unfortunate. But it\u0026#39;s again, humans are humans and our business as people managers and as leaders is to recognize that fact and then figure out how to build on it. Because humans are also ambitious or motivated or curious or any of these other things that could really lend them to taking opportunities and just going crazy with them.\u003c/p\u003e\n\n\u003cp\u003eAnd I think that\u0026#39;s the thing that you really want to inspire because they could turn around. I don\u0026#39;t know, somebody right now might be thinking, gosh, I think we could take this module out of the core database and replace it with Rust and get a 40% performance intake. No leader worth their salt is going to say, \u0026#34;That\u0026#39;s a terrible idea. Why would you waste your time on that?\u0026#34; We want people to think about things like that.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eShane Hastie\u003c/strong\u003e: One of the things that you mentioned earlier on is the more diverse the team, the better the outcomes. And yes, there are studies that have definitely shown that. It also is hard to create that diversity or it can be hard to create that diversity.\u003c/p\u003e\n\n\u003ch2\u003eThe business case for diversity [14:35]\u003c/h2\u003e\n\n\u003cp\u003e\u003cstrong\u003eTara Hernandez\u003c/strong\u003e: It absolutely can. And it has been so politicized, especially in the United States where the idea of diversity is equated with under-qualified. And I will not go down that path. I will not bore you with my rants there, but I will say that studies going back to, I think the seminal McKinsey study was back in 2012, over a decade ago, and Boston Consulting and Google actually did studies about this. So many studies have proved this over and over again that a diverse employee base that is supported by an inclusive culture. Now that\u0026#39;s a really important concept. We talk about diversity and inclusion, and there\u0026#39;s many phrases around it. Diversity is asking everybody to the dance, but inclusion is asking them to dance is one fun way I\u0026#39;ve heard it described. But think about an example of a diverse employee base could include retired members of the armed forces.\u003c/p\u003e\n\n\u003cp\u003eIf I have a team that is struggling to get organized, they have not figured out a structure that allows them to succeed, well, gosh, who gets a lot of very proactive, consistent training around leadership and structure? Non-comms and officers. So there\u0026#39;s an example. If you\u0026#39;re trying to sell into a new customer demographic, I give this example a lot. I talk about the racist soap dispenser. I don\u0026#39;t know if you\u0026#39;ve ever seen this video. It\u0026#39;s on YouTube.\u003c/p\u003e\n\n\u003cp\u003eThis poor man who has very dark skin is trying to use an automated soap dispenser to wash his hands in a bathroom, and he can\u0026#39;t because keeps putting his hand under it and nothing happens. And then his co-worker, who happens to be Caucasian, puts his hand under and it works just fine. So eventually he gets a paper towel, a white one, and puts his hand in so he can get soap because the sensor cannot understand dark skin. Imagine if there was one person with dark skin who tested that sensor, and then this company would not have made a product that cannot be used by billions of people. I mean, that\u0026#39;s an example of diversity.\u003c/p\u003e\n\n\u003cp\u003eAnother example that I\u0026#39;m personally familiar with is virtual reality hardware. You think like an Oculus or any of the rigs, even Apple\u0026#39;s product, I tried it. A study came out that estimated that as many as 78% of women would be subject to motion sickness because their physical structure and their physiology was just different enough that it gave them a significantly harder experience than the average man. These are examples of where diversity is fundamentally critical to your eventual success. All these companies made products that basically ruled out half of their potential customer base. That\u0026#39;s not good business.\u003c/p\u003e\n\n\u003cp\u003eIf you\u0026#39;re selling a lot of B2C consumer software, there\u0026#39;s a million different demographics that could come into play. Location, country, cultural norms. There was a big thing that you probably remember about how certain emojis started coming out. And in some countries it\u0026#39;s like, oh, that\u0026#39;s an emoji. In other countries, that\u0026#39;s a deadly insult. And if you don\u0026#39;t have representatives of those cultures, you\u0026#39;re going to make those mistakes. Imagine being all Americans and trying to sell in Taipei or Japan. No company of course would do that now. We\u0026#39;ve learned our lesson the hard way. We hire local people to help us with language and culture.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eShane Hastie\u003c/strong\u003e: Circling back around to developer trust and developer experience, how do we improve the relationships in our organizations, in our teams?\u003c/p\u003e\n\n\u003ch2\u003eBuilding developer trust and relationships [18:21]\u003c/h2\u003e\n\n\u003cp\u003e\u003cstrong\u003eTara Hernandez\u003c/strong\u003e: Oh gosh, there\u0026#39;s so many answers to that. But to me, the thing that I was always reached to first is transparency. So my job in my view is to make sure that my team is crystal clear on what we need to get done, and that when we do it correctly, they are rewarded. And when they do it incorrectly, they\u0026#39;re coached. And that if somebody is choosing or unable to actually do the job, then they\u0026#39;re respectfully managed out. And feedback loops are constant and circular. I always accept feedback. It\u0026#39;s that investment that you have to make every day that starts to build the human trust. And with the human trust, then you can start feeling more ambitious about everything else.\u003c/p\u003e\n\n\u003cp\u003eGoing back to Westrum generative culture, now you\u0026#39;re willing to take risks. What Google described as psychological safety is the first of five key things that make for successful teams. Psychological safety is also very critical to having an inclusive culture. The willingness to take risks because you know that you\u0026#39;ll not be unduly penalized, and that comes through transparency and consistency. And it sounds simple and it\u0026#39;s terribly difficult to maintain.\u003c/p\u003e\n\n\u003cp\u003eEspecially one of the things I love about where I work now with MongoDB is we are still committed to our hybrid and remote workforce. The people who report up to me go from Sydney to Berlin, and most of them are not based in a central office. And so it is exceedingly critical that I over-communicate and I don\u0026#39;t think I communicate enough. So this is always a challenge that I have. Am I being as transparent as I need to be? Am I passing down the information? Am I reinforcing the messages and the values that I want to make is something I worry about all the time. And I think any good leader should be thinking about that. You never want to take your people for granted because then eventually they\u0026#39;ll notice and then you lose that trust.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eShane Hastie\u003c/strong\u003e: Another thing that we were chatting about before we started recording was you build it, you run it, you use it, the dogfooding approach, although I much prefer drink our own champagne to eat our own dog food.\u003c/p\u003e\n\n\u003ch2\u003eThe value of dogfooding your own products [20:37]\u003c/h2\u003e\n\n\u003cp\u003e\u003cstrong\u003eTara Hernandez\u003c/strong\u003e: Yes, we\u0026#39;ve tried to use that one too. It hasn\u0026#39;t stuck quite as much, but I think it\u0026#39;s just because very rude. Eating your own pizza is another one. Yes. One of the things I really love about working at a company that makes developer tools is exactly that. My very first company was a company called Borland. It was compilers and databases, and Netscape of course was browsers that was very easy to dog food, but a lot of the companies I\u0026#39;ve worked at have made products that we could use, and I think it serves two purposes. Well, maybe more than two, but definitely it serves two purposes.\u003c/p\u003e\n\n\u003cp\u003eThe first one, of course, what I think is the most important is it helps develop customer empathy. We should be using as much as possible the products that our customers are using so that we can understand what our customer pain points are. And we actually recently, one of my engineers got a blog post posted for our engineering blog talking about how the most recent version of MongoDB was ... We have a proprietary continuous integration system. Don\u0026#39;t judge us. It is purpose-built to test a distributed document database. It\u0026#39;s very specialized and runs 10 engineer years worth of compute volume of tasks every day. That\u0026#39;s how much we test.\u003c/p\u003e\n\n\u003cp\u003eAnd so it\u0026#39;s built on top of MongoDB, it\u0026#39;s on Atlas, and we rolled onto version eight and we found two stopship bugs on that. And because I\u0026#39;m like, if it\u0026#39;s good enough for our customers, it\u0026#39;s good enough for us and vice versa. And my engineers had previously not had been as aware of that value opportunity. But boy, after we found those bugs, everybody was just walking around chest out, proud. We helped the business, we did something valuable.\u003c/p\u003e\n\n\u003cp\u003eAnd the other thing is, which I think is also important, but maybe a little more subtle, is it keeps the business honest. When AWS was still very early, a lot of people would ask them, a new service would come out, \u0026#34;Well, what is Amazon running on this service?\u0026#34; And for a while the answer was, \u0026#34;Not much\u0026#34;. I think Google is rightly asked something similar. How much of Google is run on Google Cloud? How much of MongoDB is run on Atlas? I think any business that\u0026#39;s providing those types of services should expect to be asked and we should be able to provide that answer.\u003c/p\u003e\n\n\u003cp\u003eOtherwise, what\u0026#39;s the point? If you\u0026#39;re not building something that you yourself would use, you\u0026#39;re clearly doing something wrong. Your priorities are not correct for this category. Obviously that doesn\u0026#39;t work for ... I would not personally find any use for most of Salesforce, for example. Slightly different.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eShane Hastie\u003c/strong\u003e: What\u0026#39;s the important question I haven\u0026#39;t asked you?\u003c/p\u003e\n\n\u003ch2\u003eThe future of software engineering and AI hype [23:21]\u003c/h2\u003e\n\n\u003cp\u003e\u003cstrong\u003eTara Hernandez\u003c/strong\u003e: I think the one that everybody is asking right now is what is the future of our industry? What is the future of the world in the face of AI? Personally, I think that\u0026#39;s giving AI a little bit too much credit, to be honest. I live on LinkedIn quite a bit. I\u0026#39;m always hiring. So keeping an eye out for folks. I remember seeing some posts someone shared about how Marc Andreessen, who I actually know from my Netscape days, we\u0026#39;re not friends or anything, but he was commenting that AI is going to become so dominant that the only humans that will still need to be involved are the venture capitalists. Everybody was like, \u0026#34;Okay, Marc\u0026#34;. But then not two days later, there was another article where a venture capital firm was using AI to do the evaluation. So if you have AI generating the ideas and AI doing the evaluations, what\u0026#39;s the point of humans?\u003c/p\u003e\n\n\u003cp\u003eAnd I think it\u0026#39;s that level of silliness. We can\u0026#39;t help ourselves. We as humans I think are inclined to be fascinated by the fantastical, but I do think that there\u0026#39;s an element of the quote that\u0026#39;s coming to mind was from the first Jurassic Park movie, Jeff Goldblum\u0026#39;s character. \u0026#34;You were so busy thinking about how you can do a thing, you never stopped to think about whether or not you should\u0026#34;. Now, I think a lot of people could argue dinosaurs are cool, all right, they eat a couple of people, but still dinosaurs. But I think there\u0026#39;s this element of what is our purpose as an industry? What is our purpose as a human? What problems are we solving? And I think going back to what I was saying earlier, the technology is an interesting implementation detail.\u003c/p\u003e\n\n\u003cp\u003eIf AI goes in the direction that some people say it\u0026#39;s going to go, are we solving a problem or are we just making humans irrelevant? And in which case your business probably isn\u0026#39;t going to go very far. You\u0026#39;ve lost your customer base. We\u0026#39;re all just going to be gone.\u003c/p\u003e\n\n\u003cp\u003eSo I think it\u0026#39;s important to remember the human element. We talk about those who think in these terms. The most important thing about a company is its culture, but you could also say, is the culture that you\u0026#39;re facilitating through your products good? Can you be proud of it? Are you contributing to our existence? Are you solving amazing things? When we were at Netscape, we speculated so much about information freedom. People can know anything anywhere. And then we started to realize, but what if the internet turns into TV but worse? And well, one could argue that kind of happened, but still, I\u0026#39;ll never forget when during the Arab Spring, people were putting the Google DNS server as graffiti on walls, 8.8.8.8, because countries were trying to shut down the internet and people bypassed it and were able to talk to each other and communicate and get information.\u003c/p\u003e\n\n\u003cp\u003eAnd despite everything terrible that can happen on the internet, I\u0026#39;ll never forget that because the internet, much like many technologies, is just enabling people to be more who they are, but faster and at scale. And I think that ethical companies remember that and think about the products that they develop and why are they developing and what problems are they actually solving. At least I hope that they are. I like to think that we are, and others I worry about, but we can never forget. And it comes into our leadership values and how we bring up the leaders behind us. I think if we\u0026#39;re doing it right, now, you\u0026#39;ve got me really going off on a tangent here.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eShane Hastie\u003c/strong\u003e: A lot of deep good conversations in here. If people want to continue the conversation, where do they find you?\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eTara Hernandez\u003c/strong\u003e: Well, I definitely am on LinkedIn. I\u0026#39;ve kind of gotten off most of the other social media just because they\u0026#39;re deadly places. I\u0026#39;ve promised myself to start writing again. I\u0026#39;ve got some blogs on Medium, mostly talking about engineering, management, leadership and diversity and inclusion. I love doing things like this. I love nerding out with people about these types of topics and I hope they find those as well and maybe think about their own message and what they bring. Because if the tech industry has taught us anything in the past decades is that everybody has the potential of having a huge impact. A lot of it is luck, but there\u0026#39;s a lot of really smart people who get into this space, and I think everybody has the opportunity to do something amazing, and I hope they feel the responsibility of doing it amazingly good.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eShane Hastie\u003c/strong\u003e: Inspiring words. Thank you so much for taking the time to talk to us today.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eTara Hernandez\u003c/strong\u003e: Thank you so much for having me.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eMentioned\u003c/strong\u003e:\u003c/p\u003e\n\n\u003cul\u003e\n\t\u003cli\u003eBook: \u003ca href=\"https://itrevolution.com/product/accelerate/\"\u003eAccelerate\u003c/a\u003e\u003c/li\u003e\n\t\u003cli\u003eCharity Majors on the \u003ca href=\"https://www.infoq.com/presentations/hands-on-coding-managers/\"\u003eEngineer/Manager Pendulum\u003c/a\u003e\u003c/li\u003e\n\t\u003cli\u003eGoogle \u003ca href=\"https://rework.withgoogle.com/en/guides/understanding-team-effectiveness#introduction\"\u003eTeam Effectiveness studies\u003c/a\u003e\u003c/li\u003e\n\t\u003cli\u003eTara Hernandez on \u003ca href=\"https://www.linkedin.com/in/tara-hernandez/\"\u003eLinkedIn\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n  \n    \u003cdiv\u003e \n        \u003ch2\u003eAbout the Author\u003c/h2\u003e \n\n        \n            \n                \n            \n            \u003cdiv data-id=\"author-Tara-Hernandez\"\u003e\n                    \u003ch4\u003e\u003cstrong\u003eTara Hernandez\u003c/strong\u003e\u003c/h4\u003e\n                    \n                \u003c/div\u003e\n        \n    \u003c/div\u003e\n\n\t\t\t\t\t\t \u003c/div\u003e\u003cp\u003e\n\t\t\t\t\t\t\t\tYou can keep up-to-date with the podcasts via our \u003ca href=\"http://www.infoq.com/podcasts/building-human-centered-engineering-cultures/\" target=\"_blank\"\u003eRSS Feed\u003c/a\u003e, and they are available via\n\t\t\t\t\t\t\t\t\u003ca href=\"https://soundcloud.com/infoq-engineering-culture\" target=\"_blank\"\u003eSoundCloud\u003c/a\u003e,\n\t\t\t\t\t\t\t\t\u003ca href=\"https://itunes.apple.com/gb/podcast/engineering-culture-by-infoq/id1161431874?mt=2\" target=\"_blank\"\u003eApple Podcasts\u003c/a\u003e,\n\t\t\t\t\t\t\t\t\u003ca href=\"https://open.spotify.com/show/5YAzpmLjbNhQVVg7HkfIHP\" target=\"_blank\"\u003eSpotify\u003c/a\u003e,\n\t\t\t\t\t\t\t\t\u003ca href=\"https://overcast.fm/itunes1161431874/engineering-culture-by-infoq\" target=\"_blank\"\u003eOvercast\u003c/a\u003e\n\t\t\t\t\t\t\t\tand \u003ca href=\"https://youtube.com/playlist?list=PLndbWGuLoHeYaFgbuLnvO5Qab2pFBaSWX\u0026amp;si=CbKqeKewkXZSXYW-\" target=\"_blank\"\u003eYouTube\u003c/a\u003e.\n\t\t\t\t\t\t\t\tFrom this page you also have access to our recorded show notes. They all have clickable links that will take you directly to that part of the audio.\n\n\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "28 min read",
  "publishedTime": "2025-07-25T00:00:00Z",
  "modifiedTime": null
}
