{
  "id": "fc05b943-0d5f-4d8f-aade-37094413544f",
  "title": "Java Annotated Monthly – July 2025",
  "link": "https://blog.jetbrains.com/idea/2025/07/java-annotated-monthly-july-2025/",
  "description": "Welcome to the July edition of Java Annotated Monthly! This issue is packed with fresh articles, helpful tips, and ideas to keep you inspired and motivated in your work. We’re excited to feature Aicha Laafia, a Java engineer passionate about writing clean, green code and empowering women in tech. She’ll share how sustainable coding practices […]",
  "author": "Irina Mariasova",
  "published": "Fri, 04 Jul 2025 10:48:27 +0000",
  "source": "https://blog.jetbrains.com/feed",
  "categories": [
    "news",
    "ai",
    "frameworks",
    "java",
    "java-annotated",
    "java-annotated-monthly",
    "kotlin",
    "spring"
  ],
  "byline": "Irina Mariasova",
  "length": 10026,
  "excerpt": "Welcome to the July edition of Java Annotated Monthly! This issue is packed with fresh articles, helpful tips, and ideas to keep you inspired and motivated in your work. We’re excited to feature Ai",
  "siteName": "The JetBrains Blog",
  "favicon": "https://blog.jetbrains.com/wp-content/uploads/2024/01/cropped-mstile-310x310-1-180x180.png",
  "text": "IntelliJ IDEA – the IDE for Professional Development in Java and Kotlin NewsJava Annotated Monthly – July 2025 Welcome to the July edition of Java Annotated Monthly! This issue is packed with fresh articles, helpful tips, and ideas to keep you inspired and motivated in your work. We’re excited to feature Aicha Laafia, a Java engineer passionate about writing clean, green code and empowering women in tech. She’ll share how sustainable coding practices improve performance and reduce energy usage, and why mental well-being deserves just as much attention in our field. You’ll also get a first look at the new Spring Debugger in IntelliJ IDEA – a powerful tool that reveals what’s really going on inside your Spring Boot app and helps you fix issues faster. As always, we’ve gathered insightful notes on AI, upcoming events in July, and a few tech-adjacent thoughts to spark reflection and curiosity. Let’s dive in! 🚀 Featured Content  Aicha Laafia I’m Aicha Laafia, a Java software engineer with a love for coding, an interest in sustainability, and a commitment to empowering women in tech. I am a Women Techmakers and Girls Code ambassador, a member of the Moroccan Association of Computing Science, and part of the JetBrains Community Contributor program. I focus on creating software with minimal environmental impact while mentoring and supporting women in technology. When I’m not coding, I enjoy exploring delicious food, phone photography, and watching Formula 1. I’m excited to share what I’m passionate about: making Java apps not just clean and fast, but also greener and more efficient. Clean code keeps you sane at 2am. Green code keeps your infrastructure costs sane at scale. It’s also more interesting! You have to squeeze performance out of what you have with no sloppy code hiding behind overkill hardware. One of the biggest sources of wasted resources is start-up and warm-up time. Microservices and serverless functions spin up and down constantly. Every millisecond wasted during startup is wasted CPU cycles and energy. This is why I would love to introduce one of JDK 24’s game-changing features, Ahead-of-Time Class Loading (JEP 483). It preloads and links classes before runtime, slashing startup and warm-up lag. Faster startup means microservices waste fewer CPU cycles, directly cutting energy use in cloud-native environments. I’ve covered this in detail in my article JDK 24: Faster, Smarter, and Ready for the Future. Pair this with GraalVM 24.2’s native image capabilities – near-instant start-up and a low memory footprint – and you get serious energy savings and better performance. Looking ahead to JDK 25 and beyond, they’re adding some solid improvements for performance and efficiency: JEP 514 and JEP 515 bring better ergonomics and profiling for Ahead-of-Time compilation, making startup faster and CPU use smarter. I am super excited about JEP 521, which enhances Shenandoah GC with generational collection, cutting pause times and improving memory management. If you want to dive deeper into practical green coding with Java, check out my Green Programming 101 article series. If video is more your thing, here’s my recent live talk at vJUG: How to Build Sustainable Java Applications. Before I say goodbye, remember there’s one resource we often overlook: ourselves. Just like we monitor and optimize CPU and memory, it’s crucial to monitor your mental health and watch for burnout. It’s a hidden struggle many developers face. If you want to learn more, check out my article on The Duck Syndrome: A Hidden Struggle for IT Professionals. Enjoy this month’s Java Annotated Monthly. 🚀 Java News Check out the most recent news from the Java world:  Java News RoundUp 1, 2, 3, 4 Java 25 Encodes PEM – Inside Java Newscast #93 What’s new for JFR in JDK 25 See what JEPs are planned for Java 25: Java 25 Brings 18 JEPs Inside Java Newscast #92 JEP targeted to JDK 25: 470: PEM Encodings of Cryptographic Objects (Preview) JEP targeted to JDK 25: 508: Vector API (10th Incubator) JEP targeted to JDK 25: 507: Primitive Types in Patterns, instanceof, and switch (3rd Preview) JEP targeted to JDK 25: 514: Ahead-of-Time Command-Line Ergonomics JEP targeted to JDK 25: 506: Scoped Values Java 25 Integrates Compact Object Headers with JEP 519 Java Tutorials and Tips Learn new things and enjoy unique insights from industry experts:  Inside Java’s Language Renaissance Key Java Language Updates From 2020 to 2025 Getting the Most of Your Java Applications – The Value of Java for Enterprises Advanced Java Garbage Collection Concepts: Weak References, Finalization, and Memory Leaks Clean and Modular Java: A Hexagonal Architecture Approach Flexible Constructor Bodies: The End of Telescoping Builders? A Preview Feature from Project Amber STF Milestone 4: Parameterized test classes How to Configure Mockito Agent for Java 21+ Without Warning Java’s Structured Concurrency: Finally Finding Its Footing Java Concurrency Best Practices for MongoDB Java, What’s Old? Part I: Collections How to Identify the Underlying Causes of Connection Timeout Errors for MongoDB With Java How ReadyNow Improves Java Warmup Time  Beyond Objects and Functions: Exploring Data-Oriented Programming Kotlin Corner Everything you might have missed about Kotlin in June: KotlinConf 2025 Talks  Kodee’s Kotlin Roundup: A Carefully Curated June Edition Get Answers to Your KMP Questions AI Learn more about the most recent AI news, innovations, problems, and predictions: Agentic Coding Recommendations  AI Agent Delegation – You Can’t Delegate What You Don’t Control Deploy JetBrains Mellum Your Way: Now Available via NVIDIA NIM AI-Powered Learning, Part 2: Get Unstuck With AI Hints in Python and Kotlin Tasks Software Developers on AI: Insights and Opportunities What to Pack for Your GenAI Adventure Context Collection Competition by JetBrains and Mistral AI Expanding ADK Java LLM coverage with LangChain4j  Spotting Image Differences in Visual Software Testing with AI This AI Agent Should Have Been a SQL Query Midjourney Debuts V1 AI Video Model Foojay Podcast #74: JCON Report, Part 3 – AI, ChatGPT, LLM, ML, RAG, MCP, GenAI, and more! Will AI Agents Force Us to Finally Do Auth Right? My First Open Source AI Generated Library  LLMs bring new nature of abstraction Languages, Frameworks, Libraries, and Technologies Get to know programming technologies and frameworks better: This Week in Spring 1, 2, 3, 4 Demystifying Spring Boot With Spring Debugger Spring Boot + Kafka Streams: Event Routing \u0026 Testing MongoDB Aggregation Framework: A Beginner’s Guide A Bootiful Podcast: IntelliJ IDEA lead Aleksey Stukalov Nikolaos Vasiloglou on Knowledge Graphs and Graph RAG Intro to RAG: Foundations of Retrieval Augmented Generation, part 2 Rust: A Productive Language for Writing Database Applications Your Complete Guide to Diagnose Slow Queries in MongoDB Performance Best Practice No. 1: Optimize Database Operations Conferences and Events Visit these events in person or online in July: DevBcn – Barcelona, Spain, July 8-10 WeAreDevelopers World Congress – Berlin, Germany, July 9-11 Java Forum Stuttgart – Stuttgart, Germany, July 10 JConf Dominicana – Santo Domingo, Dominican Republic, July 18-19 Check out the recordings from the IntelliJ IDEA Conf 2025: IntelliJ IDEA Conf talks Culture and Community Take some time to think about the non-tech topics that are of significance to the tech community at the moment: In Praise of “Normal” Engineers Developer Joy: A Better Way to Boost Developer Productivity How to Develop Your Skills to Become a Principal Engineer Humans in the Loop: Engineering Leadership in a Chaotic Industry Productivity Through Play: Why Messing Around Makes Better Software Engineers How to Catch the Good Guys: My Learnings on Recruiting IT Security Professionals One Year In  Business Advice Plagued by Survivor Bias  And Finally… Don’t miss the latest updates from the IntelliJ IDEA team:  Demystifying Spring Boot With Spring Debugger K2 Mode Takes Off: High Adoption, Fewer Bugs, and Major Improvements in 2025.1 Text Blocks in Java: Perfect for Multiline Strings Migrate from Cursor to IntelliJ IDEA That’s it for today! We’re always collecting ideas for the next Java Annotated Monthly – send us your suggestions via email or X by July 20. Don’t forget to check out our archive of past JAM issues for any articles you might have missed! Subscribe to IntelliJ IDEA Blog updates Discover more",
  "image": "https://blog.jetbrains.com/wp-content/uploads/2025/07/IJ-social-BlogSocialShare-1280x720-2x-1.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n    \u003cdiv\u003e\n                        \u003ca href=\"https://blog.jetbrains.com/idea/\"\u003e\n                            \u003cimg src=\"https://blog.jetbrains.com/wp-content/uploads/2019/01/IntelliJ-IDEA-1.svg\" alt=\"Idea logo\"/\u003e\n                                                                                                \n                                                                                    \u003c/a\u003e\n                                                    \u003cp\u003eIntelliJ IDEA – the IDE for Professional Development in Java and Kotlin\u003c/p\u003e\n                                            \u003c/div\u003e\n                            \u003csection data-clarity-region=\"article\"\u003e\n                \u003cdiv\u003e\n                    \t\t\t\t\u003cp\u003e\u003ca href=\"https://blog.jetbrains.com/idea/category/news/\"\u003eNews\u003c/a\u003e\u003c/p\u003e\u003ch2 id=\"major-updates\"\u003eJava Annotated Monthly – July 2025\u003c/h2\u003e                    \n                    \n\u003cp\u003eWelcome to the July edition of Java Annotated Monthly! This issue is packed with fresh articles, helpful tips, and ideas to keep you inspired and motivated in your work.\u003c/p\u003e\n\n\n\n\u003cp\u003eWe’re excited to feature \u003ca href=\"https://medium.com/@aichalaafia1\" target=\"_blank\" rel=\"noopener\"\u003eAicha Laafia\u003c/a\u003e, a Java engineer passionate about writing clean, green code and empowering women in tech. She’ll share how sustainable coding practices improve performance and reduce energy usage, and why mental well-being deserves just as much attention in our field.\u003c/p\u003e\n\n\n\n\u003cp\u003eYou’ll also get a first look at the new \u003ca href=\"https://plugins.jetbrains.com/plugin/25302-spring-debugger\" target=\"_blank\" rel=\"noopener\"\u003eSpring Debugger\u003c/a\u003e in IntelliJ IDEA – a powerful tool that reveals what’s really going on inside your Spring Boot app and helps you fix issues faster.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs always, we’ve gathered insightful notes on AI, upcoming events in July, and a few tech-adjacent thoughts to spark reflection and curiosity. Let’s dive in! 🚀\u003c/p\u003e\n\n\n\n\u003ch2\u003eFeatured Content \u003c/h2\u003e\n\n\n    \u003cdiv\u003e\n                                                            \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://blog.jetbrains.com/wp-content/uploads/2025/07/c129-400o400o2-pqPgo3kTsdttmSkAUgimJz-e1751613991248.jpg\" alt=\"\" loading=\"lazy\"/\u003e\n                        \u003c/p\u003e\n                                        \u003cdiv\u003e\n                                                    \u003ch4\u003eAicha Laafia\u003c/h4\u003e\n                                                \n\u003cp\u003eI’m Aicha Laafia, a Java software engineer with a love for coding, an interest in sustainability, and a commitment to empowering women in tech. I am a Women Techmakers and Girls Code ambassador, a member of the Moroccan Association of Computing Science, and part of the JetBrains Community Contributor program.\u003c/p\u003e\n\n\u003cp\u003eI focus on creating software with minimal environmental impact while mentoring and supporting women in technology. When I’m not coding, I enjoy exploring delicious food, phone photography, and watching Formula 1.\u003c/p\u003e\n\n                    \u003c/div\u003e\n                            \u003c/div\u003e\n\n\n\n\u003cp\u003eI’m excited to share what I’m passionate about: making Java apps not just clean and fast, but also greener and more efficient.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cbr/\u003eClean code keeps you sane at 2am. Green code keeps your infrastructure costs sane at scale. It’s also more interesting! You have to squeeze performance out of what you have with no sloppy code hiding behind overkill hardware.\u003c/p\u003e\n\n\n\n\u003cp\u003eOne of the biggest sources of wasted resources is start-up and warm-up time. Microservices and serverless functions spin up and down constantly. Every millisecond wasted during startup is wasted CPU cycles and energy.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis is why I would love to introduce one of JDK 24’s game-changing features, Ahead-of-Time Class Loading (\u003ca href=\"https://openjdk.org/jeps/483\" target=\"_blank\" rel=\"noopener\"\u003eJEP 483\u003c/a\u003e). It preloads and links classes before runtime, slashing startup and warm-up lag. Faster startup means microservices waste fewer CPU cycles, directly cutting energy use in cloud-native environments. I’ve covered this in detail in my article \u003ca href=\"https://medium.com/@aichalaafia1/jdk-24-faster-smarter-and-ready-for-the-future-aa2430d9fafa\" target=\"_blank\" rel=\"noopener\"\u003eJDK 24: Faster, Smarter, and Ready for the Future\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cbr/\u003ePair this with \u003ca href=\"https://www.graalvm.org/\" target=\"_blank\" rel=\"noopener\"\u003eGraalVM \u003c/a\u003e24.2’s native image capabilities – near-instant start-up and a low memory footprint – and you get serious energy savings and better performance.\u003c/p\u003e\n\n\n\n\u003cp\u003eLooking ahead to JDK 25 and beyond, they’re adding some solid improvements for performance and efficiency:\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cbr/\u003e\u003ca href=\"https://openjdk.org/jeps/514\" target=\"_blank\" rel=\"noopener\"\u003eJEP 514\u003c/a\u003e and \u003ca href=\"https://openjdk.org/jeps/515\" target=\"_blank\" rel=\"noopener\"\u003eJEP 515\u003c/a\u003e bring better ergonomics and profiling for Ahead-of-Time compilation, making startup faster and CPU use smarter. I am super excited about \u003ca href=\"https://openjdk.org/jeps/521\" target=\"_blank\" rel=\"noopener\"\u003eJEP 521\u003c/a\u003e, which enhances Shenandoah GC with generational collection, cutting pause times and improving memory management.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you want to dive deeper into practical green coding with Java, check out my \u003ca href=\"https://medium.com/@aichalaafia1/list/green-programming-101-1f5b3cdede14\" target=\"_blank\" rel=\"noopener\"\u003eGreen Programming 101\u003c/a\u003e article series. If video is more your thing, here’s my recent live talk at vJUG: \u003ca href=\"https://www.youtube.com/watch?v=q6DM_sfRhpE\u0026amp;ab_channel=vJUG\" target=\"_blank\" rel=\"noopener\"\u003eHow to Build Sustainable Java Applications\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eBefore I say goodbye, remember there’s one resource we often overlook: ourselves. Just like we monitor and optimize CPU and memory, it’s crucial to monitor your mental health and watch for burnout. It’s a hidden struggle many developers face. If you want to learn more, check out my article on \u003ca href=\"https://medium.com/womenintechnology/the-duck-syndrome-a-hidden-struggle-for-it-professionals-12de6f67fb1f\" target=\"_blank\" rel=\"noopener\"\u003eThe Duck Syndrome: A Hidden Struggle for IT Professionals\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eEnjoy this month’s Java Annotated Monthly. 🚀\u003c/p\u003e\n\n\n\n\u003ch2\u003eJava News\u003c/h2\u003e\n\n\n\n\u003cp\u003eCheck out the most recent news from the Java world: \u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eJava News RoundUp \u003ca href=\"https://www.infoq.com/news/2025/06/java-news-roundup-jun02-2025/?utm_campaign=infoq_content\u0026amp;utm_source=infoq\u0026amp;utm_medium=feed\u0026amp;utm_term=global\" target=\"_blank\" rel=\"noopener\"\u003e1\u003c/a\u003e, \u003ca href=\"https://www.infoq.com/news/2025/06/java-news-roundup-jun09-2025/?utm_campaign=infoq_content\u0026amp;utm_source=infoq\u0026amp;utm_medium=feed\u0026amp;utm_term=global\" target=\"_blank\" rel=\"noopener\"\u003e2\u003c/a\u003e, \u003ca href=\"https://www.infoq.com/news/2025/06/java-news-roundup-jun16-2025/?utm_campaign=infoq_content\u0026amp;utm_source=infoq\u0026amp;utm_medium=feed\u0026amp;utm_term=global\" target=\"_blank\" rel=\"noopener\"\u003e3\u003c/a\u003e, \u003ca href=\"https://www.infoq.com/news/2025/06/java-news-roundup-jun23-2025/?utm_campaign=infoq_content\u0026amp;utm_source=infoq\u0026amp;utm_medium=feed\u0026amp;utm_term=global\" target=\"_blank\" rel=\"noopener\"\u003e4\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://inside.java/2025/06/19/newscast-93/\" target=\"_blank\" rel=\"noopener\"\u003eJava 25 Encodes PEM – Inside Java Newscast #93\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://inside.java/2025/06/03/new-jfr-jdk25/\" target=\"_blank\" rel=\"noopener\"\u003eWhat’s new for JFR in JDK 25\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eSee what JEPs are planned for Java 25:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://inside.java/2025/06/05/newscast-92/\" target=\"_blank\" rel=\"noopener\"\u003eJava 25 Brings 18 JEPs Inside Java Newscast #92\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://inside.java/2025/06/11/jep470-target-jdk25/\" target=\"_blank\" rel=\"noopener\"\u003eJEP targeted to JDK 25: 470: PEM Encodings of Cryptographic Objects (Preview)\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://inside.java/2025/06/13/jep508-targeted-to-jdk25/\" target=\"_blank\" rel=\"noopener\"\u003eJEP targeted to JDK 25: 508: Vector API (10th Incubator)\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://inside.java/2025/06/17/jep507-target-jdk25/\" target=\"_blank\" rel=\"noopener\"\u003eJEP targeted to JDK 25: 507: Primitive Types in Patterns, instanceof, and switch (3rd Preview)\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://inside.java/2025/06/26/jep514-target-jdk25/\" target=\"_blank\" rel=\"noopener\"\u003eJEP targeted to JDK 25: 514: Ahead-of-Time Command-Line Ergonomics\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://inside.java/2025/06/02/jep506-target-jdk25/\" target=\"_blank\" rel=\"noopener\"\u003eJEP targeted to JDK 25: 506: Scoped Values\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.infoq.com/news/2025/06/java-25-compact-object-headers/\" target=\"_blank\" rel=\"noopener\"\u003eJava 25 Integrates Compact Object Headers with JEP 519\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2\u003eJava Tutorials and Tips\u003c/h2\u003e\n\n\n\n\u003cp\u003eLearn new things and enjoy unique insights from industry experts: \u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://inside.java/2025/06/30/2025-06-30-inside-java-renaissance-part1/\" target=\"_blank\" rel=\"noopener\"\u003eInside Java’s Language Renaissance\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://inside.java/2025/06/06/key-java-language-updates/\" target=\"_blank\" rel=\"noopener\"\u003eKey Java Language Updates From 2020 to 2025\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://inside.java/2025/06/25/javaone-java-value/\" target=\"_blank\" rel=\"noopener\"\u003eGetting the Most of Your Java Applications – The Value of Java for Enterprises\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://dzone.com/articles/advanced-java-garbage-collection-concepts\" target=\"_blank\" rel=\"noopener\"\u003eAdvanced Java Garbage Collection Concepts: Weak References, Finalization, and Memory Leaks\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://foojay.io/today/clean-and-modular-java-a-hexagonal-architecture-approach/\" target=\"_blank\" rel=\"noopener\"\u003eClean and Modular Java: A Hexagonal Architecture Approach\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://neha-sardana.medium.com/flexible-constructor-bodies-the-end-of-telescoping-builders-a-preview-feature-from-project-amber-d183f3cfd0fa\" target=\"_blank\" rel=\"noopener\"\u003eFlexible Constructor Bodies: The End of Telescoping Builders? A Preview Feature from Project Amber\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://marcphilipp.de/blog/2025/06/07/stf-milestone-4-parameterized-test-classes/\" target=\"_blank\" rel=\"noopener\"\u003eSTF Milestone 4: Parameterized test classes\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://rieckpil.de/how-to-configure-mockito-agent-for-java-21-without-warning/\" target=\"_blank\" rel=\"noopener\"\u003eHow to Configure Mockito Agent for Java 21+ Without Warning\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://foojay.io/today/javas-structured-concurrency-finally-finding-its-footing/\" target=\"_blank\" rel=\"noopener\"\u003eJava’s Structured Concurrency: Finally Finding Its Footing\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://foojay.io/today/java-concurrency-best-practices-for-mongodb/\" target=\"_blank\" rel=\"noopener\"\u003eJava Concurrency Best Practices for MongoDB\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://foojay.io/today/java-whats-old-part-i-collections/\" target=\"_blank\" rel=\"noopener\"\u003eJava, What’s Old? Part I: Collections\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://foojay.io/today/how-to-identify-the-underlying-causes-of-connection-timeout-errors-for-mongodb-with-java/\" target=\"_blank\" rel=\"noopener\"\u003eHow to Identify the Underlying Causes of Connection Timeout Errors for MongoDB With Java\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://foojay.io/today/how-readynow-improves-java-warmup-time/\" target=\"_blank\" rel=\"noopener\"\u003eHow ReadyNow Improves Java Warmup Time\u003c/a\u003e \u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.infoq.com/articles/data-oriented-programming\" target=\"_blank\" rel=\"noopener\"\u003eBeyond Objects and Functions: Exploring Data-Oriented Programming\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2\u003eKotlin Corner\u003c/h2\u003e\n\n\n\n\u003cp\u003eEverything you might have missed about Kotlin in June:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://kotlinconf.com/talks/\" target=\"_blank\" rel=\"noopener\"\u003eKotlinConf 2025 Talks\u003c/a\u003e \u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://blog.jetbrains.com/kotlin/2025/07/kodees-kotlin-roundup-june-edition/\"\u003eKodee’s Kotlin Roundup: A Carefully Curated June Edition\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://blog.jetbrains.com/kotlin/2025/06/get-answers-to-your-kmp-questions/\"\u003eGet Answers to Your KMP Questions\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2\u003eAI\u003c/h2\u003e\n\n\n\n\u003cp\u003eLearn more about the most recent AI news, innovations, problems, and predictions:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://lucumr.pocoo.org/2025/6/12/agentic-coding/\" target=\"_blank\" rel=\"noopener\"\u003eAgentic Coding Recommendations\u003c/a\u003e \u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://blog.christianposta.com/cracks-in-our-identity-foundations/\" target=\"_blank\" rel=\"noopener\"\u003eAI Agent Delegation – You Can’t Delegate What You Don’t Control\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://blog.jetbrains.com/ai/2025/06/deploy-jetbrains-mellum-your-way-now-available-via-nvidia-nim/\"\u003eDeploy JetBrains Mellum Your Way: Now Available via NVIDIA NIM\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://blog.jetbrains.com/education/2025/06/02/ai-hints-plugin/\"\u003eAI-Powered Learning, Part 2: Get Unstuck With AI Hints in Python and Kotlin Tasks\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://blog.jetbrains.com/research/2025/06/software-developers-on-ai/\"\u003eSoftware Developers on AI: Insights and Opportunities\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.infoq.com/presentations/genai-product-management/?utm_campaign=infoq_content\u0026amp;utm_source=infoq\u0026amp;utm_medium=feed\u0026amp;utm_term=global\" target=\"_blank\" rel=\"noopener\"\u003eWhat to Pack for Your GenAI Adventure\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://blog.jetbrains.com/ai/2025/06/context-collection-competition/\"\u003eContext Collection Competition by JetBrains and Mistral AI\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://glaforge.dev/posts/2025/06/05/expanding-adk-java-llm-coverage-with-langchain4j/\" target=\"_blank\" rel=\"noopener\"\u003eExpanding ADK Java LLM coverage with LangChain4j\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.infoq.com/articles/spotting-image-differences-visual-software-testing-ai/?utm_campaign=infoq_content\u0026amp;utm_source=infoq\u0026amp;utm_medium=feed\u0026amp;utm_term=global\" target=\"_blank\" rel=\"noopener\"\u003e Spotting Image Differences in Visual Software Testing with AI\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.morling.dev/blog/this-ai-agent-should-have-been-sql-query/\" target=\"_blank\" rel=\"noopener\"\u003eThis AI Agent Should Have Been a SQL Query\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.infoq.com/news/2025/06/midjourney-v1-video/?utm_campaign=infoq_content\u0026amp;utm_source=infoq\u0026amp;utm_medium=feed\u0026amp;utm_term=global\" target=\"_blank\" rel=\"noopener\"\u003eMidjourney Debuts V1 AI Video Model\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://foojay.io/today/foojay-podcast-74/\" target=\"_blank\" rel=\"noopener\"\u003eFoojay Podcast #74: JCON Report, Part 3 – AI, ChatGPT, LLM, ML, RAG, MCP, GenAI, and more!\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://blog.christianposta.com/ai-agents-are-not-like-microservices-or-monoliths/\" target=\"_blank\" rel=\"noopener\"\u003eWill AI Agents Force Us to Finally Do Auth Right?\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://lucumr.pocoo.org/2025/6/21/my-first-ai-library/\" target=\"_blank\" rel=\"noopener\"\u003eMy First Open Source AI Generated Library\u003c/a\u003e \u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://martinfowler.com/articles/2025-nature-abstraction.html\" target=\"_blank\" rel=\"noopener\"\u003eLLMs bring new nature of abstraction\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2\u003eLanguages, Frameworks, Libraries, and Technologies\u003c/h2\u003e\n\n\n\n\u003cp\u003eGet to know programming technologies and frameworks better:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eThis Week in Spring \u003ca href=\"https://spring.io/blog/2025/06/03/this-week-in-spring-june-3rd-2025\" target=\"_blank\" rel=\"noopener\"\u003e1\u003c/a\u003e, \u003ca href=\"https://spring.io/blog/2025/06/10/this-week-in-spring-june-10th-2025\" target=\"_blank\" rel=\"noopener\"\u003e2\u003c/a\u003e, \u003ca href=\"https://spring.io/blog/2025/06/17/this-week-in-spring-june-17-2025\" target=\"_blank\" rel=\"noopener\"\u003e3\u003c/a\u003e, \u003ca href=\"https://spring.io/blog/2025/06/24/this-week-in-spring-june-24-2025\" target=\"_blank\" rel=\"noopener\"\u003e4\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://blog.jetbrains.com/idea/2025/06/demystifying-spring-boot-with-spring-debugger/\"\u003eDemystifying Spring Boot With Spring Debugger\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://foojay.io/today/spring-boot-kafka-streams-event-routing-testing/\" target=\"_blank\" rel=\"noopener\"\u003eSpring Boot + Kafka Streams: Event Routing \u0026amp; Testing\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://foojay.io/today/mongodb-aggregation-framework-a-beginners-guide/\" target=\"_blank\" rel=\"noopener\"\u003eMongoDB Aggregation Framework: A Beginner’s Guide\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://spring.io/blog/2025/06/05/a-bootiful-podcast-aleksey-stukalov\" target=\"_blank\" rel=\"noopener\"\u003eA Bootiful Podcast: IntelliJ IDEA lead Aleksey Stukalov\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.infoq.com/podcasts/knowledge-graphs-graph-rag/?utm_campaign=infoq_content\u0026amp;utm_source=infoq\u0026amp;utm_medium=feed\u0026amp;utm_term=global\" target=\"_blank\" rel=\"noopener\"\u003eNikolaos Vasiloglou on Knowledge Graphs and Graph RAG\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://foojay.io/today/intro-to-rag-foundations-of-retrieval-augmented-generation-part-2/\" target=\"_blank\" rel=\"noopener\"\u003eIntro to RAG: Foundations of Retrieval Augmented Generation, part 2\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.infoq.com/presentations/rust-database/?utm_campaign=infoq_content\u0026amp;utm_source=infoq\u0026amp;utm_medium=feed\u0026amp;utm_term=global\" target=\"_blank\" rel=\"noopener\"\u003eRust: A Productive Language for Writing Database Applications\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://foojay.io/today/your-complete-guide-to-diagnose-slow-queries-in-mongodb/\" target=\"_blank\" rel=\"noopener\"\u003eYour Complete Guide to Diagnose Slow Queries in MongoDB\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://foojay.io/today/performance-best-practise-no-1-optimize-database-operations/\" target=\"_blank\" rel=\"noopener\"\u003ePerformance Best Practice No. 1: Optimize Database Operations\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2\u003eConferences and Events\u003c/h2\u003e\n\n\n\n\u003cp\u003eVisit these events in person or online in July:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://www.devbcn.com/\" target=\"_blank\" rel=\"noopener\"\u003eDevBcn\u003c/a\u003e – Barcelona, Spain, July 8-10\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.wearedevelopers.com/world-congress\" target=\"_blank\" rel=\"noopener\"\u003eWeAreDevelopers World Congress\u003c/a\u003e – Berlin, Germany, July 9-11\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.java-forum-stuttgart.de/\" target=\"_blank\" rel=\"noopener\"\u003eJava Forum Stuttgart\u003c/a\u003e – Stuttgart, Germany, July 10\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://jconfdominicana.org/\" target=\"_blank\" rel=\"noopener\"\u003eJConf Dominicana\u003c/a\u003e – Santo Domingo, Dominican Republic, July 18-19\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eCheck out the recordings from the IntelliJ IDEA Conf 2025:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://youtube.com/playlist?list=PLPZy-hmwOdEV1aAV4qqXkqde7OpjsVLfb\u0026amp;si=_vowea6Mmqsx36Lg\" target=\"_blank\" rel=\"noopener\"\u003eIntelliJ IDEA Conf talks \u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2\u003eCulture and Community\u003c/h2\u003e\n\n\n\n\u003cp\u003eTake some time to think about the non-tech topics that are of significance to the tech community at the moment:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://charity.wtf/2025/06/19/in-praise-of-normal-engineers/amp/\" target=\"_blank\" rel=\"noopener\"\u003eIn Praise of “Normal” Engineers\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.infoq.com/articles/developer-joy-productivity/?utm_campaign=infoq_content\u0026amp;utm_source=infoq\u0026amp;utm_medium=feed\u0026amp;utm_term=global\" target=\"_blank\" rel=\"noopener\"\u003eDeveloper Joy: A Better Way to Boost Developer Productivity\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.infoq.com/news/2025/06/skill-principal-engineer/?utm_campaign=infoq_content\u0026amp;utm_source=infoq\u0026amp;utm_medium=feed\u0026amp;utm_term=global\" target=\"_blank\" rel=\"noopener\"\u003eHow to Develop Your Skills to Become a Principal Engineer\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.infoq.com/news/2025/06/infoq-dev-summit-aihype/?utm_campaign=infoq_content\u0026amp;utm_source=infoq\u0026amp;utm_medium=feed\u0026amp;utm_term=global\" target=\"_blank\" rel=\"noopener\"\u003eHumans in the Loop: Engineering Leadership in a Chaotic Industry\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.infoq.com/podcasts/productivity-play-better-software-engineers/?utm_campaign=infoq_content\u0026amp;utm_source=infoq\u0026amp;utm_medium=feed\u0026amp;utm_term=global\" target=\"_blank\" rel=\"noopener\"\u003eProductivity Through Play: Why Messing Around Makes Better Software Engineers\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.codecentric.de/en/knowledge-hub/blog/catching-the-good-guys\" target=\"_blank\" rel=\"noopener\"\u003eHow to Catch the Good Guys: My Learnings on Recruiting IT Security Professionals One Year In\u003c/a\u003e \u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://longform.asmartbear.com/survivor-bias/\" target=\"_blank\" rel=\"noopener\"\u003eBusiness Advice Plagued by Survivor Bias\u003c/a\u003e \u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2\u003eAnd Finally…\u003c/h2\u003e\n\n\n\n\u003cp\u003eDon’t miss the latest updates from the IntelliJ IDEA team: \u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://blog.jetbrains.com/idea/2025/06/demystifying-spring-boot-with-spring-debugger/\"\u003eDemystifying Spring Boot With Spring Debugger\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://blog.jetbrains.com/idea/2025/06/k2-mode-takes-off-high-adoption-fewer-bugs-and-major-improvements-in-2025-1/\"\u003eK2 Mode Takes Off: High Adoption, Fewer Bugs, and Major Improvements in 2025.1\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://blog.jetbrains.com/idea/2025/06/text-blocks-in-java-perfect-for-multiline-strings/\"\u003eText Blocks in Java: Perfect for Multiline Strings\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://blog.jetbrains.com/idea/2025/06/migrate-cursor-to-intellij-idea/\"\u003eMigrate from Cursor to IntelliJ IDEA\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eThat’s it for today! We’re always collecting ideas for the next Java Annotated Monthly – send us your suggestions via \u003ca href=\"https://mail.google.com/mail/u/0/?fs=1\u0026amp;tf=cm\u0026amp;source=mailto\u0026amp;to=JAM@jetbrains.com\" target=\"_blank\" rel=\"noopener\"\u003eemail\u003c/a\u003e or \u003ca href=\"https://x.com/intellijidea?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\" target=\"_blank\"\u003eX\u003c/a\u003e by July 20. Don’t forget to check out our archive of \u003ca href=\"https://www.jetbrains.com/lp/jam/\" target=\"_blank\" rel=\"noopener\"\u003epast JAM issues\u003c/a\u003e for any articles you might have missed!\u003c/p\u003e\n                    \n                                                                \n                                                                                                                                \u003cdiv\u003e\n                                \u003cdiv\u003e\n                                                                            \u003ch4\u003eSubscribe to IntelliJ IDEA Blog updates\u003c/h4\u003e\n                                                                                                            \n                                \u003c/div\u003e\n                                \n                                \u003cp\u003e\u003cimg src=\"https://blog.jetbrains.com/wp-content/themes/jetbrains/assets/img/img-form.svg\" alt=\"image description\"/\u003e\n                                                                    \u003c/p\u003e\n                            \u003c/div\u003e\n                                                            \u003c/div\u003e\n                \u003ca href=\"#\"\u003e\u003c/a\u003e\n                \n                \n            \u003c/section\u003e\n                    \u003cdiv\u003e\n                \u003cp\u003e\n                    \u003ch2\u003eDiscover more\u003c/h2\u003e\n                \u003c/p\u003e\n                \n            \u003c/div\u003e\n                \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": null,
  "modifiedTime": null
}
