{
  "id": "fcb78bcf-838f-4699-a7b8-afa08cf4ca7e",
  "title": "",
  "link": "http://scripting.com/2025/06/01.html#a142901",
  "description": "Good morning and welcome to June. Another month gone, and coincidentally the end of the NBA season. I woke up this morning with the worst hangover ever, and I haven't had a drink in months (never was my vice, I have others). The Knicks lost fair and square to the Indianas last night. My first message came from NakedJen who isn't as far as I know a Mets fan, saying simply \"Let's go Mets!\" I like that, though it will of course take me some time to get re-adjusted. I think the Knicks were jinxed because Brunson said in his podcast that New York has two teams, the Knicks (I agree) and the Yankees. What! No. I think we may have to consider trading him to a team without philosophy. I'm not sure anyone will have him though, considering this possibly fatal flaw, philosophy-wise. And no doubt the Knicks are going to change some things over the summer, and I've heard that they might try to get Kevin Durant. I sure hope not. I think the Knicks are benefiting from the jinx he put on himself when he tried in vain to stir up a \"rivalry\" between the Knicks and the Brooklyns. No, that isn't likely to happen, unless they try to become a contender without kicking the Knicks in the butt like KD did. Maybe the Portland Trail Blazers will want him. That's about as far from New York as you can get in the NBA. And with that I now officially shut the door on the 2024-25 NBA season. We had a great run. See you all in October! 😄",
  "author": "",
  "published": "Sun, 01 Jun 2025 14:29:01 GMT",
  "source": "http://scripting.com/rss.xml",
  "categories": null,
  "byline": "",
  "length": 1468,
  "excerpt": "Dave Winer, OG blogger, podcaster, developed first apps in many categories. Old enough to know better. It's even worse than it appears.",
  "siteName": "Scripting News",
  "favicon": "",
  "text": "It's even worse than it appears.. Good morning and welcome to June. Another month gone, and coincidentally the end of the NBA season. I woke up this morning with the worst hangover ever, and I haven't had a drink in months (never was my vice, I have others). The Knicks lost fair and square to the Indianas last night. My first message came from NakedJen who isn't as far as I know a Mets fan, saying simply \"Let's go Mets!\" I like that, though it will of course take me some time to get re-adjusted. I think the Knicks were jinxed because Brunson said in his podcast that New York has two teams, the Knicks (I agree) and the Yankees. What! No. I think we may have to consider trading him to a team without philosophy. I'm not sure anyone will have him though, considering this possibly fatal flaw, philosophy-wise. And no doubt the Knicks are going to change some things over the summer, and I've heard that they might try to get Kevin Durant. I sure hope not. I think the Knicks are benefiting from the jinx he put on himself when he tried in vain to stir up a \"rivalry\" between the Knicks and the Brooklyns. No, that isn't likely to happen, unless they try to become a contender without kicking the Knicks in the butt like KD did. Maybe the Portland Trail Blazers will want him. That's about as far from New York as you can get in the NBA. And with that I now officially shut the door on the 2024-25 NBA season. We had a great run. See you all in October! 😄#",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"idPageTopText\"\u003e\n\t\n\t\u003cp\u003eIt\u0026#39;s even worse than it appears..\u003c/p\u003e\n\t\u003c/div\u003e\u003cdiv id=\"idDayContainer\"\u003e\n\t\t\t\t\n\u003cp\u003e\u003ca name=\"a142901\"\u003e\u003c/a\u003e\u003cimg src=\"https://imgs.scripting.com/2021/09/05/goneWithTheWind.png\"/\u003eGood morning and welcome to June. Another \u003ca href=\"https://github.com/scripting/Scripting-News/blob/master/blog/opml/2025/05.opml\"\u003emonth gone\u003c/a\u003e, and coincidentally the end of the NBA season. I woke up this morning with the worst hangover ever, and I haven\u0026#39;t had a drink in months (never was my vice, I have others). The Knicks lost fair and square to the Indianas last night. My first message came from NakedJen who isn\u0026#39;t as far as I know a Mets fan, saying simply \u0026#34;Let\u0026#39;s go Mets!\u0026#34; I like that, though it will of course take me some time to get re-adjusted. I think the Knicks were jinxed because Brunson said in \u003ca href=\"https://podcasts.apple.com/us/podcast/episode-highlight-jalen-josh-explain-why-the-yankees/id1729497779?i=1000710590814\"\u003ehis podcast\u003c/a\u003e that New York has two teams, the Knicks (I agree) and the Yankees. What! No. I think we may have to consider trading him to a team without \u003ca href=\"https://daytona.scripting.com/search?q=philosophy\"\u003ephilosophy\u003c/a\u003e. I\u0026#39;m not sure anyone will have him though, considering this possibly fatal flaw, philosophy-wise. And no doubt the Knicks are going to change some things over the summer, and I\u0026#39;ve heard that they might try to get \u003ca href=\"https://daytona.scripting.com/search?q=%22kevin%20durant%22\"\u003eKevin Durant\u003c/a\u003e. I sure hope not. I think the Knicks are benefiting from \u003ca href=\"https://www.reddit.com/r/nba/comments/dern8c/kevin_durant_explains_why_free_agents_wont_join/\"\u003ethe jinx\u003c/a\u003e he put on himself when he tried in vain to stir up a \u0026#34;rivalry\u0026#34; between the Knicks and the Brooklyns. No, that isn\u0026#39;t likely to happen, unless they try to become a contender without kicking the Knicks in the butt like KD did. Maybe the \u003ca href=\"https://en.wikipedia.org/wiki/Portland_Trail_Blazers\"\u003ePortland Trail Blazers\u003c/a\u003e will want him. That\u0026#39;s about as \u003ca href=\"https://www.google.com/maps/dir/New+York,+NY/Portland,+OR/@41.7399086,-119.4458701,4z/data=!3m1!4b1!4m14!4m13!1m5!1m1!1s0x89c24fa5d33f083b:0xc80b8f06e177fe62!2m2!1d-74.0059728!2d40.7127753!1m5!1m1!1s0x54950b0b7da97427:0x1c36b9e6f6d18591!2m2!1d-122.6783853!2d45.515232!3e0?entry=ttu\u0026amp;g_ep=EgoyMDI1MDUyOC4wIKXMDSoASAFQAw%3D%3D\"\u003efar\u003c/a\u003e from New York as you can get in the NBA. And with that I now officially shut the door on the 2024-25 NBA season. We had a great run. See you all in October! \u003cspan\u003e😄\u003c/span\u003e\u003cspan\u003e\u003ca href=\"http://scripting.com/2025/06/01.html#a142901\" title=\"Direct link to this item.\"\u003e#\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
