[
  {
    "id": "52273226-b72a-47ad-b223-19ea09e6865d",
    "title": "Best Makeup To Shop from the Sephora Sale",
    "link": "https://thebeautylookbook.com/2024/11/best-makeup-to-shop-from-the-sephora-sale.html",
    "description": "Best Makeup To Shop from the Sephora Sale - Holiday 2024. Rounding up my top 3 favorites in each makeup category. Sale starts 11/1!",
    "author": "Sabrina",
    "published": "Fri, 01 Nov 2024 18:00:25 +0000",
    "image": "https://thebeautylookbook.com/wp-content/uploads/2022/04/Sephora-Beautylookbook-7-NARS-Concealers.jpg",
    "source": "https://thebeautylookbook.com/feed",
    "categories": [
      "\u003ca href='https://thebeautylookbook.com/category/sales' target='_blank' style='color:currentColor;text-decoration:none;'\u003eSales\u003c/a\u003e",
      "Sephora"
    ]
  },
  {
    "id": "2bdfe2f4-2ba7-4eab-a350-473e86c948c0",
    "title": "Westman Atelier Holiday Sets 2024",
    "link": "https://thebeautylookbook.com/2024/10/westman-atelier-holiday-sets-2024.html",
    "description": "Westman Atelier Holiday Sets 2024. A look at the beautiful limited-edition creations from Westman Atelier this year.",
    "author": "Sabrina",
    "published": "Wed, 30 Oct 2024 13:06:20 +0000",
    "image": "https://thebeautylookbook.com/wp-content/uploads/2024/10/Westman-Atelier-Holiday-Sets-2024-BEAUTYLOOKBOOK.jpg",
    "source": "https://thebeautylookbook.com/feed",
    "categories": [
      "\u003ca href='https://thebeautylookbook.com/category/brand/westman-atelier' target='_blank' style='color:currentColor;text-decoration:none;'\u003eWestman Atelier\u003c/a\u003e",
      "Westman Atelier"
    ]
  },
  {
    "id": "294d7b4b-a042-4aa7-bb17-5324d2d432ab",
    "title": "The 15 Best Thickening Products to Strengthen Thin, Weak Hair",
    "link": "https://www.elle.com/beauty/hair/g41821867/best-hair-thickening-products/",
    "description": "Mega volume and shine are just a spritz (or rinse) away.",
    "author": "",
    "published": "Wed, 06 Nov 2024 21:37:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/beauty.xml/",
    "categories": null
  },
  {
    "id": "77a37a2d-59ca-440d-8f6e-a255ef2c07a7",
    "title": "The 8 Best Heated Round Brushes for the Hair of Your Dreams",
    "link": "https://www.elle.com/beauty/hair/g60925620/best-heated-round-brush/",
    "description": "Get a bouncy blowout in minutes.",
    "author": "",
    "published": "Wed, 06 Nov 2024 19:54:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/beauty.xml/",
    "categories": null
  },
  {
    "id": "d47dbfe4-971f-4028-8321-053bd5625ef8",
    "title": "The 23 Best Beauty Products Fashionista Editors Tried in October",
    "link": "https://fashionista.com/2024/11/fashionista-editors-favorite-beauty-products-october-2024",
    "description": "Each month, Fashionista editors try a *lot* of beauty products. And while not every formula we test is a winner, we're constantly unearthing new favorites. Here, we've rounded up our latest hair, skin, fragrance, wellness and makeup discoveries — whether fresh-to-market drops or merely recent ...Continue reading",
    "author": "Catie Pusateri",
    "published": "Fri, 01 Nov 2024 12:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjEwMzMwNDQ4Njk2NDUyNjg2/october-2024-fashionista-beauty-picks.jpg",
    "source": "https://fashionista.com/.rss/excerpt/beauty",
    "categories": [
      "beauty products",
      "Beauty",
      "Summer Fridays",
      "Prequel",
      "Being Frenshe",
      "Merit Beauty",
      "Canopy",
      "Typology",
      "Aquaphor",
      "Network",
      "Tower 28",
      "Eadem",
      "Moroccanoil",
      "Best Beauty Products Of The Month",
      "Pattern By Tracee Ellis Ross",
      "Editors' Picks",
      "Cocokind",
      "Beauty",
      "DHC",
      "ZitSticka",
      "Superegg",
      "Olive \u0026 June",
      "Loewe",
      "ColourPop",
      "Rem Beauty",
      "Shopping",
      "Glossier",
      "La Roche-posay",
      "Allies Of Skin"
    ]
  },
  {
    "id": "3a9d712b-c665-4e41-80d1-ddb40b4617af",
    "title": "How to to Pitch Your Brand or Retailer to Fashionista",
    "link": "https://fashionista.com/2024/10/how-to-pitch-fashionista-editors-fashion-beauty-retail",
    "description": "At Fashionista, we've always been passionate about independent and emerging brands and small boutiques. We believe they represent the future of the industry, and the future of this website. So, we're doubling down on covering (and servicing) this segment of the industry, in which (not to brag or ...Continue reading",
    "author": "Dhani Mau",
    "published": "Thu, 31 Oct 2024 19:30:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjEwMzExOTU5Mzk5MTEzOTMy/fashionista-logo.jpg",
    "source": "https://fashionista.com/.rss/excerpt/beauty",
    "categories": [
      "retail",
      "Store Front",
      "Indie Fashion",
      "Company Profile",
      "Careers",
      "PR",
      "Fashionista Announcement",
      "Wellness",
      "Brand Bio",
      "emerging designers",
      "Beauty",
      "Stores",
      "How To Pitch",
      "News",
      "Network",
      "Boutique",
      "e-commerce",
      "Indie Beauty",
      "Designers",
      "shopping",
      "Business"
    ]
  },
  {
    "id": "079229c6-5fa0-4169-a54b-7b7bb5cf5bc4",
    "title": "Nordstrom Anniversary Sale Haul Try-On",
    "link": "http://www.frmheadtotoe.com/2020/08/nordstrom-anniversary-sale-try-on.html",
    "description": "",
    "author": "Jen",
    "published": "2020-08-17T12:17:00.016-07:00",
    "image": "",
    "source": "http://feeds.feedburner.com/frmheadtotoe",
    "categories": [
      "Nordstrom Anniversary Sale"
    ]
  },
  {
    "id": "fdfcaf26-d813-4de2-86fa-4a359dee88aa",
    "title": "Best In-Stock Items! Nordstrom Anniversary Sale Picks 2020",
    "link": "http://www.frmheadtotoe.com/2020/08/best-in-stock-items-nordstrom.html",
    "description": "",
    "author": "Jen",
    "published": "2020-08-13T11:38:00.002-07:00",
    "image": "",
    "source": "http://feeds.feedburner.com/frmheadtotoe",
    "categories": [
      "Nordstrom Anniversary Sale"
    ]
  },
  {
    "id": "2892060a-bc2a-412e-b5aa-75e6e656de9b",
    "title": "The Perfect Holiday Gift",
    "link": "https://intothegloss.com/2024/10/holiday-gift-guide-2024/",
    "description": "Something for everyone",
    "author": "",
    "published": "Wed, 30 Oct 2024 10:30:00 -0400",
    "image": "",
    "source": "https://feeds.feedburner.com/intothegloss/oqoU",
    "categories": null
  },
  {
    "id": "ab5ab901-14ac-49e5-946b-942fced95ea9",
    "title": "Parading Around With The New York Liberty’s Breanna Stewart",
    "link": "https://intothegloss.com/2024/10/breanna-stewart-new-york-liberty-wnba-parade/",
    "description": "The WNBA star celebrated a historic win with a 4-step lip and rare Pumas",
    "author": "",
    "published": "Sun, 27 Oct 2024 10:00:00 -0400",
    "image": "",
    "source": "https://feeds.feedburner.com/intothegloss/oqoU",
    "categories": null
  },
  {
    "id": "6b4c50ec-c1e9-459c-96d7-2432be8c781c",
    "title": "How To Shop Sephora’s Holiday Savings Event Like A Beauty Editor",
    "link": "https://www.refinery29.com/en-us/sephora-holiday-savings-event-sale-products?utm_source=feed\u0026utm_medium=rss",
    "description": ".disclaimer{width:90%;margin-bottom:1rem}.disclaimer__lines{width:100%;margin:0 auto;border-bottom:1px solid #999;padding:0;max-width:150px}.disclaimer__copy{width:100%;max-width:355px;font-family:Brown Regular,sans-serif;font-size:.9rem;font-weight:300;line-height:1.3em;color:#333;padding:0 0 .4rem;margin:1rem auto;text-align:center} All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. The holidays have arrived early at Sephora, and by that, we mean that the retailer’s highly-anticipated savings event is back (and officially open to the public) for 2024. Whether you’re eyeing the bevy of sparkly gift sets or looking to repurchase your favorite luxe moisturizer, the Sephora’s Holiday Savings Event is the time to do just that. Anyone who’s shopped Sephora’s sales before knows the rules, but if you’re new here, this is the run-down: Depending on your Beauty Insider membership tier (which goes from Insider, VIB, and Rouge depending on how much you spend annually), you can get 10, 15, or 20% off, respectively. Rouge members can start shopping on November 1, and both VIBs and Insiders on November 5. All tiers have until November 11 to use the promo code SAVINGS at checkout, which automatically applies the discount according to your membership tier. (Regardless of tier, all Beauty Insider levels can take 30% off all Sephora Collection products from November 1 to November 11, no code needed.) As with previous years, there is some fine print to keep in mind as you plan your Sephora haul: Shoppers are limited to one Dyson item (choose wisely), one Shark Beauty item, and three Nutrafol items per transaction. The Ordinary products, MAC Cosmetics VIVA GLAM products, in-store services, previous purchases, and gift cards are also not eligible for a discount.  Now that you have the rules of the road, onto the fun part: Keep scrolling for the most worth-it items to snag during the sale. DashDividers_1_500x100 Sephora Favorites Bold and Blushing Blush and Lip Set Another major perk of Sephora’s holiday savings event: Snapping up gift sets at a discount. Our choice pick: This assortment of full- and mini-size blush and lip products from brands like Danessa Myricks, Pat McGrath, and Patrick Ta — already a serious steal at $42 before discounts. Shark FlexFusion™ Luxury Air \u0026 Ceramic Styling Hair Dryer System  We recently reviewed Shark’s latest hair tool launch, and it surpassed our expectations with flying colors. Sephora also stocks both the straightener and diffuser systems, but this version comes with several attachments — curling barrels, smoothing brush, finishing tool, and a concentrator nozzle — to achieve a variety of looks. Make Up For Ever Artist Color Pencil Longwear Lip Liner Anywhere Caffeine, Wherever Walnut, Endless Cacao…the list of beloved shades of this Make Up For Ever pencil goes on and on. From makeup artists to beauty tastemakers like Hailey Bieber and Suni Lee, these beautifully pigmented, long-lasting pencils are always a good idea to stock up on — especially if you can nab them at a discount. Patrick Ta Major Dimension Eye Illusion Eyeshadow Duos Celebrity makeup artist Patrick Ta only recently launched these shimmering eyeshadow duos, and they’ve already begun to make waves online. If we had a beauty crystal ball, we would forecast that these will be quite the hot commodity for holiday makeup looks this season. Sol de Janiero Cheirosa Perfume Travel Minis Set Can’t choose a favorite Sol de Janeiro fragrance? With this set, you don’t need to. Featuring the brand’s most popular Cheirosa scents, this quartet of mists is already a steal at $34 — and that’s at full price. Olehenriksen Pout Preserve Hydrating Peptide Lip Treatment There is stiff competition in the world of tinted lip butters, balms, and treatments — but this Ole Henriksen one continues to stand out from its competition time and time again. From luminous pinks to decadent cocoa, there’s a shade (including crystal clear) for everyone to stock up on this sale. Glow Recipe Blackberry Retinol Blemish Serum Another recent editor-favorite launch comes in the form of Glow Recipe’s new Blackberry Retinol Blemish Serum, which gently yet effectively sloughs off dead skin cells before they get a chance to cause breakouts and dullness. Don’t miss out on trying it for yourself, and at a discount! Sephora Collection Best Skin Ever Full Coverage Multi-Use Hydrating Concealer If you’ve been sleeping on Sephora’s in-house range of products, now’s the time to wake up. One of our choice picks is the Best Skin Ever concealer, which has been lauded as a dupe for high-end brands. It’s creamy, blendable, and provides full coverage with a natural finish — and at only $11 and change during the sale. K18 Biomimetic Hairscience Molecular Repair Hair Oil K18 launched its hair oil in 2023, and it’s been a staple in my routine ever since. I’ve yet to find a more concentrated, hydrating formula that makes my hair smooth and super shiny. A little goes a long way, but this sale is a great time to stretch your savings by knocking dollars off the $65 price tag. Rare Beauty Soft Pinch Liquid Blush, $23 Rare Beauty’s liquid blush is intensely pigmented, available in gorgeous shades for every skin tone, and is utterly giftable as a perfect stocking stuffer. Like what you see? How about some more R29 goodness, right here?This Is The Biggest Beauty Fundraiser Of The YearWhat To Buy From Amazon's Holiday Beauty Haul SaleThe Best Under-$25 Hidden Gems At Sephora",
    "author": "Karina Hoshikawa",
    "published": "Wed, 06 Nov 2024 18:00:30 +0000",
    "image": "https://www.refinery29.com/images/11803448.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/beauty/rss.xml",
    "categories": null
  },
  {
    "id": "6032bfdc-87a0-43e6-99a3-e5981c348be3",
    "title": "Love Island USA: Serena Page And JaNa Craig Spill The Tea On Black Women Redefining Reality TV",
    "link": "https://www.refinery29.com/en-us/2024/11/11805435/serena-page-jana-craig-love-island-usa-go-off-sis-beautycon-recap?utm_source=feed\u0026utm_medium=rss",
    "description": "“I did not know it would be a thing,” Serena Page confesses, reflecting on the style and maintenance of her goddess braids that took the Love Island USA villa by storm. The reality star and her best friend JaNa Craig recently joined Refinery29’s Unbothered podcast Go Off, Sis during a live recording at Beautycon to spill the tea on their journey from the villa to their burgeoning careers. As the show’s winner, fans were amazed at how Page effortlessly maintained her hair in the humid weather throughout the show’s entirety. Her braids weren’t just a fashion statement; they were a symbol of community and connection among viewers. A former braider herself, Page didn’t anticipate the significant impact her hair would have on viewers until she returned home. She insists that experimenting with different hairstyles and looks is a form of self-expression. “I simply didn’t feel like dealing with a lace for 10 weeks on the show and didn’t know what the weather would be like. Braids are the only thing I can upkeep, and I needed something that I could switch up a lot. Before the villa, I had a new hairstyle every two weeks. Now, it’s a little more frequent. I express myself through my hair,” Page said. Despite the negativity, their sisterhood captivated viewers, becoming a fan favorite, often overshadowing the romantic drama. Her passion for hair has ignited her entrepreneurial spirit, leading the reality star to her next big venture: launching a hair care brand in 2025. Tailored specifically to the needs of Black women and their protective styles, the brand aims to revolutionize the industry. It’s no secret that our crowns symbolize heritage, as Black hairstyles are deeply rooted in African traditions and have been passed down through generations. Although she kept the specifics under wraps at Beautycon, Page assured fans that the launch is happening soon. On the other hand, while fans admired Craig’s flawless makeup looks, enduring 24-hour filming days in Fiji’s heat, it was post-villa that her beauty game truly evolved. The former Love Island USA contestant told co-host Unbothered VP Chelsea Sanders that she’s recently embraced blush and opted for more natural-looking lashes. As the conversation turned to friendship, co-host and Unbothered Global Deputy Director Kathleen Newman Bremang addressed the unfortunate reality of online trolls targeting the beloved “Power Puff Gang” (PPG) – Page, Craig, and Leah Kateb. Despite the negativity, their sisterhood captivated viewers, becoming a fan favorite, often overshadowing the romantic drama. However, their friendship was put to the ultimate test when online haters targeted Kateb with racist accusations. Page immediately shut down those rumors by defending her friend and highlighting Kateb’s unwavering support for both of them. “Leah is more in our corner than anybody,” she told the crowd. “She don’t play about us. I love Leah, and Leah loves us. She always protects us in any way she can, even if that means utilizing her platform.” When discussing their Love Island USA experience, the duo acknowledged the unfortunate trend of Black women facing early elimination or romantic struggles on reality dating shows. Because of this, they entered the villa with lowered expectations; however, once they connected, they knew their experience would be different in a positive way. And they were right!  Not only did they form a strong bond with each other, but they also found love. Since leaving the island, Page, and partner Kordell Beckham have jointly collaborated with major brands like Spotify, Bumble, Topicals, and Dunkin’ Donuts, to name a few. When deciding which brands to collaborate with, Page revealed that she and Beckham ensure that the collaboration aligns with their morals before accepting any offers, ensuring it resonates with their personal brands. Craig, who has also worked with brands like Dunkin Donuts and Agua De Kefir, shared similar sentiments about how she and boyfriend Kenny Rodriguez agree on which partnerships to film together. Reflecting on their pre-reality TV lives, Craig shared her entrepreneurial journey as a lash business owner, real estate investor, personal trainer, and day trader. Page, a former ASL interpreter, educator, and media planner, encouraged audiences to explore their passions, as they never know where they might lead. Unlike most cases, Page and Craig didn’t have to choose between leaving with a romantic partner or financial security. They secured both. As their influence and popularity grow, Page and Craig are using their platform to inspire the next generation of creators. Recognizing the many challenges Black women face in the industry and in the face of adversity, they encourage aspiring influencers to stay true to themselves and embrace their individuality. Their main advice for rising entrepreneurs and influencers is to approach their endeavors with courage, creativity, and a dedicated commitment to their craft, emphasizing the importance of perseverance and embracing opportunities. “You’ve got to be consistent,” Craig said. “… You’ve got to take the risks in life. You only have one life to live. And if you fail, at least when you’re 90 years old, you can look back and be proud that you tried rather than live with regret.” By fearlessly stepping onto Love Island USA as two of the few brown-skinned women, Page and Craig challenged the historically negative portrayal of Black women on reality dating shows. Embracing their authentic selves, they set a new standard for future reality TV, proving that Black women can thrive and succeed without settling for less. Unlike most cases, Page and Craig didn’t have to choose between leaving with a romantic partner or financial security. They secured both, and we love to see it. Like what you see? How about some more R29 goodness, right here?The Love Island USA Reunion Missed The MarkWhy Do So Many Black Women Love White Reality TV?R29 Beautycon: A New Era in Experiential Beauty",
    "author": "Giana Levy",
    "published": "Tue, 05 Nov 2024 22:20:49 +0000",
    "image": "https://www.refinery29.com/images/11805725.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/beauty/rss.xml",
    "categories": null
  },
  {
    "id": "7b76569e-fd34-407e-b24a-90b1684e6aef",
    "title": "What we have written",
    "link": "https://thebeautybrains.com/2024/03/this-is-a-test/",
    "description": "Here is the beauty brains test blog page",
    "author": "Perry Romanowski",
    "published": "Mon, 04 Mar 2024 22:05:47 +0000",
    "image": "",
    "source": "https://thebeautybrains.com/blog/feed/",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "8be8ba7c-644f-48cc-9416-80933b6bc400",
    "title": "Is scalp exfoliation helpful for hair? episode 226",
    "link": "https://thebeautybrains.com/2020/07/6890/",
    "description": "Welcome to the Beauty Brains, a show where real cosmetic chemists answer your beauty product questions and give you an insider’s look at the cosmetic industry. This is Episode 226. Hosts Perry Romanowski, and Valerie George Is glycerin bad for curly hair? Are encapsulated ingredients better? Do scalp exfoliators help? Can beauty companies hide allergens […]",
    "author": "Perry Romanowski",
    "published": "Thu, 02 Jul 2020 17:22:57 +0000",
    "image": "http://thebeautybrains.com/wp-content/uploads/podcast/Episode226.mp3",
    "source": "https://thebeautybrains.com/blog/feed/",
    "categories": [
      "Podcast"
    ]
  },
  {
    "id": "ac26de7b-9ca5-4508-a9b8-dc80567a8aa5",
    "title": "13 Easy Hair Buns to Spice Up Your Everyday Look",
    "link": "https://www.popsugar.com/beauty/easy-hair-buns-49318105",
    "description": "One of the easiest ways to transform your look is by switching up your go-to hairstyle. Of course, getting a new trendy haircut, like the \"mixie\" or the ubiquitous \"octopus,\" will surely make an impact, but that big of a chance is not for the faint of heart. Nothing matches the ease and versatility of incorporating more looks, like easy hair buns, into your daily rotation. While you can always brush up on your braiding skills and break out the hot tools now and then, it's hard to beat this classic updo. Your options for easy hair bun styles are plentiful. The timeless look offers a chic and quick fix to all hair woes, as it can be worn by people of all hair types, textures, and lengths. From an effortless messy bun to a half-up bun and even quick-to-achieve side bun hairstyles, all you need is a little bit of inspiration and some hair ties to get you started. Ahead, we've rounded up a variety of hair bun styles requiring no previous experience to pull together. Whether you're searching for braid bun hairstyles for a fun night out with friends, or just want to elevate one of your typical bun hairstyles, you'll find a look that suits your needs and aligns perfectly with your style. Keep reading to discover just how many different easy bun hairstyles there are to choose from for long hair, curls, and even lobs.",
    "author": "Ina Bansal",
    "published": "Wed, 06 Nov 2024 13:35:02 -0800",
    "image": "https://media1.popsugar-assets.com/files/thumbor/tTpoaO03L3dqd0mD60PvUFpI3nI/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2023/11/21/240/n/1922153/82586051655d8784299c49.90567399_.jpg",
    "source": "https://www.popsugar.com/beauty/feed",
    "categories": [
      "Long Hairstyles",
      "Hair",
      "Updos"
    ]
  },
  {
    "id": "de8fb4e3-b3d4-4a51-ac8a-acd2ff185261",
    "title": "28 Matte Nail Ideas to Level Up Your Manicure",
    "link": "https://www.popsugar.com/beauty/matte-nail-ideas-49129998",
    "description": "Of all the year's biggest nail trends, there's one that everyone on social media is suddenly raving about again: matte nails. That's right, the manicure finish is officially in its comeback era. Think of it like the edgier cousin of the high-shine looks you know and love that can make textures and nail-art designs really pop. Unlike classic trends like the \"rich girl\" designs you've been seeing everywhere, matte nails are timeless. The satiny finish adds a flatness to any nail look and is versatile enough to pair with all designs, including hearts, swirls, smiley faces, and even the classic french manicure. The best part? This style is a year-round staple, with colder months championing darker shades like burgundy, emerald green, or deep brown, while the warmer parts of the year often see more mood-boosting hues. If you want to take things up a notch, there's always the option for matte nail art, too. You can expect to see all kinds of matte nail ideas taking over your social feeds, whether it's dark hues, pastels, or something else entirely. You may even spot some out-of-the-box matte nail art designs like clouds or geometric shapes. Whether you want to go bold or keep things simple and classic, there are no limits to what you can do with matte nail designs. Here's everything else you need to know about the comeback trend, as well as some manicure ideas you can bring with you to your next salon appointment. Best Matte Nail-Polish Topcoats What we really love about matte nails is how easy it is to create the finish at home or, if you'd like a more complicated design, take it to the salon. Giving yourself a DIY manicure doesn't mean you have to stock up on matte colors, either. Grabbing a topcoat with a matte finish will provide equally flawless results while allowing you to continue using your favorite shades. Some of our favorites include the Essie Gel Couture Long-Lasting Nail Polish ($10), OPI Matte Top Coat ($11), Beetles Gel No Wipe Matte Top Coat ($7), and Sally Hansen Miracle Gel Nail Polish Matte Top Coat ($10). For anyone on a budget, we also recommend the Wet n Wild Matte Top Coat ($1). Best Matte Nail Colors There is no limit to the color options for this staple trend; you can adapt them to your aesthetic. If you're on the hunt for a more grungy look, consider reds and blacks, or opt for pastels and neutral shades if you're after a soft, delicate look. Neon colors will brighten your entire disposition and allow you to add bold patterns and designs to your manicure.",
    "author": "Rylee Johnston",
    "published": "Wed, 06 Nov 2024 13:05:03 -0800",
    "image": "https://media1.popsugar-assets.com/files/thumbor/khysy8zZvIqUOymE2SWqK7SvIic/148x0:2621x1875/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2024/11/06/806/n/1922153/55775ca3672bb3a4de3c78.77492415_.jpg",
    "source": "https://www.popsugar.com/beauty/feed",
    "categories": [
      "Nails",
      "Nail Trends",
      "Nail Art"
    ]
  }
]
