[
  {
    "id": "aaf9c1f5-0e2d-4547-ae03-e709da3f883a",
    "title": "NARS Light Reflecting Luminizing Powder + Afterglow Lip Shine (New Shades)",
    "link": "https://thebeautylookbook.com/2025/06/nars-light-reflecting-luminizing-powder-afterglow-lip-shine-new-shades.html",
    "description": "NARS Light Reflecting Luminizing Powder + Afterglow Lip Shine (New Shades). Sharing a look at the latest launches from NARS.",
    "author": "Sabrina",
    "published": "Thu, 19 Jun 2025 19:02:08 +0000",
    "image": "https://thebeautylookbook.com/wp-content/uploads/2025/06/New-NARS-Afterglow-Lip-Shine-Gloss-Light-Reflecting-Highlighters.jpg",
    "source": "https://thebeautylookbook.com/feed",
    "categories": [
      "\u003ca href='https://thebeautylookbook.com/category/brand/nars' target='_blank' style='color:currentColor;text-decoration:none;'\u003eNARS\u003c/a\u003e",
      "NARS"
    ]
  },
  {
    "id": "6e02d581-deec-4105-9ed4-884407053324",
    "title": "New Prada Beauty Launches",
    "link": "https://thebeautylookbook.com/2025/06/new-prada-beauty-launches.html",
    "description": "New Prada Beauty Launches. A look at the new highlighters, lip oil stick and eyeshadow palettes from Prada.",
    "author": "Sabrina",
    "published": "Tue, 17 Jun 2025 17:56:42 +0000",
    "image": "https://thebeautylookbook.com/wp-content/uploads/2025/06/PradaBeauty-Light-Glowing-Lip-Oil-Stick-Highlighter.jpg",
    "source": "https://thebeautylookbook.com/feed",
    "categories": [
      "\u003ca href='https://thebeautylookbook.com/category/highlighter' target='_blank' style='color:currentColor;text-decoration:none;'\u003eHighlighters\u003c/a\u003e"
    ]
  },
  {
    "id": "16bf714b-46a8-4bb5-8280-2bbd5229377e",
    "title": "The 10 Best Hair Dryers for Frizzy Hair",
    "link": "https://www.elle.com/beauty/hair/g64541779/best-hair-dryers-for-frizzy-hair-women/",
    "description": "Say hello to sleek strands.",
    "author": "",
    "published": "Tue, 01 Jul 2025 17:48:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/beauty.xml/",
    "categories": null
  },
  {
    "id": "46c79309-cc46-4805-8708-5ff458bb95e6",
    "title": "2026’s Biggest Beauty Trend? According to Marc Jacobs, Romanticism",
    "link": "https://www.elle.com/beauty/makeup-skin-care/a65258182/marc-jacobs-runway-beauty-2026/",
    "description": "The looks at his runway show were extra poetic.",
    "author": "",
    "published": "Tue, 01 Jul 2025 15:26:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/beauty.xml/",
    "categories": null
  },
  {
    "id": "dff8330f-4448-4820-8dc4-ba1d4f63918d",
    "title": "The 24 Best Beauty Products Fashionista Editors Tried in June",
    "link": "https://fashionista.com/2025/07/fashionista-editors-favorite-beauty-products-june-2025",
    "description": "Each month, Fashionista editors try a *lot* of beauty products. And while not every formula we test is a winner, we're constantly unearthing new favorites. Here, we've rounded up our latest hair, skin, fragrance, wellness and makeup discoveries — whether fresh-to-market drops or merely recent ...Continue reading",
    "author": "Catie Pusateri",
    "published": "Tue, 01 Jul 2025 12:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjE1ODk3NDY2Mzg4NjIwODE5/june-2025-beauty-picks-2.jpg",
    "source": "https://fashionista.com/.rss/excerpt/beauty",
    "categories": [
      "Voluspa",
      "editors' picks",
      "Network",
      "Shopping",
      "sunscreen",
      "Beauty",
      "Facile",
      "Urban Decay",
      "Tata Harper",
      "Best Beauty Products Of The Month",
      "Tarte",
      "Saint Jane",
      "Lancome",
      "Editors' Picks",
      "Skin Care",
      "Coola",
      "Murad",
      "makeup",
      "Hair Care",
      "Follain",
      "Higher Dose",
      "Messy",
      "Briogeo",
      "Moroccanoil",
      "Jouer",
      "Glossier",
      "Charlotte Tilbury",
      "beauty products",
      "Korres"
    ]
  },
  {
    "id": "7a5636b0-201e-4264-8c9c-5019568afc72",
    "title": "How Ellis Brooklyn's Bee Shapiro Stays Ahead of Fragrance Trends",
    "link": "https://fashionista.com/2025/06/bee-shapiro-ellis-brooklyn-fragrance-founder-interview",
    "description": "Watch the full conversation between Bee Shapiro and Fashionista's Beauty \u0026 Style Director Steph Saltzman on The Fashionista Network. When beauty veteran Bee Shapiro launched her fragrance brand Ellis Brooklyn 10 years ago, it was in a very different industry. For one, as a longtime beauty ...Continue reading",
    "author": "Janelle Sessoms",
    "published": "Mon, 30 Jun 2025 14:30:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjE1NzU1OTQ0MjYzNDI3NjAz/bee-shapiro---headshot-.png",
    "source": "https://fashionista.com/.rss/excerpt/beauty",
    "categories": [
      "Bee Shapiro",
      "Fashionista Network",
      "Careers",
      "Fragrance",
      "How To Make It",
      "Network",
      "Ellis Brooklyn",
      "Beauty"
    ]
  },
  {
    "id": "f1d92274-d1aa-4ae3-8fd1-f77bca5fb11f",
    "title": "Karah Katenkamp, Curve Model",
    "link": "https://intothegloss.com/2025/03/karah-katenkamp-curve-model-beauty-routine/",
    "description": "With a probiotic rec to fight rosacea, under-the-radar tubing mascaras, and a masseter treatment that's not Botox",
    "author": "",
    "published": "Wed, 05 Mar 2025 10:30:00 -0500",
    "image": "",
    "source": "https://feeds.feedburner.com/intothegloss/oqoU",
    "categories": null
  },
  {
    "id": "3a323477-163e-4504-a2e5-0115f608c7f4",
    "title": "How Tracey Cunningham Colored 17 Stars’ Hair For The Oscars",
    "link": "https://intothegloss.com/2025/03/tracey-cunningham-meche-celeb-colorist-oscars-diary/",
    "description": "5 days, 17 celebs, so much Olaplex",
    "author": "",
    "published": "Mon, 03 Mar 2025 10:30:00 -0500",
    "image": "",
    "source": "https://feeds.feedburner.com/intothegloss/oqoU",
    "categories": null
  },
  {
    "id": "7cee7a95-a512-4ad9-8c20-1eb5099a95d7",
    "title": "Nordstrom Anniversary Sale Haul Try-On",
    "link": "http://www.frmheadtotoe.com/2020/08/nordstrom-anniversary-sale-try-on.html",
    "description": "",
    "author": "Jen",
    "published": "2020-08-17T12:17:00.016-07:00",
    "image": "",
    "source": "http://feeds.feedburner.com/frmheadtotoe",
    "categories": [
      "Nordstrom Anniversary Sale"
    ]
  },
  {
    "id": "3107819f-7ab0-483d-965a-bba77e16d6a3",
    "title": "Best In-Stock Items! Nordstrom Anniversary Sale Picks 2020",
    "link": "http://www.frmheadtotoe.com/2020/08/best-in-stock-items-nordstrom.html",
    "description": "",
    "author": "Jen",
    "published": "2020-08-13T11:38:00.002-07:00",
    "image": "",
    "source": "http://feeds.feedburner.com/frmheadtotoe",
    "categories": [
      "Nordstrom Anniversary Sale"
    ]
  },
  {
    "id": "7cdebeb8-7558-4207-9ada-f4d91bf667a6",
    "title": "Lancôme Just Launched Another “Juicy” Lip Gloss — \u0026 It’s Incredible",
    "link": "https://www.refinery29.com/en-us/lancome-lip-idole-juicytreat-gloss-review?utm_source=feed\u0026utm_medium=rss",
    "description": "When it comes to famous beauty products, few reach the cultural status of Lancôme’s Juicy Tubes. The iconic lip gloss was a mainstay of the early aughts, and at the height of its reign, no starlet’s party bag was complete without a tube of the stuff. Well, if you thought that was Lancôme’s only powerhouse gloss, think again: The iconic French brand is going all in on gloss with its latest launch, Lip Idôle JuicyTreat Oil-in-Gloss. I know what you’re thinking: Another “juicy” gloss courtesy of Lancôme? No, you’re not dreaming. But your makeup bag did just get way juicier. As the name suggests, JuicyTreat is not your average gloss. The oil-in-gloss formula combines the hydration you get from your favorite lip treatment with the shine and color payoff of a gloss. The texture is utterly decadent — and if you ask me, a new icon in the making. Ahead, four Refinery29 beauty editors put Lancôme’s latest launch to the test.  Lancôme Lip Idôle JuicyTreat Oil-in-Gloss, $32 DashDividers_1_500x100 Name \u0026 title: Karina Hoshikawa, Senior WriterShade(s) tested: All The Tea, Toffee Talk Review: I came of age in the 2000s, so Juicy Tubes hold a special place in my core beauty memories. I truly didn’t think I could love another Lancôme gloss more — how can you improve upon perfection? But Lip Idôle JuicyTreat may have done the impossible. It’s decadent, cushiony, and feels as hydrating as my favorite lip oil. I love a warm nude shade, and All The Tea (a gorgeous rosewood) and Toffee Talk (a peachy caramel)  are my favorites from the bunch. The formula is pigmented enough to show up on lips, but still sheer enough for just a hint of color or layering on top of a lip pencil. Plus, can we talk about the applicator? It’s not your average doe-foot — the slightly tapered shape really hugs lips for an even application and buttery-smooth glide. DashDividers_1_500x100 Name \u0026 title: Sara Tan, Global Beauty DirectorShade(s) tested: Brownie Bite Review: Lancôme Lip Idôle JuicyTreat feels like the grown-up evolution of my Juicy Tubes obsession — same glossy finish, but way more nourishing. It’s loaded with 20% squalane for legit hydration, delivers rich color, and delivers that plush, mirror-like shine. There’s even a slight tingle that seems to give your lips a fuller look (without the sting). And the oversized applicator? So satisfying to swipe on. DashDividers_1_500x100 Name \u0026 title: Venus Wong, senior writerShade(s) tested: Million Dollar Berry Review: “I’m a huge Olivia Rodrigo fan, so I was stoked to swipe on Million Dollar Berry, which happens to be the shade she wore for the JuicyTreat ad campaign. I have to say — this juicy wash of plum looks so pretty on both of us. Right off the bat, the gloss feels noticeably more conditioning than many lip oils and tinted balms I’ve tried. While most lip products claim to have moisturizing benefits, a lot of them don’t go the distance — my lips usually dry out and get flaky after a few hours. But thanks to 20% squalane in the formula, which smooths and hydrates, my lips feel plump and comfortable for hours. It’s like wearing an ultra-shiny lip mask that seals in moisture and blurs fine lines for a glass-like finish. Special mention goes to the angular applicator, which makes it easier to trace along my Cupid’s bow with precision.”  DashDividers_1_500x100 Name \u0026 title: Jacqueline Kilikita, beauty directorShade(s) tested: Idôle Nude Review: Growing up, JuicyTubes were always out of my budget, so I have to admit, I’ve never actually tried the cult-favorite gloss. I know — how did I get this job, again? Because of that, I had nothing to compare JuicyTreat to, but it didn’t matter. I think I’ve found the ultimate gloss in Idôle Nude. I expected it to be really sheer, but the pigment packs a punch and looks like I’m wearing the perfect nude lipstick underneath. And the shine? Gorgeous — and without stickiness. When the day comes, I know it will be part of my wedding makeup look; it’s giving blushing bride. Every shade has a slight minty tingle — subtle, but I’m convinced it helps my lips look plumper. That, and the 20% squalane, of course, which moisturizes deeply. Lastly, the chunky — actually, ergonomic — applicator makes top-ups easy, even without a mirror. Like what you see? How about some more R29 goodness, right here?Violette_FR’s New Lip Nectar Is Summer In A TubeWe Tested 16 Tinted Lip Balms To Find The BestWhat We're Buying From Ulta’s Summer Sale",
    "author": "Karina Hoshikawa",
    "published": "Tue, 01 Jul 2025 17:50:27 +0000",
    "image": "https://www.refinery29.com/images/11910863.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/beauty/rss.xml",
    "categories": null
  },
  {
    "id": "cabfe267-c2ac-487f-a351-4d82a086d2c8",
    "title": "10 Hair Perfumes That Cost Less Than The EDPs — \u0026 Last Just As Long",
    "link": "https://www.refinery29.com/en-us/best-hair-perfume-fragrance?utm_source=feed\u0026utm_medium=rss",
    "description": "If you’re in the habit of spritzing perfume on your wrists, you’re missing out on a key piece of real estate: your hair. As a fragrance-obsessed editor, I find hair perfumes to be a vastly underrated category. They come at a snip of the price of eaux de parfum — which typically feature a higher fragrance oil concentration — making them a low-commitment way to trial a new signature scent and a great option for gifting. Unlike traditional perfumes, hair perfumes typically contain little to no alcohol and instead boast moisturizing, shine-enhancing ingredients that help nourish rather than dry out your ends. Standing at just 5 ft tall, I’ve come to learn that my hair often makes the first impression when I talk to taller people. Having hair that smells amazing feels like a small but meaningful way to make a good first impression. I personally find that my hair holds on to scent molecules longer than my skin does, especially in the summer when I’m sweating a lot in the heat. Not only are hair perfumes great for scent layering, but they also leave a lovely trail when I move around. Ahead, I’ve rounded up a list of hair perfumes I’ll always keep on my beauty shelf. DashDividers_1_500x100 Initio Parfums Privés Atomic Rose Hair Perfume, $93 This intensely feminine hair mist is by far my most complimented perfume. I always get told that I “smell so expensive” when I hug someone while wearing this scent. Bulgarian rose, bergamot, jasmine, and pink pepper form the basis of this sensual and spicy floral scent, which lingers on my hair for hours and has incredible projection. I’d say that because of how heady the rose heart notes are, it’s more suitable for nighttime wear. Ellis Brooklyn Peaches Hair and Body Fragrance Mist, $48 $36 Peaches is the hair perfume equivalent of a refreshing cocktail on an unbearably hot and sticky afternoon. It has a candy-like initial blast, but the dry down is surprisingly photorealistic: juicy peach notes smell exactly like the actual fruit, while orris and ambrette musk bring a skin-like intimacy that reminds me of peach fuzz. It’s an ideal beach perfume that feels carefree and flirty, without being too much. Diptyque Do Son Hair Mist, $76 Do Son needs no introduction. This gorgeous white floral scent is a classic for good reason: it has a linear scent profile that’s equal parts elegant and distinctive, thanks to intoxicating tuberose, gardenia and orange blossom. The hair mist version is heavily slept on, in my opinion: the hit of tuberose is just as potent, and the packaging is equally beautiful as the full-size eau de parfum. Phlur Vanilla Smoke Body \u0026 Hair Mist, $25 Vanilla Smoke marks an interesting deviation from the sweet gourmand perfumes that Phlur has helped popularize in the last couple of years. The scent is still anchored by warm and comforting vanilla, but smoky incense and sappy birch are here to inject depth and personality. The result is a woody, spicy aroma that almost smells like a burning vanilla candle. It’s so unique and elevated, especially considering the $25 price tag. Chanel Coco Mademoiselle Hair Perfume, $82 I reach for this crowd-pleaser of a scent when I need to impress. The bergamot, mandarin, and orange top notes lift my mood at first spray, and as the scent dries down, my nose is hit with an exquisite concoction of rose, jasmine, and ylang ylang. I love catching whiffs of this every time I move my head, and it helps me feel more self-assured. I’m glad that Chanel has retained its chic glass bottle and square cap, as many luxury brands package hair perfumes in a plain-looking aerosol bottle. Gisou Lavender Berry Honey Infused Hair Perfume, $25 Gisou’s hair perfumes are my go-to for when I’m getting ready for bed. There’s something about making my hair smell like delicious honey that helps calm my thoughts, not to mention nourish the hair and boost shine. I carry the mini version of the lavender and blackberry scent on my travels; I’m convinced it helps me fall asleep faster. Byredo Mojave Ghost Hair Perfume, $85 If you can’t get enough of clean, musky perfumes, this Byredo classic is the one. There’s a reason Mojave Ghost is enduringly popular: it envelopes you in a cloud of magnolia, cedar, and musk that smells so alluring on freshly-showered hair. I like spraying this liberally onto my paddle brush and pulling it through my hair. Le Monde Gourmand Lait De Coco Hair \u0026 Body Mist, $28 It doesn’t get any more summery than this coconut-based scent. I’m normally not a fan of sweet gourmand perfumes, but here the combination of coconut, vanilla praline, and bergamot really works to create something that smells delicious and inviting without coming off as cloying or juvenile. Parfums De Marly Delina Hair Mist, $93 Delina is an all-time R29 editor favorite; we can’t get enough of this sweet-yet-sophisticated fragrance, which greets the nose with a buoyant cocktail of lychee, peonies, rose, and rhubarb. I’m very happy to report that this fruity floral scent hits just as hard in hair perfume format. In fact, the creamy vanilla and cashmeran base notes smell more prominent on the hair. This is a great one to pop in the purse for fun summer plans, from festivals to picnics and garden parties. Ruka Hair Perfume, $35 I spritz this scent in place of a leave-in conditioner or hair oil when the weather gets too hot. It contains mongongo oil, an ingredient from Zambia that is rich in nourishing vitamin E and omega-6. There’s also aloe vera, which prevents breakage. My hair immediately feels softer after using this, and the refreshing coconut and musk scent is simply gorgeous. Like what you see? How about some more R29 goodness, right here?10 Perfumes That Smell Like Sunscreen \u0026 NostalgiaThese Italian Summer Nail Ideas Are So DreamyI Tried 8 Peptide Lip Balms \u0026 The Cheapest Won",
    "author": "Venus Wong",
    "published": "Tue, 01 Jul 2025 15:00:05 +0000",
    "image": "https://www.refinery29.com/images/11908117.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/beauty/rss.xml",
    "categories": null
  },
  {
    "id": "068b16ea-25f9-4fbd-b684-055c66348f57",
    "title": "What we have written",
    "link": "https://thebeautybrains.com/2024/03/this-is-a-test/",
    "description": "Here is the beauty brains test blog page",
    "author": "Perry Romanowski",
    "published": "Mon, 04 Mar 2024 22:05:47 +0000",
    "image": "",
    "source": "https://thebeautybrains.com/blog/feed/",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "9e99f184-0313-48a9-84bb-9f1543360227",
    "title": "Is scalp exfoliation helpful for hair? episode 226",
    "link": "https://thebeautybrains.com/2020/07/6890/",
    "description": "Welcome to the Beauty Brains, a show where real cosmetic chemists answer your beauty product questions and give you an insider’s look at the cosmetic industry. This is Episode 226. Hosts Perry Romanowski, and Valerie George Is glycerin bad for curly hair? Are encapsulated ingredients better? Do scalp exfoliators help? Can beauty companies hide allergens […]",
    "author": "Perry Romanowski",
    "published": "Thu, 02 Jul 2020 17:22:57 +0000",
    "image": "http://thebeautybrains.com/wp-content/uploads/podcast/Episode226.mp3",
    "source": "https://thebeautybrains.com/blog/feed/",
    "categories": [
      "Podcast"
    ]
  },
  {
    "id": "9738b876-798a-4b8a-b177-eebdbbc804ce",
    "title": "Can Bleach Baths Treat Eczema? Here's What to Know",
    "link": "https://www.popsugar.com/beauty/bleach-baths-for-eczema-49373974",
    "description": "It can be a long journey to soothe certain skin irritations, including eczema, which can be unpredictable and hard to treat. Those with eczema are often prone to skin sensitivities, so when certain treatment options begin trending, it can be tempting yet nerve-wracking to get the courage to try them out. One treatment route that you either sing its praises or err on the side of caution of are bleach baths. The word \"bleach\" associated with anything that involves your skin may give you pause, and rightfully so! Putting bleach on your skin is a big \"no, no\" we've all heard throughout our lives. However, bleach baths are a treatment option many rely on when it comes to alleviating eczema flare-ups and side effects. So, what exactly are bleach baths, and do they work? We spoke with two board-certified dermatologists to help us understand everything about bleach baths and their effectiveness and safety for treating eczema. Experts Featured in This Article Howard Sobel, MD, is a cosmetic dermatologic surgeon and the founder of Sobel Skin. Jody Alpert Levine, MD, FAAD, FAAP, is a New York-based dermatologist. Can Bleach Baths Help Eczema? First, it's worth noting eczema comes in many different forms and can affect people in a variety of ways. Put simply, it is \"an excess inflammation of the skin that can be caused by an overactive immune system,\" says cosmetic dermatologic surgeon Howard Sobel, MD. \"There are many causes of eczema, including environmental factors and allergens such as dust and fragrances,\" board-certified dermatologist Jody Alpert Levine, MD, FAAD, FAAP says. \"There is also evidence to suggest that genetics and immunity are factors in the development of eczema.\" When someone experiences eczema, their skin barrier allows moisture to escape and external irritants to enter the body. \"The inflammation can lead to itchy skin, rough patches, crusting and swelling of the skin as well as dark patches,\" Dr. Sobel says. Bleach baths are something people are doing in hopes of helping soothe their eczema. \"There is research that suggests that very diluted baths containing bleach may reduce symptoms associated with eczema,\" Dr. Sobel says. In the study, researchers wanted to see if bleach baths would decrease the severity of those struggling with eczema symptoms. They found that this treatment option is effective in decreasing symptoms, but they aren't more effective than a simple bath with just water. So, how does it work? \"In theory, reducing bacteria on the skin does help reduce the risk of skin irritation,\" Dr. Levine says. There is some belief that the diluted bleach will minimize inflammation and bacteria growth, thereby improving eczema flare-ups. \"However, it is important to note that precautions should be taken with bleach baths since there are various triggers of eczema,\" she adds. \"Eczema leaves your skin with increased sensitivities and bleach is made with a lot of harsh chemicals that can dry out the skin and cause further irritation.\" Unfortunately, there are some side effects to doing a bleach bath. \"They can further exacerbate one's eczema, dry out the skin, or cause stinging or burning,\" Dr. Levine says. How Do You Take a Bleach Bath? Dr. Levine says a bleach bath consists of a very small amount of bleach, about half a cup of bleach, and lukewarm water in a full bathtub. You can soak the affected parts of your body in the bath for up to 10 minutes. Following the bath, you should take a shower and rinse your body well with soap and pat your skin dry. You'll want to make sure your body is well moisturized prior to the shower as well. When it comes to how often you do a bleach bath, you should consult your doctors to gauge a proper timeline, however, Dr. Levine doesn't recommend doing them more than once a week. Alternative Eczema Treatments to Beach Baths Dr. Levine doesn't recommend bleach baths to her patients \"as there are many other treatment options that are much gentler on the skin, which I find important when treating eczema.\" Instead, she suggests an oatmeal bath, which can soothe the skin, reduce inflammation, and help hydrate the skin. \"Additionally, I recommend applying a gentle moisturizer multiple times daily, particularly after showering or bathing, avoiding triggers, reducing stress, and consulting with a board-certified dermatologist for treatment.\" Dr. Sobel shares that there is a new class of oral medications such as Dupixent, Cinqo, and Rinvoq that can be prescribed by your physician to help alleviate side effects of eczema. Before conducting a bleach bath, it's important to speak to your physician and/or board-certified dermatologist to learn more about the potential side effects and if it's the right option for treating your eczema. Sydney Wingfield has been a freelance writer in the beauty and wellness space for six years. She has written for Women's Health, Marie Claire, Glamour, and other publications and loves to cover all things skin care, makeup, and hair.",
    "author": "Sydney Wingfield",
    "published": "Tue, 01 Jul 2025 12:40:02 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/FYvYXIJLj5BBK2RViACslODBrgE/18x0:3948x3930/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2024/06/27/865/n/1922153/4ef2cd45667dc17ab891e8.91644511_.jpg",
    "source": "https://www.popsugar.com/beauty/feed",
    "categories": [
      "Skin Care",
      "Eczema",
      "Skinposium"
    ]
  },
  {
    "id": "1161bad5-7c08-470a-9d70-7f4a329de1de",
    "title": "5 Little-Known Tips For Eczema That Actually Work, According to Derms",
    "link": "https://www.popsugar.com/beauty/eczema-hacks-49428472",
    "description": "Does eczema have your skin feeling itchy and looking red and scaly no matter what you try, making you wonder if there will ever be relief ahead? Don't worry, you're not alone - according to the National Eczema Association, nearly 32 million Americans (more than 10 percent of all people in the United States) have some form of eczema. Eczema, aka atopic dermatitis, is a \"chronic inflammatory skin condition characterized by dry, scaly, and itchy skin due to an impaired skin barrier,\" says board-certified dermatologist Supriya Rastogi, MD. But what causes eczema in the first place? Though everyone has different triggers, factors like dry, cold weather, emotional or physical stress, or environmental allergens and irritants can cause eczema flare-ups, says double board-certified dermatologist Karan Lal, DO, MS. It can also develop from a genetic predisposition, Dr. Rastogi adds. To help you learn how to effectively treat your eczema when you feel like you've already tried it all, we chatted with both of these dermatologists to get their best out-of-the-box tricks and tips. Ahead, find five hacks that'll actually help your eczema, as recommended by dermatologists. Experts Featured in This Article Karan Lal, DO, MS, is a double board-certified adult, pediatric, and cosmetic dermatologist in Scottsdale, Arizona. Supriya Rastogi, MD, is a board-certified dermatologist at Schweiger Dermatology Group - Park Ave in New York City. 1. Diluted Bleach Baths If you've been trying to treat your eczema with topical products to no avail, it may be time to get in the bath. More specifically, get in a diluted bleach bath (yes, you read that correctly - bleach can help). It can help suppress bacteria on the skin that can contribute to flare-ups and inflammation, and it's also cost-effective, says Dr. Rastogi. \"To prepare, add 1/4 cup of household bleach to a half-full bathtub (or 1/2 cup for a full tub) and soak for 10 minutes,\" she says. She recommends doing this two to three times a week. 2. Layering Products Effectively and Strategically Turns out, there is a right way and a wrong way to layer your skin-care products, including your prescriptions. If you use eczema medication such as a topical steroid, apply the medication first and follow with a moisturizer, says Dr. Lal. Wait five to 10 minutes before adding the moisturizer to help increase effectiveness, adds Dr. Rastogi. If you don't use any topical eczema medications, simply make sure you're strategically layering skin-care products. For eczema, Dr. Rastogi recommends the popular TikTok trend of slugging. \"Apply a fast-absorbing humectant like hyaluronic acid serum first, followed by a rich ceramide cream, and then seal with an occlusive such as petrolatum to enhance hydration retention,\" she says. 3. Wet Wraps Maximum moisturization is key to any successful eczema treatment. Both Dr. Lal and Dr. Rastogi recommend this wet wrap method for an extra boost of moisturization: Apply a thick layer of moisturizer (an occlusive can work well), and then place damp soft cotton or gauze (or socks or gloves if your hands and feet are affected) at night. \"The water and moist environment will help lock in moisture,\" says Dr. Lal. It's especially effective for severe dryness or scaling as it can also enhance absorption, reduce inflammation, and soothe itching, Dr. Rastogi adds. 4. Hydrotherapy Continuing the aquatic theme, this hydrotherapy technique helps \"increase product absorption, enhance the skin barrier, and maximize hydration,\" says Dr. Rastogi. Rather than moisturizing followed by wet cloth as you would with wet wraps, you can try flipping the order: \"For example, for hand eczema, soak hands in lukewarm water for five to 10 minutes, then apply a thick moisturizer,\" Dr. Rastogi advises. 5. Consciously Clean Hands Though it can be tempting to constantly wash your hands (especially during flu season), if you have eczema on your hands, take note of what you're using to wash. Overusing hand soaps or hand sanitizers can dry out the skin and exacerbate flare-ups. Instead, \"use a gentle face cleanser in place of soap to wash your hands,\" Dr. Lal says. \"You should only use soap if your hands are visibly soiled.\" Catharine Malzahn is a beauty writer and editor with nearly half a decade of experience covering everything from skin care and makeup to spas and injectables.",
    "author": "Catharine Malzahn",
    "published": "Tue, 01 Jul 2025 11:40:02 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/MUi_S3OuKDWPJ4CTJUkP6QID2L8/0x0:1950x1950/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2025/02/14/978/n/1922153/1be9923867afc3d24ea376.40653689_.jpg",
    "source": "https://www.popsugar.com/beauty/feed",
    "categories": [
      "Body Care",
      "Skin Care",
      "Eczema",
      "Skinposium",
      "Condition Center"
    ]
  }
]
