{
  "id": "060f4cff-ed16-4126-b418-52a3c2c0901a",
  "title": "D’Angelo Cancels Comeback Performance at Roots Picnic Due to “Unforeseen” Medical Issue",
  "link": "https://consequence.net/2025/05/dangelo-cancels-comeback-set-roots-picnic/",
  "description": "However, the acclaimed R\u0026B singer has confirmed that new music is on the way. D’Angelo Cancels Comeback Performance at Roots Picnic Due to “Unforeseen” Medical Issue Jo Vito",
  "author": "Jo Vito",
  "published": "Sat, 24 May 2025 16:18:05 +0000",
  "source": "http://consequenceofsound.net/feed",
  "categories": [
    "Music",
    "News",
    "Philadelphia",
    "R\u0026B",
    "Roots Picnic"
  ],
  "byline": "Jo Vito",
  "length": 1454,
  "excerpt": "D’Angelo has canceled his highly anticipated comeback performance at the Roots Picnic in Philadelphia. Read his full statement.",
  "siteName": "Consequence",
  "favicon": "https://consequence.net/wp-content/themes/cosv2/images/apple-touch-icon.png",
  "text": "D’Angelo has canceled his highly anticipated comeback performance at the 2025 Roots Picnic in Philadelphia. The headlining slot was supposed to be D’Angelo’s first public performance to an audience in nearly a decade, but in a statement posted to Instagram on Friday night, the Black Messiah singer explained that he “must cancel” the appearance “due to an unforeseen medical delay regarding surgery” he had earlier this year. Get Roots Picnic 2025 Tickets Here Continuing, D’Angelo wrote that it’s “nearly impossible” to express how disappointed he is to miss the performance, and thanked his fans for their continued support. He also added that new music may be on the horizon, writing, “I’m currently in the Lab, and can’t wait to serve up what’s in the pot! Love u all and will see you very soon!” Read the full statement below. The Roots Picnic will take place from May 31st through June 1st at The Mann in Fairmount Park in Philadelphia. D’Angelo was announced as the headliner this past February, and his set would have marked his first major performance since 2016. Now, in lieu of D’Angelo, the festival has announced that Maxwell has joined the lineup, writing that he will be bringing “that once-in-a-lifetime, sing-it-from-your-chest, soul-stirring magic that only he can deliver.” Other artists slated to perform include Lenny Kravitz, Miguel, Kaytranda, GloRilla, Pusha T, Tems, Latto, 2 Chainz, Musiq Soulchild, and more. Get tickets here.",
  "image": "https://consequence.net/wp-content/uploads/2025/05/DAngelo-cancels-headline-slot-at-Roots-Picnic.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-id=\"1487961\" data-title=\"D’Angelo Cancels Comeback Performance at Roots Picnic Due to “Unforeseen” Medical Issue\" data-url=\"https://consequence.net/2025/05/dangelo-cancels-comeback-set-roots-picnic/\" data-page=\"1\" data-pages=\"1\" data-total-posts=\"1\" aria-live=\"polite\" aria-atomic=\"true\" data-nextpage=\"true\" data-nextpage-urls=\"true\" data-nextpage-pageviews=\"false\" data-nextpage-post-id=\"1487961\" data-nextpage-scroll=\"false\" data-nextpage-startpage=\"1\" data-nextpage-post-title=\"D’Angelo Cancels Comeback Performance at Roots Picnic Due to “Unforeseen” Medical Issue\" data-container-type=\"ul\" data-loading-style=\"infinite fading-circles\" data-repeater=\"default\" data-post-type=\"post\" data-order=\"DESC\" data-orderby=\"date\" data-offset=\"0\" data-posts-per-page=\"5\" data-scroll-distance=\"-200\" data-pause-override=\"true\" data-pause=\"true\" data-button-label=\"Load More\"\u003e\u003cp\u003e\u003ca href=\"https://consequence.net/artist/dangelo/\" target=\"_blank\" rel=\"noopener\"\u003eD’Angelo\u003c/a\u003e has canceled his highly anticipated comeback performance at the \u003ca href=\"https://consequence.net/2025/02/dangelo-roots-picnic/\" target=\"_blank\" rel=\"noopener\"\u003e2025 Roots Picnic\u003c/a\u003e in Philadelphia.\u003c/p\u003e\n\u003cp\u003eThe headlining slot was supposed to be D’Angelo’s first public performance to an audience in nearly a decade, but in a statement posted to Instagram on Friday night, the \u003cem\u003eBlack Messiah\u003c/em\u003e singer explained that he “must cancel” the appearance “due to an unforeseen medical delay regarding surgery” he had earlier this year.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://stubhub.prf.hn/click/camref:1100l9Pt3/pubref:roots-picnic*dangelo-cancel-button/destination:https%3A%2F%2Fwww.stubhub.com%2Fthe-roots-picnic-music-festival-tickets%2Fgrouping%2F718771\" target=\"_blank\" rel=\"nofollow noopener\"\u003eGet Roots Picnic 2025 Tickets Here\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eContinuing, D’Angelo wrote that it’s “nearly impossible” to express how disappointed he is to miss the performance, and thanked his fans for their continued support.\u003c/p\u003e\n\u003cp\u003eHe also added that new music may be on the horizon, writing, “I’m currently in the Lab, and can’t wait to serve up what’s in the pot! Love u all and will see you very soon!” Read the full statement below.\u003c/p\u003e\n\u003cp\u003eThe Roots Picnic will take place from May 31st through June 1st at The Mann in Fairmount Park in Philadelphia. D’Angelo was announced as the headliner this past February, and his set would have marked his first major performance since 2016.\u003c/p\u003e\n\u003cp\u003eNow, in lieu of D’Angelo, the festival has announced that Maxwell has joined the lineup, writing that he will be bringing “that once-in-a-lifetime, sing-it-from-your-chest, soul-stirring magic that only he can deliver.” Other artists slated to perform include Lenny Kravitz, Miguel, Kaytranda, GloRilla, Pusha T, Tems, Latto, 2 Chainz, Musiq Soulchild, and more. \u003ca href=\"https://stubhub.prf.hn/click/camref:1100l9Pt3/pubref:roots-picnic*dangelo-cancel/destination:https%3A%2F%2Fwww.stubhub.com%2Fthe-roots-picnic-music-festival-tickets%2Fgrouping%2F718771\" target=\"_blank\" rel=\"noopener nofollow\"\u003eGet tickets here.\u003c/a\u003e\u003c/p\u003e\n\u003cblockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/p/DKA6bznx3cz/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e\n\n\u003c/blockquote\u003e\n\n\u003cblockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/reel/DKAj7-zRJYn/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e\n\n\u003c/blockquote\u003e\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-05-24T12:18:05-04:00",
  "modifiedTime": null
}
