{
  "id": "10d0f96e-3193-4aeb-9ca9-f647696db4f3",
  "title": "METALLICA Donates $100,000 To Hurricane Helene \u0026 Milton Victims",
  "link": "https://metalinjection.net/news/metallica-donates-100000-to-hurricane-helene-milton-victims",
  "description": "Via their All Within My Hands Foundation, of course.",
  "author": "Greg Kennelty",
  "published": "Wed, 16 Oct 2024 22:41:44 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Latest News",
    "Metallica"
  ],
  "byline": "By Greg Kennelty Published 2 hours ago",
  "length": 1758,
  "excerpt": "Via their All Within My Hands Foundation, of course.",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "Florida, Georgia, and the Carolinas have been having a rough month. The states were slammed by Hurricane Helene in late September, and then Florida was hit again with Hurricane Milton (and its associated tornados) a few weeks later. The two hurricanes killed nearly 300 people, totaled over $70 billion in damage, and have laid out a very long road to recovery. Metallica is giving aid via their All Within My Hands Foundation by donating $50,000 each to both the Feeding America and the Information Technology Disaster Resource Center (ITDRC). Why those two charities? Metallica explained via their All Within My Hands Foundation website (where you can also make a donation): \"The series of storms has strained food bank operations, and our partners at Feeding America need our support. We are granting $50,000 to Feeding America's national disaster response program, which provides food and water to communities devastated by recent hurricanes. \"Along with the physical damage caused by these hurricanes, the swift restoration of essential technology and communications infrastructure is needed. The Information Technology Disaster Resource Center is a volunteer-driven nonprofit that provides technology continuity, connectivity, and recovery after catastrophic events for communities impacted by disasters. \"We are donating $50,000 to support the ongoing work of hundreds of ITDRC volunteers to ensure public safety, responding relief organizations, and local businesses are connected and have access to the communications they need to serve their community.\" Want More Metal? Subscribe To Our Daily Newsletter Enter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2023/04/Metallica-2023.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003eFlorida, Georgia, and the Carolinas have been having a rough month. The states were slammed by Hurricane Helene in late September, and then Florida was hit again with Hurricane Milton (and its associated tornados) a few weeks later. The two hurricanes killed nearly 300 people, totaled over $70 billion in damage, and have laid out a very long road to recovery.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/metallica\"\u003eMetallica\u003c/a\u003e\u003c/strong\u003e is giving aid via their All Within My Hands Foundation by donating $50,000 each to both the Feeding America and the Information Technology Disaster Resource Center (ITDRC). \n\n\n\n\u003c/p\u003e\u003cp\u003eWhy those two charities? \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/metallica\"\u003eMetallica\u003c/a\u003e\u003c/strong\u003e explained \u003ca href=\"https://www.allwithinmyhands.org/news-media/news-from-awmh/100k-donated-to-hurricane-milton-relief-operations.html\"\u003evia their All Within My Hands Foundation website\u003c/a\u003e (where you can also make a donation): \u0026#34;The series of storms has strained food bank operations, and our partners at Feeding America need our support. We are granting $50,000 to Feeding America\u0026#39;s national disaster response program, which provides food and water to communities devastated by recent hurricanes.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;Along with the physical damage caused by these hurricanes, the swift restoration of essential technology and communications infrastructure is needed. The Information Technology Disaster Resource Center is a volunteer-driven nonprofit that provides technology continuity, connectivity, and recovery after catastrophic events for communities impacted by disasters.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;We are donating $50,000 to support the ongoing work of hundreds of ITDRC volunteers to ensure public safety, responding relief organizations, and local businesses are connected and have access to the communications they need to serve their community.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\n\t\t\t\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003ch5\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/h5\u003e\n\t\t\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-16T18:41:44-04:00",
  "modifiedTime": "2024-10-16T18:41:52-04:00"
}
