{
  "id": "15657fce-57cf-4859-a1e4-f30e09129f90",
  "title": "CHAT PILE Launches Tape Label Dungeon Earth Recordings, Drops Blood At Night I \u0026 II",
  "link": "https://metalinjection.net/av/full-album-stream/chat-pile-launches-tape-label-dungeon-earth-recordings-drops-blood-at-night-i-ii",
  "description": "A two-volume collection of noise, ambient, and improv recordings from the Cool World sessions. The post CHAT PILE Launches Tape Label Dungeon Earth Recordings, Drops Blood At Night I \u0026 II appeared first on Metal Injection.",
  "author": "Greg Kennelty",
  "published": "Mon, 07 Jul 2025 19:58:29 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Full Album Stream",
    "Chat Pile"
  ],
  "byline": "By Greg Kennelty Published 4 hours ago",
  "length": 1995,
  "excerpt": "A two-volume collection of noise, ambient, and improv recordings from the Cool World sessions.",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "Chat Pile has officially launched their own cassette label, Dungeon Earth Recordings, with a mission to unearth and release the most obscure and experimental material from their archives. Operated entirely by the band and made for the fans, by the band, Dungeon Earth will offer exclusive cassette-only and Bandcamp-only releases. So if you're trying to listen to these on streaming, tough shit. They ain't there. The label debuts with Blood at Night I \u0026 II, a two-volume collection of noise, ambient, and improv recordings from the Cool World sessions. Stream both below and get 'em here on Bandcamp. Not on tape, though – those sold out like, three seconds after Chat Pile announced the label. Chat Pile describes both releases as such: \"Blood at Night I – This release contains the entire collection of manipulated tape loops recorded during the making of Cool World. Sections of most of these tracks were dissected and subtly woven into the final version of the record. All the original cassettes used on this collection were sourced from OKC thrift stores and cover a variety of oddball niches like hypnosis tapes, local band practices, hotel conference background music and the occasional religious self-help lecture. \"Blood at Night II – We recorded Cool World at Chat Pile H/Q from December 2023 to March 2024, and during that time we scheduled two specific improv recording sessions to help shake loose the grind that can occur when creating a record from scratch. The first session, represented here by the first three tracks in this collection, included Stin, Ron and Raygun blasting feedback and synth squeals at high volumes for a couple hours. The second session involved Stin, Luther, Ron, Vincent Ciarlo and Mekala Littleton and excerpts from this jam are represented in tracks 4 through 7.\" Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2024/07/Chat-Pile-2024-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/chat-pile\"\u003eChat Pile\u003c/a\u003e\u003c/strong\u003e has officially launched their own cassette label, Dungeon Earth Recordings, with a mission to unearth and release the most obscure and experimental material from their archives. Operated entirely by the band and made for the fans, by the band, Dungeon Earth will offer exclusive cassette-only and Bandcamp-only releases. So if you\u0026#39;re trying to listen to these on streaming, tough shit. They ain\u0026#39;t there.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe label debuts with \u003cem\u003eBlood at Night I \u0026amp; II\u003c/em\u003e, a two-volume collection of noise, ambient, and improv recordings from the \u003cem\u003eCool World\u003c/em\u003e sessions. Stream both below and \u003ca href=\"https://dungeonearth.bandcamp.com/\"\u003eget \u0026#39;em here on Bandcamp\u003c/a\u003e. Not on tape, though – those sold out like, three seconds after \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/chat-pile\"\u003eChat Pile\u003c/a\u003e\u003c/strong\u003e announced the label. \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/chat-pile\"\u003eChat Pile\u003c/a\u003e\u003c/strong\u003e describes both releases as such:\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;\u003cem\u003eBlood at Night I \u003c/em\u003e– This release contains the entire collection of manipulated tape loops recorded during the making of \u003cem\u003eCool World\u003c/em\u003e. Sections of most of these tracks were dissected and subtly woven into the final version of the record. All the original cassettes used on this collection were sourced from OKC thrift stores and cover a variety of oddball niches like hypnosis tapes, local band practices, hotel conference background music and the occasional religious self-help lecture.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;\u003cem\u003eBlood at Night II \u003c/em\u003e– We recorded \u003cem\u003eCool World\u003c/em\u003e at \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/chat-pile\"\u003eChat Pile\u003c/a\u003e\u003c/strong\u003e H/Q from December 2023 to March 2024, and during that time we scheduled two specific improv recording sessions to help shake loose the grind that can occur when creating a record from scratch. The first session, represented here by the first three tracks in this collection, included \u003cstrong\u003eStin\u003c/strong\u003e, \u003cstrong\u003eRon\u003c/strong\u003e and \u003cstrong\u003eRaygun\u003c/strong\u003e blasting feedback and synth squeals at high volumes for a couple hours. The second session involved \u003cstrong\u003eStin\u003c/strong\u003e, \u003cstrong\u003eLuther\u003c/strong\u003e, \u003cstrong\u003eRon\u003c/strong\u003e, \u003cstrong\u003eVincent Ciarlo\u003c/strong\u003e and \u003cstrong\u003eMekala Littleton\u003c/strong\u003e and excerpts from this jam are represented in tracks 4 through 7.\u0026#34;\n\n\n\n\u003c/p\u003e\n\n\n\n\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-07-07T15:58:29-04:00",
  "modifiedTime": "2025-07-07T15:58:30-04:00"
}
