{
  "id": "1581e4ef-77b9-44a2-822f-fdc54e8f13f6",
  "title": "Major Lazer Celebrates 15 Years of ‘Guns Don’t Kill People… Lazers Do’ | Billboard News",
  "link": "https://www.billboard.com/video/major-lazer-celebrates-15-years-of-guns-dont-kill-people-lazers-do-billboard/",
  "description": "Diplo \u0026 Switch of Major Lazer sit down and share everything you need to know about the group. From first meeting to picking out their name, to creating ‘Guns Don’t Kill People… Lazers Do,’ the duo share stories about their time together, their journey over the last 15 years and more! Katie Bain: I’m here […]",
  "author": "Katie Cao",
  "published": "Sat, 23 Nov 2024 01:00:00 +0000",
  "source": "https://www.billboard.com/feed/",
  "categories": [
    "Media",
    "Videos",
    "bbnews",
    "Billboard",
    "billboard news"
  ],
  "byline": "Katie Cao",
  "length": 1645,
  "excerpt": "Diplo \u0026 Switch of Major Lazer sit down and share stories about their time together, their journey over the last 15 years and more!",
  "siteName": "Billboard",
  "favicon": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/apple-touch-icon.png",
  "text": "Diplo \u0026 Switch of Major Lazer sit down and share everything you need to know about the group. From first meeting to picking out their name, to creating ‘Guns Don’t Kill People… Lazers Do,’ the duo share stories about their time together, their journey over the last 15 years and more! Katie Bain: I’m here with Diplo and Switch. We’re here to talk about the 15 year anniversary of the seminal major laser album, ‘Guns Don’t Kill People… Lazers Do.’ To start, how are you guys feeling about it being 15 years ago now, what does that bring up for you?  Diplo: Well, we’re old now. We’ve been doing it-  Switch: We’re slower.  Diplo: It’s crazy that we actually have been still having our careers 15 years and still like loving music, and we’re still the same kind of creative people. I think me and Dave have known each other for so long, and it’s cool to still be friends and come together and be able to work and share ideas and to come from that world. So it’s it’s cool that we can keep doing it.  Switch: Yeah? It’s true. Actually, Jamaica, out of anywhere in the world, is kind of like, every time you go there, there’s something new to pick up on or buy. Do you know what I mean? It feels brand new every time you go there.  Do you guys remember the first time that you met?  Diplo: It was at Fabric wasn’t it?  Switch  Yeah, London, yeah. London.  Diplo: I think I told the story recently, but Dave could correct me if I was wrong. We both played Fabric. It was like, he was a resident there, and he was like in a house room. Keep watching for more!",
  "image": "https://www.billboard.com/wp-content/uploads/2024/11/MAJORLAZER.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\u003cp\u003e\n\tDiplo \u0026amp; Switch of Major Lazer sit down and share everything you need to know about the group. From first meeting to picking out their name, to creating ‘Guns Don’t Kill People… Lazers Do,’ the duo share stories about their time together, their journey over the last 15 years and more!\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eKatie Bain:\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eI’m here with Diplo and Switch. We’re here to talk about the 15 year anniversary of the seminal major laser album, ‘Guns Don’t Kill People… Lazers Do.’ To start, how are you guys feeling about it being 15 years ago now, what does that bring up for you? \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tDiplo:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWell, we’re old now. We’ve been doing it- \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSwitch:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWe’re slower. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tDiplo:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIt’s crazy that we actually have been still having our careers 15 years and still like loving music, and we’re still the same kind of creative people. I think me and Dave have known each other for so long, and it’s cool to still be friends and come together and be able to work and share ideas and to come from that world. So it’s it’s cool that we can keep doing it. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSwitch:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tYeah? It’s true. Actually, Jamaica, out of anywhere in the world, is kind of like, every time you go there, there’s something new to pick up on or buy. Do you know what I mean? It feels brand new every time you go there. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDo you guys remember the first time that you met? \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tDiplo:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIt was at Fabric wasn’t it? \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSwitch \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tYeah, London, yeah. London. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tDiplo:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tI think I told the story recently, but Dave could correct me if I was wrong. We both played Fabric. It was like, he was a resident there, and he was like in a house room.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cem\u003eKeep watching for more!\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-11-23T01:00:00Z",
  "modifiedTime": "2024-11-23T00:37:11Z"
}
