{
  "id": "1bf73cb3-0acd-4b05-a6f1-99835a8e78c8",
  "title": "Andrew Klein promoted to President of Global Partnerships at AEG Presents",
  "link": "https://www.musicbusinessworldwide.com/andrew-klein-promoted-to-president-of-global-partnerships-at-aeg-presents/",
  "description": "AEG describes Klein as a recognized pioneer in the field of “merging brands with bands” Source",
  "author": "Daniel Tencer",
  "published": "Tue, 18 Feb 2025 18:11:29 +0000",
  "source": "https://www.musicbusinessworldwide.com/feed/",
  "categories": [
    "News",
    "AEG Presents",
    "Andrew Klein",
    "Shawn Trell"
  ],
  "byline": "Daniel Tencer",
  "length": 3957,
  "excerpt": "AEG describes Klein as a recognized pioneer in the field of “merging brands with bands.”",
  "siteName": "Music Business Worldwide",
  "favicon": "https://www.musicbusinessworldwide.com/wp-content/themes/mb/assets/img/icons/favicon-192x192.png",
  "text": "Live events and promotion company AEG Presents has promoted Andrew Klein to President of Global Partnerships.Klein, who previously served as Senior Vice President of Global Partnerships, will continue to be based in New York and will report to Executive Vice President and Chief Operating Officer Shawn Trell.In his new role, Klein will oversee all sales and activation business for AEG Presents’ Global Partnerships division.A two-decade veteran of AEG Presents, Klein has been responsible for leading sponsorship sales efforts across the company’s tours, festivals, and music venues, including Stagecoach Festival, Camp Flog Gnaw, the New Orleans Jazz Fest \u0026 Heritage Festival, the company’s more than 55 owned and operated venues, and numerous music tours. In a statement on Tuesday (February 18), AEG Presents described Klein as a recognized pioneer in the field of “merging brands with bands.” The company credits him with developing some of its most prominent sponsorships, including H\u0026M’s global licensing deal with Coachella, tour sponsorship deals between Justin Bieber, Xbox, Ubisoft, and Motorola, and Katy Perry’s sponsorship deal with Staples.Klein was listed in Variety’s Dealmakers Impact Report in 2016 and Billboard’s Branding Power Players list in 2018. He helped pioneer live music streaming, playing a key role in executing broadcasts for the AT\u0026T Blue Room with New Orleans Jazz Fest, Coachella, and the Mile High Music Festival. More recently, he was instrumental in orchestrating live stream deals between YouTube and Coachella, as well as Amazon and Stagecoach. Prior to joining AEG, Klein was President of New York-headquartered Entertainment Marketing Communications International (EMCI), a music sponsorship sales and activations company, where he oversaw the sponsorship program for the original Lilith Fair. That included deals with Volkswagen, the Borders bookstore chain, Tower Records, Levi’s, and Chevrolet, among others. He also orchestrated partnerships between Tommy Hilfiger and Sheryl Crow, Shania Twain and Gitano Jeans, and the Rolling Stones and Sprint.“Andrew has spent years cultivating relationships and identifying brands and partners to bring critical value and expanded reach across our entire portfolio,” Trell said. “I’m happy to see him elevated to this new position – it’s well deserved – and I’m looking forward to what’s ahead.”“The opportunities in our company have never been more exciting or abundant for driving meaningful results for our partners.”Andrew Klein, AEG PresentsKlein added: “The opportunities in our company have never been more exciting or abundant for driving meaningful results for our partners. I look forward to continuing to develop and implement innovative programs that amplify our world-class brand partners and industry-leading music assets.”A division of Anschutz Entertainment Group (AEG), AEG Presents is the world’s second-largest presenter of live music and entertainment, behind only Live Nation. Besides the aforementioned Coachella, Stagecoach, New Orleans Jazz Fest, and Mile High Music Fest, AEG Presents’ tentpole events include British Summer Time at Hyde Park, Hangout Festival, Electric Forest, Buckeye Country Superfest, Rock En Seine, and All Points East. Klein’s promotion follows several other notable appointments at AEG Presents in recent months, including Angie Rho’s appointment to Senior Vice President, Global Touring, and Weston Herbert’s appointment to Vice President, Global Touring last month.The company recently implemented a new management structure for its international operations, with Adam Wilkes assuming responsibility for regional operations in Asia-Pacific and Europe in the new position of President and CEO, Europe and Asia-Pacific. Alex Hill assumed leadership of all of AEG’s global real estate and venue operations outside of the United States, in the new position of President and CEO, AEG International.Music Business Worldwide",
  "image": "https://www.musicbusinessworldwide.com/files/2025/02/Andrew-Klein.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eLive events and promotion company \u003ca title=\"Companies \u0026gt; AEG Presents [95 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/aeg-presents/\"\u003eAEG Presents\u003c/a\u003e has promoted Andrew Klein to President of Global Partnerships.\u003c/p\u003e\u003cp\u003eKlein, who previously served as Senior Vice President of Global Partnerships, will continue to be based in New York and will report to Executive Vice President and Chief Operating Officer \u003cstrong\u003eShawn Trell\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eIn his new role, Klein will oversee all sales and activation business for AEG Presents’ Global Partnerships division.\u003c/p\u003e\u003cp\u003eA two-decade veteran of AEG Presents, Klein has been responsible for leading sponsorship sales efforts across the company’s tours, festivals, and music venues, including \u003cstrong\u003eStagecoach Festival\u003c/strong\u003e, \u003cstrong\u003eCamp Flog Gnaw\u003c/strong\u003e, the \u003cstrong\u003eNew Orleans Jazz Fest \u0026amp; Heritage Festival\u003c/strong\u003e, the company’s more than 55 owned and operated venues, and numerous music tours.\u003c/p\u003e  \u003cp\u003eIn a statement on Tuesday (February 18), AEG Presents described Klein as a recognized pioneer in the field of “merging brands with bands.” The company credits him with developing some of its most prominent sponsorships, including \u003cstrong\u003eH\u0026amp;M\u003c/strong\u003e’s global licensing deal with Coachella, tour sponsorship deals between \u003cstrong\u003eJustin Bieber\u003c/strong\u003e, \u003cstrong\u003eXbox\u003c/strong\u003e, \u003cstrong\u003eUbisoft\u003c/strong\u003e, and \u003cstrong\u003eMotorola\u003c/strong\u003e, and \u003cstrong\u003eKaty Perry\u003c/strong\u003e’s sponsorship deal with \u003cstrong\u003eStaples\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eKlein was listed in \u003cem\u003eVariety\u003c/em\u003e’s \u003ca href=\"https://variety.com/gallery/dealmakers-impact-report-2016/stew-heathcote-andrew-klein/\" target=\"_blank\" rel=\"noopener\"\u003eDealmakers Impact Report\u003c/a\u003e in 2016 and \u003cem\u003e\u003ca title=\"Companies \u0026gt; Billboard [1,361 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/billboard/\"\u003eBillboard\u003c/a\u003e\u003c/em\u003e’s \u003ca href=\"https://www.billboard.com/music/music-news/billboard-top-branding-power-players-2018-list-8460771/\" target=\"_blank\" rel=\"noopener\"\u003eBranding Power Players\u003c/a\u003e list in 2018. He helped pioneer live music streaming, playing a key role in executing broadcasts for the \u003cstrong\u003eAT\u0026amp;T Blue Room\u003c/strong\u003e with New Orleans Jazz Fest, \u003cstrong\u003eCoachella\u003c/strong\u003e, and the \u003cstrong\u003eMile High Music Festival\u003c/strong\u003e. More recently, he was instrumental in orchestrating live stream deals between \u003cstrong\u003e\u003ca title=\"Companies \u0026gt; YouTube [1,957 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/youtube/\"\u003eYouTube\u003c/a\u003e\u003c/strong\u003e and Coachella, as well as \u003cstrong\u003e\u003ca title=\"Companies \u0026gt; Amazon [839 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/amazon/\"\u003eAmazon\u003c/a\u003e\u003c/strong\u003e and Stagecoach.\u003c/p\u003e  \u003cp\u003ePrior to joining AEG, Klein was President of New York-headquartered \u003cstrong\u003eEntertainment Marketing Communications International\u003c/strong\u003e (\u003cstrong\u003eEMCI\u003c/strong\u003e), a music sponsorship sales and activations company, where he oversaw the sponsorship program for the original \u003cstrong\u003eLilith Fair\u003c/strong\u003e. That included deals with \u003cstrong\u003eVolkswagen\u003c/strong\u003e, the \u003cstrong\u003eBorders\u003c/strong\u003e bookstore chain, \u003cstrong\u003eTower Records\u003c/strong\u003e, \u003cstrong\u003eLevi’s\u003c/strong\u003e, and \u003cstrong\u003eChevrolet\u003c/strong\u003e, among others. He also orchestrated partnerships between \u003cstrong\u003eTommy Hilfiger\u003c/strong\u003e and \u003cstrong\u003eSheryl Crow\u003c/strong\u003e, \u003cstrong\u003eShania Twain\u003c/strong\u003e and \u003cstrong\u003eGitano Jeans\u003c/strong\u003e, and the \u003cstrong\u003eRolling Stones\u003c/strong\u003e and \u003cstrong\u003eSprint\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003e“Andrew has spent years cultivating relationships and identifying brands and partners to bring critical value and expanded reach across our entire portfolio,” Trell said. “I’m happy to see him elevated to this new position – it’s well deserved – and I’m looking forward to what’s ahead.”\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e“The opportunities in our company have never been more exciting or abundant for driving meaningful results for our partners.”\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAndrew Klein, AEG Presents\u003c/span\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003eKlein added: “The opportunities in our company have never been more exciting or abundant for driving meaningful results for our partners. I look forward to continuing to develop and implement innovative programs that amplify our world-class brand partners and industry-leading music assets.”\u003c/p\u003e\u003cp\u003eA division of \u003cstrong\u003eAnschutz Entertainment Group\u003c/strong\u003e (\u003cstrong\u003eAEG\u003c/strong\u003e), AEG Presents is the world’s second-largest presenter of live music and entertainment, behind only \u003cstrong\u003e\u003ca title=\"Companies \u0026gt; Live Nation [594 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/live-nation/\"\u003eLive Nation\u003c/a\u003e\u003c/strong\u003e. Besides the aforementioned Coachella, Stagecoach, New Orleans Jazz Fest, and Mile High Music Fest, AEG Presents’ tentpole events include \u003cstrong\u003eBritish Summer Time at Hyde Park\u003c/strong\u003e, \u003cstrong\u003eHangout Festival\u003c/strong\u003e, \u003cstrong\u003eElectric Forest\u003c/strong\u003e, \u003cstrong\u003eBuckeye Country Superfest\u003c/strong\u003e, \u003cstrong\u003eRock En Seine\u003c/strong\u003e, and \u003cstrong\u003eAll Points East\u003c/strong\u003e.\u003c/p\u003e  \u003cp\u003eKlein’s promotion follows several other notable appointments at AEG Presents in recent months, including \u003ca href=\"https://www.musicbusinessworldwide.com/angie-rho-appointed-senior-vice-president-global-touring-at-aeg-presents/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eAngie Rho\u003c/strong\u003e’s appointment\u003c/a\u003e to Senior Vice President, Global Touring, and \u003ca href=\"https://www.musicbusinessworldwide.com/weston-hebert-named-vice-president-of-global-touring-at-aeg-presents/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eWeston Herbert\u003c/strong\u003e’s appointment\u003c/a\u003e to Vice President, Global Touring last month.\u003c/p\u003e\u003cp\u003eThe company recently \u003ca href=\"https://www.musicbusinessworldwide.com/aeg-realigns-management-structure-with-adam-wilkes-and-alex-hill-to-lead-companys-international-operations/\" target=\"_blank\" rel=\"noopener\"\u003eimplemented a new management structure\u003c/a\u003e for its international operations, with \u003cstrong\u003eAdam Wilkes\u003c/strong\u003e assuming responsibility for regional operations in Asia-Pacific and Europe in the new position of President and CEO, Europe and Asia-Pacific. \u003cstrong\u003eAlex Hill\u003c/strong\u003e assumed leadership of all of AEG’s global real estate and venue operations outside of the United States, in the new position of President and CEO, AEG International.\u003cspan\u003eMusic Business Worldwide\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-02-18T18:11:29Z",
  "modifiedTime": "2025-02-18T20:46:13Z"
}
