{
  "id": "3604e7db-2bbc-4d87-8080-5ce3f4940fed",
  "title": "BODEGA and THICK Bring Intimate Sets, Mental Health Discussion to Inaugural CoSigns Sessions: Recap + Photos",
  "link": "https://consequence.net/2025/02/bodega-thick-cosigns-sessions-photos-recap/",
  "description": "The Brooklyn bands headlined a very special evening at the Sound Mind Center. BODEGA and THICK Bring Intimate Sets, Mental Health Discussion to Inaugural CoSigns Sessions: Recap + Photos Ben Kaye",
  "author": "Ben Kaye",
  "published": "Tue, 25 Feb 2025 21:56:39 +0000",
  "source": "http://consequenceofsound.net/feed",
  "categories": [
    "Live",
    "Concert Reviews",
    "CoSigns",
    "Music",
    "Photo Galleries",
    "Wellness",
    "Indie Rock",
    "Mental Health",
    "Post-Punk",
    "Punk"
  ],
  "byline": "Ben Kaye",
  "length": 2566,
  "excerpt": "BODEGA and THICK headlined the inaugural CoSigns Sessions at Brooklyn's Sound Mind Center. See photos from the intimate event.",
  "siteName": "Consequence",
  "favicon": "https://consequence.net/wp-content/themes/cosv2/images/apple-touch-icon.png",
  "text": "This past Friday, BODEGA and THICK joined forces with Consequence for the first-ever CoSigns Sessions, an intimate concert event featuring unique sets and discussions on mental health. Held at Brooklyn’s Sound Mind Center, the evening benefited the organization’s mission of fostering mental health conversations through the power of music. In what was a very special night for all those in attendance (thank you for coming!), CoSigns Sessions saw both acts performing stripped-down versions of their tracks. THICK, previously honored with our CoSigns stamp of approval, softened their usually hard-hitting punk rock for the show. “We’re normally screaming on stage, but you can actually hear the lyrics now,” they joked. “It’s vulnerable!” It was, also, fitting. The four-piece’s songs like “Tell Myself” and new track “I’m Not Dying” explore many of the mental and emotional struggles many of us face. Hearing them in such a setting gave them a newfound immediacy. BODEGA, meanwhile, played perhaps more existential material such as “Shiny New Model” and “Images.” Many of their lyrics offer a critical take on how the modern world obscures our true selves, providing a fascinating perspective on everyday challenges. BODEGA went “mostly acoustic” for their set (at one point, Ben Hozie’s guitar connection went wonky and Nikki Belfiglio had to hold a mic up to his strumming), just days after opening for Jack White at the Brooklyn Paramount. They also tested out new songs like “Combustible” and “Backbeaten,” and even treated the audience to a cover of Milk Dick’s “Cry When Yr Young.” Milk Dick may seem obscure to some, but Hozie is obsessed with the band, and even interviewed leader Mike Delaney on the band’s ATM: BOODEGA at This Moment podcast. Following their performances, each band was joined by Sound Mind’s Advocacy Program Manager Mike Rublin for an open discussion about mental health. Both groups touched on topics such as wellness habits on the road, grappling with the necessity and anxiety of social media, and navigating the music industry. Each artist on stage presented a unique perspective, offering meaningful insights for all those who had the pleasure of listening. Soon, that will be everyone with an internet connection; we’ll be premiering video of the full panel discussions and selections of the performances in the coming weeks. Stay tuned for a glimpse of what went down at our first CoSigns Sessions, and consider it a teaser of what awaits at the next one! For now, check out photos of BODEGA and THICK’s CoSigns Sessions below.",
  "image": "https://consequence.net/wp-content/uploads/2025/02/thick-bodega-cosigns-sessions-sound-mind-center-brooklyn.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-id=\"1467925\" data-title=\"BODEGA and THICK Bring Intimate Sets, Mental Health Discussion to Inaugural CoSigns Sessions: Recap + Photos\" data-url=\"https://consequence.net/2025/02/bodega-thick-cosigns-sessions-photos-recap/\" data-page=\"1\" data-pages=\"1\" data-total-posts=\"1\" aria-live=\"polite\" aria-atomic=\"true\" data-nextpage=\"true\" data-nextpage-urls=\"true\" data-nextpage-pageviews=\"false\" data-nextpage-post-id=\"1467925\" data-nextpage-scroll=\"false\" data-nextpage-startpage=\"1\" data-nextpage-post-title=\"BODEGA and THICK Bring Intimate Sets, Mental Health Discussion to Inaugural CoSigns Sessions: Recap + Photos\" data-container-type=\"ul\" data-loading-style=\"infinite fading-circles\" data-repeater=\"default\" data-post-type=\"post\" data-order=\"DESC\" data-orderby=\"date\" data-offset=\"0\" data-posts-per-page=\"5\" data-scroll-distance=\"-200\" data-pause-override=\"true\" data-pause=\"true\" data-button-label=\"Load More\"\u003e\u003cp\u003eThis past Friday, \u003ca href=\"https://consequence.net/artist/bodega/\" target=\"_blank\" rel=\"noopener\"\u003eBODEGA\u003c/a\u003e and \u003ca href=\"https://consequence.net/artist/thick/\" target=\"_blank\" rel=\"noopener\"\u003eTHICK\u003c/a\u003e joined forces with \u003cem\u003eConsequence\u003c/em\u003e for the first-ever \u003ca href=\"https://consequence.net/2025/02/bodega-thick-cosigns-sessions-brooklyn/\" target=\"_blank\" rel=\"noopener\"\u003eCoSigns Sessions\u003c/a\u003e, an intimate concert event featuring unique sets and discussions on mental health. Held at Brooklyn’s Sound Mind Center, the evening benefited the organization’s mission of fostering mental health conversations through the power of music.\u003c/p\u003e\n\u003cp\u003eIn what was a very special night for all those in attendance (thank you for coming!), CoSigns Sessions saw both acts performing stripped-down versions of their tracks. THICK, previously honored with our \u003ca href=\"https://consequence.net/2020/03/artist-of-the-month-thick/\" target=\"_blank\" rel=\"noopener\"\u003eCoSigns\u003c/a\u003e stamp of approval, softened their usually hard-hitting punk rock for the show. “We’re normally screaming on stage, but you can actually hear the lyrics now,” they joked. “It’s vulnerable!”\u003c/p\u003e\n\u003cp\u003eIt was, also, fitting. The four-piece’s songs like “Tell Myself” and new track “I’m Not Dying” explore many of the mental and emotional struggles many of us face. Hearing them in such a setting gave them a newfound immediacy. BODEGA, meanwhile, played perhaps more existential material such as “Shiny New Model” and “Images.” Many of their lyrics offer a critical take on how the modern world obscures our true selves, providing a fascinating perspective on everyday challenges.\u003c/p\u003e\n\u003cp\u003eBODEGA went “mostly acoustic” for their set (at one point, Ben Hozie’s guitar connection went wonky and Nikki Belfiglio had to hold a mic up to his strumming), just days after opening for Jack White at the Brooklyn Paramount. They also tested out new songs like “Combustible” and “Backbeaten,” and even treated the audience to a cover of Milk Dick’s “Cry When Yr Young.” Milk Dick may seem obscure to some, but Hozie is obsessed with the band, and even interviewed leader Mike Delaney on the band’s \u003ca href=\"https://www.tryamazonmusic.com/aOe1kM\" target=\"_blank\" rel=\"noopener nofollow\"\u003e\u003cem\u003eATM: BOODEGA at This Moment \u003c/em\u003e\u003c/a\u003epodcast.\u003c/p\u003e\n\u003cp\u003eFollowing their performances, each band was joined by Sound Mind’s Advocacy Program Manager Mike Rublin for an open discussion about mental health. Both groups touched on topics such as wellness habits on the road, grappling with the necessity and anxiety of social media, and navigating the music industry. Each artist on stage presented a unique perspective, offering meaningful insights for all those who had the pleasure of listening.\u003c/p\u003e\n\u003cp\u003eSoon, that will be everyone with an internet connection; we’ll be premiering video of the full panel discussions and selections of the performances in the coming weeks. Stay tuned for a glimpse of what went down at our first CoSigns Sessions, and consider it a teaser of what awaits at the next one!\u003c/p\u003e\n\u003cp\u003eFor now, check out photos of BODEGA and THICK’s CoSigns Sessions below.\u003c/p\u003e\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-25T16:56:39-05:00",
  "modifiedTime": "2025-02-25T17:27:54-05:00"
}
