{
  "id": "360a431e-1ef9-49da-94ec-21368a2694a9",
  "title": "Primus Hold Open Call for New Drummer",
  "link": "https://consequence.net/2024/11/primus-hold-call-new-drummer/",
  "description": "The band is \"currently taking submissions from all points in the universe.\" Primus Hold Open Call for New Drummer Spencer Kaufman",
  "author": "Spencer Kaufman",
  "published": "Mon, 18 Nov 2024 23:11:14 +0000",
  "source": "http://consequenceofsound.net/feed",
  "categories": [
    "Heavy Consequence",
    "Heavy Music News",
    "Music",
    "News",
    "Alternative Metal",
    "Audition",
    "Drums",
    "Funk Metal",
    "Modern Drummer"
  ],
  "byline": "Spencer Kaufman",
  "length": 2489,
  "excerpt": "Primus are looking for a new drummer following the abrupt departure of Tim \"Herb\" Alexander from the band, and they're opening the position to all drummers.",
  "siteName": "Consequence",
  "favicon": "https://consequence.net/wp-content/themes/cosv2/images/apple-touch-icon.png",
  "text": "Primus are looking for a new drummer following the abrupt departure of Tim “Herb” Alexander from the band, and they’re opening the position to anyone with skills behind the drum kit. A social media post from the band on Monday (November 18th) reads: “We are currently taking submissions from all points in the universe for the position of Primus drummer/percussionist. Seeking a well-mannered, affable individual with original sensibility and aesthetic, possessing a desire to open new doors in the creative world.” Get Primus and Sessanta V2.0 Tour Tickets Here The notice continues, “Flashy chops are wonderful, but groove, pocket, and the ability to listen, react, and contribute to the musical conversation is a must. Interested parties can submit a resume and a recent video performance to drumsearch@primusville.com.” After exiting Primus, Alexander explained that he had lost his passion for playing in the band, saying, “A lot of times, you do something you love for a long time, and sometimes the passion turns into a job, and sometimes that job doesn’t feel like it’s your being anymore. Over time, I started realizing that it was affecting my physical life, it was affecting my mental life, and it was affecting my family life, and my heart just wasn’t in it.” Primus holding an open call for drummers is similar to Smashing Pumpkins’ search for a new touring guitarist earlier this year. The Pumpkins received more than 10,000 submissions, with Kiki Wong eventually getting the job. In the meantime, members of Holy Mackerel and Frog Brigade will fill in on drums during Primus’ New Year’s Eve shows at the Fox Theater in Oakland, California, on December 30th and 31st, while Tool’s Danny Carey will perform with Primus during the “Tool Live in the Sand” destination festival in the Dominican Republic in March. It can be presumed that whoever gets the drumming job will join Primus on the “Sessanta V2.0” tour with A Perfect Circle and Puscifer. That outing kicks off in late April, with tickets available here. As mentioned in the notice, drummers interested in joining Primus alongside singer-bassist Les Claypool and guitarist Larry “Ler” LaLonde can submit a video performance to drumsearch@primusville.com. We are currently taking submissions from all points in the universe for the position of Primus drummer/percussionist.    Submit resume and a recent video performance todrumsearch@primusville.com pic.twitter.com/i3CtuiigVs — Primus (@primus) November 18, 2024",
  "image": "https://consequence.net/wp-content/uploads/2024/11/Primus.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-id=\"1443021\" data-title=\"Primus Hold Open Call for New Drummer\" data-url=\"https://consequence.net/2024/11/primus-hold-call-new-drummer/\" data-page=\"1\" data-pages=\"1\" data-total-posts=\"1\" aria-live=\"polite\" aria-atomic=\"true\" data-nextpage=\"true\" data-nextpage-urls=\"true\" data-nextpage-pageviews=\"false\" data-nextpage-post-id=\"1443021\" data-nextpage-scroll=\"false\" data-nextpage-startpage=\"1\" data-nextpage-post-title=\"Primus Hold Open Call for New Drummer\" data-container-type=\"ul\" data-loading-style=\"infinite fading-circles\" data-repeater=\"default\" data-post-type=\"post\" data-order=\"DESC\" data-orderby=\"date\" data-offset=\"0\" data-posts-per-page=\"5\" data-scroll-distance=\"-200\" data-pause-override=\"true\" data-pause=\"true\" data-button-label=\"Load More\"\u003e\u003cp\u003e\u003ca href=\"https://consequence.net/artist/primus/\" target=\"_blank\" rel=\"noopener\"\u003ePrimus\u003c/a\u003e are looking for a new drummer following the \u003ca href=\"https://consequence.net/2024/10/primus-departure-of-tim-herb-alexander/\" target=\"_blank\" rel=\"noopener\"\u003eabrupt departure\u003c/a\u003e of Tim “Herb” Alexander from the band, and they’re opening the position to anyone with skills behind the drum kit.\u003c/p\u003e\n\u003cp\u003eA social media post from the band on Monday (November 18th) reads: “We are currently taking submissions from all points in the universe for the position of Primus drummer/percussionist. Seeking a well-mannered, affable individual with original sensibility and aesthetic, possessing a desire to open new doors in the creative world.”\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003ca href=\"https://stubhub.prf.hn/click/camref:1100l9Pt3/pubref:primus*drummer-audition-button/destination:https%3A%2F%2Fwww.stubhub.com%2Fprimus-tickets%2Fperformer%2F9511\" target=\"_blank\" rel=\"nofollow noopener\"\u003eGet Primus and Sessanta V2.0 Tour Tickets Here\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe notice continues, “Flashy chops are wonderful, but groove, pocket, and the ability to listen, react, and contribute to the musical conversation is a must. Interested parties can submit a resume and a recent video performance to drumsearch@primusville.com.”\u003c/p\u003e\n\u003cp\u003eAfter exiting Primus, Alexander explained that he had \u003ca href=\"https://consequence.net/2024/11/drummer-tim-alexander-explains-primus-exit/\" target=\"_blank\" rel=\"noopener\"\u003elost his passion\u003c/a\u003e for playing in the band, saying, “A lot of times, you do something you love for a long time, and sometimes the passion turns into a job, and sometimes that job doesn’t feel like it’s your being anymore. Over time, I started realizing that it was affecting my physical life, it was affecting my mental life, and it was affecting my family life, and my heart just wasn’t in it.”\n\t\u003c/p\u003e\n\n\n\u003cp\u003ePrimus holding an open call for drummers is similar to Smashing Pumpkins’ search for a new touring guitarist earlier this year. The Pumpkins \u003ca href=\"https://consequence.net/2024/01/smashing-pumpkins-guitarist-submissions/\" target=\"_blank\" rel=\"noopener\"\u003ereceived more than 10,000 submissions\u003c/a\u003e, with Kiki Wong eventually getting the job.\u003c/p\u003e\n\u003cp\u003eIn the meantime, members of Holy Mackerel and Frog Brigade will fill in on drums during Primus’ New Year’s Eve shows at the Fox Theater in Oakland, California, on December 30th and 31st, while Tool’s Danny Carey will perform with Primus during the \u003ca href=\"https://consequence.net/2024/10/tool-2025-destination-festival/\" target=\"_blank\" rel=\"noopener\"\u003e“Tool Live in the Sand” destination festival\u003c/a\u003e in the Dominican Republic in March.\u003c/p\u003e\n\u003cp\u003eIt can be presumed that whoever gets the drumming job will join Primus on the \u003ca href=\"https://consequence.net/2024/09/a-perfect-circle-primus-puscifer-2025-sessanta-v2-0-tour/\" target=\"_blank\" rel=\"noopener\"\u003e“Sessanta V2.0” tour\u003c/a\u003e with A Perfect Circle and Puscifer. That outing kicks off in late April, with \u003ca href=\"https://stubhub.prf.hn/click/camref:1100l9Pt3/pubref:primus*drummer-audition/destination:https%3A%2F%2Fwww.stubhub.com%2Fprimus-tickets%2Fperformer%2F9511\" target=\"_blank\" rel=\"noopener nofollow\"\u003etickets available here\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eAs mentioned in the notice, drummers interested in joining Primus alongside singer-bassist Les Claypool and guitarist Larry “Ler” LaLonde can submit a video performance to drumsearch@primusville.com.\u003c/p\u003e\n\n\u003cblockquote data-width=\"500\" data-dnt=\"true\"\u003e\n\u003cp lang=\"en\" dir=\"ltr\"\u003eWe are currently taking submissions from all points in the universe for the position of Primus drummer/percussionist.   \u003c/p\u003e\n\u003cp\u003eSubmit resume and a recent video performance to\u003cbr/\u003edrumsearch@primusville.com \u003ca href=\"https://t.co/i3CtuiigVs\" target=\"_blank\" rel=\"nofollow\"\u003epic.twitter.com/i3CtuiigVs\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— Primus (@primus) \u003ca href=\"https://twitter.com/primus/status/1858626046641295442?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow noopener\"\u003eNovember 18, 2024\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-18T18:11:14-05:00",
  "modifiedTime": null
}
