{
  "id": "3a6baf85-fa89-4472-a393-b331aaef3731",
  "title": "Jay Mehta talks Warner Music’s M\u0026A strategy in South Asia and how India will produce ‘the next big global wave for music.’",
  "link": "https://www.musicbusinessworldwide.com/jay-mehta-talks-warner-musics-ma-strategy-in-south-asia-and-how-india-is-going-to-produce-the-next-big-global-wave-for-music/",
  "description": "MBW’s World Leaders series meets Jay Mehta, Managing Director, Warner Music South Asia Source",
  "author": "Murray Stassen",
  "published": "Mon, 02 Dec 2024 16:43:52 +0000",
  "source": "https://www.musicbusinessworldwide.com/feed/",
  "categories": [
    "Interviews",
    "World Leaders"
  ],
  "byline": "Murray Stassen",
  "length": 14650,
  "excerpt": "MBW’s World Leaders series meets Jay Mehta, Managing Director, Warner Music South Asia…",
  "siteName": "Music Business Worldwide",
  "favicon": "https://www.musicbusinessworldwide.com/wp-content/themes/mb/assets/img/icons/favicon-192x192.png",
  "text": "MBW’s World Leaders is a regular series in which we turn the spotlight toward some of the most influential industry figures overseeing key international markets. In this feature, we speak to Jay Mehta, Managing Director, Warner Music South Asia. World Leaders is supported by PPL.India is a big priority for Warner Music Group – and it’s not hard to see why.The company’s CEO Robert Kyncl told analysts on WMG’s calendar Q3 earnings call the other week that India “will become an increasingly influential global force in the music business”.He pointed out the gap between the size of the market’s GDP (the world’s fifth largest) versus the size of its recorded music market (the world’s 14th largest).Kyncl argued that this gap will close, pointing to the opportunity in subscription music streaming. He noted that only 2% of the country’s 1.4 billion population currently subscribe to music streaming services, but that India’s total subscriber number has grown 40% over the past year.India might not be the largest market globally by number of music subscribers, but it could be on course to become the largest by volume of streams.Stats published by Luminate in January showed that India saw the biggest YoY increase in total annual on-demand music streams of any nation last year.If annual streaming volume growth in the US slows in 2024, as many expect it will – but India manages to sustain its 2023 YoY streaming growth margin this year – India could become the world’s largest music streaming territory by volume in 2024.WMG officially launched Warner Music India in March 2020, headed up by Jay Mehta.He joined Warner Music Group following several years at Sony Music on April 1, 2020, right in the middle of the first COVID lockdown.His remit expanded in April 2024 to include oversight of Bangladesh, Nepal, Pakistan, and Sri Lanka as Managing Director of the newly formed Warner Music South Asia.“We had a very interesting start to Warner Music India,” Mehta tells us. “But what we’ve done in the last four years is significant.”Warner Music has since inked several distribution and M\u0026A deals in the market, looking to bolster its positioning amid projections of significant subscriber growth and streaming consumption domestically.On the distribution front, WMG has struck deals with Bollywood specialist Tips Music and Punjabi music company Sky Digital India.WMG’s M\u0026A moves, meanwhile, include a strategic investment in JetSynthesys’ Global Music Junction in April. It also acquired India-based artist management and live events company E–Positive in October 2023 and bought a majority stake in digital media and music company Divo in February last year.Most recently, earlier this month, WMG took a minority stake in ticketing platform SkillBox, just a couple of weeks after Robert Kyncl revealed via an Economic Times article that WMG is actively seeking M\u0026A opportunities in India.Speaking with MBW, Jay Mehta reiterates that M\u0026A will be key to the company’s expansion in India.“One of the things we always aimed for when I started Warner Music India was to become a top three label in the country,” he tells us. “It seemed very ambitious when we started because we were the last big player to enter the market.”He adds: “To have that kind of dream in an extremely competitive Indian market, without having a domestic catalog, almost felt unreal. But [we’ve already] had success. In the month of March, we had close to 30 tracks in Spotify‘s Top 200 and we don’t have a big catalog as part of Warner [in India]”.“We want to be the flag bearers taking this sound global, and I think we’ve had a good start in that.”Jay MehtaIn addition to preparing for India’s domestic music industry growth through local partnerships and investments, Mehta argues that India will start playing an increasingly influential creative role in the global music industry.He predicts that Punjabi-language music will be the next global breakout genre after K-pop and Afrobeats.“I’ve been saying this for a while now,” he says. “The first interview that I gave when I started Warner Music India was about this. I truly believe the next global wave is going to be from India.  And I feel Punjabi music has all the ingredients to make that happen, from the beats to the melody and the artists.”Warner is seeing success in India and globally with frontline Punjabi-language artists like Diljit Dosanjh, who signed his first major label partnership with WMG in March 2022. According to Mehta, Dosanjh is becoming “one of the biggest superstars of the Indian diaspora”.Evidence of Dosanjh’s global appeal arrived in April when he performed the biggest-ever Punjabi concert held outside of India at the BC Place Stadium in Vancouver, Canada. He also became the first-ever Punjabi-language artist to perform on The Tonight Show with Jimmy Fallon in June.“We want to be the flag bearers taking this sound global, and I think we’ve had a good start,” says Mehta.Other Warner-affiliated Punjabi-language stars include Shubh, plus Karan Aujla who is signed between Warner Music India and its Toronto-based JV with Warner Music Canada, 91 North. Warner also works with Hindi-language superstar rapper, King.“All of these artists will ensure that it’s not just a one-artist phenomenon,” says Mehta. “A big cultural shift is going to happen.”Mehta tells us that the 91 North joint venture, led by Ikwinder (Ikky) Singh and Ajay Charlie ‘B’ Saxena, forms part of Warner’s “ambition of taking South Asian music to the world”.He plans to replicate the model in other countries but explains that Canada was chosen as the first location for the JV, because it’s where a “big cultural revolution is happening in terms of content creation” in the global South Asian diaspora.“There are a lot of markets which are consumption markets for South Asian music, but Canada is becoming a big creator hub,” adds Mehta. “That’s why we wanted to do this JV in Canada. It’s where some of the biggest artists and so the best music is getting created.”He spotlights the success of Karan Aujla and Ikky’s Making Memories album as an example of crossover success in the market. It reached No.5 on the Canadian album chart last summer, the highest-charting Punjabi-language album in the chart’s history.Looking ahead, Mehta says that he’s looking forward to the day when a frontline South Asian artist “celebrates a mainstream award” like a Grammy in a major category.“Fingers crossed on that one,” he says and tells MBW about the steps WMG is taking to try and make that a reality…What markets globally are you identifying as key creative hubs for South Asian music like Canada?India and Pakistan are the most obvious markets. But outside of the South Asian community in South Asia and Canada, we’re seeing [potential] in California and lots of parts of the US.The UK has always been a hub, but I think it has started to mirror some of those [trends] from Canada. That’s where we want to take North records – to all of these diaspora markets.Could you comment on Diljit Dosanjh’s success in North America?It’s a big moment, not only for him but for the entire community. We always wanted there to be the flag bearer of taking this sound global, or taking South Asia global.He is leading from the front with the successes and the amount of interest that he’s generating from across the world and on his North American tour. We’ve seen arenas sold out and sold out within days of him announcing the tour. That’s incredible.We don’t see that happen for many artists, not only South Asian artists but big, global artists; when they announce a tour, it gets sold out in hours. That’s the power of what Diljit has [achieved]. And a lot of that is reflected in other success as well.The amount of collaborations that we’ve done with him in the last 18 months is incredible. The Sia track [Hass Hass] was on Spotify charts in multiple countries. It was on YouTube charts in multiple countries.A series of big international collaborations are coming up. He’s only going to grow bigger from here.Looking at his touring stats, he has arguably broken the North American market in live. Are those collaborations with global stars the key to breaking the North American market, in terms of breaking into the top 10 of the Hot 100?For sure, yes. That’s what we’re aiming for next. You’re right – in terms of touring, he’s already broken there, but we want to hit the Billboard charts and we want to hit top streaming charts in these markets.Collaborations are the immediate steps to ensuring that a wider audience beyond the diaspora starts to discover and stream his music.So we will have the fans of the artist he is collaborating with discover him, and slowly, the revolution will be complete in terms of, people who are not listening to South Asian music will now start listening to it because of him.As Punjabi artists become more successful globally, how competitive is it getting to sign artists from South Asia, and are you competing with labels in the US for those signings?Sure, but that’s only exciting for us.The more competition means that these artists are generating a lot of interest worldwide. That’s important. It’s a big positive takeaway for us, saying that a lot of big US labels are now interested in signing South Asian artists.What’s driving the growth in streaming volume domestically and in the global consumption of music from India?It’s a combination of how underpenetrated India as a market was, and at the same time, we now have artists who are [making] truly international-level music, and we have Indian artists who are becoming big stars.It’s a combination of all three. But, you know, the first track ever from India to hit the Global Top 25 on Spotify was by an artist that we [signed], called King.The second track to hit the Global Top 25 on Spotify was again from one of the artists signed to us, Jasleen Royal.These [global hits] were driven by a large number of streams from India. India, as a market, has approximately 220 million audio streaming users, which is just 40% of the country’s total YouTube users.  YouTube users are at around 550 million, approximately less than 50% of total mobile users.At such low levels of penetration, India is turning out the [domestic streaming] numbers [to produce] a truly Global Top 25 on Spotify.Imagine, even if we reach 50% of India’s total mobile population using audio streaming, we might start having global No.1s only coming from streams [from within] India.We are growing much faster than large parts of the world. So even at these big numbers and big base, there’s a market that is going to multiply. And we finally also have a big list of artists who are making truly international music of very good quality. India is going to [produce] the next big global wave for music.Circling back to Warner Music’s positioning in India and in South Asia, you’ve signed a few partnerships and made a few investments since 2020. How important will M\u0026A be in expanding your presence in the market in the coming months and years?M\u0026A is important because the larger aim is to be a top label in the country within the first five years of launching. And we’re not too far from that. We’re definitely in the Top 5.  M\u0026A is a way of ensuring that, more importantly, we have deeper penetration and deeper presence within a country.India behaves like a continent in terms of music, where music is created in different languages, in different states. Each language and each state has a journey of its own.Our aim was to ensure that we are definitely present in at least 12 or 13 of the country’s top languages. While Hindi was growing faster than English, regional languages were growing multiple times faster than Hindi.That was our big objective: ensuring that we grow bottom up and be closer to the ground. That’s why most of our M\u0026A deals are in the regional space.We acquired a company which is one of the biggest media companies in the south of India, called Divo. We have a big presence in Punjab through acquisitions and a partnership with Sky Digital. We invested in the biggest central India company called Global Music Junction. As we speak, we effectively have some sort of presence in 19 of 28 states in the country on the back of M\u0026A.While at the center, we are signing artists and making ourselves a destination for pop culture in India. But at the same time, we are creating this ecosystem across the country by having the same philosophy across different languages to our partners.What was the thinking behind the launch of Warner Music South Asia?It was started with the objective of taking the success that we had in India and replicating it in other South Asian nations. Because, like I said, our dream is to take South Asian music to the world. And it will happen off the back of, not just India, but by taking Pakistan, Bangladesh, and this entire creative hub across these countries to the world.And because of proximity to these markets, the idea was to operate Warner Music South Asia from Dubai, but all of these countries have access to Pakistan, Bangladesh, Sri Lanka, and Nepal.Pakistan in particular is the second-biggest South Asian market outside of India, and some of the best content created there is through Coke Studio. So we decided to invest in the company called Giraffe Studios, which have been making the biggest tracks out of Coke Studio.The idea was to ensure that we look at South Asia holistically, and that means that across India, Pakistan and Bangladesh, collectively, we have to take these cultures to the world. That’s the larger idea behind the South Asia [division].What are your longer-term predictions for the music sector in both India and wider South Asia?This phenomenon is here to stay. We are just at the tip of the iceberg in terms of exploring the true potential of South Asian music and the artists.The presence is truly felt, both in terms of music and consumption, and now artists like Karan Aujla are winning Junos and Diljit Dosanjh are selling out stadiums.These are very encouraging signs. But in the near long term, we will see a big, major South Asian music wave throughout the world. These are the best times for South Asian music and artists.World Leaders is supported by PPL, a leading international neighbouring rights collector, with best-in-class operations that help performers and recording rightsholders around the world maximise their royalties. Founded in 1934, PPL collects money from across Africa, Asia, Australia, Europe, and North and South America. It has collected over £500 million internationally for its members since 2006.Music Business Worldwide",
  "image": "https://www.musicbusinessworldwide.com/files/2021/06/WL_300x250-2-691x576.gif",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eMBW’s World Leaders is a regular series in which we turn the spotlight toward some of the most influential industry figures overseeing key international markets. In this feature, we speak to Jay Mehta, Managing Director, Warner Music South Asia. World Leaders is supported by \u003ca target=\"_blank\" href=\"https://www.ppluk.com/\" rel=\"noopener\"\u003ePPL.\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\u003cfigure\u003e\u003cimg data-src=\"https://www.musicbusinessworldwide.com/files/2021/06/WL_300x250-2.gif\"/\u003e\u003c/figure\u003e\u003cp\u003eIndia is a big priority for \u003ca title=\"Companies \u0026gt; Warner Music Group [3,041 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/access-industries/warner-music-group/\"\u003eWarner Music Group\u003c/a\u003e – and it’s not hard to see why.\u003c/p\u003e\u003cp\u003eThe company’s CEO \u003cstrong\u003e\u003ca title=\"People \u0026gt; Robert Kyncl [173 articles]\" href=\"https://www.musicbusinessworldwide.com/people/robert-kyncl/\"\u003eRobert Kyncl\u003c/a\u003e\u003c/strong\u003e told analysts on WMG’s calendar Q3 earnings call the other week that India “will become an increasingly influential global force in the music business”.\u003c/p\u003e\u003cp\u003eHe pointed out the gap between the size of the market’s GDP (the world’s fifth largest) versus the size of its recorded music market (the world’s 14th largest).\u003c/p\u003e\u003cp\u003eKyncl argued that this gap \u003cem\u003ewill\u003c/em\u003e close, pointing to the opportunity in subscription music streaming. He noted that only 2% of the country’s 1.4 billion population currently subscribe to music streaming services, but that India’s total subscriber number has grown 40% over the past year.\u003c/p\u003e\u003cp\u003eIndia might not be the largest market globally by number of music subscribers, but it could be on course to become the largest by volume of streams\u003cem\u003e.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eStats\u003ca href=\"https://www.musicbusinessworldwide.com/india-could-become-the-worlds-biggest-music-streaming-market-by-volume-in-2024/\"\u003e published\u003c/a\u003e by \u003ca href=\"https://www.musicbusinessworldwide.com/companies/luminate/\"\u003eLuminate\u003c/a\u003e in January showed that India saw the biggest YoY increase in total annual on-demand music streams of any nation last year.\u003c/p\u003e\u003cp\u003eIf annual streaming volume growth in the \u003cstrong\u003eUS\u003c/strong\u003e slows in 2024, as many expect it will – but \u003cstrong\u003eIndia\u003c/strong\u003e manages to sustain its 2023 YoY streaming growth margin this year – India could become the world’s largest music streaming territory by \u003cstrong\u003evolume\u003c/strong\u003e in 2024.\u003c/p\u003e\u003cp\u003eWMG\u003ca href=\"https://www.musicbusinessworldwide.com/warner-music-india-launches-headed-by-ex-sony-exec-jay-mehta/\"\u003e officially launched\u003c/a\u003e Warner Music India in March 2020, headed up by \u003cstrong\u003eJay Mehta.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eHe joined Warner Music Group following several years at \u003ca title=\"Companies \u0026gt; Sony Music Entertainment [1,756 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/sony/sony-music-group/sony-music-entertainment/\"\u003eSony Music\u003c/a\u003e on April 1, 2020, right in the middle of the first COVID lockdown.\u003c/p\u003e\u003cp\u003eHis remit expanded in April 2024 to include oversight of Bangladesh, Nepal, Pakistan, and Sri Lanka as Managing Director of\u003ca href=\"https://www.musicbusinessworldwide.com/warner-music-group-launches-warner-music-south-asia-led-by-jay-mehta/\"\u003e the newly formed\u003c/a\u003e Warner Music South Asia.\u003c/p\u003e\u003cp\u003e“We had a very interesting start to Warner Music India,” Mehta tells us. “But what we’ve done in the last four years is significant.”\u003c/p\u003e\u003cp\u003eWarner Music has since inked several \u003cstrong\u003edistribution\u003c/strong\u003e and \u003cstrong\u003eM\u0026amp;A\u003c/strong\u003e deals in the market, looking to bolster its positioning amid projections of significant subscriber growth and streaming consumption domestically.\u003c/p\u003e\u003cp\u003eOn the distribution front, WMG has\u003ca href=\"https://www.musicbusinessworldwide.com/warner-inks-distribution-deal-with-bollywood-specialist-tips-music-in-india/\"\u003e struck deals\u003c/a\u003e with Bollywood specialist \u003cstrong\u003eTips Music\u003c/strong\u003e and Punjabi music company \u003ca href=\"https://www.musicbusinessworldwide.com/warner-music-inks-exclusive-distribution-deal-with-punjabi-music-company-sky-digital-india/\"\u003eSky Digital India\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eWMG’s M\u0026amp;A moves, meanwhile, include a\u003ca href=\"https://www.musicbusinessworldwide.com/warner-music-india-makes-strategic-investment-in-jetsynthesys-global-music-junction1/\"\u003e strategic investment\u003c/a\u003e in JetSynthesys’ \u003cstrong\u003eGlobal Music Junction\u003c/strong\u003e in April. It also\u003ca href=\"https://www.musicbusinessworldwide.com/darshan-raval-warner-acquires-e-positive-in-india/\"\u003e acquired\u003c/a\u003e India-based artist management and live events company \u003cstrong\u003eE\u003c/strong\u003e–\u003cstrong\u003ePositive\u003c/strong\u003e in October 2023 and bought a majority stake in digital media and music company \u003cstrong\u003eDivo\u003c/strong\u003e in February last year.\u003c/p\u003e\u003cp\u003eMost recently, earlier this month, WMG took a minority stake in ticketing platform \u003cstrong\u003eSkillBox\u003c/strong\u003e, just a couple of weeks after Robert Kyncl \u003ca href=\"https://m.economictimes.com/industry/media/entertainment/india-next-billion-user-market-for-warner-music-ceo-robert-kyncl/articleshow/114663630.cms#:~:text=India%2C%20alongside%20China%2C%20is%20one,seeking%20acquisition%20opportunities%20in%20India.\" target=\"_blank\" rel=\"noopener\"\u003erevealed\u003c/a\u003e via an \u003cem\u003eEconomic Times\u003c/em\u003e article that WMG is actively seeking M\u0026amp;A opportunities in India.\u003c/p\u003e\u003cp\u003eSpeaking with MBW, Jay Mehta reiterates that \u003cstrong\u003eM\u0026amp;A\u003c/strong\u003e will be key to the company’s expansion in India.\u003c/p\u003e\u003cp\u003e“One of the things we always aimed for when I started Warner Music India was to become a top three label in the country,” he tells us. “It seemed very ambitious when we started because we were the last big player to enter the market.”\u003c/p\u003e\u003cp\u003eHe adds: “To have that kind of dream in an extremely competitive Indian market, without having a domestic catalog, almost felt unreal. But [we’ve already] had success. In the month of March, we had close to 30 tracks in \u003ca title=\"Companies \u0026gt; Spotify [4,061 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/spotify/\"\u003eSpotify\u003c/a\u003e‘s Top 200 and we don’t have a big catalog as part of Warner [in India]”.\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e“We want to be the flag bearers taking this sound global, and I think we’ve had a good start in that.”\u003c/p\u003e\u003cp\u003e\u003cspan\u003eJay Mehta\u003c/span\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003eIn addition to preparing for India’s domestic music industry growth through local partnerships and investments, Mehta argues that India will start playing an increasingly influential \u003cem\u003ecreative \u003c/em\u003erole in the global music industry.\u003c/p\u003e\u003cp\u003eHe predicts that Punjabi-language music will be the next global breakout genre after K-pop and Afrobeats.\u003c/p\u003e\u003cp\u003e“I’ve been saying this for a while now,” he says. “The first interview that I gave when I started Warner Music India was about this. I truly believe the next global wave is going to be from India.  And I feel Punjabi music has all the ingredients to make that happen, from the beats to the melody and the artists.”\u003c/p\u003e\u003cp\u003eWarner is seeing success in India and globally with frontline Punjabi-language artists like \u003cstrong\u003eDiljit Dosanjh\u003c/strong\u003e, who signed his first major label partnership with WMG\u003ca target=\"_blank\" href=\"https://www.wmg.com/news/indian-superstar-diljit-dosanjh-signs-deal-warner-music-36246\"\u003e in March 2022\u003c/a\u003e. According to Mehta, Dosanjh is becoming “one of the biggest superstars of the Indian diaspora”.\u003c/p\u003e\u003cp\u003eEvidence of \u003cstrong\u003eDosanjh’s \u003c/strong\u003eglobal appeal arrived in April when he performed the biggest-ever Punjabi concert held outside of India at the BC Place Stadium in Vancouver, Canada. He also became the first-ever Punjabi-language artist \u003ca target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/c722gn8p97zo\"\u003eto perform on The Tonight Show\u003c/a\u003e with \u003cstrong\u003eJimmy Fallon\u003c/strong\u003e in June.\u003c/p\u003e\u003cp\u003e“We want to be the flag bearers taking this sound global, and I think we’ve had a good start,” says Mehta.\u003c/p\u003e\u003chr/\u003e\u003cp\u003e\u003ciframe src=\"https://www.youtube.com/embed/g-Ij0idc_dk?si=e01nh6XlRmqjWOmP\" frameborder=\"0\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003chr/\u003e\u003cp\u003eOther Warner-affiliated Punjabi-language stars include \u003cstrong\u003eShubh,\u003c/strong\u003e plus \u003cstrong\u003eKaran Aujla\u003c/strong\u003e who is signed between Warner Music India and its Toronto-based JV with Warner Music Canada, \u003cstrong\u003e91 North. \u003c/strong\u003eWarner also works with Hindi-language superstar rapper, King.\u003c/p\u003e\u003cp\u003e“All of these artists will ensure that it’s not just a one-artist phenomenon,” says Mehta. “A big cultural shift is going to happen.”\u003c/p\u003e\u003cp\u003eMehta tells us that the 91 North joint venture, led by \u003cstrong\u003eIkwinder (Ikky) Singh\u003c/strong\u003e and \u003cstrong\u003eAjay Charlie ‘B’ Saxena\u003c/strong\u003e, forms part of Warner’s “ambition of taking South Asian music to the world”.\u003c/p\u003e\u003cp\u003eHe plans to replicate the model in other countries but explains that Canada was chosen as the first location for the JV, because it’s where a “big cultural revolution is happening in terms of content creation” in the global South Asian diaspora.\u003c/p\u003e\u003cp\u003e“There are a lot of markets which are consumption markets for South Asian music, but Canada is becoming a big creator hub,” adds Mehta. “That’s why we wanted to do this JV in Canada. It’s where some of the biggest artists and so the best music is getting created.”\u003c/p\u003e\u003cp\u003eHe spotlights the success of \u003cstrong\u003eKaran Aujla\u003c/strong\u003e and Ikky’s \u003cem\u003eMaking Memories\u003c/em\u003e album as an example of crossover success in the market. It reached No.5 on the Canadian album chart last summer, the highest-charting Punjabi-language album in the chart’s history.\u003c/p\u003e\u003cp\u003eLooking ahead, Mehta says that he’s looking forward to the day when a frontline South Asian artist “celebrates a mainstream award” like a Grammy in a major category.\u003c/p\u003e\u003cp\u003e“Fingers crossed on that one,” he says and tells MBW about the steps WMG is taking to try and make that a reality…\u003c/p\u003e\u003chr/\u003e\u003ch6\u003e\u003cstrong\u003eWhat markets globally are you identifying as key creative hubs for South Asian music like Canada?\u003c/strong\u003e\u003c/h6\u003e\u003cp\u003eIndia and Pakistan are the most obvious markets. But outside of the South Asian community in South Asia and Canada, we’re seeing [potential] in California and lots of parts of the US.\u003c/p\u003e\u003cp\u003eThe UK has always been a hub, but I think it has started to mirror some of those [trends] from Canada. That’s where we want to take North records – to all of these diaspora markets.\u003c/p\u003e\u003chr/\u003e\u003ch6\u003e\u003cstrong\u003eCould you comment on Diljit Dosanjh’s success in North America?\u003c/strong\u003e\u003c/h6\u003e\u003cp\u003eIt’s a big moment, not only for him but for the entire community. We always wanted there to be the flag bearer of taking this sound global, or taking South Asia global.\u003c/p\u003e\u003cp\u003eHe is leading from the front with the successes and the amount of interest that he’s generating from across the world and on his North American tour. We’ve seen arenas sold out and sold out within days of him announcing the tour. That’s incredible.\u003c/p\u003e\u003cp\u003eWe don’t see that happen for many artists, not only South Asian artists but big, global artists; when they announce a tour, it gets sold out in hours. That’s the power of what Diljit has [achieved]. And a lot of that is reflected in other success as well.\u003c/p\u003e\u003chr/\u003e\u003cp\u003e\u003ciframe src=\"https://www.youtube.com/embed/jADTdg-o8i0?si=S2B-hVxTi3kaVkiB\" frameborder=\"0\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003chr/\u003e\u003cp\u003eThe amount of collaborations that we’ve done with him in the last 18 months is incredible. The Sia track [\u003cem\u003eHass Hass\u003c/em\u003e] was on Spotify charts in multiple countries. It was on \u003ca title=\"Companies \u0026gt; YouTube [1,922 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/youtube/\"\u003eYouTube\u003c/a\u003e charts in multiple countries.\u003c/p\u003e\u003cp\u003eA series of big international collaborations are coming up. He’s only going to grow bigger from here.\u003c/p\u003e\u003ch6\u003e\u003cstrong\u003eLooking at his touring stats, he has arguably broken the North American market in live. Are those collaborations with global stars the key to breaking the North American market, in terms of breaking into the top 10 of the Hot 100?\u003c/strong\u003e\u003c/h6\u003e\u003cp\u003eFor sure, yes. That’s what we’re aiming for next. You’re right – in terms of touring, he’s already broken there, but we want to hit the \u003ca title=\"Companies \u0026gt; Billboard [1,331 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/billboard/\"\u003eBillboard\u003c/a\u003e charts and we want to hit top streaming charts in these markets.\u003c/p\u003e\u003cp\u003eCollaborations are the immediate steps to ensuring that a wider audience beyond the diaspora starts to discover and stream his music.\u003c/p\u003e\u003cp\u003eSo we will have the fans of the artist he is collaborating with discover him, and slowly, the revolution will be complete in terms of, people who are not listening to South Asian music will now start listening to it because of him.\u003c/p\u003e\u003chr/\u003e\u003ch6\u003e\u003cstrong\u003eAs Punjabi artists become more successful globally, how competitive is it getting to sign artists from South Asia, and are you competing with labels in the US for those signings?\u003c/strong\u003e\u003c/h6\u003e\u003cp\u003eSure, but that’s only exciting for us.\u003c/p\u003e\u003cp\u003eThe more competition means that these artists are generating a lot of interest worldwide. That’s important. It’s a big positive takeaway for us, saying that a lot of big US labels are now interested in signing South Asian artists.\u003c/p\u003e\u003chr/\u003e\u003ch6\u003e\u003cstrong\u003eWhat’s driving the growth in streaming volume domestically and in the global consumption of music from India?\u003c/strong\u003e\u003c/h6\u003e\u003cp\u003eIt’s a combination of how underpenetrated India as a market was, and at the same time, we now have artists who are [making] truly international-level music, and we have Indian artists who are becoming big stars.\u003c/p\u003e\u003cp\u003eIt’s a combination of all three. But, you know, the first track ever from India to hit the Global Top 25 on Spotify was by an artist that we [signed], called King.\u003c/p\u003e\u003cp\u003eThe second track to hit the Global Top 25 on Spotify was again from one of the artists signed to us, Jasleen Royal.\u003c/p\u003e\u003cp\u003eThese [global hits] were driven by a large number of streams from India. India, as a market, has approximately \u003cstrong\u003e220 million\u003c/strong\u003e audio streaming users, which is just 40% of the country’s total YouTube users.  YouTube users are at around 550 million, approximately less than 50% of total mobile users.\u003c/p\u003e\u003cp\u003eAt such low levels of penetration, India is turning out the [domestic streaming] numbers [to produce] a truly Global Top 25 on Spotify.\u003c/p\u003e\u003cp\u003eImagine, even if we reach \u003cstrong\u003e50%\u003c/strong\u003e of India’s total mobile population using audio streaming, we might start having global No.1s only coming from streams [from within] India.\u003c/p\u003e\u003cp\u003eWe are growing much faster than large parts of the world. So even at these big numbers and big base, there’s a market that is going to multiply. And we finally also have a big list of artists who are making truly international music of very good quality. India is going to [produce] the next big global wave for music.\u003c/p\u003e\u003chr/\u003e\u003ch6\u003e\u003cstrong\u003eCircling back to Warner Music’s positioning in India and in South Asia, you’ve signed a few partnerships and made a few investments since 2020. How important will M\u0026amp;A be in expanding your presence in the market in the coming months and years?\u003c/strong\u003e\u003c/h6\u003e\u003cp\u003eM\u0026amp;A is important because the larger aim is to be a top label in the country within the first five years of launching. And we’re not too far from that. We’re definitely in the Top 5.  M\u0026amp;A is a way of ensuring that, more importantly, we have deeper penetration and deeper presence within a country.\u003c/p\u003e\u003cp\u003eIndia behaves like a continent in terms of music, where music is created in different languages, in different states. Each language and each state has a journey of its own.\u003c/p\u003e\u003cp\u003eOur aim was to ensure that we are definitely present in at least 12 or 13 of the country’s top languages. While Hindi was growing faster than English, regional languages were growing multiple times faster than Hindi.\u003c/p\u003e\u003cp\u003eThat was our big objective: ensuring that we grow bottom up and be closer to the ground. That’s why most of our M\u0026amp;A deals are in the regional space.\u003c/p\u003e\u003cp\u003eWe acquired a company which is one of the biggest media companies in the south of India, called Divo. We have a big presence in Punjab through acquisitions and a partnership with Sky Digital. We invested in the biggest central India company called Global Music Junction. As we speak, we effectively have some sort of presence in 19 of 28 states in the country on the back of M\u0026amp;A.\u003c/p\u003e\u003cp\u003eWhile at the center, we are signing artists and making ourselves a destination for pop culture in India. But at the same time, we are creating this ecosystem across the country by having the same philosophy across different languages to our partners.\u003c/p\u003e\u003chr/\u003e\u003ch6\u003e\u003cstrong\u003eWhat was the thinking behind the launch of Warner Music South Asia?\u003c/strong\u003e\u003c/h6\u003e\u003cp\u003eIt was started with the objective of taking the success that we had in India and replicating it in other South Asian nations. Because, like I said, our dream is to take South Asian music to the world. And it will happen off the back of, not just India, but by taking Pakistan, Bangladesh, and this entire creative hub across these countries to the world.\u003c/p\u003e\u003cp\u003eAnd because of proximity to these markets, the idea was to operate Warner Music South Asia from Dubai, but all of these countries have access to Pakistan, Bangladesh, Sri Lanka, and Nepal.\u003c/p\u003e\u003cp\u003ePakistan in particular is the second-biggest South Asian market outside of India, and some of the best content created there is through Coke Studio. So we decided to invest in the company called Giraffe Studios, which have been making the biggest tracks out of Coke Studio.\u003c/p\u003e\u003cp\u003eThe idea was to ensure that we look at South Asia holistically, and that means that across India, Pakistan and Bangladesh, collectively, we have to take these cultures to the world. That’s the larger idea behind the South Asia [division].\u003c/p\u003e\u003chr/\u003e\u003ch6\u003e\u003cstrong\u003eWhat are your longer-term predictions for the music sector in both India and wider South Asia?\u003c/strong\u003e\u003c/h6\u003e\u003cp\u003eThis phenomenon is here to stay. We are just at the tip of the iceberg in terms of exploring the true potential of South Asian music and the artists.\u003c/p\u003e\u003cp\u003eThe presence is truly felt, both in terms of music and consumption, and now artists like Karan Aujla are winning Junos and Diljit Dosanjh are selling out stadiums.\u003c/p\u003e\u003cp\u003eThese are very encouraging signs. But in the near long term, we will see a big, major South Asian music wave throughout the world. These are the best times for South Asian music and artists.\u003c/p\u003e\u003cfigure\u003e\u003cem\u003e\u003cimg data-srcset=\"https://www.musicbusinessworldwide.com/files/2021/05/PPL-80x51.jpg 80w, https://www.musicbusinessworldwide.com/files/2021/05/PPL-160x101.jpg 160w, https://www.musicbusinessworldwide.com/files/2021/05/PPL-320x202.jpg 320w, https://www.musicbusinessworldwide.com/files/2021/05/PPL-418x264.jpg 418w\" data-sizes=\"auto\" srcset=\"https://www.musicbusinessworldwide.com/files/2021/05/PPL-80x51.jpg 80w, https://www.musicbusinessworldwide.com/files/2021/05/PPL-160x101.jpg 160w, https://www.musicbusinessworldwide.com/files/2021/05/PPL-320x202.jpg 320w, https://www.musicbusinessworldwide.com/files/2021/05/PPL-418x264.jpg 418w\"/\u003e\u003c/em\u003e\u003c/figure\u003e\u003cp\u003e\u003cem\u003e\u003cspan\u003e\u003ca href=\"https://www.ppluk.com/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eWorld Leaders is supported by \u003c/strong\u003e\u003cstrong\u003ePPL, a leading international neighbouring rights collector, with best-in-class operations that help performers and recording rightsholders around the world maximise their royalties. Founded in 1934, PPL collects money from across Africa, Asia, Australia, Europe, and North and South America. It has collected over £500 million internationally for its members since 2006.\u003c/strong\u003e\u003c/a\u003e\u003c/span\u003e\u003c/em\u003e\u003cspan\u003eMusic Business Worldwide\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "16 min read",
  "publishedTime": "2024-12-02T16:43:52Z",
  "modifiedTime": "2024-12-02T17:38:24Z"
}
