{
  "id": "43146ac1-f09a-4cbd-9e98-d7b213ac7d62",
  "title": "Wicked: Part One Now Streaming on Peacock",
  "link": "https://consequence.net/2025/03/wicked-peacock-streaming-march-21st/",
  "description": "The sing-along version, plus dozens of deleted scenes and extras, also arrives on the streaming service. Wicked: Part One Now Streaming on Peacock Paolo Ragusa",
  "author": "Paolo Ragusa",
  "published": "Fri, 21 Mar 2025 23:50:25 +0000",
  "source": "http://consequenceofsound.net/feed",
  "categories": [
    "Film",
    "News",
    "Streaming",
    "Cynthia Erivo",
    "Peacock",
    "Wicked"
  ],
  "byline": "Paolo Ragusa",
  "length": 1680,
  "excerpt": "After a massive theatrical run, Wicked: Part One is now streaming exclusively on Peacock as of March 21st along with deleted scenes, featurettes, and more.",
  "siteName": "Consequence",
  "favicon": "https://consequence.net/wp-content/themes/cosv2/images/apple-touch-icon.png",
  "text": "After a lauded theatrical run, Wicked: Part One is now streaming on Peacock as of March 21st. Along with the Oscar-nominated film, Peacock hosts the film’s Sing-Along version, which landed in theaters on Christmas Day, and the “Defying Gravity” collection of Wicked bonus content. The collection includes the NBC special Defying Gravity: The Curtain Rises on Wicked, which features stars Cynthia Erivo and Ariana Grande reflecting on their Wicked journeys alongside cast members Jonathan Bailey, Ethan Slater, Bowen Yang, Marissa Bode, Michelle Yeoh and Jeff Goldblum. Also featured is Making of Wicked, which offers an extensive behind-the-scenes look into the film’s characters, costumes, sets, designs, and choreography. There’s also large slate of deleted and extended scenes, including Pfannee, ShenShen, and Glinda’s reunion at Shiz University, Glinda teaching Elphaba a game called “Toss, Toss,” Elphaba making a promise to Glinda, a chat between Boq and Elphaba, more footage of Elphaba and Glinda’s trip to Emerald City, and more. Finally, the collection features a few Wicked “Featurettes” as well as a pair of “As Seen on Screen” podcast episodes. The sheer amount of content should be enough to hold Wicked fans over until the release of Part Two, now titled Wicked: For Good, which arrives on November 21st. Meanwhile, Erivo and Grande are set to celebrate Wicked‘s Academy Awards campaign with an opening performance at the 2025 Oscars on March 2nd. For those who prefer physical media, Wicked is currently available to purchase on 4K, Blu-ray, and DVD. Revisit our review of Wicked, where we praised the film’s design, musical sequences, performances, and more.",
  "image": "https://consequence.net/wp-content/uploads/2025/02/Wicked-Peacock-Streaming-March-21.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-id=\"1466609\" data-title=\"Wicked: Part One Now Streaming on Peacock\" data-url=\"https://consequence.net/2025/03/wicked-peacock-streaming-march-21st/\" data-page=\"1\" data-pages=\"1\" data-total-posts=\"1\" aria-live=\"polite\" aria-atomic=\"true\" data-nextpage=\"true\" data-nextpage-urls=\"true\" data-nextpage-pageviews=\"false\" data-nextpage-post-id=\"1466609\" data-nextpage-scroll=\"false\" data-nextpage-startpage=\"1\" data-nextpage-post-title=\"Wicked: Part One Now Streaming on Peacock\" data-container-type=\"ul\" data-loading-style=\"infinite fading-circles\" data-repeater=\"default\" data-post-type=\"post\" data-order=\"DESC\" data-orderby=\"date\" data-offset=\"0\" data-posts-per-page=\"5\" data-scroll-distance=\"-200\" data-pause-override=\"true\" data-pause=\"true\" data-button-label=\"Load More\"\u003e\u003cp\u003eAfter a lauded theatrical run, \u003ca href=\"https://consequence.net/tag/wicked/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cem\u003eWicked: Part One\u003c/em\u003e\u003c/a\u003e is now streaming on Peacock as of March 21st.\u003c/p\u003e\n\u003cp\u003eAlong with the Oscar-nominated film, Peacock hosts the film’s \u003ca href=\"https://consequence.net/2024/12/wicked-sing-along-screenings-christmas/\" target=\"_blank\" rel=\"noopener\"\u003eSing-Along version\u003c/a\u003e, which landed in theaters on Christmas Day, and the “Defying Gravity” collection of \u003cem\u003eWicked\u003c/em\u003e bonus content.\u003c/p\u003e\n\u003cp\u003eThe collection includes the NBC special \u003cem\u003eDefying Gravity: The Curtain Rises on Wicked\u003c/em\u003e, which features stars \u003ca href=\"https://consequence.net/tag/cynthia-erivo/\" target=\"_blank\" rel=\"noopener\"\u003eCynthia Erivo\u003c/a\u003e and \u003ca href=\"https://consequence.net/artist/ariana-grande/\" target=\"_blank\" rel=\"noopener\"\u003eAriana Grande\u003c/a\u003e reflecting on their \u003cem\u003eWicked\u003c/em\u003e journeys alongside cast members Jonathan Bailey, Ethan Slater, Bowen Yang, Marissa Bode, Michelle Yeoh and Jeff Goldblum.\n\t\u003c/p\u003e\n\n\n\u003cp\u003eAlso featured is \u003cem\u003eMaking of Wicked\u003c/em\u003e, which offers an extensive behind-the-scenes look into the film’s characters, costumes, sets, designs, and choreography. There’s also large slate of deleted and extended scenes, including Pfannee, ShenShen, and Glinda’s reunion at Shiz University, Glinda teaching Elphaba a game called “Toss, Toss,” Elphaba making a promise to Glinda, a chat between Boq and Elphaba, more footage of Elphaba and Glinda’s trip to Emerald City, and more.\u003c/p\u003e\n\u003cp\u003eFinally, the collection features a few \u003cem\u003eWicked\u003c/em\u003e “Featurettes” as well as a pair of “As Seen on Screen” podcast episodes. The sheer amount of content should be enough to hold \u003cem\u003eWicked\u003c/em\u003e fans over until the release of Part Two, \u003ca href=\"https://consequence.net/2024/12/wicked-part-2-new-name-release-date/\" target=\"_blank\" rel=\"noopener\"\u003enow titled \u003cem\u003eWicked: For Good\u003c/em\u003e\u003c/a\u003e, which arrives on November 21st. Meanwhile, Erivo and Grande are set to celebrate \u003cem\u003eWicked\u003c/em\u003e‘s Academy Awards campaign with an \u003ca href=\"https://consequence.net/2025/02/oscars-wicked-medley-ariana-grande-cynthia-erivo/\" target=\"_blank\" rel=\"noopener\"\u003eopening performance at the 2025 Oscars\u003c/a\u003e on March 2nd.\u003c/p\u003e\n\u003cp\u003eFor those who prefer physical media, \u003cem\u003eWicked\u003c/em\u003e is currently available to purchase on \u003ca href=\"https://amzn.to/4bbHlKL\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003e4K\u003c/a\u003e, \u003ca href=\"https://amzn.to/4hKCT8h\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"\u003eBlu-ray\u003c/a\u003e, and \u003ca href=\"https://amzn.to/4b7S5Kc\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003eDVD\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eRevisit our \u003ca href=\"https://consequence.net/2024/11/wicked-part-1-review-cynthia-erivo/\" target=\"_blank\" rel=\"noopener\"\u003ereview\u003c/a\u003e of \u003cem\u003eWicked\u003c/em\u003e, where we praised the film’s design, musical sequences, performances, and more.\u003c/p\u003e\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-03-21T19:50:25-04:00",
  "modifiedTime": null
}
