{
  "id": "6280aa27-abfb-41a4-ab5e-3e4824fb6fcb",
  "title": "SCOWL's KAT MOSS Explains The Band's Hardcore Ethos \u0026 \"Practice Of Radical Expression\"",
  "link": "https://metalinjection.net/news/scowls-kat-moss-explains-the-bands-hardcore-ethos-practice-of-radical-expression",
  "description": "Hardcore is not a genre, it's a state of mind, bro. The post SCOWL's KAT MOSS Explains The Band's Hardcore Ethos \u0026 \"Practice Of Radical Expression\" appeared first on Metal Injection.",
  "author": "Isabella Ambrosio",
  "published": "Fri, 28 Mar 2025 17:10:30 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Latest News",
    "SCOWL"
  ],
  "byline": "By Isabella Ambrosio Published 8 hours ago",
  "length": 1948,
  "excerpt": "Hardcore is not a genre, it's a state of mind, bro.",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "Hardcore is an ethos. A state of being and understanding. And Scowl's Kat Moss understands that more than most. The lead vocalist spoke to Kerrang! about the band's upcoming record, Are We All Angels, and slight venture away from straight hardcore that Scowl is known for: \"I love hardcore, but it’s not my prerogative, and I’m okay with that. I think that, in and of itself, is very hardcore, on the ethos side of things.” Are We All Angels is due out on April 4, with Scowl releasing singles such as \"Tonight (I'm Afraid),\" \"B.A.B.E.,\" \"Not Hell, Not Heaven,\" and \"Special,\" to support the upcoming release. The singles definitely err on the lighter side of Scowl's sound, something they began to explore on their 2023 EP Psychic Dance Party, but Are We All Angels pushes the envelope even further. However, when it comes to moving away from the hardcore sound, vocalist Moss reassures that the band wants to \"consistently embody a hardcore mindset, to whatever degree is possible. But also, I love music as a whole. It’s not just about punk and hardcore for me. Music and art are so vital to my existence, so why wouldn’t I honour that?\" You can save Scowl's upcoming record here, and you can find the remaining US dates, and upcoming UK dates, below for the band's tour in support of Are We All Angels. 3/29 Salt Lake City, Utah The Complex3/31 Seattle, Washington Paramount Theatre4/1 Portland, Oregon Roseland Theatre4/3 Wheatland, California Hard Rock Live Sacramento4/4 San Francisco, California The Masonic4/6 Los Angeles, California The Torch at the LA Memorial Coliseum5/5 Manchester, England Rebellion5/6 Newcastle Upon Tyne, England Digital5/7 Glasgow, Scotland The Cathouse5/8 Bristol, England Thekla5/9 London, England The Dome London Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2025/01/Scowl-2024.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003eHardcore is an ethos. A state of being and understanding. And \u003cstrong\u003eScowl\u003c/strong\u003e\u0026#39;s \u003cstrong\u003eKat\u003c/strong\u003e \u003cstrong\u003eMoss\u003c/strong\u003e understands that more than most.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe lead vocalist spoke to \u003cem\u003e\u003ca href=\"https://www.kerrang.com/scowl-interview-kerrang-cover-story-vocalist-kat-moss-hardcore-are-we-all-angels-slam-dunk-festival-dead-oceans\"\u003eKerrang!\u003c/a\u003e\u003c/em\u003e about the band\u0026#39;s upcoming record, \u003cem\u003eAre We All Angels,\u003c/em\u003e and slight venture away from straight hardcore that \u003cstrong\u003eScowl\u003c/strong\u003e is known for: \u0026#34;I love hardcore, but it’s not my prerogative, and I’m okay with that. I think that, in and of itself, is very hardcore, on the ethos side of things.”\n\n\n\n\u003c/p\u003e\u003cp\u003e\u003cem\u003eAre We All Angels\u003c/em\u003e is due out on April 4, with \u003cstrong\u003eScowl\u003c/strong\u003e releasing singles such as \u0026#34;Tonight (I\u0026#39;m Afraid),\u0026#34; \u0026#34;B.A.B.E.,\u0026#34; \u0026#34;Not Hell, Not Heaven,\u0026#34; and \u0026#34;Special,\u0026#34; to support the upcoming release.\n\n\n\n\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Scowl - B.A.B.E. (Official Video)\" width=\"880\" height=\"660\" src=\"https://www.youtube.com/embed/u_mZbGUJRC4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThe singles \u003cem\u003edefinitely\u003c/em\u003e err on the lighter side of \u003cstrong\u003eScowl\u003c/strong\u003e\u0026#39;s sound, something they began to explore on their 2023 EP \u003cem\u003ePsychic Dance Party,\u003c/em\u003e but \u003cem\u003eAre We All Angels \u003c/em\u003epushes the envelope even further.\n\n\n\n\u003c/p\u003e\u003cp\u003eHowever, when it comes to moving away from the hardcore sound, vocalist \u003cstrong\u003eMoss\u003c/strong\u003e reassures that the band wants to \u0026#34;consistently embody a hardcore mindset, to whatever degree is possible. But also, I love music as a whole. It’s not just about punk and hardcore for me. Music and art are so vital to my existence, so why wouldn’t I honour that?\u0026#34;\u003c/p\u003e\n\n\n\n\u003cp\u003eYou can save \u003cstrong\u003eScowl\u003c/strong\u003e\u0026#39;s upcoming record \u003ca href=\"https://scowl.lnk.to/Are-We-All-Angels\"\u003ehere\u003c/a\u003e, and you can find the remaining US dates, and upcoming UK dates, below for the band\u0026#39;s tour in support of \u003cem\u003eAre We All Angels\u003c/em\u003e.\n\n\n\n\u003c/p\u003e\u003cp\u003e3/29 Salt Lake City, Utah The Complex\u003cbr/\u003e3/31 Seattle, Washington Paramount Theatre\u003cbr/\u003e4/1 Portland, Oregon Roseland Theatre\u003cbr/\u003e4/3 Wheatland, California Hard Rock Live Sacramento\u003cbr/\u003e4/4 San Francisco, California The Masonic\u003cbr/\u003e4/6 Los Angeles, California The Torch at the LA Memorial Coliseum\u003cbr/\u003e5/5 Manchester, England Rebellion\u003cbr/\u003e5/6 Newcastle Upon Tyne, England Digital\u003cbr/\u003e5/7 Glasgow, Scotland The Cathouse\u003cbr/\u003e5/8 Bristol, England Thekla\u003cbr/\u003e5/9 London, England The Dome London\n\t\t\t\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-03-28T13:10:30-04:00",
  "modifiedTime": "2025-03-28T13:10:32-04:00"
}
