{
  "id": "64b949d9-052d-4597-95af-f7cdfefeccfb",
  "title": "Was Katy Perry’s Journey to Space Tone-Deaf? | Billboard News",
  "link": "https://www.billboard.com/video/katy-perry-space-flight-debate-billboard-news/",
  "description": "Katy Perry went to space with Lauren Sanchez, Gayle King and others on a Blue Origin spacecraft. The public and celebrities alike shared their opinions about the women being sent to space. Keep watching to find out what some Billboard staffers had to say about the trip. What do you think of Katy Perry going […]",
  "author": "Katie Cao",
  "published": "Thu, 17 Apr 2025 23:28:43 +0000",
  "source": "https://www.billboard.com/feed/",
  "categories": [
    "Media",
    "Videos",
    "bbnews",
    "Billboard",
    "billboard news",
    "genre pop"
  ],
  "byline": "Katie Cao",
  "length": 2361,
  "excerpt": "Katy Perry went to space with Lauren Sanchez, Gayle King, and others on Blue Origin’s spacecraft. The public shared their opinions about the trip.",
  "siteName": "Billboard",
  "favicon": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/apple-touch-icon.png",
  "text": "Katy Perry went to space with Lauren Sanchez, Gayle King and others on a Blue Origin spacecraft. The public and celebrities alike shared their opinions about the women being sent to space. Keep watching to find out what some Billboard staffers had to say about the trip. What do you think of Katy Perry going to space? Let us know in the comments. Stefanie Tanaka: If anyone out there has $150,000, then you can go to space too.  Tetris Kelly: All right, so Billboard squad, five ladies went to space, but everybody seems to just be mad at Katy Perry. Are we mad? What’s going on? Jerah Milligan: I don’t care. Stefanie Tanaka: I can understand why people are mad. I don’t know if I feel that strongly about it. Tetris Kelly: Why? What are people upset about? Stefanie Tanaka: I mean, a lot of people, you know, times are tough right now. It doesn’t really like look super inspiring to see, like, super rich people just going into space.  Ciara Zimring: It’s not giving what they think it’s giving. They think it’s giving inspiring, sending a bunch of women to space, but it’s giving more sending a bunch of rich people in space, as opposed to actual female astronauts that should be sent up.  Stefanie Tanaka: Yeah, yeah.  Ciara Zimring: That would give more.  Stefanie Tanaka: It’s like, it’s cool for, like, the aesthetics of it, like to see a group of women, women of color, going into space. Like, it looks good as a photo- Jerah Milligan: As a photo.   Stefanie Tanaka: But it’s like, this was all funded by Jeff Bezos. They wouldn’t be going up there without him. If this is Elon Musk, people would be reacting the same way. All these billionaires are obsessed with going to space because they’re gonna leave this planet completely f—ed Tetris Kelly: Stefanie’s mad.  Stefanie Tanaka: They’re going to go up there the minute this planet goes to hell because of climate change. Tetris Kelly: I mean, and I think the funny part to me is that you have, like, this inspirational moment, but then I feel like the whole time I watched Gayle be a part of this, she was looking scared. She didn’t even want to go. And she’s like, why am I here? How did I get on this spacecraft? Keep watching for more!",
  "image": "https://www.billboard.com/wp-content/uploads/2025/04/spacemission.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\u003cp\u003e\n\tKaty Perry went to space with Lauren Sanchez, Gayle King and others on a Blue Origin spacecraft. The public and celebrities alike shared their opinions about the women being sent to space. Keep watching to find out what some \u003cem\u003eBillboard\u003c/em\u003e staffers had to say about the trip.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWhat do you think of Katy Perry going to space? Let us know in the comments.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tStefanie Tanaka:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIf anyone out there has $150,000, then you can go to space too. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tTetris Kelly:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAll right, so Billboard squad, five ladies went to space, but everybody seems to just be mad at Katy Perry. Are we mad? What’s going on?\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tJerah Milligan:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tI don’t care.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tStefanie Tanaka:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tI can understand why people are mad. I don’t know if I feel that strongly about it.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tTetris Kelly:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWhy? What are people upset about?\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tStefanie Tanaka:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tI mean, a lot of people, you know, times are tough right now. It doesn’t really like look super inspiring to see, like, super rich people just going into space. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tCiara Zimring:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIt’s not giving what they think it’s giving. They think it’s giving inspiring, sending a bunch of women to space, but it’s giving more sending a bunch of rich people in space, as opposed to actual female astronauts that should be sent up. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tStefanie Tanaka:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tYeah, yeah. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tCiara Zimring:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThat would give more. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tStefanie Tanaka:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIt’s like, it’s cool for, like, the aesthetics of it, like to see a group of women, women of color, going into space. Like, it looks good as a photo-\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tJerah Milligan:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAs a photo.  \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tStefanie Tanaka:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tBut it’s like, this was all funded by Jeff Bezos. They wouldn’t be going up there without him. If this is Elon Musk, people would be reacting the same way. All these billionaires are obsessed with going to space because they’re gonna leave this planet completely f—ed\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tTetris Kelly:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tStefanie’s mad. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tStefanie Tanaka:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThey’re going to go up there the minute this planet goes to hell because of climate change.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tTetris Kelly:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tI mean, and I think the funny part to me is that you have, like, this inspirational moment, but then I feel like the whole time I watched Gayle be a part of this, she was looking scared. She didn’t even want to go. And she’s like, why am I here? How did I get on this spacecraft?\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cem\u003eKeep watching for more!\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-17T23:28:43Z",
  "modifiedTime": "2025-04-17T23:28:44Z"
}
