{
  "id": "6ace5b9b-6bda-4704-8306-a7b7bed7a43d",
  "title": "CHRISTIAN OLDE WOLBERS Offers A First Look At His New Band, ANGST FABRIK",
  "link": "https://metalinjection.net/news/christian-olde-wolbers-offers-a-first-look-at-his-new-band-angst-fabrik",
  "description": "Which is Fear Factory in German. The post CHRISTIAN OLDE WOLBERS Offers A First Look At His New Band, ANGST FABRIK appeared first on Metal Injection.",
  "author": "Greg Kennelty",
  "published": "Wed, 05 Mar 2025 21:19:21 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Latest News",
    "Christian Olde Wolbers",
    "Fear Factory"
  ],
  "byline": "By Greg Kennelty Published 2 hours ago",
  "length": 1347,
  "excerpt": "Which is Fear Factory in German.",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "Former Fear Factory bassist Christian Olde Wolbers seems to be revisiting his past in some regard with a new band called Angst Fabrik… which if you don't speak German is literally Fear Factory in German. All we know is that Angst Fabrik's debut album is due out sometime in 2026 and that Wolbers is working with drummer Adam Jarvis, who you know from Scour and Pig Destroyer. Angst Fabrik's logo is also reminiscent of Fear Factory's old logo, so I'm just gonna go ahead and guess that this new project is gonna sound like Wolbers-era Fear Factory. You can check out a little of what Wolbers is working on below, which yeah – this has that super mechanized Fear Factory riffing. And who knows – maybe we'll get a full-on old school Fear Factory thing going, seeing as Wolbers recently met up with former Fear Factory vocalist Burton C. Bell. And who better to do that than Wolbers? Dude played bass in Fear Factory for 22 years, and played guitar as well in the band for his last three years – namely on the 2004 album Archetype and 2005 album Transgression. So again, it's not super shocking that Wolbers can really conjure up that old school Fear Factory sound. Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2025/03/Angst-Fabrik.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003eFormer \u003cstrong\u003eFear Factory\u003c/strong\u003e bassist \u003cstrong\u003eChristian Olde Wolbers\u003c/strong\u003e seems to be revisiting his past in some regard with a new band called \u003cstrong\u003eAngst Fabrik\u003c/strong\u003e… which if you don\u0026#39;t speak German is literally \u003cstrong\u003eFear Factory\u003c/strong\u003e in German.\u003c/p\u003e\n\n\n\n\u003cp\u003eAll we know is that \u003cstrong\u003eAngst Fabrik\u003c/strong\u003e\u0026#39;s debut album is due out sometime in 2026 and that \u003cstrong\u003eWolbers\u003c/strong\u003e is working with drummer \u003cstrong\u003eAdam Jarvis\u003c/strong\u003e, who you know from \u003cstrong\u003eScour\u003c/strong\u003e and\u003cstrong\u003e Pig Destroyer\u003c/strong\u003e. \u003cstrong\u003eAngst Fabrik\u003c/strong\u003e\u0026#39;s logo is also reminiscent of\u003cstrong\u003e Fear Factory\u003c/strong\u003e\u0026#39;s old logo, so I\u0026#39;m just gonna go ahead and guess that this new project is gonna sound like \u003cstrong\u003eWolbers\u003c/strong\u003e-era \u003cstrong\u003eFear Factory\u003c/strong\u003e. You can check out a little of what \u003cstrong\u003eWolbers\u003c/strong\u003e is working on below, which yeah – this has that super mechanized Fear Factory riffing.\n\n\n\n\u003c/p\u003e\u003cp\u003eAnd who knows – maybe we\u0026#39;ll get a full-on old school \u003cstrong\u003eFear Factory\u003c/strong\u003e thing going, seeing as \u003cstrong\u003eWolbers\u003c/strong\u003e recently \u003ca href=\"https://metalinjection.net/news/ex-fear-factory-members-burton-c-bell-christian-olde-wolbers-hung-out-recently\"\u003emet up with former \u003cstrong\u003eFear Factory\u003c/strong\u003e vocalist \u003cstrong\u003eBurton C. Bell\u003c/strong\u003e\u003c/a\u003e. And who better to do that than \u003cstrong\u003eWolbers\u003c/strong\u003e? Dude played bass in \u003cstrong\u003eFear Factory\u003c/strong\u003e for 22 years, and played guitar as well in the band for his last three years – namely on the 2004 album \u003cem\u003eArchetype\u003c/em\u003e and 2005 album \u003cem\u003eTransgression\u003c/em\u003e. So again, it\u0026#39;s not super shocking that Wolbers can really conjure up that old school\u003cstrong\u003e Fear Factory\u003c/strong\u003e sound.\n\n\n\u003c/p\u003e\u003cblockquote data-instgrm-permalink=\"https://www.instagram.com/p/DGyKboisirA/\" data-instgrm-version=\"14\" data-instgrm-captioned=\"\"\u003e\u003c/blockquote\u003e\n\t\t\t\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-03-05T16:19:21-05:00",
  "modifiedTime": "2025-03-05T16:19:23-05:00"
}
