{
  "id": "6f66b663-25a0-449d-86d0-e70881ccc5ac",
  "title": "HYBE’s CEO just issued an apology to K-Pop artists, fans and rival labels amid a torrent of controversies from leaked internal documents. What’s going on?",
  "link": "https://www.musicbusinessworldwide.com/hybe-ceo-issues-apology-to-k-pop-artists-fans-rival-labels-amid-torrent-of-controversies-from-leaked-internal-documents1/",
  "description": "Disparaging comments about certain K-pop stars have angered fans, while other revelations have piqued the interest of regulators Source",
  "author": "Daniel Tencer",
  "published": "Tue, 29 Oct 2024 18:37:20 +0000",
  "source": "https://www.musicbusinessworldwide.com/feed/",
  "categories": [
    "Analysis",
    "News",
    "ADOR",
    "HYBE",
    "leaked documents",
    "MBW Explains",
    "Min Hee-jin"
  ],
  "byline": "Daniel Tencer",
  "length": 11689,
  "excerpt": "Disparaging comments about certain K-pop stars have angered fans, while other revelations have piqued the interest of regulators.",
  "siteName": "Music Business Worldwide",
  "favicon": "https://www.musicbusinessworldwide.com/wp-content/themes/mb/assets/img/icons/favicon-192x192.png",
  "text": "MBW Explains is a series of analytical features in which we explore the context behind major music industry talking points – and suggest what might happen next. Only MBW+ subscribers have unlimited access to these articles.What’s happened?K-pop giant HYBE – and, more broadly, South Korea’s entire K-pop ecosystem – have been thrown into turmoil in recent days, following the release of a trove of internal HYBE documents that included disparaging comments about K-pop artists, both HYBE’s own and those managed by rival labels.The media firestorm began on Thursday (October 24) when a member of Korea’s opposition Democratic Party, Rep. Min Hyung-bae, revealed internal HYBE documents during an audit being carried out by the National Assembly’s Culture, Sports and Tourism Committee.The documents, a compilation of “Weekly Music Industry Reports,” left some observers shocked at the insensitive nature of the comments made about certain K-pop acts and their members.As quoted by the Korea Herald, the documents contained statements such as “They debuted at an age when they’re at their most unattractive,” “Surprisingly, none of them are pretty,” and “Shockingly unattractive.”Lawmakers reportedly reacted most negatively to the fact that some of the comments about physical appearance were made about underage individuals.Kim Tae-ho, COO of HYBE and CEO of HYBE sub-label Be-Lift Lab, explained to the committee that the documents weren’t a reflection of HYBE’s official stance and may not have even reflected the opinions of HYBE executives – they were compilations of what K-pop fans and others were saying online and elsewhere, and they were compiled in an effort to keep track of public opinion about K-pop. He stressed that the weekly reports were sent only to senior executives at HYBE and its subsidiaries, and were not meant for public consumption.That, however, wasn’t enough to quell the firestorm that broke out even while the committee meeting was in session. In fact, one of the first controversies arose when HYBE issued a statement on the document release during the committee meeting, reiterating the points that Kim had made while also promising to “hold accountable those who selectively leaked provocative portions of the report to make it appear as though HYBE had criticized the artists,” per the Herald.After protests from committee members, HYBE pulled the statement down from its website.Nonetheless, things went downhill from there, particularly after a number of news organizations, including South Korea’s Channel A TV network, reportedly obtained the compiled reports. While the selected documents presented in the National Assembly had individuals’ names redacted (sparking endless speculation about who was being disparaged in the documents), the leaked version of the documents – amounting to some 18,000 pages, by some accounts – had all the names in place.The unredacted documents not only sparked an uproar among fans of the K-pop acts who had been mentioned, they also highlighted some internal tensions between HYBE leadership and some of the company’s acts. For the numerous media outlets that cover the K-pop scene, the document trove became fodder for countless stories, each focusing on some controversial comment about a particular K-pop act or artist.It was, in short, a public relations nightmare. On Tuesday (October 29), HYBE CEO Jason Jaesang Lee – only several months into the job – issued an apology “to our artists, industry insiders, and our fans.”While reiterating that the documents were never meant for public consumption, Lee conceded that “the content of the document was highly inappropriate.”“On behalf of the company, we acknowledge all wrongdoings and take full responsibility for the fact that the provocative and original expressions directed at K-pop artists are still there.”Jason Jaesang Lee, HYBE“On behalf of the company, we acknowledge all wrongdoings and take full responsibility for the fact that the provocative and original expressions directed at K-pop artists are still there, the author’s personal views and evaluations have been added, and the contents have been documented. In particular, I am very sorry and saddened by the situation in which innocent artists and members are being misunderstood and harmed by the allegations of [negative] virality, which are not true at all,” Lee wrote.Lee stressed that HYBE had contacted each K-pop agency individually and apologized for the damage done.Nonetheless, the fallout from the document leak continues, some of it sparking rumors and speculation about potential malfeasance by HYBE, and some of it directly affecting ongoing legal issues in which HYBE had been involved.Here’s a rundown of some of the more significant consequences of the document leak.A celebrity news firestormK-pop fans are a passionate and devoted demographic, with many developing near-obsessive interest in their favorite acts or artists. So, predictably, the naming of numerous artists in the leaked documents has led to countless news stories, social media threads, and celebrity responses in the media.Some of these stories have sparked rumors and speculation – often without evidence – about HYBE’s potential involvement in earlier scandals and gossip involving K-pop stars.We have neither the space nor the time to document them all (if you’re interested in all that, you can check out the coverage at AllKPop, Koreaboo, and many, many similar news sites) – but here’s one illustrative example.One of HYBE’s leaked weekly updates made an observation about Seunghan, a member of SM Entertainment’s boy band RIIZE. The observation was that a controversy that engulfed Seunghan in August 2023 “failed to go viral on Theqoo,” an online forum frequented by K-pop fans.This led to speculation that HYBE may have been somehow involved in Seunghan’s scandal. Photos were published of him in bed with a woman, smoking a cigarette, prior to his rise to fame as a member of RIIZE. The scandal led to his suspension from the boy group in October 2023.“Does this mean HYBE is to blame for Seunghan’s past being exposed?” a Twitter commenter asked, as quoted by Sportskeeda.Another asserted: “Doesn’t this literally mean HYBE was the reason for Seunghan’s photos being everywhere?”As Sportskeeda noted, the leaked documents offered no evidence that HYBE was in any way involved in the SM Entertainment artists’ scandal.Min Hee-jin, NewJeans, and a bullying investigationPerhaps more problematic for HYBE are the leaked documents connected to an ongoing and very public conflict in which the K-pop agency has been embroiled for the past half a year.This past spring, HYBE announced that it suspected Min Hee-jin, the CEO of HYBE sub-label ADOR, of surreptitiously trying to sever the label from its parent company. HYBE accused Min of working behind the scenes to wrest control of ADOR away from HYBE, a charge that Min denies. HYBE replaced Min as CEO amid the ongoing dispute.ADOR has one principal act, the girl group NewJeans, developed and produced by Min herself. According to reports in the Korean media, Min was reportedly angered by the behavior of another HYBE sub-label, BeLift Lab, which she believed had developed a girl group, ILLIT, that explicitly copied NewJeans.The conflict between HYBE and Min is now the subject of a criminal investigation and a civil court action.In September, it emerged that Min continues to have support within HYBE – particularly from the members of NewJeans itself. During a live stream on YouTube, which has since been removed, the NewJeans members accused some HYBE staff of passive-aggressive bullying over their loyalty to Min.One member of NewJeans, Hanni, recently testified in front of the National Assembly hearing on workplace bullying, alleging that HYBE had created an atmosphere in which the members of NewJeans felt they were hated – for instance, when one manager was heard telling staff to ignore and pretend not to notice the group when they passed in the corridor. The recent document leak has added fuel to the fire. According to multiple news reports, the documents included comments that some have interpreted to mean HYBE wants to dispose of NewJeans.Per those reports, one of the documents referred to the phrase “New-ILL-LE,” referring to the HYBE girl groups NewJeans, ILLIT, and LE SSERAFIM. (Sort of the K-pop equivalent of “Barbenmheimer.”)The HYBE documents reportedly indicated that HYBE insiders weren’t happy with the term because of NewJeans’ inclusion.“We had some trouble for the past few days with the term… but we can dispose of NewJeans and just come up with a new phrase,” a comment in the documents stated, as quoted by Malay Mail.Naturally, this made some NewJeans fans unhappy – and the comment could yet play a role in the ongoing legal battles between HYBE, Min, and NewJeans.According to multiple news reports, an unidentified person not connected to HYBE, Min or NewJeans, has submitted the leaked documents to an ongoing investigation into the alleged bullying surrounding NewJeans, which is being carried out by the Seoul Western District Office of the Ministry of Employment and Labor.According to the unnamed complainant, the documents provide evidence against Kim Joo-young, the CEO who replaced Min Hee-jin at ADOR.Allegations of ‘chart manipulation’There was another notable development at the Culture, Sports and Tourism Committee hearing last week, one that hasn’t had nearly the same amount of loud news coverage but which could prove consequential to HYBE all the same – allegations that the K-pop company artificially inflated album sales.According to the Korea Times, Rep. Min Hyung-bae accused the company of boosting first-week sales by selling records with a return guarantee, as well as by incentivizing sales through fan signing events.Min said the tactic resulted in boosts of 70,000 to 200,000 in first-week sales.However, HYBE’s Kim insisted that the practice was rarely used and resulted in only an insignificant increase in sales.“We have never sold albums under such conditions. An external audit found that less than a few percent of albums were sold under contracts that allowed returns. However, this volume was not significant enough to disrupt the market or impact sales,” Kim said, as quoted in The Korea Herald.Kim said Hybe wouldn’t use the sales tactic going forward.Nevertheless, according to news reports, the state-run Korea Creative Content Agency (KOCCA) has launched an investigation to determine whether HYBE engaged in chart manipulation.A final thought…It may be tempting to think that the legal implications of the leaked documents (alleged workplace harassment, alleged chart manipulation) may be the bigger headache for HYBE in all of this, while the cultural implications (fans angry over perceived disparaging comments) are secondary – but that might not prove to be the case.Angry fans can make the difference between a hit album and a flop. There is a reason why a company like HYBE would pay so much attention to fans’ opinions online. In the highly competitive K-pop space, perception can be everything.For HYBE, this latest series of controversies – in a year already marred by conflict – comes at a bad time. The company has spent the past several years expanding beyond K-pop and into the US and Latin American music markets, and that’s likely not the end of its global ambitions.Becoming a major global music player means building strong partnerships and a large roster. HYBE’s recent bad press makes both more difficult. Right now, the one thing HYBE needs more than a successful new K-pop act is… some good news, for a change.Music Business Worldwide",
  "image": "https://www.musicbusinessworldwide.com/files/2024/10/Screenshot-2024-10-29-at-18.35.20.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e \u003cp\u003e\u003cem\u003eMBW Explains is a series of analytical features in which we explore the context behind major music industry talking points – and suggest what might happen next. Only \u003ca href=\"https://www.musicbusinessworldwide.com/mbw-plus/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003eMBW+ subscribers\u003c/span\u003e\u003c/a\u003e have unlimited access to these articles.\u003c/em\u003e\u003c/p\u003e\u003chr/\u003e\u003ch5\u003e\u003cspan\u003eWhat’s happened?\u003c/span\u003e\u003c/h5\u003e\u003cp\u003eK-pop giant \u003cstrong\u003eHYBE\u003c/strong\u003e – and, more broadly, South Korea’s entire K-pop ecosystem – have been thrown into turmoil in recent days, following the release of a trove of internal HYBE documents that included disparaging comments about K-pop artists, both HYBE’s own and those managed by rival labels.\u003c/p\u003e\u003cp\u003eThe media firestorm began on Thursday (October 24) when a member of Korea’s opposition Democratic Party, \u003cstrong\u003eRep. Min Hyung-bae\u003c/strong\u003e, revealed internal HYBE documents during an audit being carried out by the National Assembly’s Culture, Sports and Tourism Committee.\u003c/p\u003e\u003cp\u003eThe documents, a compilation of “Weekly Music Industry Reports,” left some observers shocked at the insensitive nature of the comments made about certain K-pop acts and their members.\u003c/p\u003e\u003cp\u003eAs \u003ca href=\"https://www.koreaherald.com/view.php?ud=20241025050524\" target=\"_blank\" rel=\"noopener\"\u003equoted by the \u003cem\u003eKorea Herald\u003c/em\u003e\u003c/a\u003e, the documents contained statements such as “They debuted at an age when they’re at their most unattractive,” “Surprisingly, none of them are pretty,” and “Shockingly unattractive.”\u003c/p\u003e\u003cp\u003eLawmakers reportedly reacted most negatively to the fact that some of the comments about physical appearance were made about underage individuals.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eKim Tae-ho\u003c/strong\u003e, COO of HYBE and CEO of HYBE sub-label \u003cstrong\u003eBe-Lift Lab\u003c/strong\u003e, explained to the committee that the documents weren’t a reflection of HYBE’s official stance and may not have even reflected the opinions of HYBE executives – they were compilations of what K-pop fans and others were saying online and elsewhere, and they were compiled in an effort to keep track of public opinion about K-pop.\u003c/p\u003e  \u003cp\u003eHe stressed that the weekly reports were sent only to senior executives at HYBE and its subsidiaries, and were not meant for public consumption.\u003c/p\u003e\u003cp\u003eThat, however, wasn’t enough to quell the firestorm that broke out even while the committee meeting was in session. In fact, one of the first controversies arose when HYBE issued a statement on the document release during the committee meeting, reiterating the points that Kim had made while also promising to “hold accountable those who selectively leaked provocative portions of the report to make it appear as though HYBE had criticized the artists,” per the \u003cem\u003eHerald\u003c/em\u003e.\u003c/p\u003e\u003cp\u003eAfter protests from committee members, HYBE pulled the statement down from its website.\u003c/p\u003e\u003cp\u003eNonetheless, things went downhill from there, particularly after a number of news organizations, including South Korea’s \u003cstrong\u003eChannel A\u003c/strong\u003e TV network, reportedly obtained the compiled reports. While the selected documents presented in the National Assembly had individuals’ names redacted (sparking endless speculation about who was being disparaged in the documents), the leaked version of the documents – amounting to some \u003cstrong\u003e18,000\u003c/strong\u003e pages, by \u003ca href=\"https://www.sportskeeda.com/us/k-pop/news-hybe-fire-alleged-18k-page-internal-report-demeaning-k-pop-groups-complete-list-artists-named-far\" target=\"_blank\" rel=\"noopener\"\u003esome accounts\u003c/a\u003e – had all the names in place.\u003c/p\u003e\u003cp\u003eThe unredacted documents not only sparked an uproar among fans of the K-pop acts who had been mentioned, they also highlighted some internal tensions between HYBE leadership and some of the company’s acts. For the numerous media outlets that cover the K-pop scene, the document trove became fodder for countless stories, each focusing on some controversial comment about a particular K-pop act or artist.\u003c/p\u003e\u003cp\u003eIt was, in short, a public relations nightmare.\u003c/p\u003e  \u003cp\u003eOn Tuesday (October 29), HYBE CEO Jason Jaesang Lee – only several months into the job – issued an apology “to our artists, industry insiders, and our fans.”\u003c/p\u003e\u003cp\u003eWhile reiterating that the documents were never meant for public consumption, Lee conceded that “the content of the document was highly inappropriate.”\u003c/p\u003e\u003cblockquote\u003e\u003cfigure\u003e\u003cimg data-srcset=\"https://www.musicbusinessworldwide.com/files/2024/10/Screenshot-2024-10-29-at-18.35.20-80x74.jpg 80w, https://www.musicbusinessworldwide.com/files/2024/10/Screenshot-2024-10-29-at-18.35.20-160x149.jpg 160w, https://www.musicbusinessworldwide.com/files/2024/10/Screenshot-2024-10-29-at-18.35.20-320x298.jpg 320w, https://www.musicbusinessworldwide.com/files/2024/10/Screenshot-2024-10-29-at-18.35.20-418x389.jpg 418w\" data-sizes=\"auto\" srcset=\"https://www.musicbusinessworldwide.com/files/2024/10/Screenshot-2024-10-29-at-18.35.20-80x74.jpg 80w, https://www.musicbusinessworldwide.com/files/2024/10/Screenshot-2024-10-29-at-18.35.20-160x149.jpg 160w, https://www.musicbusinessworldwide.com/files/2024/10/Screenshot-2024-10-29-at-18.35.20-320x298.jpg 320w, https://www.musicbusinessworldwide.com/files/2024/10/Screenshot-2024-10-29-at-18.35.20-418x389.jpg 418w\"/\u003e\u003c/figure\u003e\u003cp\u003e“On behalf of the company, we acknowledge all wrongdoings and take full responsibility for the fact that the provocative and original expressions directed at K-pop artists are still there.”\u003c/p\u003e\u003cp\u003e\u003cspan\u003eJason Jaesang Lee, HYBE\u003c/span\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e“On behalf of the company, we acknowledge all wrongdoings and take full responsibility for the fact that the provocative and original expressions directed at K-pop artists are still there, the author’s personal views and evaluations have been added, and the contents have been documented. In particular, I am very sorry and saddened by the situation in which innocent artists and members are being misunderstood and harmed by the allegations of [negative] virality, which are not true at all,” Lee \u003ca href=\"https://hybecorp.com/kor/news/announcements/content/6647\" target=\"_blank\" rel=\"noopener\"\u003ewrote\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eLee stressed that HYBE had contacted each K-pop agency individually and apologized for the damage done.\u003c/p\u003e\u003cp\u003eNonetheless, the fallout from the document leak continues, some of it sparking rumors and speculation about potential malfeasance by HYBE, and some of it directly affecting ongoing legal issues in which HYBE had been involved.\u003c/p\u003e\u003cp\u003eHere’s a rundown of some of the more significant consequences of the document leak.\u003c/p\u003e\u003chr/\u003e\u003ch5\u003e\u003cspan\u003eA celebrity news firestorm\u003c/span\u003e\u003c/h5\u003e\u003cp\u003eK-pop fans are a passionate and devoted demographic, with many developing near-obsessive interest in their favorite acts or artists. So, predictably, the naming of numerous artists in the leaked documents has led to countless news stories, social media threads, and celebrity responses in the media.\u003c/p\u003e\u003cp\u003eSome of these stories have sparked rumors and speculation – often without evidence – about HYBE’s potential involvement in earlier scandals and gossip involving K-pop stars.\u003c/p\u003e\u003cp\u003eWe have neither the space nor the time to document them all (if you’re interested in all that, you can check out the coverage at AllKPop, Koreaboo, and many, many similar news sites) – but here’s one illustrative example.\u003c/p\u003e\u003cp\u003eOne of HYBE’s leaked weekly updates made an observation about \u003cstrong\u003eSeunghan\u003c/strong\u003e, a member of \u003cstrong\u003eSM Entertainment\u003c/strong\u003e’s boy band \u003cstrong\u003eRIIZE\u003c/strong\u003e. The observation was that a controversy that engulfed Seunghan in August 2023 “failed to go viral on Theqoo,” an online forum frequented by K-pop fans.\u003c/p\u003e\u003cp\u003eThis led to speculation that HYBE may have been somehow involved in Seunghan’s scandal. Photos were published of him in bed with a woman, smoking a cigarette, prior to his rise to fame as a member of RIIZE. The scandal led to his suspension from the boy group in October 2023.\u003c/p\u003e\u003cp\u003e“Does this mean HYBE is to blame for Seunghan’s past being exposed?” a Twitter commenter asked, as \u003ca href=\"https://www.sportskeeda.com/us/k-pop/news-most-pathetic-company-fans-react-hybe-s-leaked-internal-reports-reveal-label-s-alleged-involvement-former-riize-seunghan-s-controversies\" target=\"_blank\" rel=\"noopener\"\u003equoted by \u003cem\u003eSportskeeda\u003c/em\u003e\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eAnother asserted: “Doesn’t this literally mean HYBE was the reason for Seunghan’s photos being everywhere?”\u003c/p\u003e\u003cp\u003eAs \u003cem\u003eSportskeeda\u003c/em\u003e noted, the leaked documents offered no evidence that HYBE was in any way involved in the SM Entertainment artists’ scandal.\u003c/p\u003e\u003chr/\u003e\u003ch5\u003e\u003cspan\u003eMin Hee-jin, NewJeans, and a bullying investigation\u003c/span\u003e\u003c/h5\u003e\u003cp\u003ePerhaps more problematic for HYBE are the leaked documents connected to an ongoing and very public conflict in which the K-pop agency has been embroiled for the past half a year.\u003c/p\u003e\u003cp\u003eThis past spring, HYBE announced that it suspected \u003cstrong\u003eMin Hee-jin\u003c/strong\u003e, the CEO of HYBE sub-label \u003cstrong\u003eADOR\u003c/strong\u003e, of surreptitiously trying to sever the label from its parent company. HYBE \u003ca href=\"https://www.musicbusinessworldwide.com/hybe-confirms-audit-of-ador-ceo-over-reported-attempt-to-seize-control12/\" target=\"_blank\" rel=\"noopener\"\u003eaccused Min\u003c/a\u003e of working behind the scenes to wrest control of ADOR away from HYBE, a charge that Min denies. HYBE \u003ca href=\"https://www.musicbusinessworldwide.com/hybe-owned-label-ador-replaces-ceo-min-hee-jin-amid-legal-dispute/\" target=\"_blank\" rel=\"noopener\"\u003ereplaced Min\u003c/a\u003e as CEO amid the ongoing dispute.\u003c/p\u003e\u003cp\u003eADOR has one principal act, the girl group \u003cstrong\u003eNewJeans\u003c/strong\u003e, developed and produced by Min herself. According to reports in the Korean media, Min was reportedly angered by the behavior of another HYBE sub-label, BeLift Lab, which she believed had developed a girl group, \u003cstrong\u003eILLIT\u003c/strong\u003e, that explicitly copied NewJeans.\u003c/p\u003e\u003cp\u003eThe conflict between HYBE and Min is now the subject of a criminal investigation and a civil court action.\u003c/p\u003e\u003cp\u003eIn September, it emerged that Min continues to have support within HYBE – particularly from the members of NewJeans itself. During a live stream on \u003ca title=\"Companies \u0026gt; YouTube [1,893 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/youtube/\"\u003eYouTube\u003c/a\u003e, which has since been removed, the NewJeans members accused some HYBE staff of passive-aggressive bullying over their loyalty to Min.\u003c/p\u003e\u003cp\u003eOne member of NewJeans, \u003cstrong\u003eHanni\u003c/strong\u003e, recently testified in front of the National Assembly hearing on workplace bullying, \u003ca href=\"https://www.reuters.com/world/asia-pacific/k-pop-star-calls-parliamentary-hearing-better-treatment-artists-2024-10-15/\" target=\"_blank\" rel=\"noopener\"\u003ealleging\u003c/a\u003e that HYBE had created an atmosphere in which the members of NewJeans felt they were hated – for instance, when one manager was heard telling staff to ignore and pretend not to notice the group when they passed in the corridor.\u003c/p\u003e  \u003cp\u003eThe recent document leak has added fuel to the fire. According to multiple news reports, the documents included comments that some have interpreted to mean HYBE wants to dispose of NewJeans.\u003c/p\u003e\u003cp\u003ePer those reports, one of the documents referred to the phrase “New-ILL-LE,” referring to the HYBE girl groups NewJeans, ILLIT, and LE SSERAFIM. (Sort of the K-pop equivalent of “Barbenmheimer.”)\u003c/p\u003e\u003cp\u003eThe HYBE documents reportedly indicated that HYBE insiders weren’t happy with the term because of NewJeans’ inclusion.\u003c/p\u003e\u003cp\u003e“We had some trouble for the past few days with the term… but we can dispose of NewJeans and just come up with a new phrase,” a comment in the documents stated, as \u003ca href=\"https://malaysia.news.yahoo.com/hybe-internal-documents-shocks-kpop-090110648.html\" target=\"_blank\" rel=\"noopener\"\u003equoted by \u003cem\u003eMalay Mail\u003c/em\u003e\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eNaturally, this made some NewJeans fans unhappy – and the comment could yet play a role in the ongoing legal battles between HYBE, Min, and NewJeans.\u003c/p\u003e\u003cp\u003eAccording to multiple \u003ca href=\"https://www.sportskeeda.com/us/k-pop/news-hybe-submits-music-industry-report-amid-ongoing-workplace-bullying-investigation-involving-newjeans\" target=\"_blank\" rel=\"noopener\"\u003enews\u003c/a\u003e \u003ca href=\"https://www.allkpop.com/article/2024/10/hybe-submits-internal-report-in-newjeans-bullying-investigation\" target=\"_blank\" rel=\"noopener\"\u003ereports\u003c/a\u003e, an unidentified person not connected to HYBE, Min or NewJeans, has \u003ca href=\"https://www.pinkvilla.com/entertainment/newjeans-alleged-workplace-bullying-case-hybes-leaked-music-industry-report-submitted-to-ministry-of-employment-and-labor-1355752\" target=\"_blank\" rel=\"noopener\"\u003esubmitted\u003c/a\u003e the leaked documents to an ongoing investigation into the alleged bullying surrounding NewJeans, which is being carried out by the Seoul Western District Office of the Ministry of Employment and Labor.\u003c/p\u003e\u003cp\u003eAccording to the unnamed complainant, the documents provide evidence against \u003cstrong\u003eKim Joo-young\u003c/strong\u003e, the CEO who replaced Min Hee-jin at ADOR.\u003c/p\u003e\u003chr/\u003e\u003ch5\u003e\u003cspan\u003eAllegations of ‘chart manipulation’\u003c/span\u003e\u003c/h5\u003e\u003cp\u003eThere was another notable development at the Culture, Sports and Tourism Committee hearing last week, one that hasn’t had nearly the same amount of loud news coverage but which could prove consequential to HYBE all the same – allegations that the K-pop company artificially inflated album sales.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.koreatimes.co.kr/www/art/2024/10/398_384968.html\" target=\"_blank\" rel=\"noopener\"\u003eAccording to the \u003cem\u003eKorea Times\u003c/em\u003e\u003c/a\u003e, Rep. Min Hyung-bae accused the company of boosting first-week sales by selling records with a return guarantee, as well as by incentivizing sales through fan signing events.\u003c/p\u003e\u003cp\u003eMin said the tactic resulted in boosts of 70,000 to 200,000 in first-week sales.\u003c/p\u003e\u003cp\u003eHowever, HYBE’s Kim insisted that the practice was rarely used and resulted in only an insignificant increase in sales.\u003c/p\u003e\u003cp\u003e“We have never sold albums under such conditions. An external audit found that less than a few percent of albums were sold under contracts that allowed returns. However, this volume was not significant enough to disrupt the market or impact sales,” Kim said, as \u003ca href=\"https://news.koreaherald.com/view.php?ud=20241024050646\" target=\"_blank\" rel=\"noopener\"\u003equoted in \u003cem\u003eThe Korea Herald\u003c/em\u003e\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eKim said Hybe wouldn’t use the sales tactic going forward.\u003c/p\u003e\u003cp\u003eNevertheless, according to news reports, the state-run Korea Creative Content Agency (KOCCA) has launched an investigation to determine whether HYBE engaged in chart manipulation.\u003c/p\u003e\u003chr/\u003e\u003ch5\u003e\u003cspan\u003eA final thought…\u003c/span\u003e\u003c/h5\u003e\u003cp\u003eIt may be tempting to think that the \u003cem\u003elegal\u003c/em\u003e implications of the leaked documents (alleged workplace harassment, alleged chart manipulation) may be the bigger headache for HYBE in all of this, while the \u003cem\u003ecultural\u003c/em\u003e implications (fans angry over perceived disparaging comments) are secondary – but that might not prove to be the case.\u003c/p\u003e\u003cp\u003eAngry fans can make the difference between a hit album and a flop. There is a reason why a company like HYBE would pay so much attention to fans’ opinions online. In the highly competitive K-pop space, perception can be everything.\u003c/p\u003e\u003cp\u003eFor HYBE, this latest series of controversies – in a year already marred by conflict – comes at a bad time. The company has spent the past several years expanding beyond K-pop and into the US and Latin American music markets, and that’s likely not the end of its global ambitions.\u003c/p\u003e\u003cp\u003eBecoming a major global music player means building strong partnerships and a large roster. HYBE’s recent bad press makes both more difficult. Right now, the one thing HYBE needs more than a successful new K-pop act is… some good news, for a change.\u003cspan\u003eMusic Business Worldwide\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": "2024-10-29T18:37:20Z",
  "modifiedTime": "2024-10-29T22:16:33Z"
}
