{
  "id": "784524ab-32dd-4227-b590-4fd37077f2d1",
  "title": "Signed: Breaking Benjamin Links With BMG for New Music, Eminem Protege Ez Mil Finds New Manager",
  "link": "https://www.billboard.com/pro/breaking-benjamin-eminem-protege-ez-mil-music-artist-deals/",
  "description": "Also this week: thiarajxtt, The Head and the Heart, The Red Jumpsuit Apparatus, The Rasmus, Hollywood Undead and more.",
  "author": "Chris Eggertsen",
  "published": "Tue, 29 Oct 2024 23:44:03 +0000",
  "source": "https://www.billboard.com/feed/",
  "categories": [
    "Business",
    "Business News",
    "label signings",
    "Signed",
    "signings"
  ],
  "byline": "Chris Eggertsen",
  "length": 4796,
  "excerpt": "Breaking Benjamin, Eminem protege Ez Mil and more music artists deals are rounded up, including for thiarajxtt, The Head and the Heart and The Rasmus.",
  "siteName": "Billboard",
  "favicon": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/apple-touch-icon.png",
  "text": "Also this week: thiarajxtt, The Head and the Heart, The Red Jumpsuit Apparatus, The Rasmus, Hollywood Undead and more. Breaking Benjamin Dominique D'Costa Breaking Benjamin signed with BMG to release new music, their first since 2018. According to a press release, the band has racked up 8.5 billion streams globally. On the heels of his recent signing with Eminem’s Shady Records, Aftermath Entertainment and Interscope, Filipino rapper Ez Mil signed to Grassroots Music for global management. His representative at the company is Dan Lee. Universal Music Canada signed Punjabi producer thiarajxtt (a.k.a. Dilmanjot Singh Thiara), who released the EP If the Sun Had a Dark Side on the label on Oct. 18. Last year, thiarajxtt produced most of Diljit Dosanjh’s album Ghost and collaborated with Jassa Dhillon, Shubh, Channi Nattan, Jerry and more. Trending on Billboard The Head and the Heart signed with Verve Forecast and released a new single entitled “Arrow.” A new studio album will be announced in the coming weeks. The Red Jumpsuit Apparatus (“Face Down,” “Your Guardian Angel”) signed to Better Noise Music, which will release the band’s new album next spring. Finnish rock band The Rasmus (“In the Shadows”) also signed with Better Noise, which jointly released the group’s new single, “Rest in Pieces,” with Nordic indie label Playground Music on Friday (Oct. 25). Rap-rock group Hollywood Undead signed with Sumerian Records and released the new single “Hollywood Forever.” According to a press release, the group has more than 3.1 billion career streams across platforms. Alt-pop trio Coyote Theory (“This Side of Paradise”) signed with Nettwerk Music Group and released the new single “Waiting on the Weather.” The band’s drummer, Jayson Lynn, acts as the group’s manager. A\u0026Rs are Anne Elise Dickinson and Tom Gates. Austin Williams and Truth or Dare Records partnered with RECORDS Nashville/Columbia Records. Williams, known for songs including “Here We Go Again” and “Wanna Be Saved,” is repped by Loyd Potts and Ken Madson at Ignition Management, with agency representation from CAA. – Jessica Nicholson Big Machine Records signed singer-songwriter and two-time Grammy nominee Ryan Hurd, who released his latest song, “This Party Sucks,” on Friday (Oct. 25). Hurd is also signed to Big Machine Music for publishing. The Big Machine Records roster additionally includes Tim McGraw, Carly Pearce, Midland, Rascal Flatts and Jackson Dean. – Jessica Nicholson Mereba signed to Secretly Canadian, which will release her new album, The Breeze Grew a Fire, on Feb. 14. The first single from the LP, “Counterfeit,” dropped on Oct. 22. Pop-rock duo Sparks (Ron and Russell Mael) signed with Transgressive Records, which will release their as-yet-untitled upcoming studio album — the band’s 28th — next year, with Firebird Label Services serving as distributor. HEYOON, a Korean-born pop artist based in both L.A. and Korea who was previously part of the international pop group Now United, signed with Universal Music Korea. The label will help develop HEYOON globally. Sibling duo Ocie and Wes Crowe, known as the country/folk/alternative duo Crowe Boys, signed with UMG Nashville. The duo’s first release for the label is “Let Me Feel Alone,” written solely by Ocie Crowe, out Nov. 8. – Jessica Nicholson New York-based rapper-producer-trumpeter Pan Amsterdam, previously known as Leron Thomas, signed to Heavenly Records and released the new track “White Ninja.” An album is due next year. Manchester, U.K.-based experimental punk band Maruja signed with Music For Nations and released a new single, “Break the Tension,” on the label. The group is slated to embark on a North American tour next year. Barbadian singer/songwriter/producer Ayoni signed with Def Jam Recordings and released the single “San Francisco” ahead of a larger project set to drop next year. Ayoni is featured in the Paramount+ documentary Uncharted. WME signed singer-songwriter Zach Meadows. The Florida native (and now Nashville resident) is repped by Torrez Music Group’s Alex Torrez and Emily Vincent. He released his debut album, Road to Nowhere, in August and will soon join Braxton Keith on the road throughout November. – Jessica Nicholson Handcraft Entertainment signed Japanese-British artist, model and influencer Hana Kuro to a global production and management deal, marking the second major signing for the J-pop-focused firm. Daily newsletters straight to your inbox Sign Up More From Pro",
  "image": "https://www.billboard.com/wp-content/uploads/2024/10/Breaking-Benjamin_2024_cr-Dominique-DCosta-billboard-pro-1260.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-1235814833\"\u003e\n\n\t\t\u003cdiv\u003e\n\t\t\t\u003cheader\u003e\n\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\u003cp\u003eAlso this week: thiarajxtt, The Head and the Heart, The Red Jumpsuit Apparatus, The Rasmus, Hollywood Undead and more.\u003c/p\u003e\n\t\t\t\t\n\n\t\t\t\t\n\n\t\t\t\u003c/header\u003e\n\t\t\u003c/div\u003e\n\n\t\t\u003cdiv\u003e\n\t\t\t\t\n\u003cdiv\u003e\n\t\n\n\u003cfigure\u003e\n\n\t\t\t\n\u003cdiv\u003e\n\t\n\t\t\t\u003cp\u003e\u003cimg src=\"https://www.billboard.com/wp-content/uploads/2024/10/Breaking-Benjamin_2024_cr-Dominique-DCosta-billboard-pro-1260.jpg?w=942\u0026amp;h=623\u0026amp;crop=1\" alt=\"Breaking Benjamin\" srcset=\"\" sizes=\"(min-width: 87.5rem) 1000px, (min-width: 78.75rem) 681px, (min-width: 48rem) 450px, (max-width: 48rem) 100vw\" height=\"\" width=\"\" decoding=\"async\"/\u003e\n\t\t\t\n\t\t\t\u003c/p\u003e\n\t\n\t\u003c/div\u003e\n\t\n\t\t\t\n\t\t\t\n\u003cfigcaption\u003e\n\t\n\t\t\t\t\t\u003cspan\u003eBreaking Benjamin\u003c/span\u003e\n\t\t\n\t\t\t\t\t\t\t\t\t\u003ccite\u003eDominique D\u0026#39;Costa\u003c/cite\u003e\n\t\t\t\t\t\n\t\t\n\t\t\u003c/figcaption\u003e\n\n\t\t\t\n\u003c/figure\u003e\n\n\u003c/div\u003e\n\t\t\t\t\u003cdiv\u003e\u003cp\u003e\n\t\u003cstrong\u003e\u003ca href=\"https://www.billboard.com/artist/breaking-benjamin/\"\u003eBreaking Benjamin\u003c/a\u003e\u003c/strong\u003e signed with \u003cstrong\u003eBMG \u003c/strong\u003eto release new music, their first since 2018. According to a press release, the band has racked up 8.5 billion streams globally.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\n\tOn the heels of his recent signing with Eminem’s Shady Records, Aftermath Entertainment and Interscope, Filipino rapper \u003cstrong\u003eEz Mil\u003c/strong\u003e signed to \u003cstrong\u003eGrassroots Music\u003c/strong\u003e for global management. His representative at the company is \u003cstrong\u003eDan Lee\u003c/strong\u003e.\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eUniversal Music Canada \u003c/strong\u003esigned Punjabi producer \u003cstrong\u003ethiarajxtt \u003c/strong\u003e(a.k.a. Dilmanjot Singh Thiara), who released the EP \u003cem\u003eIf the Sun Had a Dark Side\u003c/em\u003e on the label on Oct. 18. Last year, thiarajxtt produced most of Diljit Dosanjh’s album Ghost and collaborated with Jassa Dhillon, Shubh, Channi Nattan, Jerry and more.\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"10140328\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tTrending on Billboard\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eThe Head and the Heart\u003c/strong\u003e signed with \u003cstrong\u003eVerve Forecast\u003c/strong\u003e and released a new single entitled “Arrow.” A new studio album will be announced in the coming weeks.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eThe Red Jumpsuit Apparatus\u003c/strong\u003e (“Face Down,” “Your Guardian Angel”) signed to \u003cstrong\u003eBetter Noise Music\u003c/strong\u003e, which will release the band’s new album next spring.\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tFinnish rock band \u003cstrong\u003eThe Rasmus\u003c/strong\u003e (“In the Shadows”) also signed with \u003cstrong\u003eBetter Noise\u003c/strong\u003e, which jointly released the group’s new single, “Rest in Pieces,” with Nordic indie label Playground Music on Friday (Oct. 25).\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tRap-rock group \u003cstrong\u003e\u003ca href=\"https://www.billboard.com/artist/hollywood-undead/\"\u003eHollywood Undead\u003c/a\u003e\u003c/strong\u003e signed with \u003cstrong\u003eSumerian Records\u003c/strong\u003e and released the new single “Hollywood Forever.” According to a press release, the group has more than 3.1 billion career streams across platforms.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAlt-pop trio \u003cstrong\u003eCoyote Theory\u003c/strong\u003e (“This Side of Paradise”) signed with \u003cstrong\u003eNettwerk Music Group\u003c/strong\u003e and released the new single “Waiting on the Weather.” The band’s drummer, \u003cstrong\u003eJayson Lynn\u003c/strong\u003e, acts as the group’s manager. A\u0026amp;Rs are \u003cstrong\u003eAnne Elise Dickinson\u003c/strong\u003e and \u003cstrong\u003eTom Gates\u003c/strong\u003e.\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eAustin Williams\u003c/strong\u003e and \u003cstrong\u003eTruth or Dare Records\u003c/strong\u003e partnered with \u003cstrong\u003eRECORDS Nashville/Columbia Records\u003c/strong\u003e. Williams, known for songs including “Here We Go Again” and “Wanna Be Saved,” is repped by \u003cstrong\u003eLoyd Potts\u003c/strong\u003e and \u003cstrong\u003eKen Madson\u003c/strong\u003e at Ignition Management, with agency representation from CAA. \u003cem\u003e– Jessica Nicholson\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eBig Machine Records\u003c/strong\u003e signed singer-songwriter and two-time Grammy nominee \u003cstrong\u003e\u003ca href=\"https://www.billboard.com/artist/ryan-hurd/\"\u003eRyan Hurd\u003c/a\u003e\u003c/strong\u003e, who released his latest song, “This Party Sucks,” on Friday (Oct. 25). Hurd is also signed to Big Machine Music for publishing. The Big Machine Records roster additionally includes Tim McGraw, Carly Pearce, Midland, Rascal Flatts and Jackson Dean.\u003cem\u003e – Jessica Nicholson\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003ca href=\"https://www.billboard.com/artist/mereba/\"\u003eMereba\u003c/a\u003e\u003c/strong\u003e signed to \u003cstrong\u003eSecretly Canadian\u003c/strong\u003e, which will release her new album, \u003cem\u003eThe Breeze Grew a Fire\u003c/em\u003e, on Feb. 14. The first single from the LP, “Counterfeit,” dropped on Oct. 22.\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tPop-rock duo \u003cstrong\u003e\u003ca href=\"https://www.billboard.com/artist/sparks/\"\u003eSparks\u003c/a\u003e\u003c/strong\u003e (Ron and Russell Mael) signed with \u003cstrong\u003eTransgressive Records\u003c/strong\u003e, which will release their as-yet-untitled upcoming studio album — the band’s 28th — next year, with Firebird Label Services serving as distributor.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eHEYOON\u003c/strong\u003e, a Korean-born pop artist based in both L.A. and Korea who was previously part of the international pop group Now United, signed with \u003cstrong\u003eUniversal Music Korea\u003c/strong\u003e. The label will help develop HEYOON globally.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSibling duo Ocie and Wes Crowe, known as the country/folk/alternative duo \u003cstrong\u003eCrowe Boys\u003c/strong\u003e, signed with \u003cstrong\u003eUMG Nashville\u003c/strong\u003e. The duo’s first release for the label is “Let Me Feel Alone,” written solely by Ocie Crowe, out Nov. 8. \u003cem\u003e– Jessica Nicholson\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tNew York-based rapper-producer-trumpeter \u003cstrong\u003ePan Amsterdam\u003c/strong\u003e, previously known as Leron Thomas, signed to \u003cstrong\u003eHeavenly Records\u003c/strong\u003e and released the new track “White Ninja.” An album is due next year.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tManchester, U.K.-based experimental punk band\u003cstrong\u003e Maruja \u003c/strong\u003esigned with \u003cstrong\u003eMusic For Nations\u003c/strong\u003e and released a new single, “Break the Tension,” on the label. The group is slated to embark on a North American tour next year.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tBarbadian singer/songwriter/producer \u003cstrong\u003eAyoni \u003c/strong\u003esigned with \u003cstrong\u003eDef Jam Recordings \u003c/strong\u003eand released the single “San Francisco” ahead of a larger project set to drop next year. Ayoni is featured in the Paramount+ documentary \u003cem\u003eUncharted\u003c/em\u003e.\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eWME \u003c/strong\u003esigned singer-songwriter\u003cstrong\u003e Zach Meadows\u003c/strong\u003e. The Florida native (and now Nashville resident) is repped by Torrez Music Group’s \u003cstrong\u003eAlex Torrez\u003c/strong\u003e and \u003cstrong\u003eEmily Vincent\u003c/strong\u003e. He released his debut album, \u003cem\u003eRoad to Nowhere\u003c/em\u003e, in August and will soon join Braxton Keith on the road throughout November.\u003cem\u003e – Jessica Nicholson\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eHandcraft Entertainment \u003c/strong\u003esigned Japanese-British artist, model and influencer \u003cstrong\u003eHana Kuro\u003c/strong\u003e to a global production and management deal, marking the second major signing for the J-pop-focused firm.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\n\n\t\t\t\t\n\u003cdiv\u003e\n\t\n\t\u003ca href=\"https://www.billboard.com/\" title=\"Billboard\"\u003e\n\t\t\u003csvg xmlns=\"http://www.w3.org/2000/svg\" style=\"height:100%;width:100%\" viewBox=\"0 0 344.228 59.945\"\u003e\u003cg data-name=\"Group 4101\" transform=\"translate(-159 -5503.055)\"\u003e\u003cpath d=\"M208.716 5503.055a7.609 7.609 0 105.38 2.229 7.609 7.609 0 00-5.38-2.229zM202.153 5520.818h13.122v39.903h-13.122z\" fill=\"#101119\"\u003e\u003c/path\u003e\u003cpath data-name=\"Rectangle\" fill=\"#101119\" d=\"M217.989 5505.215h13.119v55.507h-13.119zM233.822 5505.215h13.119v55.507h-13.119z\"\u003e\u003c/path\u003e\u003cpath data-name=\"Path\" d=\"M388.136 5524.938v-4.115h-13.122v39.906h13.122v-19.026c0-4.891 2.562-7.531 7.221-7.531h1.557v-13.743c-3.966.161-6.837 1.4-8.778 4.509z\" fill=\"#101119\"\u003e\u003c/path\u003e\u003cpath d=\"M349.936 5561.352a20.08 20.08 0 01-6.711-1.131 18.468 18.468 0 01-5.7-3.23 19.249 19.249 0 01-6.585-11.829 20.269 20.269 0 01-19.833 16.083h-.2a20.269 20.269 0 01-19.721-16.47 20.762 20.762 0 01-6.235 11.834 17.738 17.738 0 01-5.371 3.43 16.719 16.719 0 01-6.315 1.233h-.274a14.707 14.707 0 01-10.285-4.2v3.649h-12.889v-55.5h13.122v17.625a15.209 15.209 0 018.478-2.574c.2 0 .4 0 .6.012a19.819 19.819 0 016.8 1.176 18.531 18.531 0 015.713 3.326 18.992 18.992 0 014.235 5.175 21.223 21.223 0 012.368 6.722 20.276 20.276 0 0119.838-16.74h.132a20.267 20.267 0 0119.927 16.485 20.1 20.1 0 016.311-11.762 18.484 18.484 0 0112.442-4.48c3.271 0 7.573 1.68 9.395 3.67v-2.968h13.119v18.185c0 .787-.006 1.473-.018 2.1.012.621.018 1.307.018 2.1v17.458h-13.122v-2.252a16.223 16.223 0 01-9.239 2.873zm-79.308-28a7.609 7.609 0 107.609 7.609 7.617 7.617 0 00-7.609-7.609zm79.907-.368a7.608 7.608 0 107.609 7.609 7.618 7.618 0 00-7.609-7.609zm-39.418-.238a7.609 7.609 0 107.609 7.608 7.617 7.617 0 00-7.609-7.608z\" fill=\"#101119\"\u003e\u003c/path\u003e\u003cpath data-name=\"Shape\" d=\"M415.967 5561.266h-.271a16.731 16.731 0 01-7.076-1.562 18.056 18.056 0 01-5.8-4.3 21.418 21.418 0 01-5.37-14.478 23.077 23.077 0 011.5-8.37 19.508 19.508 0 014.132-6.528 19 19 0 0113.848-5.755c.2-.008.4-.012.6-.012a15.208 15.208 0 018.482 2.574v-17.625h13.132v55.51h-12.889v-3.649a14.716 14.716 0 01-10.289 4.2zm2.327-28.013a7.609 7.609 0 107.608 7.609 7.618 7.618 0 00-7.608-7.609zM182.177 5561.275a14.71 14.71 0 01-10.288-4.2v3.649H159v-55.503h13.122v17.625a15.209 15.209 0 018.478-2.574c.2 0 .4 0 .6.012a19 19 0 0113.847 5.754 19.514 19.514 0 014.133 6.528 23.081 23.081 0 011.507 8.37 21.418 21.418 0 01-5.36 14.475 18.058 18.058 0 01-5.8 4.3 16.728 16.728 0 01-7.077 1.562zm-2.369-27.923a7.608 7.608 0 107.609 7.609 7.618 7.618 0 00-7.609-7.609z\" fill=\"#101119\"\u003e\u003c/path\u003e\u003ccircle cx=\"28.37\" cy=\"28.37\" r=\"28.37\" transform=\"translate(446.487 5506.26)\" fill=\"#cb001b\"\u003e\u003c/circle\u003e\u003cpath data-name=\"Shape\" d=\"M458.261 5546.785h-4.028v-20.87h3.542v1.982a6.615 6.615 0 015.072-2.361c.086 0 .178 0 .266.005l.16-.005a7.746 7.746 0 017.735 8.135 7.744 7.744 0 01-7.735 8.13h-.393a6.723 6.723 0 01-4.619-1.829v6.806zm4.3-17.391h-.013a4.303 4.303 0 00.014 8.606h.119a4.188 4.188 0 004.182-4.325 4.31 4.31 0 00-4.299-4.281z\" fill=\"#fff\"\u003e\u003c/path\u003e\u003cpath data-name=\"Path\" d=\"M482.299 5525.778v3.644a4.09 4.09 0 00-1.406-.256c-2.325 0-4.567 2.134-4.567 5.665v6.6h-4.027v-15.514h3.318v2.669a5.5 5.5 0 015.006-3.038 6.638 6.638 0 011.676.23z\" fill=\"#fff\"\u003e\u003c/path\u003e\u003cpath data-name=\"Shape\" d=\"M490.747 5541.803a8.665 8.665 0 01-6.076-2.285 8 8 0 01-2.373-5.844 8 8 0 012.374-5.846 8.664 8.664 0 016.075-2.285 8.661 8.661 0 016.074 2.284 8 8 0 012.377 5.847 8 8 0 01-2.373 5.845 8.662 8.662 0 01-6.078 2.284zm0-12.409h-.014a4.303 4.303 0 00.015 8.606h.119a4.188 4.188 0 004.183-4.327 4.311 4.311 0 00-4.301-4.28z\" fill=\"#fff\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/svg\u003e\t\t\u003cspan\u003e\u003c/span\u003e\n\t\u003c/a\u003e\n\t\n\t\u003cp\u003eDaily newsletters straight to your inbox\u003c/p\u003e\n\n\t\n\u003cp\u003e\u003ca href=\"https://cloud.email.billboard.com/signup/\" rel=\"noopener noreferrer\"\u003e\n\tSign Up\u003c/a\u003e\n\u003c/p\u003e\u003c/div\u003e\n\n\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\u003csection\u003e\n\t\t\t\n\n\t\u003ch2 id=\"section-heading\"\u003e\n\n\t\n\t\tMore From Pro\n\t\n\t\u003c/h2\u003e\n\n\t\n\t\n\n\t\t\t\n\t\n\t\u003c/section\u003e\n\t\t\t\n\t\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-10-29T23:44:03Z",
  "modifiedTime": "2024-10-29T23:44:10Z"
}
