{
  "id": "7e57e130-7df1-49b6-b63e-ee4d1b7a31a1",
  "title": "The EU is investigating UMG’s $775m Downtown buyout – but why, and what happens now?",
  "link": "https://www.musicbusinessworldwide.com/the-eu-is-investigating-umgs-775m-downtown-buyout-but-why-and-what-happens-now/",
  "description": "MBW explains Article 22, and how the investigation process works... Source",
  "author": "Murray Stassen",
  "published": "Thu, 01 May 2025 18:48:29 +0000",
  "source": "https://www.musicbusinessworldwide.com/feed/",
  "categories": [
    "Analysis",
    "News",
    "MBW Explains"
  ],
  "byline": "Murray Stassen",
  "length": 12740,
  "excerpt": "MBW explains Article 22, and how the investigation process works…",
  "siteName": "Music Business Worldwide",
  "favicon": "https://www.musicbusinessworldwide.com/wp-content/themes/mb/assets/img/icons/favicon-192x192.png",
  "text": "Universal Music Group‘s Virgin Music Group revealed in December that it had agreed to buy Downtown Music Holdings LLC in a $775 million dealOn Friday (April 25), Europe’s competition watchdog – the European Commission – revealed that it’s preparing to investigate the proposed deal.The EC decided to look into the deal because the Netherlands triggered a legal mechanism in EU competition law called Article 22.In recent years, Article 22 – which we explain in more detail below – has been used by individual EU member states in a number of high-profile M\u0026A deals.In December, for example, the European Commission cleared unconditionally NVIDIA’s $700 million acquisition of AI company Run:AI, concluding that the transaction would raise no competition concerns in the European Economic Area, after it was referred to the EC by Italy, using Article 22.In a plot twist, NVIDIA sued the European Commision earlier this year over its decision to probe the deal. As reported by Reuters, the EC’s authority over mergers in Europe could be curbed if NVIDIA wins the case.In 2022, the EC approved Meta’s acquisition of customer relationship management platform Kustomer with remedies. Austria referred the case under Article 22, which was then joined by several other countries.Apple‘s $400 million Shazam acquisition in 2018 was also investigated by the EC after it was referred by Austria and six other Member States under Article 22. The Commission conducted an in-depth investigation and approved the acquisition.Three big deals, three significant approvals.One recent example of a deal referred to the EC via Article 22 that wasn’t approved revolved around Illumina’s $7.1 billion acquisition of Grail, a company developing cancer detection tests. It was referred to the EC by France and joined by other countries.The EC investigated the deal, and prohibited the acquisition in September 2022, citing concerns about the deal’s impact on the competitive landscape of early cancer detection tests. Illumina launched a court battle against the EC, which it won, with the European Court of Justice overturning the EC’s decision, finding that the Commission lacked jurisdiction to review the deal under Article 22.Illumina argued the deal fell outside the Commission’s jurisdiction. The ECJ ultimately agreed with Illumina, ruling that the Commission’s review was unlawful, as reported by Reuters.As you can see, Article 22 was the legal tool used in Europe to refer each of those deals to the EC. Here’s what it means, how the investigation process works, and what it tells us about the UMG/Downtown deal’s chances of approval.1. What is Article 22Article 22 of the European Commission’s Merger Regulation (ECMR) is sometimes called the “Dutch clause” and allows EU Member States to refer merger cases to the European Commission for review, even when these mergers don’t meet the EU-level notification thresholds.It was introduced as part of the original European Merger Regulation (Council Regulation 4064/89), which was adopted on December 21, 1989, and came into effect on September 21, 1990.This was the first comprehensive EU-level merger control system, and Article 22 was included from the beginning as a mechanism to address the fact that some Member States (notably the Netherlands) didn’t have their own national merger control regimes at that time. The Ne2. What happens when a member state triggers Article 22? To trigger Article 22, a Member State must submit a written referral request to the Commission within 15 working days of being informed of the merger.The request must demonstrate that the “concentration” – i.e. the alleged dominant positioning of the proposed combination of the parties in the market – could:“(i) affect trade between Member States; and (ii) threaten to significantly affect competition within the territory of the Member State or States making the request”.There’s also a key part of the Article 22 process that speaks volumes about the wider European market’s appetite for investigating the UMG/Downtown deal in particular.Once the European Commission receives a written referral from any one member state, the EC immediately notifies all other European States about the referral request.All other European Union Member States and European Economic Area (EEA) states – including giants like Germany, France, Spain and Italy – then have 15 working days from receiving this notification to join the request.The Commission then has 10 working days from the end of the joining period to decide whether to accept the referral.In the case of the Downtown deal, which the Netherlands referred to the EC by triggering Article 22, Austria was the only other European state that chose to join the referral.A big point to note here is that the window for the other member states to join the referral is now officially closed, which means no other European country can join the Netherlands and Austria as the investigation process rolls out.3. The importance of Turnover Thresholds in all of thisThe European Commission explains in a document outlining its merger control procedures that it investigates mergers and acquisitions that exceed specific turnover thresholds to assess their potential impact on competition within the EU internal market.These thresholds determine whether a transaction has an “EU dimension” requiring notification to and clearance from the Commission.That “EU Dimension” part means that both companies involved in an acquisition have to meet certain annual turnover thresholds in the EU and globally before they’re required by EU law to notify the EC of their intention to strike their deal.Interestingly, the EC confirmed on Friday that UMG’s proposed Downtown deal “does not reach the turnover thresholds set out in the EUMR [EU Merger Regulation]”.UMG was therefore not originally required to notify the European Commission about the deal.Universal was required, however, to notify two specific European member states about the deal: the Netherlands and Austria, where, according to the EC, it did meet “the relevant national turnover-based notification thresholds.”In Austria, a transaction requires notification to the Austrian Competition Authority if the companies’ combined worldwide turnover exceeds €300 million and Combined Austrian turnover exceeds €30 million; and at least two undertakings each have Austrian turnover exceeding €1 million.In the Netherlands, a transaction requires notification to the Dutch competition authority (ACM) if the companies’ combined worldwide turnover exceeds €150 million; and at least two undertakings each have Dutch turnover exceeding €30 million.Universal Music Group’s overall global annual revenues in FY 2024 (across recorded music, publishing, and more) stood at EUR €11.834 billion (USD $12.81bn).According to Dutch company filings, the gross revenues of Downtown-owned FUGA alone were €187.78 million in 2023, and €168.44 million in 2022 (see below).The thresholds are considerably higher at an EU level. A transaction has an “EU dimension” requiring notification to the European Commission if either set of the following thresholds is met:Primary Thresholds: Combined worldwide turnover exceeds €5 billion, and; At least two undertakings each have EU-wide turnover exceeding €250 million UNLESS each undertaking achieves more than two-thirds of its EU-wide turnover in a single Member StateSecondary Thresholds: Combined worldwide turnover exceeds €2.5 billion, and; Combined turnover exceeds €100 million in each of at least three Member States, and; At least two undertakings each have turnover exceeding €25 million in those same three Member States, and; At least two undertakings each have EU-wide turnover exceeding €100 million UNLESS each undertaking achieves more than two-thirds of its EU-wide turnover in a single Member StateTransactions meeting either set of thresholds must be notified to and cleared by the Commission before implementation.4. We are now in the ‘pre-notification’ period’UMG is now required to notify the European Commission about the deal. It is now in the pre-notification period.The pre-notification period refers to the phase after a deal is referred by a Member State competition authority under Article 22 of the EU Merger Regulation, but before formal notification.During this period, parties engage with the competition authority through pre-notification discussions. These discussions aim to address preliminary issues, such as jurisdiction questions, and ensure the notification will be complete when formally submitted.This process allows parties to resolve potential concerns early and prepare comprehensive information for the subsequent investigation phase.It’s a crucial preparatory stage that helps streamline the formal review process once notification occurs.There is no deadline for the formal notification to be filed with the European Commission.5. formal notification of the deal to the EC and a Phase 1 investigationAfter formal notification under Article 22 of the EU Merger Regulation, the formal review process – the Phase One investigation – begins.The competition authority has 25 working days to conduct its Phase I investigation, examining whether the alleged “concentration” raises serious competition concerns.During this period, the authority reviews the submitted information, may request additional data, and potentially consult third parties like competitors and customers.If concerns are identified, the authority can either accept remedies from the parties or open an in-depth Phase II investigation, which extends the review by up to 90 additional working days.Alternatively, if no serious concerns are found during Phase I, the deal will be cleared unconditionally, allowing the transaction to proceed.According to the European Commission, “more than 90% of all cases are resolved in Phase I, generally without remedies,” which implies that less than 10% of cases proceed to Phase II.6. A Phase II investigation is very rareIn the rare event that a Phase II investigation is launched under the EU Merger Regulation, the European Commission conducts an in-depth examination lasting 90 working days, which can be extended by 15-20 additional working days if needed.During this period, the Commission thoroughly investigates competition concerns through extensive document reviews, stakeholder interviews, and economic analyses. The parties have opportunities to offer remedies addressing identified issues.The Commission may request significant additional information and hold formal hearings with the parties and third parties. At the conclusion, the Commission can either clear the merger (with or without conditions), or prohibit it entirely if competition concerns cannot be adequately addressed.Just to reiterate those stats from above, Phase II investigations are rare, representing less than 10% of all EU merger cases.7. A final thought..Based on historical precedents, the odds seem to favor approval of the UMG-Downtown deal, possibly with conditions.Unlike the blocked Illumina-Grail merger, which involved concerns about eliminating future competition in cancer screening, the music industry has already seen significant consolidation, and the EC has typically approved such deals.Also, the recent ECJ ruling in the Illumina/Grail case potentially changes the Article 22 landscape.The ruling limits the Commission’s ability to review transactions that fall below both EU and national merger control thresholds, which could affect how future Article 22 cases are approached. The ruling was described in an article in the Journal of Antitrust Enforcement as “a watershed moment for EU merger control”.“We are confident that we will close this acquisition in the second half of the year, on its original timeline.”Universal Music GroupFor Universal Music Group, this regulatory scrutiny comes at a time when the company continues to expand its global footprint.The acquisition of Downtown would add significant artist and label services capabilities to UMG’s portfolio through Virgin Music Group with the addition of Downtown-owned FUGA, CD Baby, Curve Royalty Systems, and other companies within the Downtown portfolio.The outcome of this investigation will be closely watched by the global music industry, as it could establish precedents for future music industry consolidation and M\u0026A activity in the European market.In a statement issued last week, UMG was bullish about its prospects of winning approval for the deal: “We look forward to continuing to co-operate with the European Commission in the weeks ahead. We are confident that we will close this acquisition in the second half of the year, on its original timeline.” Music Business Worldwide",
  "image": "https://www.musicbusinessworldwide.com/files/2025/05/Fuga-revenues-1.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003ca title=\"Companies \u0026gt; Universal Music Group [4,070 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/universal-music-group/\"\u003eUniversal Music Group\u003c/a\u003e‘s Virgin Music Group \u003ca href=\"https://www.musicbusinessworldwide.com/universals-music-group-buys-downtown-music-for-775-million/\"\u003e\u003cspan\u003erevealed \u003c/span\u003e\u003c/a\u003ein December that it had agreed to buy \u003cb\u003e\u003ca title=\"Companies \u0026gt; Downtown Music Holdings [455 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/downtown-music-holdings/\"\u003eDowntown Music Holdings\u003c/a\u003e LLC in a $775 million deal\u003c/b\u003e\u003c/p\u003e\u003cp\u003eOn Friday (April 25), Europe’s competition watchdog – the European Commission – revealed that it’s preparing to investigate the proposed deal.\u003c/p\u003e\u003cp\u003eThe EC decided to look into the deal because the \u003cstrong\u003eNetherlands\u003c/strong\u003e triggered a legal mechanism in EU competition law called \u003ca href=\"https://competition-policy.ec.europa.eu/system/files/2022-12/article22_recalibrated_approach_QandA.pdf\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eArticle 22\u003c/strong\u003e\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eIn recent years, Article 22 – which we explain in more detail below – has been used by individual EU member states in a number of high-profile M\u0026amp;A deals.\u003c/p\u003e\u003cp\u003eIn December, for example, the European Commission \u003ca href=\"https://ec.europa.eu/commission/presscorner/detail/en/ip_24_6548\" target=\"_blank\" rel=\"noopener\"\u003ecleared\u003c/a\u003e unconditionally NVIDIA’s \u003cstrong\u003e$700 million\u003c/strong\u003e acquisition of AI company \u003cstrong\u003eRun:AI,\u003c/strong\u003e concluding that the transaction would raise no competition concerns in the European Economic Area, after it was referred to the EC by Italy, using \u003cstrong\u003eArticle 22\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eIn a plot twist, \u003ca href=\"https://www.reuters.com/technology/nvidia-takes-eu-antitrust-regulators-court-probing-ai-startup-runai-bid-2025-02-24/\" target=\"_blank\" rel=\"noopener\"\u003eNVIDIA sued the European Commision\u003c/a\u003e earlier this year over its decision to probe the deal. As reported by \u003cem\u003eReuters\u003c/em\u003e, the EC’s authority over mergers in Europe could be curbed if NVIDIA wins the case.\u003c/p\u003e\u003cp\u003eIn 2022, the \u003ca href=\"https://ec.europa.eu/commission/presscorner/detail/en/ip_22_652\" target=\"_blank\" rel=\"noopener\"\u003eEC approved Meta’s\u003c/a\u003e acquisition of customer relationship management platform Kustomer with remedies. Austria referred the case under Article 22, which was then joined by several other countries.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca title=\"Companies \u0026gt; Apple [1,327 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/apple/\"\u003eApple\u003c/a\u003e‘s $400 million \u003ca title=\"Companies \u0026gt; Shazam [152 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/apple/shazam/\"\u003eShazam\u003c/a\u003e acquisition in 2018 was also\u003c/strong\u003e investigated by the EC after it was referred by Austria and six other Member States under Article 22. The Commission conducted an in-depth investigation and approved the acquisition.\u003c/p\u003e\u003cp\u003eThree big deals, three significant approvals.\u003c/p\u003e\u003cp\u003eOne recent example of a deal referred to the EC via Article 22 that \u003cem\u003ewasn’t\u003c/em\u003e approved revolved around Illumina’s\u003cstrong\u003e $7.1 billion \u003c/strong\u003eacquisition of Grail, a company developing cancer detection tests. It was referred to the EC by France and joined by other countries.\u003c/p\u003e\u003cp\u003eThe EC investigated the deal, and \u003ca href=\"https://ec.europa.eu/commission/presscorner/detail/it/ip_22_5364\" target=\"_blank\" rel=\"noopener\"\u003eprohibited the acquisition\u003c/a\u003e in September 2022, citing concerns about the deal’s impact on the competitive landscape of early cancer detection tests.\u003cspan data-cid=\"decc4772-ec81-4da3-86db-67541de60188\"\u003e\u003cspan\u003e \u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eIllumina launched a court battle against the EC, \u003ca href=\"https://www.reuters.com/markets/deals/eu-top-court-backs-illumina-fight-against-eu-probe-into-grail-deal-2024-09-03/\" target=\"_blank\" rel=\"noopener\"\u003ewhich it won,\u003c/a\u003e with the European Court of Justice\u003c/strong\u003e overturning the EC’s decision, finding that the Commission lacked jurisdiction to review the deal under Article 22.\u003c/p\u003e\u003cp\u003eIllumina argued the deal fell outside the Commission’s jurisdiction. The ECJ ultimately agreed with Illumina, ruling that the Commission’s review was unlawful, as reported by \u003cem\u003eReuters.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eAs you can see, Article 22 was the legal tool used in Europe to refer each of those deals to the EC. Here’s what it means, how the investigation process works, and what it tells us about the UMG/\u003ca title=\"Companies \u0026gt; Downtown Music Holdings [457 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/downtown-music-holdings/\"\u003eDowntown\u003c/a\u003e deal’s chances of approval.\u003c/p\u003e\u003chr/\u003e\u003ch6\u003e\u003cspan\u003e1. What is Article 22\u003c/span\u003e\u003c/h6\u003e\u003cp\u003eArticle 22 of the European Commission’s Merger Regulation (ECMR) is sometimes called the “\u003cstrong\u003eDutch clause\u003c/strong\u003e” and allows EU Member States to refer merger cases to the European Commission for review, even when these mergers don’t meet the EU-level notification thresholds.\u003c/p\u003e\u003cp\u003eIt was introduced as part of the original European Merger Regulation (Council Regulation 4064/89), which was adopted on December 21, 1989, and came into effect on September 21, 1990.\u003c/p\u003e\u003cp\u003eThis was the first comprehensive EU-level merger control system, and Article 22 was included from the beginning as a mechanism to address the fact that some Member States (notably the Netherlands) didn’t have their own national merger control regimes \u003cem\u003eat that time. \u003c/em\u003eThe Ne\u003c/p\u003e\u003chr/\u003e\u003ch6\u003e\u003cspan\u003e2. What happens when a member state triggers Article 22? \u003c/span\u003e\u003c/h6\u003e\u003cp\u003eTo trigger Article 22, a Member State must submit a written referral request to the Commission within \u003cstrong\u003e15\u003c/strong\u003e working days of being informed of the merger.\u003c/p\u003e\u003cp\u003eThe request must demonstrate that the “concentration” – i.e. the alleged dominant positioning of the proposed combination of the parties in the market – could:\u003c/p\u003e\u003cp\u003e“(i) affect trade between Member States; and (ii) threaten to significantly affect competition within the territory of the Member State or States making the request”.\u003c/p\u003e\u003cp\u003eThere’s also a key part of the \u003cstrong\u003eArticle 22\u003c/strong\u003e process that speaks volumes about the wider European market’s \u003cstrong\u003eappetite\u003c/strong\u003e for investigating the UMG/Downtown deal in particular.\u003c/p\u003e\u003cp\u003eOnce the European Commission receives a written referral from any one member state, the EC immediately notifies \u003cstrong\u003eall\u003c/strong\u003e \u003cstrong\u003eother \u003c/strong\u003eEuropean States about the referral request.\u003c/p\u003e\u003cp\u003eAll other European Union Member States and European Economic Area (EEA) states – including giants like \u003cstrong\u003eGermany, France, Spain and Italy\u003c/strong\u003e – then have \u003cstrong\u003e15\u003c/strong\u003e working days from receiving this notification to join the request.\u003c/p\u003e\u003cp\u003eThe Commission then has \u003cstrong\u003e10\u003c/strong\u003e working days from the end of the joining period to decide whether to accept the referral.\u003c/p\u003e\u003cp\u003eIn the case of the Downtown deal, which the Netherlands referred to the EC by triggering Article 22, \u003cstrong\u003eAustria\u003c/strong\u003e was the only other European state that chose to join the referral.\u003c/p\u003e\u003cp\u003eA big point to note here is that the window for the other member states to join the referral is now officially closed, which means no other European country can join the Netherlands and Austria as the investigation process rolls out.\u003c/p\u003e\u003chr/\u003e\u003ch6\u003e\u003cspan\u003e3. The importance of Turnover Thresholds in all of this\u003c/span\u003e\u003c/h6\u003e\u003cp\u003eThe European Commission explains in a \u003ca href=\"https://competition-policy.ec.europa.eu/system/files/2021-02/merger_control_procedures_en.pdf\" target=\"_blank\" rel=\"noopener\"\u003edocument outlining its merger control procedures\u003c/a\u003e that it investigates mergers and acquisitions that exceed specific turnover thresholds to assess their potential impact on competition within the EU internal market.\u003c/p\u003e\u003cp\u003eThese thresholds determine whether a transaction has an “EU dimension” requiring notification to and clearance from the Commission.\u003c/p\u003e\u003cp\u003eThat “\u003cstrong\u003eEU Dimension\u003c/strong\u003e” part means that both companies involved in an acquisition have to meet certain \u003cstrong\u003eannual turnover thresholds\u003c/strong\u003e in the EU and globally before they’re required by EU law to notify the EC of their intention to strike their deal.\u003c/p\u003e\u003cp\u003eInterestingly, the EC confirmed on Friday that UMG’s proposed Downtown deal “\u003cstrong\u003edoes not reach the\u003c/strong\u003e \u003cstrong\u003eturnover thresholds\u003c/strong\u003e set out in the EUMR [EU Merger Regulation]”.\u003c/p\u003e\u003cp\u003eUMG was therefore not originally required to notify the European Commission about the deal.\u003c/p\u003e\u003cp\u003eUniversal was required, however, to notify two specific European member states about the deal: \u003cstrong\u003ethe Netherlands\u003c/strong\u003e and \u003cstrong\u003eAustria,\u003c/strong\u003e where, according to the EC, it did meet “the relevant national turnover-based notification thresholds.”\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eIn\u003c/strong\u003e \u003cstrong\u003eAustria\u003c/strong\u003e, a transaction requires notification to the Austrian Competition Authority if the companies’ combined worldwide turnover exceeds \u003cstrong\u003e€300 million \u003c/strong\u003eand Combined Austrian turnover exceeds \u003cstrong\u003e€30 million; \u003c/strong\u003eand at least two undertakings each have Austrian turnover exceeding \u003cstrong\u003e€1 million.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eIn \u003cstrong\u003ethe Netherlands\u003c/strong\u003e, a transaction requires notification to the Dutch competition authority (ACM) if the companies’ combined worldwide turnover exceeds \u003cstrong\u003e€150 million;\u003c/strong\u003e and at least two undertakings each have Dutch turnover exceeding \u003cstrong\u003e€30 million\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eUniversal Music Group’s overall global annual revenues in FY 2024 (across recorded music, publishing, and more) \u003ca href=\"https://www.musicbusinessworldwide.com/universal-recorded-music-subscription-streaming-revenues-topped-5bn-in-2024-up-9-1-yoy/\" target=\"_blank\" rel=\"noopener\"\u003estood at\u003c/a\u003e \u003cstrong\u003eEUR €11.834 billion (USD $12.81bn)\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAccording to Dutch company filings, the gross revenues of Downtown-owned \u003ca title=\"Companies \u0026gt; FUGA [160 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/downtown-music-holdings/fuga/\"\u003eFUGA\u003c/a\u003e alone were\u003cstrong\u003e €187.78 million\u003c/strong\u003e in 2023, and \u003cstrong\u003e€168.44 million\u003c/strong\u003e in 2022 (see below).\u003c/span\u003e\u003c/p\u003e\u003chr/\u003e\u003cfigure\u003e\u003cimg src=\"https://www.musicbusinessworldwide.com/files/2025/05/Fuga-revenues-1-80x44.png\" data-srcset=\"https://www.musicbusinessworldwide.com/files/2025/05/Fuga-revenues-1-80x44.png 80w, https://www.musicbusinessworldwide.com/files/2025/05/Fuga-revenues-1-160x89.png 160w, https://www.musicbusinessworldwide.com/files/2025/05/Fuga-revenues-1-320x178.png 320w, https://www.musicbusinessworldwide.com/files/2025/05/Fuga-revenues-1-418x232.png 418w, https://www.musicbusinessworldwide.com/files/2025/05/Fuga-revenues-1-648x360.png 648w, https://www.musicbusinessworldwide.com/files/2025/05/Fuga-revenues-1-836x464.png 836w, https://www.musicbusinessworldwide.com/files/2025/05/Fuga-revenues-1-1296x720.png 1296w\" data-sizes=\"auto\" srcset=\"https://www.musicbusinessworldwide.com/files/2025/05/Fuga-revenues-1-80x44.png 80w, https://www.musicbusinessworldwide.com/files/2025/05/Fuga-revenues-1-160x89.png 160w, https://www.musicbusinessworldwide.com/files/2025/05/Fuga-revenues-1-320x178.png 320w, https://www.musicbusinessworldwide.com/files/2025/05/Fuga-revenues-1-418x232.png 418w, https://www.musicbusinessworldwide.com/files/2025/05/Fuga-revenues-1-648x360.png 648w, https://www.musicbusinessworldwide.com/files/2025/05/Fuga-revenues-1-836x464.png 836w, https://www.musicbusinessworldwide.com/files/2025/05/Fuga-revenues-1-1296x720.png 1296w\"/\u003e\u003c/figure\u003e\u003chr/\u003e\u003cp\u003eThe thresholds are considerably higher at an EU level. A transaction has an “\u003cstrong\u003eEU dimension\u003c/strong\u003e” requiring notification to the European Commission if either set of the following thresholds is met:\u003c/p\u003e\u003cp\u003e\u003cstrong\u003ePrimary Thresholds:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e \u003cli\u003eCombined worldwide turnover exceeds \u003cstrong\u003e€5 billion\u003c/strong\u003e, and;\u003c/li\u003e \u003cli\u003eAt least two undertakings each have EU-wide turnover exceeding \u003cstrong\u003e€250 million\u003c/strong\u003e\u003c/li\u003e \u003cli\u003eUNLESS each undertaking achieves more than two-thirds of its EU-wide turnover in a single Member State\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eSecondary Thresholds:\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e \u003cli\u003eCombined worldwide turnover exceeds \u003cstrong\u003e€2.5 billion\u003c/strong\u003e, and;\u003c/li\u003e \u003cli\u003eCombined turnover exceeds \u003cstrong\u003e€100 million\u003c/strong\u003e in each of at least three Member States, and;\u003c/li\u003e \u003cli\u003eAt least two undertakings each have turnover exceeding \u003cstrong\u003e€25 million\u003c/strong\u003e in those same three Member States, and;\u003c/li\u003e \u003cli\u003eAt least two undertakings each have EU-wide turnover exceeding\u003cstrong\u003e €100 million\u003c/strong\u003e\u003c/li\u003e \u003cli\u003eUNLESS each undertaking achieves more than two-thirds of its EU-wide turnover in a single Member State\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eTransactions meeting either set of thresholds must be notified to and cleared by the Commission before implementation.\u003c/p\u003e\u003chr/\u003e\u003ch6\u003e\u003cspan\u003e4. We are now in the ‘pre-notification’ period’\u003c/span\u003e\u003c/h6\u003e\u003cp\u003eUMG is now required to notify the European Commission about the deal. It is now in the pre-notification period.\u003c/p\u003e\u003cp\u003eThe pre-notification period refers to the phase after a deal is referred by a Member State competition authority under Article 22 of the EU Merger Regulation, but before \u003cstrong\u003eformal notification\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eDuring this period, parties engage with the competition authority through pre-notification discussions. These discussions aim to address preliminary issues, such as jurisdiction questions, and ensure the notification will be complete when formally submitted.\u003c/p\u003e\u003cp\u003eThis process allows parties to resolve potential concerns early and prepare comprehensive information for the subsequent investigation phase.\u003c/p\u003e\u003cp\u003eIt’s a crucial preparatory stage that helps streamline the formal review process once notification occurs.\u003c/p\u003e\u003cp\u003eThere is no deadline for the formal notification to be filed with the European Commission.\u003c/p\u003e\u003chr/\u003e\u003ch6\u003e\u003cspan\u003e5. formal notification of the deal to the EC and a Phase 1 investigation\u003c/span\u003e\u003c/h6\u003e\u003cp\u003eAfter formal notification under Article 22 of the EU Merger Regulation, the formal review process – the Phase One investigation – begins.\u003c/p\u003e\u003cp\u003eThe competition authority has 25 working days to conduct its Phase I investigation, examining whether the alleged “concentration” raises serious competition concerns.\u003c/p\u003e\u003cp\u003eDuring this period, the authority reviews the submitted information, may request additional data, and potentially consult third parties like competitors and customers.\u003c/p\u003e\u003cp\u003eIf concerns are identified, the authority can either accept remedies from the parties or open an in-depth Phase II investigation, which extends the review by up to 90 additional working days.\u003c/p\u003e\u003cp\u003eAlternatively, if no serious concerns are found during Phase I, the deal will be cleared unconditionally, allowing the transaction to proceed.\u003c/p\u003e\u003cp\u003eAccording to the \u003ca href=\"https://competition-policy.ec.europa.eu/mergers/procedures_en\" target=\"_blank\" rel=\"noopener\"\u003eEuropean Commission\u003c/a\u003e, “more than 90% of all cases are resolved in Phase I, generally without remedies,” which implies that less than 10% of cases proceed to \u003cstrong\u003ePhase II\u003c/strong\u003e.\u003c/p\u003e\u003chr/\u003e\u003ch6\u003e\u003cspan\u003e6. A Phase II investigation is very rare\u003c/span\u003e\u003c/h6\u003e\u003cp\u003eIn the rare event that a Phase II investigation \u003cem\u003eis\u003c/em\u003e launched under the EU Merger Regulation, the European Commission conducts an in-depth examination lasting 90 working days, which can be extended by 15-20 additional working days if needed.\u003c/p\u003e\u003cp\u003eDuring this period, the Commission thoroughly investigates competition concerns through extensive document reviews, stakeholder interviews, and economic analyses. The parties have opportunities to offer remedies addressing identified issues.\u003c/p\u003e\u003cp\u003eThe Commission may request significant additional information and hold formal hearings with the parties and third parties. At the conclusion, the Commission can either clear the merger (with or without conditions), or prohibit it entirely if competition concerns cannot be adequately addressed.\u003c/p\u003e\u003cp\u003eJust to reiterate those stats from above, Phase II investigations are rare, representing less than 10% of all EU merger cases.\u003c/p\u003e\u003chr/\u003e\u003ch6\u003e\u003cspan\u003e7. A final thought..\u003c/span\u003e\u003c/h6\u003e\u003cp\u003eBased on historical precedents, the odds seem to favor approval of the UMG-Downtown deal, possibly with conditions.\u003c/p\u003e\u003cp\u003eUnlike the blocked Illumina-Grail merger, which involved concerns about eliminating future competition in cancer screening, the music industry has already seen significant consolidation, and the EC has typically approved such deals.\u003c/p\u003e\u003cp\u003eAlso, the recent ECJ ruling in the Illumina/Grail case potentially changes the Article 22 landscape.\u003c/p\u003e\u003cp\u003eThe ruling limits the Commission’s ability to review transactions that fall below both EU and national merger control thresholds, which could affect how future Article 22 cases are approached. The ruling was described in an article in the \u003cem\u003eJournal of Antitrust Enforcement\u003c/em\u003e as “a \u003ca href=\"https://academic.oup.com/antitrust/article/13/1/215/8045483\" target=\"_blank\" rel=\"noopener\"\u003ewatershed moment\u003c/a\u003e for EU merger control”.\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e“We are confident that we will close this acquisition in the second half of the year, on its original timeline.”\u003c/p\u003e\u003cp\u003e\u003cspan\u003eUniversal Music Group\u003c/span\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003eFor Universal Music Group, this regulatory scrutiny comes at a time when the company continues to expand its global footprint.\u003c/p\u003e\u003cp\u003eThe acquisition of Downtown would add significant artist and label services capabilities to UMG’s portfolio through Virgin Music Group with the addition of Downtown-owned FUGA, \u003ca title=\"Companies \u0026gt; CD Baby [161 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/downtown-music-holdings/cd-baby/\"\u003eCD Baby\u003c/a\u003e, Curve Royalty Systems, and other companies within the Downtown portfolio.\u003c/p\u003e\u003cp\u003eThe outcome of this investigation will be closely watched by the global music industry, as it could establish precedents for future music industry consolidation and M\u0026amp;A activity in the European market.\u003c/p\u003e\u003cp\u003eIn a statement issued last week, UMG was bullish about its prospects of winning approval for the deal: “We look forward to continuing to co-operate with the European Commission in the weeks ahead. We are confident that we will close this acquisition in the second half of the year, on its original timeline.”\u003c/p\u003e\u003cp\u003e \u003cspan\u003eMusic Business Worldwide\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "14 min read",
  "publishedTime": "2025-05-01T18:48:29Z",
  "modifiedTime": "2025-05-01T19:21:33Z"
}
