{
  "id": "7ea1a136-f164-48ed-90ce-ba971069946c",
  "title": "Watch BALANCE AND COMPOSURE Perform Their Entire Album, The Things We Think We're Missing",
  "link": "https://metalinjection.net/video/watch-balance-and-composure-perform-their-entire-album-the-things-we-think-were-missing",
  "description": "The post-hardcore group revisited their 2013 record in a video just released on YouTube. The post Watch BALANCE AND COMPOSURE Perform Their Entire Album, The Things We Think We're Missing appeared first on Metal Injection.",
  "author": "Isabella Ambrosio",
  "published": "Sat, 01 Mar 2025 21:22:47 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "balance and composure"
  ],
  "byline": "By Isabella Ambrosio Published 2 hours ago",
  "length": 804,
  "excerpt": "The post-hardcore group revisited their 2013 record in a video just released on YouTube.",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "Post-hardcore legends Balance and Composure just released a live performance of their entire The Things We Think We're Missing record this Friday. Performed at Studio 4, Andy Slaymaker (rhythm guitar), Erik Peterson (lead guitar), Jon Simmons (lead vocals, rhythm guitar), Matt Warner (bass) and Dennis Wilson (drums) revisit the record that now sits at over 52 million streams to date in a live-setting that near mimics the record's studio quality. The instrumentals are so crisp and clear – with the sound engineer mixing like the rent is due – that Balance and Composure's newest performance allows nothing to be missed. Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2025/03/Screenshot-2025-03-01-at-9.12.46 p.m.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003ePost-hardcore legends \u003cstrong\u003eBalance and Composure\u003c/strong\u003e just released a live performance of their entire \u003cem\u003eThe Things We Think We\u0026#39;re Missing\u003c/em\u003e record this Friday.\u003c/p\u003e\n\n\n\n\u003cp\u003ePerformed at Studio 4, \u003cstrong\u003eAndy Slaymaker\u003c/strong\u003e (rhythm guitar), \u003cstrong\u003eErik Peterson\u003c/strong\u003e (lead guitar), \u003cstrong\u003eJon Simmons\u003c/strong\u003e (lead vocals, rhythm guitar), \u003cstrong\u003eMatt Warner\u003c/strong\u003e (bass) and \u003cstrong\u003eDennis Wilson\u003c/strong\u003e (drums) revisit the record that now sits at over 52 million streams to date in a live-setting that near mimics the record\u0026#39;s studio quality.\n\n\n\n\u003c/p\u003e\u003cp\u003eThe instrumentals are so crisp and clear – with the sound engineer mixing like the rent is due – that \u003cstrong\u003eBalance and Composure\u003c/strong\u003e\u0026#39;s newest performance allows nothing to be missed.\n\n\n\n\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
