{
  "id": "89f5adad-106a-451f-86f8-8b4af91c18c3",
  "title": "NEIL FALLON On New CLUTCH: \"It's Taken Longer Than I Think We Would've Liked\"",
  "link": "https://metalinjection.net/news/neil-fallon-on-new-clutch-its-taken-longer-than-i-think-we-wouldve-liked",
  "description": "\"When you come home from tour, you don't wanna turn around the next day and say, 'Let's get together and write a song.'\" The post NEIL FALLON On New CLUTCH: \"It's Taken Longer Than I Think We Would've Liked\" appeared first on Metal Injection.",
  "author": "Joel Barrios",
  "published": "Tue, 01 Apr 2025 18:02:22 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Latest News",
    "featured",
    "Clutch"
  ],
  "byline": "By Joel Barrios Published 7 hours ago",
  "length": 3681,
  "excerpt": "\"When you come home from tour, you don't wanna turn around the next day and say, 'Let's get together and write a song.'\"",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "Clutch fans eager for new music will be glad to hear that the band is deep in the songwriting process for their next album. In a recent interview with the Mark And Me podcast, frontman Neil Fallon shared an update on the follow-up to Sunrise On Slaughter Beach, released in September 2022. \"Yeah, we're writing now. It's taken longer than I think we would've liked to have, but to be honest, we toured a lot in the past three years, like really grounded down,\" Fallon explained. \"When you come home from tour, you don't wanna turn around the next day and say, 'Let's get together and write a song.' Gotta take a bit of a break.\" He went on to describe the band's current creative process, saying that they typically meet \"once, twice a week for four or five hours\" to work on new material. According to Fallon, the best songs often emerge organically rather than being overly planned. \"You gotta write a lot of garbage to get to the good stuff. And it seems the less premeditated it is, those are the songs that end up as part of the canon, almost the accidental songs. Those are the ones that seem to be the best.\" When asked about the possibility of a solo album, Fallon admitted that while he has written music outside of Clutch, he isn’t interested in pursuing a separate project. \"I've written a handful of solo works, for lack of a better word, just because they never ended up in the hands of the band. Not because I'm keeping it a secret. It's just I listened to it, and it's, like, I don't think this is gonna make a lot of sense, trying to fit a square peg in a round hole. And I don't have any interest in being in another band. I feel very satisfied with where I'm at.\" Beyond music, Fallon has also rekindled an old artistic passion—oil painting. \"The only other thing I kind of occupy my time with is I've taken up oil painting, which I used to do when I was really young,\" he revealed. \"And I find it to be a very good distraction from music, and a lot of times I come up with lyrics when I'm doing that instead of sitting down with a blank piece of paper. It's just another exercise to keep the creative brain in shape and not atrophy.\" Clutch has a whole shit ton of tour dates lined up for this June through August. Tickets are available here. Clutch, Tyler Bryant \u0026 The Shakedown, and Nate Bergman 6/6 Montreal, QC MTELUS6/7 Pickering, ON The Arena at Pickering Casino Resort6/8 Ottawa, ON Bronson Centre Theatre6/10 Moncton, NB Molson Canadian Centre at Casino New Brunswick6/12 Lynn, MA Lynn Memorial Auditorium6/13 Portland, ME State Theatre6/14 Bensalem, PA Parx Casino6/15 Albany, NY Empire Live6/17 Morgantown, WV Ruby Amphitheater6/19 Sault Ste Marie, MI Kewadin Casino Indoor Concert6/20 Ann Arbor, MI Michigan Theater6/21 Elizabeth, IN Caesars Event Center at Caesars Southern Indiana6/22 Pelham, TN The Caverns6/24 Charleston, SC Charleston Music Hall6/25 Lake Buena Vista, FL House of Blues6/27 Columbus, OH KEMBA Live!6/28 Greensboro, NC Piedmont Hall Clutch, Blacktop Mojo \u0026 The Inspector Cluzo 7/30 Little Rock, AR The Hall7/31 Oklahoma City, OK Diamond Ballroom8/1 Austin, TX Emo's8/3 Fort Collins, CO Washington's8/4 Sturgis, SD Bike Week at Iron Horse Saloon8/5 Bozeman, MT The ELM8/7 Vancouver, BC Commodore Ballroom8/9 Edmonton, AB Midway Music Hall8/10 Tsuut'ina, AB Grey Eagle Resort \u0026 Casino8/12 Fargo, ND UP District Festival Field8/14 Milwaukee, WI The Rave8/15 Chesterfield, MO The Factory8/16 Hammond, IN Horsehoe Hammond Casino Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2024/09/Rocklahoma-2024-37-Clutch-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003e\u003cstrong\u003eClutch\u003c/strong\u003e fans eager for new music will be glad to hear that the band is deep in the songwriting process for their next album. In a recent interview with the \u003cem\u003eMark And Me\u003c/em\u003e podcast, frontman \u003cstrong\u003eNeil Fallon\u003c/strong\u003e shared an update on the follow-up to \u003cem\u003eSunrise On Slaughter Beach\u003c/em\u003e, released in September 2022.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u0026#34;Yeah, we\u0026#39;re writing now. It\u0026#39;s taken longer than I think we would\u0026#39;ve liked to have, but to be honest, we toured a lot in the past three years, like really grounded down,\u0026#34; \u003cstrong\u003eFallon\u003c/strong\u003e explained. \u0026#34;When you come home from tour, you don\u0026#39;t wanna turn around the next day and say, \u0026#39;Let\u0026#39;s get together and write a song.\u0026#39; Gotta take a bit of a break.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003eHe went on to describe the band\u0026#39;s current creative process, saying that they typically meet \u0026#34;once, twice a week for four or five hours\u0026#34; to work on new material. According to \u003cstrong\u003eFallon\u003c/strong\u003e, the best songs often emerge organically rather than being overly planned. \u0026#34;You gotta write a lot of garbage to get to the good stuff. And it seems the less premeditated it is, those are the songs that end up as part of the canon, almost the accidental songs. Those are the ones that seem to be the best.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003eWhen asked about the possibility of a solo album, \u003cstrong\u003eFallon\u003c/strong\u003e admitted that while he has written music outside of \u003cstrong\u003eClutch\u003c/strong\u003e, he isn’t interested in pursuing a separate project. \u0026#34;I\u0026#39;ve written a handful of solo works, for lack of a better word, just because they never ended up in the hands of the band. Not because I\u0026#39;m keeping it a secret. It\u0026#39;s just I listened to it, and it\u0026#39;s, like, I don\u0026#39;t think this is gonna make a lot of sense, trying to fit a square peg in a round hole. And I don\u0026#39;t have any interest in being in another band. I feel very satisfied with where I\u0026#39;m at.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003eBeyond music, \u003cstrong\u003eFallon\u003c/strong\u003e has also rekindled an old artistic passion—oil painting. \u0026#34;The only other thing I kind of occupy my time with is I\u0026#39;ve taken up oil painting, which I used to do when I was really young,\u0026#34; he revealed. \u0026#34;And I find it to be a very good distraction from music, and a lot of times I come up with lyrics when I\u0026#39;m doing that instead of sitting down with a blank piece of paper. It\u0026#39;s just another exercise to keep the creative brain in shape and not atrophy.\u0026#34;\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eClutch\u003c/strong\u003e has a whole shit ton of tour dates lined up for this June through August. \u003ca href=\"https://stubhub.prf.hn/click/camref:1100liXbx/pubref:clutch*NA-tour-02042025/ar:metalinjection/destination:https%3A%2F%2Fwww.stubhub.com%2Fclutch-tickets%2Fperformer%2F148736\"\u003eTickets are available here\u003c/a\u003e.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eClutch\u003c/strong\u003e, \u003cstrong\u003eTyler Bryant \u0026amp; The Shakedown\u003c/strong\u003e, and \u003cstrong\u003eNate Bergman\u003c/strong\u003e\n\n\n\n\u003c/p\u003e\u003cp\u003e6/6 Montreal, QC MTELUS\u003cbr/\u003e6/7 Pickering, ON The Arena at Pickering Casino Resort\u003cbr/\u003e6/8 Ottawa, ON Bronson Centre Theatre\u003cbr/\u003e6/10 Moncton, NB Molson Canadian Centre at Casino New Brunswick\u003cbr/\u003e6/12 Lynn, MA Lynn Memorial Auditorium\u003cbr/\u003e6/13 Portland, ME State Theatre\u003cbr/\u003e6/14 Bensalem, PA Parx Casino\u003cbr/\u003e6/15 Albany, NY Empire Live\u003cbr/\u003e6/17 Morgantown, WV Ruby Amphitheater\u003cbr/\u003e6/19 Sault Ste Marie, MI Kewadin Casino Indoor Concert\u003cbr/\u003e6/20 Ann Arbor, MI Michigan Theater\u003cbr/\u003e6/21 Elizabeth, IN Caesars Event Center at Caesars Southern Indiana\u003cbr/\u003e6/22 Pelham, TN The Caverns\u003cbr/\u003e6/24 Charleston, SC Charleston Music Hall\u003cbr/\u003e6/25 Lake Buena Vista, FL House of Blues\u003cbr/\u003e6/27 Columbus, OH KEMBA Live!\u003cbr/\u003e6/28 Greensboro, NC Piedmont Hall\n\n\n\n\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eClutch\u003c/strong\u003e, \u003cstrong\u003eBlacktop Mojo\u003c/strong\u003e \u0026amp; \u003cstrong\u003eThe Inspector Cluzo\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e7/30 Little Rock, AR The Hall\u003cbr/\u003e7/31 Oklahoma City, OK Diamond Ballroom\u003cbr/\u003e8/1 Austin, TX Emo\u0026#39;s\u003cbr/\u003e8/3 Fort Collins, CO Washington\u0026#39;s\u003cbr/\u003e8/4 Sturgis, SD Bike Week at Iron Horse Saloon\u003cbr/\u003e8/5 Bozeman, MT The ELM\u003cbr/\u003e8/7 Vancouver, BC Commodore Ballroom\u003cbr/\u003e8/9 Edmonton, AB Midway Music Hall\u003cbr/\u003e8/10 Tsuut\u0026#39;ina, AB Grey Eagle Resort \u0026amp; Casino\u003cbr/\u003e8/12 Fargo, ND UP District Festival Field\u003cbr/\u003e8/14 Milwaukee, WI The Rave\u003cbr/\u003e8/15 Chesterfield, MO The Factory\u003cbr/\u003e8/16 Hammond, IN Horsehoe Hammond Casino\n\n\n\n\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Mark and Me Podcast - Episode 421: Neil Fallon (Clutch)\" width=\"880\" height=\"660\" src=\"https://www.youtube.com/embed/Akc_diYvCOE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\t\t\t\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-01T14:02:22-04:00",
  "modifiedTime": "2025-04-01T14:02:24-04:00"
}
