{
  "id": "8eeff75f-010a-4def-86fd-e104bc170ddb",
  "title": "CANDLEMASS Drops Music Video for Cover Of BLACK SABBATH's \"Sabbath Bloody Sabbath\" On New EP",
  "link": "https://metalinjection.net/video/candlemass-drop-music-video-for-cover-of-black-sabbaths-sabbath-bloody-sabbath-on-new-ep",
  "description": "Candlemass pay tribute to the classic track on their brand new EP, Black Star. The post CANDLEMASS Drops Music Video for Cover Of BLACK SABBATH's \"Sabbath Bloody Sabbath\" On New EP appeared first on Metal Injection.",
  "author": "Isabella Ambrosio",
  "published": "Tue, 13 May 2025 18:48:08 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "candlemass"
  ],
  "byline": "By Isabella Ambrosio Published 6 hours ago",
  "length": 2035,
  "excerpt": "Candlemass pay tribute to the classic track on their brand new EP, Black Star.",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "\"\"Sabbath Bloody Sabbath\" needs no introduction – one of the best songs ever recorded, if you ask me. Maybe not the obvious choice, but it's a dream for me to do it one day and here it is. Our rendition of 'S.B.S.' (Mass Bloody Mass?),\" Leif Edling of Candlemass says of the band's cover of Black Sabbath's classic track which appears on the band's newest EP released earlier this week. To some, Edling may be right. But, that's besides the point – Candlemass is celebrating 40 years as a band and decided to top off the celebrations with their new EP, Black Star. The EP has four tracks: two brand new tracks, and two covers. One cover, the aforementioned \"Sabbath Bloody Sabbath\" by Black Sabbath, and the other, \"Forever My Queen\" by Pentagram. Candlemass' \"Sabbath Bloody Sabbath\" tribute was also accompanied by a music video which you can check out above. Eery and unsettling, what else would you come to expect from a doom metal band? Get it here. \"Not all bands get to see their 40th birthday and it certainly hasn't been an easy ride,\" said Candlemass mastermind Leif Edling. \"But many ups and downs later, we stand here as survivors, veterans even… a bit scarred perhaps? Still ready though to unleash another piece of doom-laden metal upon an unsuspecting world. You have to do something when you turn 40, right? Anyway, as always, it's been fun recording some new stuff as well as covering a couple of old favorites.\" Candlemass also has the following European tour dates lined up. 6/20 21 DE Daun Rengen Der Detze Rockt6/25 NO Oslo Tons of Rock7/4 TR Istanbul Headbangers Weekend7/20 IT Cremona Luppolo In Rock Festival7/30-8/2 NO Bergen Beyond the Gates Festival8/8 FI Helsinki Helsinki Metal Festival8/8 BE Kortrijk Alcatraz9/12 GR Athens Rock Hard Festival11/1 SE Stockholm Berns12/6 UK Wolverhampton Bloodstock Winter Gathering Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2025/03/Candlemass-2025.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003e\u0026#34;\u0026#34;Sabbath Bloody Sabbath\u0026#34; needs no introduction – one of the best songs ever recorded, if you ask me. Maybe not the obvious choice, but it\u0026#39;s a dream for me to do it one day and here it is. Our rendition of \u0026#39;S.B.S.\u0026#39; (Mass Bloody Mass?),\u0026#34; \u003cstrong\u003eLeif\u003c/strong\u003e \u003cstrong\u003eEdling\u003c/strong\u003e of \u003cstrong\u003eCandlemass\u003c/strong\u003e says of the band\u0026#39;s cover of \u003cstrong\u003eBlack Sabbath\u003c/strong\u003e\u0026#39;s classic track which appears on the band\u0026#39;s newest EP released earlier this week.\u003c/p\u003e\n\n\n\n\u003cp\u003eTo some, \u003cstrong\u003eEdling\u003c/strong\u003e may be right. But, that\u0026#39;s besides the point – \u003cstrong\u003eCandlemass\u003c/strong\u003e is celebrating 40 years as a band and decided to top off the celebrations with their new EP, \u003cem\u003eBlack Star\u003c/em\u003e. \n\n\n\n\u003c/p\u003e\u003cp\u003eThe EP has four tracks: two brand new tracks, and two covers. One cover, the aforementioned \u0026#34;Sabbath Bloody Sabbath\u0026#34; by \u003cstrong\u003eBlack\u003c/strong\u003e \u003cstrong\u003eSabbath\u003c/strong\u003e, and the other, \u0026#34;Forever My Queen\u0026#34; by \u003cstrong\u003ePentagram\u003c/strong\u003e. \u003cstrong\u003eCandlemass\u003c/strong\u003e\u0026#39; \u0026#34;Sabbath Bloody Sabbath\u0026#34; tribute was also accompanied by a music video which you can check out above. Eery and unsettling, what else would you come to expect from a doom metal band? Get it \u003ca href=\"https://lnk.to/CANDLEMASS-BlackStar/napalmrecords\"\u003ehere\u003c/a\u003e.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;Not all bands get to see their 40\u003csup\u003eth\u003c/sup\u003e birthday and it certainly hasn\u0026#39;t been an easy ride,\u0026#34; said \u003cstrong\u003eCandlemass\u003c/strong\u003e mastermind \u003cstrong\u003eLeif Edling\u003c/strong\u003e. \u0026#34;But many ups and downs later, we stand here as survivors, veterans even… a bit scarred perhaps? Still ready though to unleash another piece of doom-laden metal upon an unsuspecting world. You have to do something when you turn 40, right? Anyway, as always, it\u0026#39;s been fun recording some new stuff as well as covering a couple of old favorites.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCandlemass\u003c/strong\u003e also has the following European tour dates lined up.\u003c/p\u003e\n\n\n\n\u003cp\u003e6/20 21 DE Daun Rengen Der Detze Rockt\u003cbr/\u003e6/25 NO Oslo Tons of Rock\u003cbr/\u003e7/4 TR Istanbul Headbangers Weekend\u003cbr/\u003e7/20 IT Cremona Luppolo In Rock Festival\u003cbr/\u003e7/30-8/2 NO Bergen Beyond the Gates Festival\u003cbr/\u003e8/8 FI Helsinki Helsinki Metal Festival\u003cbr/\u003e8/8 BE Kortrijk Alcatraz\u003cbr/\u003e9/12 GR Athens Rock Hard Festival\u003cbr/\u003e11/1 SE Stockholm Berns\u003cbr/\u003e12/6 UK Wolverhampton Bloodstock Winter Gathering\n\t\t\t\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
