{
  "id": "d8fb287a-bfff-4847-9b6e-0dc9c4a06f53",
  "title": "SPINESHANK Reunites, Announced For Louder Than Life",
  "link": "https://metalinjection.net/news/spineshank-reunites-announced-for-louder-than-life",
  "description": "Hey, it happened!",
  "author": "Greg Kennelty",
  "published": "Thu, 30 Jan 2025 22:10:45 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Latest News",
    "Spineshank"
  ],
  "byline": "By Greg Kennelty Published 2 hours ago",
  "length": 1142,
  "excerpt": "Hey, it happened!",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "Hey, remember a few days ago when we all speculated that Spineshank was gonna reunite soon? Well good news – Spineshank has reunited! Details are scarce at the moment, though we know for sure Spineshank is reuniting for (at the very least) a performance at Louder Than Life 2025. \"Reuniting after 13 Years to perform at Louder Than Life 2025, we are honored to bring back Spineshank!\" wrote Louder Than Life organizers. \"A Nu Metal force in the early 2000s, the Grammy-nominated band carved their name into heavy music history with era-defining tracks like 'New Disease', 'Synthetic', and 'Smothered.' Returning to the stage for the first time since 2012, these Ozzfest alumni are breaking their years of silence with a thunderous comeback here in Louisville!\" I'm sure Spineshank will soon issue a statement on their reunion, but in the meantime maybe go listen to The Height Of Callousness. It's turning 25 years old this year and it's still very good. Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2025/01/Spineshank.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003eHey, remember a few days ago when we all \u003ca href=\"https://metalinjection.net/news/rumors/is-spineshank-teasing-something-for-this-year\"\u003especulated that \u003cstrong\u003eSpineshank\u003c/strong\u003e was gonna reunite soon\u003c/a\u003e? Well good news – \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/spineshank\"\u003eSpineshank\u003c/a\u003e\u003c/strong\u003e has reunited! Details are scarce at the moment, though we know for sure \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/spineshank\"\u003eSpineshank\u003c/a\u003e\u003c/strong\u003e is reuniting for (at the very least) a performance at Louder Than Life 2025.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u0026#34;Reuniting after 13 Years to perform at Louder Than Life 2025, we are honored to bring back \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/spineshank\"\u003eSpineshank\u003c/a\u003e\u003c/strong\u003e!\u0026#34; wrote Louder Than Life organizers.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;A Nu Metal force in the early 2000s, the Grammy-nominated band carved their name into heavy music history with era-defining tracks like \u0026#39;New Disease\u0026#39;, \u0026#39;Synthetic\u0026#39;, and \u0026#39;Smothered.\u0026#39; Returning to the stage for the first time since 2012, these Ozzfest alumni are breaking their years of silence with a thunderous comeback here in Louisville!\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003eI\u0026#39;m sure \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/spineshank\"\u003eSpineshank\u003c/a\u003e\u003c/strong\u003e will soon issue a statement on their reunion, but in the meantime maybe go listen to \u003cem\u003eThe Height Of Callousness\u003c/em\u003e. It\u0026#39;s turning 25 years old this year and it\u0026#39;s still very good.\n\n\n\n\u003c/p\u003e\n\t\t\t\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-01-30T17:10:45-05:00",
  "modifiedTime": "2025-01-30T17:10:48-05:00"
}
