{
  "id": "e3a64e26-9895-4864-a148-904eaa3a4fba",
  "title": "Tyler, the Creator’s ‘CHROMAKOPIA’ Debuts at No. 1 on Billboard 200",
  "link": "https://www.billboard.com/music/chart-beat/tyler-the-creator-chromakopia-debuts-no-1-billboard-200-1235818700/",
  "description": "Plus: Halsey and Kelsea Ballerini debut in the top five, while Eminem's 'The Death of Slim Shady' returns to the top 10 after its vinyl release.",
  "author": "Keith Caulfield",
  "published": "Sun, 03 Nov 2024 22:02:51 +0000",
  "source": "https://www.billboard.com/feed/",
  "categories": [
    "Chart Beat",
    "Music",
    "Billboard",
    "Billboard 200",
    "music",
    "Music News",
    "News"
  ],
  "byline": "Keith Caulfield",
  "length": 7676,
  "excerpt": "Tyler, the Creator's 'CHROMAKOPIA' album debuts at No. 1 on the Billboard 200, while Halsey and Kelsea Ballerini arrive in the top five.",
  "siteName": "Billboard",
  "favicon": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/apple-touch-icon.png",
  "text": "Tyler, the Creator scores his third No. 1 album on the Billboard 200 chart as his new studio effort, CHROMAKOPIA, arrives atop the tally (dated Nov. 9). The set launches with 299,500 equivalent album units earned in the U.S. in the week ending Oct. 31, his best week ever in terms of units. Its starting sum — the sixth-largest debut of 2024 — is also notable because the album arrived on an off-cycle Monday (Oct. 28), and thus had only four days of activity in its first tracking week. (Most albums are released on a Friday, giving them a full seven days of activity in their opening chart week.) The album was announced on Oct. 17, slightly more than 10 days before its release on Oct. 28. Trending on Billboard CHROMAKOPIA also claims Tyler, the Creator’s biggest streaming week ever for an album, and largest sales week ever — again, after only four days of availability. Streams and sales were so strong for the set, it would have been No. 1 off streams alone, or solely on sales. He previously hit No. 1 on the chart with his last two releases, Call Me If You Get Lost (in 2021) and Igor (in 2019). In total, CHROMAKOPIA marks his seventh top 10-charting set on the Billboard 200 — the entirety of his charting efforts. Also in the top 10 of the new Billboard 200, Halsey logs her fifth top two-charting set as The Great Impersonator debuts at No. 2, Kelsea Ballerini achieves her highest-charting album ever as Patterns opens at No. 4 and Eminem’s chart-topping The Death of Slim Shady (Coup de Grâce) vaults 44-6 after its vinyl release. The Billboard 200 chart ranks the most popular albums of the week in the U.S. based on multi-metric consumption as measured in equivalent album units, compiled by Luminate. Units comprise album sales, track equivalent albums (TEA) and streaming equivalent albums (SEA). Each unit equals one album sale, or 10 individual tracks sold from an album, or 3,750 ad-supported or 1,250 paid/subscription on-demand official audio and video streams generated by songs from an album. The new Nov. 9, 2024-dated chart will be posted in full on Billboard‘s website on Tuesday, Nov. 5. For all chart news, follow @billboard and @billboardcharts on both X, formerly known as Twitter, and Instagram. Of CHROMAKOPIA’s 299,500 equivalent album units earned, SEA units comprise 157,000 (equaling 212.55 million on-demand official streams of the 14 songs on the streaming edition of the album, his best streaming week ever; it debuts at No. 1 on Top Streaming Albums chart), album sales comprise 142,000 (his best sales week ever; it debuts at No. 1 on the Top Album Sales chart) and TEA units comprise 500 units. Vinyl sales accounted for 66,000 of the album’s first-week number, which is Tyler, the Creator’s best week ever on vinyl, and the third-biggest debut week on vinyl for a rap album since Luminate began tracking sales in 1991. CHROMAKOPIA was issued as an 11-song standard digital download album, a 14-song album on CD and vinyl, and a 14-song digital deluxe and streaming album. (The two 14-song editions each had three additional songs versus the standard 11-song album. The 14-song CD and vinyl added “Mother,” “Sticky” (featuring Sexyy Red and Lil Wayne) and “Thought I Was Dead” (featuring Santigold). The 14-song digital and streaming edition added “Balloon” (featuring Doechii), “Sticky” (featuring GloRilla, Lil Wayne and Sexyy Red) and “Thought I Was Dead” (featuring ScHoolboy Q and Santigold). Album sales were bolstered by the set’s availability across six deluxe collectible CD boxed sets (each containing a CD, poster and another branded merch item) and a green-colored vinyl pressing. The boxed sets and vinyl were exclusively sold via the artist’s official webstore. A stand-alone CD was available to pre-order, exclusively, in the same store, but has yet to be shipped to customers. All physical editions of the album are only available via the artist’s webstore. The standard 11-song digital download album, as well as the 14-song deluxe digital edition, was widely available through the iTunes Store and similar services (but were not sold on the artist’s webstore). At No. 2 on the Billboard 200, Halsey’s The Great Impersonator debuts with 93,000 equivalent album units earned. Of that sum, album sales comprise 81,000, SEA units comprise 12,000 (equaling 16.05 million on-demand streams of the songs on the streaming edition of the album) and TEA units comprise a negligible sum. The Great Impersonator is the fifth top 10-charting set for Halsey, all of which have debuted in the top two positions of the list. The album’s first-week sales were aided by its availability across many permutations: a dozen deluxe collectible CD boxed sets (each containing a CD and branded merchandise), a standard CD, a standard signed CD, four alternative cover CDs (each signed) and eight vinyl variants (including one signed edition). Most of the offerings were exclusively sold in Halsey’s official webstore. The album was also released as a standard digital album, and via seven alternative digital download albums (each with one to three exclusive bonus tracks unique to each of the seven editions) — all of which sold for a discounted $4.99. The vinyl sales added up to just over 26,000 copies — Halsey’s best week on vinyl ever. Sabrina Carpenter’s former leader Short n’ Sweet falls 2-3 on the new Billboard 200 with 74,000 equivalent album units earned (down 5%). Kelsea Ballerini’s Patterns bows at No. 4 on the Billboard 200, marking her highest-charting album ever and second top 10-charting set. It arrives with 54,000 equivalent album units earned — her best week by units. Of that sum, album sales comprise 35,000 (her second-largest sales week), SEA units comprise 19,000 and TEA units comprise a negligible sum. Ballerini had previously gone as high as No. 7 on the Billboard 200 with Unapologetically in 2017. The new album was preceded by the song “Cowboys Cry Too,” with Noah Kahan, which reached the top 20 on the Hot Country Songs chart in July. The set’s first-week sales were encouraged by its availability across eight vinyl variants (including one signed edition), three digital download editions (a standard set, one with bonus commentary tracks and one with two bonus song tracks), and two CDs (including one signed variant). Her vinyl sales totaled 12,000 for the week — Ballerini’s best week ever on vinyl. Rod Wave’s Last Lap dips 4-5 on the Billboard 200 with 51,000 equivalent album units earned (down 24%), while Eminem’s The Death of Slim Shady (Coup de Grâce) jumps 44-6 with 49,000 units (up 193%) after its release on vinyl and cassette. The latter was issued across five vinyl editions (mostly color variants) which combined to sell 31,000 copies in the tracking week — Eminem’s best week ever on vinyl. Rounding out the rest of the top 10 on the new Billboard 200: Gracie Abrams’ The Secret of Us rises 8-7 (49,000 equivalent album units earned; down less than 1%), Morgan Wallen’s chart-topping One Thing at a Time falls 6-8 (46,000; down 9%), Billie Eilish’s Hit Me Hard and Soft is steady at No. 9 (nearly 46,000; down 5%) and GloRilla’s Glorious falls 7-10 (45,000; down 11%). Luminate, the independent data provider to the Billboard charts, completes a thorough review of all data submissions used in compiling the weekly chart rankings. Luminate reviews and authenticates data. In partnership with Billboard, data deemed suspicious or unverifiable is removed, using established criteria, before final chart calculations are made and published.",
  "image": "https://www.billboard.com/wp-content/uploads/2024/11/tyler-the-creator-cr-luis-panch-perez-2024-press-billboard-1548.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\t\u003ca href=\"https://www.billboard.com/artist/tyler-the-creator\"\u003eTyler, the Creator\u003c/a\u003e scores his third No. 1 album on the \u003ca href=\"https://www.billboard.com/charts/billboard-200/\"\u003eBillboard 200\u003c/a\u003e chart as his new studio effort, \u003cem\u003eCHROMAKOPIA\u003c/em\u003e, arrives atop the tally (dated Nov. 9). The set launches with 299,500 equivalent album units earned in the U.S. in the week ending Oct. 31, his best week ever in terms of units. Its starting sum — the sixth-largest debut of 2024 — is also notable because the album arrived on an off-cycle Monday (Oct. 28), and thus had only four days of activity in its first tracking week. (Most albums are released on a Friday, giving them a full seven days of activity in their opening chart week.)\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tThe album \u003ca href=\"https://www.billboard.com/music/rb-hip-hop/tyler-the-creator-new-album-chromakopia-release-date-cover-1235804098/\"\u003ewas announced\u003c/a\u003e on Oct. 17, slightly more than 10 days before its release on Oct. 28.\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"10140246\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tTrending on Billboard\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cem\u003e\u003cem\u003e\u003cem\u003eCHROMAKOPIA\u003c/em\u003e\u003c/em\u003e\u003c/em\u003e also claims Tyler, the Creator’s biggest streaming week ever for an album, and largest sales week ever — again, after only four days of availability. Streams and sales were so strong for the set, it would have been No. 1 off streams alone, or solely on sales.\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tHe previously hit No. 1 on the chart with his last two releases, \u003cem\u003eCall Me If You Get Lost \u003c/em\u003e(in 2021) and \u003cem\u003eIgor\u003c/em\u003e (in 2019). In total, \u003cem\u003e\u003cem\u003e\u003cem\u003e\u003cem\u003eCHROMAKOPIA\u003c/em\u003e\u003c/em\u003e\u003c/em\u003e\u003c/em\u003e marks his seventh top 10-charting set on the \u003ca href=\"https://www.billboard.com/t/billboard/\" id=\"auto-tag_billboard\" data-tag=\"billboard\"\u003eBillboard\u003c/a\u003e 200 — the entirety of his charting efforts.\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAlso in the top 10 of the new \u003ca href=\"https://www.billboard.com/t/billboard-200/\" id=\"auto-tag_billboard-200\" data-tag=\"billboard-200\"\u003eBillboard 200\u003c/a\u003e, \u003ca href=\"https://www.billboard.com/artist/halsey/\"\u003eHalsey\u003c/a\u003e logs her fifth top two-charting set as \u003cem\u003eThe Great Impersonator\u003c/em\u003e debuts at No. 2, \u003ca href=\"https://www.billboard.com/artist/kelsea-ballerini/\"\u003eKelsea Ballerini\u003c/a\u003e achieves her highest-charting album ever as \u003cem\u003ePatterns\u003c/em\u003e opens at No. 4 and \u003ca href=\"https://www.billboard.com/artist/eminem/\"\u003eEminem\u003c/a\u003e’s chart-topping \u003cem\u003eThe Death of Slim Shady (Coup de Grâce) \u003c/em\u003evaults 44-6 after its vinyl release.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe Billboard 200 chart ranks the most popular albums of the week in the U.S. based on multi-metric consumption as measured in equivalent album units, compiled by Luminate. Units comprise album sales, track equivalent albums (TEA) and streaming equivalent albums (SEA). Each unit equals one album sale, or 10 individual tracks sold from an album, or 3,750 ad-supported or 1,250 paid/subscription on-demand official audio and video streams generated by songs from an album. The new Nov. 9, 2024-dated chart will be posted in full on \u003cem\u003eBillboard\u003c/em\u003e‘s website on Tuesday, Nov. 5. For all chart \u003ca href=\"https://www.billboard.com/t/news/\" id=\"auto-tag_news\" data-tag=\"news\"\u003enews\u003c/a\u003e, follow @billboard and @billboardcharts on both X, formerly known as Twitter, and Instagram.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tOf \u003cem\u003e\u003cem\u003e\u003cem\u003e\u003cem\u003e\u003cem\u003eCHROMAKOPIA\u003c/em\u003e\u003c/em\u003e\u003c/em\u003e\u003c/em\u003e\u003c/em\u003e’s 299,500 equivalent album units earned, SEA units comprise 157,000 (equaling 212.55 million on-demand official streams of the 14 songs on the streaming edition of the album, his best streaming week ever; it debuts at No. 1 on Top Streaming Albums chart), album sales comprise 142,000 (his best sales week ever; it debuts at No. 1 on the Top Album Sales chart) and TEA units comprise 500 units. Vinyl sales accounted for 66,000 of the album’s first-week number, which is Tyler, the Creator’s best week ever on vinyl, and the third-biggest debut week on vinyl for a rap album since Luminate began tracking sales in 1991.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cem\u003e\u003cem\u003e\u003cem\u003e\u003cem\u003e\u003cem\u003e\u003cem\u003eCHROMAKOPIA\u003c/em\u003e\u003c/em\u003e\u003c/em\u003e\u003c/em\u003e\u003c/em\u003e\u003c/em\u003e was issued as an 11-song standard digital download album, a 14-song album on CD and vinyl, and a 14-song digital deluxe and streaming album. (The two 14-song editions each had three additional songs versus the standard 11-song album. The 14-song CD and vinyl added “Mother,” “Sticky” (featuring Sexyy Red and Lil Wayne) and “Thought I Was Dead” (featuring Santigold). The 14-song digital and streaming edition added “Balloon” (featuring Doechii), “Sticky” (featuring GloRilla, Lil Wayne and Sexyy Red) and “Thought I Was Dead” (featuring ScHoolboy Q and Santigold).\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAlbum sales were bolstered by the set’s availability across six deluxe collectible CD boxed sets (each containing a CD, poster and another branded merch item) and a green-colored vinyl pressing. The boxed sets and vinyl were exclusively sold via the artist’s official webstore. A stand-alone CD was available to pre-order, exclusively, in the same store, but has yet to be shipped to customers. All physical editions of the album are only available via the artist’s webstore.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe standard 11-song digital download album, as well as the 14-song deluxe digital edition, was widely available through the iTunes Store and similar services (but were not sold on the artist’s webstore).\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAt No. 2 on the Billboard 200, Halsey’s \u003cem\u003eThe Great Impersonator\u003c/em\u003e debuts with 93,000 equivalent album units earned. Of that sum, album sales comprise 81,000, SEA units comprise 12,000 (equaling 16.05 million on-demand streams of the songs on the streaming edition of the album) and TEA units comprise a negligible sum. \u003cem\u003eThe Great Impersonator\u003c/em\u003e is the fifth top 10-charting set for Halsey, all of which have debuted in the top two positions of the list.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe album’s first-week sales were aided by its availability across many permutations: a dozen deluxe collectible CD boxed sets (each containing a CD and branded merchandise), a standard CD, a standard signed CD, four alternative cover CDs (each signed) and eight vinyl variants (including one signed edition). Most of the offerings were exclusively sold in Halsey’s official webstore. The album was also released as a standard digital album, and via seven alternative digital download albums (each with one to three exclusive bonus tracks unique to each of the seven editions) — all of which sold for a discounted $4.99.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tThe vinyl sales added up to just over 26,000 copies — Halsey’s best week on vinyl ever.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003ca href=\"https://www.billboard.com/artist/sabrina-carpenter/\"\u003eSabrina Carpenter\u003c/a\u003e’s former leader \u003cem\u003eShort n’ Sweet\u003c/em\u003e falls 2-3 on the new Billboard 200 with 74,000 equivalent album units earned (down 5%).\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tKelsea Ballerini’s \u003cem\u003ePatterns\u003c/em\u003e bows at No. 4 on the Billboard 200, marking her highest-charting album ever and second top 10-charting set. It arrives with 54,000 equivalent album units earned — her best week by units. Of that sum, album sales comprise 35,000 (her second-largest sales week), SEA units comprise 19,000 and TEA units comprise a negligible sum.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tBallerini had previously gone as high as No. 7 on the Billboard 200 with \u003cem\u003eUnapologetically\u003c/em\u003e in 2017.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe new album was preceded by the song “Cowboys Cry Too,” with Noah Kahan, which reached the top 20 on the Hot Country Songs chart in July.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe set’s first-week sales were encouraged by its availability across eight vinyl variants (including one signed edition), three digital download editions (a standard set, one with bonus commentary tracks and one with two bonus song tracks), and two CDs (including one signed variant). Her vinyl sales totaled 12,000 for the week — Ballerini’s best week ever on vinyl.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003ca href=\"https://www.billboard.com/artist/rod-wave/\"\u003eRod Wave\u003c/a\u003e’s \u003cem\u003eLast Lap\u003c/em\u003e dips 4-5 on the Billboard 200 with 51,000 equivalent album units earned (down 24%), while Eminem’s \u003cem\u003eThe Death of Slim Shady (Coup de Grâce) \u003c/em\u003ejumps 44-6 with 49,000 units (up 193%) after its release on vinyl and cassette. The latter was issued across five vinyl editions (mostly color variants) which combined to sell 31,000 copies in the tracking week — Eminem’s best week ever on vinyl.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tRounding out the rest of the top 10 on the new Billboard 200: \u003ca href=\"https://www.billboard.com/artist/gracie-abrams/\"\u003eGracie Abrams\u003c/a\u003e’ \u003cem\u003eThe Secret of Us \u003c/em\u003erises 8-7 (49,000 equivalent album units earned; down less than 1%), \u003ca href=\"https://www.billboard.com/artist/morgan-wallen/\"\u003eMorgan Wallen\u003c/a\u003e’s chart-topping \u003cem\u003eOne Thing at a Time\u003c/em\u003e falls 6-8 (46,000; down 9%), \u003ca href=\"https://www.billboard.com/artist/billie-eilish/\"\u003eBillie Eilish\u003c/a\u003e’s \u003cem\u003eHit Me Hard and Soft\u003c/em\u003e is steady at No. 9 (nearly 46,000; down 5%) and \u003ca href=\"https://www.billboard.com/artist/glorilla/\"\u003eGloRilla\u003c/a\u003e’s \u003cem\u003eGlorious\u003c/em\u003e falls 7-10 (45,000; down 11%).\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cem\u003eLuminate, the independent data provider to the \u003c/em\u003eBillboard\u003cem\u003e charts, completes a thorough review of all data submissions used in compiling the weekly chart rankings. Luminate reviews and authenticates data. In partnership with \u003c/em\u003eBillboard\u003cem\u003e, data deemed suspicious or unverifiable is removed, using established criteria, before final chart calculations are made and published.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-11-03T22:02:51Z",
  "modifiedTime": "2024-11-03T23:51:04Z"
}
