{
  "id": "f3fd7250-798b-4d23-b012-48ebd8a653ab",
  "title": "GUNS N' ROSES Announces New Drummer, Fans' Dreams Of Classic Member Return Dashed",
  "link": "https://metalinjection.net/news/guns-n-roses-announces-new-drummer-fans-dreams-of-classic-member-return-dashed",
  "description": "Still, shout out to Isaac Carpenter! The post GUNS N' ROSES Announces New Drummer, Fans' Dreams Of Classic Member Return Dashed appeared first on Metal Injection.",
  "author": "Greg Kennelty",
  "published": "Thu, 20 Mar 2025 18:49:37 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Latest News",
    "featured",
    "Guns N' Roses"
  ],
  "byline": "By Greg Kennelty Published 6 hours ago",
  "length": 1242,
  "excerpt": "Still, shout out to Isaac Carpenter!",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "Guns N' Roses announced the departure of longtime drummer Frank Ferrer yesterday, and now they've got a new drummer today! Guns N' Roses has welcomed new drummer Isaac Carpenter whose resume includes everyone from Duff McKagan's Loaded, Awolnation, Adam Lambert to Barbarians of California, A Perfect Circle, and The Exies. Guns N' Roses first show with Carpenter is slated for May 1 at Songdo Moonlight Park in Incheon, South Korea. Guns N' Roses issued the following statement regarding Ferrer's departure: \"Guns N' Roses announce the amicable exit of Frank Ferrer, the longest-serving drummer in their storied run. The band thanks Frank for his friendship, creativity, and sturdy presence over the past 19 years, and they wish him success in the next chapter of his musical journey.\" \"Frank first joined GNR during a show in June 2006 helping anchor the rhythm section during subsequent tours, including their recent outings featuring the reunited trio of Axl Rose, Slash, and Duff McKagan. His last show with the band took place November 5, 2023 in Mexico.\" Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2025/03/Isaac-Carpenter.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003e\u003cstrong\u003eGuns N\u0026#39; Roses\u003c/strong\u003e announced the \u003ca href=\"https://metalinjection.net/news/breakups/guns-n-roses-parts-ways-with-longtime-drummer-frank-ferrer\"\u003edeparture of longtime drummer \u003cstrong\u003eFrank Ferrer\u003c/strong\u003e yesterday\u003c/a\u003e, and now they\u0026#39;ve got a new drummer today! \u003cstrong\u003eGuns N\u0026#39; Roses\u003c/strong\u003e has welcomed new drummer Isaac Carpenter whose resume includes everyone from \u003cstrong\u003eDuff McKagan\u0026#39;s Loaded\u003c/strong\u003e, \u003cstrong\u003eAwolnation\u003c/strong\u003e, \u003cstrong\u003eAdam Lambert\u003c/strong\u003e to \u003cstrong\u003eBarbarians of California\u003c/strong\u003e, \u003cstrong\u003eA Perfect Circle\u003c/strong\u003e, and \u003cstrong\u003eThe Exies\u003c/strong\u003e. \u003cstrong\u003eGuns N\u0026#39; Roses\u003c/strong\u003e first show with Carpenter is slated for May 1 at Songdo Moonlight Park in Incheon, South Korea.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGuns N\u0026#39; Roses\u003c/strong\u003e issued the following statement regarding \u003cstrong\u003eFerrer\u003c/strong\u003e\u0026#39;s departure: \u0026#34;\u003cstrong\u003eGuns N\u0026#39; Roses\u003c/strong\u003e announce the amicable exit of \u003cstrong\u003eFrank Ferrer\u003c/strong\u003e, the longest-serving drummer in their storied run. The band thanks \u003cstrong\u003eFrank\u003c/strong\u003e for his friendship, creativity, and sturdy presence over the past 19 years, and they wish him success in the next chapter of his musical journey.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;Frank first joined \u003cstrong\u003eGNR\u003c/strong\u003e during a show in June 2006 helping anchor the rhythm section during subsequent tours, including their recent outings featuring the reunited trio of \u003cstrong\u003eAxl Rose\u003c/strong\u003e, \u003cstrong\u003eSlash\u003c/strong\u003e, and \u003cstrong\u003eDuff McKagan\u003c/strong\u003e. His last show with the band took place November 5, 2023 in Mexico.\u0026#34;\n\t\t\t\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-03-20T14:49:37-04:00",
  "modifiedTime": "2025-03-20T14:50:01-04:00"
}
