{
  "id": "f51a134f-98a2-411b-ae92-c174354ab031",
  "title": "“Weird Al” Has “Come Up in Conversations” Around Rock and Roll Hall of Fame Induction",
  "link": "https://consequence.net/2025/01/weird-al-rock-and-roll-hall-of-fame/",
  "description": "Even if he's never made it close to the ballot, the legendary entertainer has at least been discussed. “Weird Al” Has “Come Up in Conversations” Around Rock and Roll Hall of Fame Induction Mary Siroky",
  "author": "Mary Siroky",
  "published": "Thu, 02 Jan 2025 20:20:01 +0000",
  "source": "http://consequenceofsound.net/feed",
  "categories": [
    "Music",
    "News",
    "Comedy",
    "Rock and Roll Hall of Fame"
  ],
  "byline": "Mary Siroky",
  "length": 1951,
  "excerpt": "\"Weird Al\" Yankovic has been named among potential candidates for the Rock and Roll Hall of Fame, according to a new interview with chairman John Skyes.",
  "siteName": "Consequence",
  "favicon": "https://consequence.net/wp-content/themes/cosv2/images/apple-touch-icon.png",
  "text": "Very few artists commit to the bit the way “Weird Al” Yankovic does. The musician and comedian has spent decades carving out a place for himself within the music industry, putting his own spin on familiar tunes along the way, prompting some devoted fans to wonder if his work would warrant consideration for the Rock and Roll Hall of Fame. In a recent interview with Vulture, Hall of Fame chairman John Sykes offered a rare look into the often mysterious process around selecting and vetting candidates, which he described as “a cross between an intellectual conversation and WWE.” Meetings are said to span hours of time, and over the course of many of these debates, Weird Al’s name has reportedly “come up in conversations.” Get Weird Al Yankovic Tickets Here “He’s a genius,” Sykes offered. “He has made brilliant versions of the songs, but I’ll be honest: He’s never made it close to the ballot.” It’s a fair concession — the list of acts that have been snubbed for induction into the Rock and Roll Hall of Fame includes bands like Oasis, Pixies, and Iron Maiden. “We have such a backlog of people that need to get in,” Sykes confirmed. When looking at the fact that The B-52s have yet to make it to the ballot, Weird Al’s name missing makes that much more sense. Meanwhile, as some people have advocated to rename the institution the as simply the Music Hall Of Fame as the organization has expanded to include more hip-hop, rap, or country figures, Sykes is committed to the idea of Rock and Roll being the best umbrella term for artists in the realm of “popular music.” Regardless of his proximity to the Hall of Fame, Weird Al is gearing up for a major 2025 tour, where he’ll be delivering some of his most beloved hits over the course of 65 cities. Grab tickets here. Plus, be sure to check out the comedy musician’s 2024 podcast sitdown with Kyle Meredith, and read the interview in which “Weird Al” breaks down all 14 of his polka medleys.",
  "image": "https://consequence.net/wp-content/uploads/2024/09/Weird-Al.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-id=\"1456504\" data-title=\"“Weird Al” Has “Come Up in Conversations” Around Rock and Roll Hall of Fame Induction\" data-url=\"https://consequence.net/2025/01/weird-al-rock-and-roll-hall-of-fame/\" data-page=\"1\" data-pages=\"1\" data-total-posts=\"1\" aria-live=\"polite\" aria-atomic=\"true\" data-nextpage=\"true\" data-nextpage-urls=\"true\" data-nextpage-pageviews=\"false\" data-nextpage-post-id=\"1456504\" data-nextpage-scroll=\"false\" data-nextpage-startpage=\"1\" data-nextpage-post-title=\"“Weird Al” Has “Come Up in Conversations” Around Rock and Roll Hall of Fame Induction\" data-container-type=\"ul\" data-loading-style=\"infinite fading-circles\" data-repeater=\"default\" data-post-type=\"post\" data-order=\"DESC\" data-orderby=\"date\" data-offset=\"0\" data-posts-per-page=\"5\" data-scroll-distance=\"-200\" data-pause-override=\"true\" data-pause=\"true\" data-button-label=\"Load More\"\u003e\u003cp\u003eVery few artists commit to the bit the way \u003ca href=\"https://consequence.net/artist/weird-al-yankovic/\" target=\"_blank\" rel=\"noopener\"\u003e“Weird Al” Yankovic\u003c/a\u003e does. The musician and comedian has spent decades carving out a place for himself within the music industry, putting his own spin on familiar tunes along the way, prompting some devoted fans to wonder if his work would warrant consideration for the \u003ca href=\"https://consequence.net/tag/rock-and-roll-hall-of-fame/\" target=\"_blank\" rel=\"noopener\"\u003eRock and Roll Hall of Fame.\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eIn a recent interview with \u003ca href=\"https://www.vulture.com/article/rock-hall-of-fame-ceremony-2024-john-sykes.html\" target=\"_blank\" rel=\"noopener nofollow\"\u003e\u003cem\u003eVulture\u003c/em\u003e\u003c/a\u003e, Hall of Fame chairman John Sykes offered a rare look into the often mysterious process around selecting and vetting candidates, which he described as “a cross between an intellectual conversation and WWE.” Meetings are said to span hours of time, and over the course of many of these debates, Weird Al’s name has reportedly “come up in conversations.”\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://stubhub.prf.hn/click/camref:1100l9Pt3/pubref:weird-al-yankovic*hall-of-fame-conversations-button/destination:https%3A%2F%2Fwww.stubhub.com%2Fweird-al-yankovic-tickets%2Fperformer%2F11047\" target=\"_blank\" rel=\"nofollow noopener\"\u003eGet Weird Al Yankovic Tickets Here\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e“He’s a genius,” Sykes offered. “He has made brilliant versions of the songs, but I’ll be honest: He’s never made it close to the ballot.”\u003c/p\u003e\n\u003cp\u003eIt’s a fair concession — the list of acts that have been \u003ca href=\"https://consequence.net/list/rock-and-roll-hall-of-fame-snubs-list/\" target=\"_blank\" rel=\"noopener\"\u003esnubbed for induction\u003c/a\u003e into the Rock and Roll Hall of Fame includes bands like Oasis, Pixies, and Iron Maiden. “We have such a backlog of people that need to get in,” Sykes confirmed. When looking at the fact that The B-52s have yet to make it to the ballot, Weird Al’s name missing makes that much more sense.\u003c/p\u003e\n\u003cp\u003eMeanwhile, as some people have advocated to rename the institution the as simply the Music Hall Of Fame as the organization has expanded to include more hip-hop, rap, or country figures, Sykes is \u003ca href=\"https://consequence.net/2025/01/rock-hall-of-fame-wont-be-renamed/\" target=\"_blank\" rel=\"noopener\"\u003ecommitted\u003c/a\u003e to the idea of Rock and Roll being the best umbrella term for artists in the realm of “popular music.”\u003c/p\u003e\n\u003cp\u003eRegardless of his proximity to the Hall of Fame, Weird Al is gearing up for a major \u003ca href=\"https://consequence.net/2024/09/weird-al-yankovic-2025-tour-dates/\" target=\"_blank\" rel=\"noopener\"\u003e2025 tour\u003c/a\u003e, where he’ll be delivering some of his most beloved hits over the course of 65 cities. \u003ca href=\"https://stubhub.prf.hn/l/AJaQwng/\" target=\"_blank\" rel=\"noopener nofollow\"\u003eGrab tickets here\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003ePlus, be sure to check out the comedy musician’s 2024 \u003ca href=\"https://consequence.net/2024/08/weird-al-yankovic-polkamania-pop-interview/\" target=\"_blank\" rel=\"noopener\"\u003epodcast sitdown\u003c/a\u003e with Kyle Meredith, and read \u003ca href=\"https://consequence.net/2024/07/polkamania-weird-al-polka-medleys/\" target=\"_blank\" rel=\"noopener\"\u003ethe interview\u003c/a\u003e in which “Weird Al” breaks down all 14 of his polka medleys.\u003c/p\u003e\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-02T15:20:01-05:00",
  "modifiedTime": null
}
