{
  "id": "4a4bd4da-e0ae-4e8d-8d4d-824dc349467f",
  "title": "A Royal Tribute: Five Designs Unveiled for Queen Elizabeth II National Memorial",
  "link": "https://www.yankodesign.com/2025/05/08/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial",
  "description": "A Royal Tribute: Five Designs Unveiled for Queen Elizabeth II National MemorialThe UK Government has revealed five extraordinary design proposals for the national memorial to Queen Elizabeth II, marking a significant milestone in creating a lasting...",
  "author": "Vincent Nguyen",
  "published": "Thu, 08 May 2025 22:30:05 +0000",
  "source": "http://feeds.feedburner.com/yankodesign",
  "categories": [
    "Architecture",
    "Architectural Designs",
    "memorial"
  ],
  "byline": "Vincent Nguyen",
  "length": 8380,
  "excerpt": "The UK Government has revealed five extraordinary design proposals for the national memorial to Queen Elizabeth II, marking a significant milestone in creating",
  "siteName": "Yanko Design",
  "favicon": "https://www.yankodesign.com/images/design_news/2015/07/favicon144.png",
  "text": "The UK Government has revealed five extraordinary design proposals for the national memorial to Queen Elizabeth II, marking a significant milestone in creating a lasting tribute to Britain’s longest-reigning monarch. Located in St James’s Park, London, the memorial will honor the Queen’s extraordinary 70-year reign and her profound impact on the United Kingdom and the Commonwealth. The winning design will be announced in early Summer 2025 and unveiled in 2026, the late Queen’s centenary year. Until May 19, 2025, the public can view these proposals through an online exhibition managed by Malcolm Reading Consultants and provide feedback to help shape the final selection. A Historic Location with Royal Connections St James’s Park was chosen for its historical significance, personal connection to the late Queen, and proximity to the ceremonial route of The Mall. The site is strategically positioned near Buckingham Palace, the Commonwealth headquarters, and statues of her parents, King George VI and Queen Elizabeth the Queen Mother. Lord Janvrin, chair of the Queen Elizabeth Memorial Committee, emphasized the importance of this location and public involvement: “Queen Elizabeth II’s extraordinary life of service profoundly touched countless individuals, and she was a figure of great respect and admiration. Memories of her long reign are still fresh for so many of us, and we need to capture the essence of them for future generations.” Five Visionary Designs: A Closer Look Foster + Partners’ Royal Gardens The proposal by Foster + Partners, collaborating with artist Yinka Shonibare, ecologist Professor Nigel Dunnett, and landscape architect Michel Desvigne Paysagiste, features a “tranquil family” of royal gardens inspired by John Nash’s original landscape design for the park. The gardens are connected by a natural stone tessellated pathway sourced from the United Kingdom and the Commonwealth that meanders through the park. This design includes figurative sculptures of Queen Elizabeth II alongside Prince Philip on Birdcage Walk and an equestrian statue of the Queen in a new civic space called Queen Elizabeth II Place at Marlborough Gate. Audio installations featuring the Queen’s voice, inscriptions, and a digital conservatory accessible from the site or anywhere worldwide further enhance the experience. The design is crowned by a translucent Unity Bridge, described as a “jewel” completing the memorial journey. Heatherwick Studio’s Bridge of Togetherness Heatherwick Studio, partnering with sculptor and ceramicist Halima Cassell, MRG Studio, Webb Yates, and Arup, has proposed a memorial walk inspired by the concept of “togetherness.” Their design features 70 lily pad stepping stones representing the Queen’s 70-year reign, acting as a bridge across the park. At the center of this bridge stands a limestone sculpture of the late Queen, protected by a canopy of eight carved sculptural lily pads. The stone was specifically chosen because it will “age with dignity,” reflecting the Queen’s enduring legacy. This dramatic form creates a unique architectural space for reflection and celebration of the monarch’s life. J\u0026L Gibbons’ Stone Bridge J\u0026L Gibbons, working with production designer Michael Levine, William Matthews Associates, Structure Workshop, and Arup, has designed an innovative stone bridge over soil, tree roots, and water. Featuring a gentle cascade of water onto the lake, this structure symbolically represents the late Queen as the “bedrock of the nation.” The design aims to capture a “meandering flow of geology carrying people through an ephemeral choreography of blossoming and colour beneath the high tree canopy.” It includes glades that invite “forest bathing in the heart of the city” while enhancing the park’s capacity to welcome increased footfall and adapt to future climate conditions. The bridge would be crafted from stone sourced from all four nations of the United Kingdom, emphasizing unity. Tom Stuart-Smith’s Queen’s Oak Tom Stuart-Smith, together with Jamie Fobert Architects, artist Adam Lowe of Factum Arte, and Structure Workshop, has centered their design around “The Queen’s Oak.” This proposal features an exact bronze cast of an “awe-inspiring” ancient oak from Windsor Great Park, representing the late Queen’s strength and endurance while symbolizing the monarchy. The digitally scanned replica tree would stand on a plinth in the lake, with a curved stone bridge serving as a viewing platform. The design also incorporates a serpentine memorial path for all ages and abilities, featuring inlaid bronze casts of significant objects from the late Queen’s life and a “sonic soundscape” of memories from those she influenced. WilkinsonEyre’s Thread of Pathways WilkinsonEyre, collaborating with artists Lisa Vandy and Fiona Clarke, has proposed a thread of pathways and landscapes “gently woven through the natural fabric” of the park. Their design includes a pair of “elegant bridges” spanning the lake, framing views of the park, royal palaces, and London skyline. Aiming to impose the “lightest footprint” on the Grade I listed park, this design focuses on seven themes of the late Queen’s life: reign, faith, Commonwealth, values, nature, family, and Prince Philip. Symbolic spaces for reflection along the path invite visitors to form their own personal connection to the Queen’s life and values. Selection Process and Public Engagement The Queen Elizabeth Memorial Committee, established by the UK Government and Royal Household in 2023 and chaired by the late Queen’s former Private Secretary Lord Janvrin, is overseeing the project. A panel of committee members will select the winning design concept and work with the team on the final design. Public feedback gathered through the online exhibition will play a crucial role in shaping the committee’s decision. Baroness Amos, a member of the selection committee, highlighted the significance of public engagement: “We want the public to comment on these proposals because we want them to feel part of it. So much of what the late Queen was about was meeting people and engaging with them.” In addition to selecting the winning design team, the committee will also choose an artist, through a separate process, to create a figurative representation of Queen Elizabeth II for the site on The Mall. The final design will be submitted to the King and Prime Minister Sir Keir Starmer for approval. Budget and Broader Legacy The memorial is expected to cost between £23 million and £46 million, depending on the selected design, and will be funded by public funds. However, the project extends beyond the physical monument in St James’s Park. The memorial scheme will also provide community projects and facilities around the country, following in the tradition of legacy schemes such as the King George V Playing Fields, which saw almost 500 sports grounds opened in memory of the monarch who died in 1936. Many of those playing fields are still in use today, scattered throughout the country. A Fitting Tribute to an Extraordinary Reign The shortlisted designs for Queen Elizabeth II’s national memorial represent diverse approaches to commemorating Britain’s longest-reigning monarch. From Foster + Partners’ royal gardens to Heatherwick Studio’s lily pad canopy, J\u0026L Gibbons’ stone bridge, Tom Stuart-Smith’s bronze oak, and WilkinsonEyre’s woven pathways, each proposal offers a unique vision for this significant national landmark. Three of the five proposed designs feature the late Queen riding a horse, reflecting her lifelong enthusiasm for equestrianism, while others incorporate elements like recordings of her voice, symbolic oak trees, and interactive pathways. As the selection process continues and public feedback is gathered, the memorial promises to become a fitting tribute to Queen Elizabeth II’s extraordinary life and legacy. The chosen design will not only serve as a place for reflection and commemoration but will also stand as a testament to the monarch’s 70-year reign and her profound impact on the United Kingdom and the Commonwealth. When completed, this new memorial will join other important royal monuments in London, becoming part of the capital’s rich tapestry of historical tributes while creating new opportunities for future generations to connect with this remarkable chapter in British history.",
  "image": "https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/hero-04.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                        \u003cp\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/hero-04.jpg\" alt=\"\" width=\"1280\" height=\"960\" data-jpibfi-post-excerpt=\"\" data-jpibfi-post-url=\"https://www.yankodesign.com/2025/05/08/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/\" data-jpibfi-post-title=\"A Royal Tribute: Five Designs Unveiled for Queen Elizabeth II National Memorial\" data-jpibfi-src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/hero-04.jpg\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe UK Government has revealed five extraordinary design proposals for the national memorial to Queen Elizabeth II, marking a significant milestone in creating a lasting tribute to Britain’s longest-reigning monarch. Located in St James’s Park, London, the memorial will honor the Queen’s extraordinary 70-year reign and her profound impact on the United Kingdom and the Commonwealth.\u003c/p\u003e\n\u003cp\u003eThe winning design will be announced in early Summer 2025 and unveiled in 2026, the late Queen’s centenary year. Until May 19, 2025, the public can view these proposals through an online exhibition managed by Malcolm Reading Consultants and provide feedback to help shape the final selection.\u003c/p\u003e\n\u003ch2\u003eA Historic Location with Royal Connections\u003c/h2\u003e\n\u003cp\u003eSt James’s Park was chosen for its historical significance, personal connection to the late Queen, and proximity to the ceremonial route of The Mall. The site is strategically positioned near Buckingham Palace, the Commonwealth headquarters, and statues of her parents, King George VI and Queen Elizabeth the Queen Mother.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/hero-02.jpg\" data-src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/hero-02.jpg\" alt=\"\" width=\"1280\" height=\"960\" data-jpibfi-post-excerpt=\"\" data-jpibfi-post-url=\"https://www.yankodesign.com/2025/05/08/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/\" data-jpibfi-post-title=\"A Royal Tribute: Five Designs Unveiled for Queen Elizabeth II National Memorial\" data-jpibfi-src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/hero-02.jpg\"/\u003e\u003c/p\u003e\n\n\u003cp\u003eLord Janvrin, chair of the Queen Elizabeth Memorial Committee, emphasized the importance of this location and public involvement: “Queen Elizabeth II’s extraordinary life of service profoundly touched countless individuals, and she was a figure of great respect and admiration. Memories of her long reign are still fresh for so many of us, and we need to capture the essence of them for future generations.”\u003c/p\u003e\n\u003ch2\u003eFive Visionary Designs: A Closer Look\u003c/h2\u003e\n\u003ch3\u003eFoster + Partners’ Royal Gardens\u003c/h3\u003e\n\u003cp\u003eThe proposal by Foster + Partners, collaborating with artist Yinka Shonibare, ecologist Professor Nigel Dunnett, and landscape architect Michel Desvigne Paysagiste, features a “tranquil family” of royal gardens inspired by John Nash’s original landscape design for the park.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/Untitled-116.jpg\" data-src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/Untitled-116.jpg\" alt=\"\" width=\"1280\" height=\"960\" data-jpibfi-post-excerpt=\"\" data-jpibfi-post-url=\"https://www.yankodesign.com/2025/05/08/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/\" data-jpibfi-post-title=\"A Royal Tribute: Five Designs Unveiled for Queen Elizabeth II National Memorial\" data-jpibfi-src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/Untitled-116.jpg\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe gardens are connected by a natural stone tessellated pathway sourced from the United Kingdom and the Commonwealth that meanders through the park. This design includes figurative sculptures of Queen Elizabeth II alongside Prince Philip on Birdcage Walk and an equestrian statue of the Queen in a new civic space called Queen Elizabeth II Place at Marlborough Gate.\u003c/p\u003e\n\u003cp\u003eAudio installations featuring the Queen’s voice, inscriptions, and a digital conservatory accessible from the site or anywhere worldwide further enhance the experience. The design is crowned by a translucent Unity Bridge, described as a “jewel” completing the memorial journey.\u003c/p\u003e\n\u003ch3\u003eHeatherwick Studio’s Bridge of Togetherness\u003c/h3\u003e\n\u003cp\u003eHeatherwick Studio, partnering with sculptor and ceramicist Halima Cassell, MRG Studio, Webb Yates, and Arup, has proposed a memorial walk inspired by the concept of “togetherness.” Their design features 70 lily pad stepping stones representing the Queen’s 70-year reign, acting as a bridge across the park.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/Untitled-1182.jpg\" data-src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/Untitled-1182.jpg\" alt=\"\" width=\"1280\" height=\"960\" data-jpibfi-post-excerpt=\"\" data-jpibfi-post-url=\"https://www.yankodesign.com/2025/05/08/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/\" data-jpibfi-post-title=\"A Royal Tribute: Five Designs Unveiled for Queen Elizabeth II National Memorial\" data-jpibfi-src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/Untitled-1182.jpg\"/\u003e\u003c/p\u003e\n\n\u003cp\u003eAt the center of this bridge stands a limestone sculpture of the late Queen, protected by a canopy of eight carved sculptural lily pads. The stone was specifically chosen because it will “age with dignity,” reflecting the Queen’s enduring legacy. This dramatic form creates a unique architectural space for reflection and celebration of the monarch’s life.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/hero-01.jpg\" data-src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/hero-01.jpg\" alt=\"\" width=\"1280\" height=\"960\" data-jpibfi-post-excerpt=\"\" data-jpibfi-post-url=\"https://www.yankodesign.com/2025/05/08/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/\" data-jpibfi-post-title=\"A Royal Tribute: Five Designs Unveiled for Queen Elizabeth II National Memorial\" data-jpibfi-src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/hero-01.jpg\"/\u003e\u003c/p\u003e\n\u003ch3\u003eJ\u0026amp;L Gibbons’ Stone Bridge\u003c/h3\u003e\n\u003cp\u003eJ\u0026amp;L Gibbons, working with production designer Michael Levine, William Matthews Associates, Structure Workshop, and Arup, has designed an innovative stone bridge over soil, tree roots, and water. Featuring a gentle cascade of water onto the lake, this structure symbolically represents the late Queen as the “bedrock of the nation.”\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/Untitled-113.jpg\" data-src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/Untitled-113.jpg\" alt=\"\" width=\"1280\" height=\"960\" data-jpibfi-post-excerpt=\"\" data-jpibfi-post-url=\"https://www.yankodesign.com/2025/05/08/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/\" data-jpibfi-post-title=\"A Royal Tribute: Five Designs Unveiled for Queen Elizabeth II National Memorial\" data-jpibfi-src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/Untitled-113.jpg\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe design aims to capture a “meandering flow of geology carrying people through an ephemeral choreography of blossoming and colour beneath the high tree canopy.” It includes glades that invite “forest bathing in the heart of the city” while enhancing the park’s capacity to welcome increased footfall and adapt to future climate conditions. The bridge would be crafted from stone sourced from all four nations of the United Kingdom, emphasizing unity.\u003c/p\u003e\n\u003ch3\u003eTom Stuart-Smith’s Queen’s Oak\u003c/h3\u003e\n\u003cp\u003eTom Stuart-Smith, together with Jamie Fobert Architects, artist Adam Lowe of Factum Arte, and Structure Workshop, has centered their design around “The Queen’s Oak.” This proposal features an exact bronze cast of an “awe-inspiring” ancient oak from Windsor Great Park, representing the late Queen’s strength and endurance while symbolizing the monarchy.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/Untitled-112.jpg\" data-src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/Untitled-112.jpg\" alt=\"\" width=\"1280\" height=\"960\" data-jpibfi-post-excerpt=\"\" data-jpibfi-post-url=\"https://www.yankodesign.com/2025/05/08/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/\" data-jpibfi-post-title=\"A Royal Tribute: Five Designs Unveiled for Queen Elizabeth II National Memorial\" data-jpibfi-src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/Untitled-112.jpg\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe digitally scanned replica tree would stand on a plinth in the lake, with a curved stone bridge serving as a viewing platform. The design also incorporates a serpentine memorial path for all ages and abilities, featuring inlaid bronze casts of significant objects from the late Queen’s life and a “sonic soundscape” of memories from those she influenced.\u003c/p\u003e\n\u003ch3\u003eWilkinsonEyre’s Thread of Pathways\u003c/h3\u003e\n\u003cp\u003eWilkinsonEyre, collaborating with artists Lisa Vandy and Fiona Clarke, has proposed a thread of pathways and landscapes “gently woven through the natural fabric” of the park. Their design includes a pair of “elegant bridges” spanning the lake, framing views of the park, royal palaces, and London skyline.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/Untitled-1189.jpg\" data-src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/Untitled-1189.jpg\" alt=\"\" width=\"1280\" height=\"960\" data-jpibfi-post-excerpt=\"\" data-jpibfi-post-url=\"https://www.yankodesign.com/2025/05/08/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/\" data-jpibfi-post-title=\"A Royal Tribute: Five Designs Unveiled for Queen Elizabeth II National Memorial\" data-jpibfi-src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/Untitled-1189.jpg\"/\u003e\u003c/p\u003e\n\u003cp\u003eAiming to impose the “lightest footprint” on the Grade I listed park, this design focuses on seven themes of the late Queen’s life: reign, faith, Commonwealth, values, nature, family, and Prince Philip. Symbolic spaces for reflection along the path invite visitors to form their own personal connection to the Queen’s life and values.\u003c/p\u003e\n\u003ch2\u003eSelection Process and Public Engagement\u003c/h2\u003e\n\u003cp\u003eThe Queen Elizabeth Memorial Committee, established by the UK Government and Royal Household in 2023 and chaired by the late Queen’s former Private Secretary Lord Janvrin, is overseeing the project. A panel of committee members will select the winning design concept and work with the team on the final design.\u003c/p\u003e\n\u003cp\u003ePublic feedback gathered through the online exhibition will play a crucial role in shaping the committee’s decision. Baroness Amos, a member of the selection committee, highlighted the significance of public engagement: “We want the public to comment on these proposals because we want them to feel part of it. So much of what the late Queen was about was meeting people and engaging with them.”\u003c/p\u003e\n\u003cp\u003eIn addition to selecting the winning design team, the committee will also choose an artist, through a separate process, to create a figurative representation of Queen Elizabeth II for the site on The Mall. The final design will be submitted to the King and Prime Minister Sir Keir Starmer for approval.\u003c/p\u003e\n\u003ch2\u003eBudget and Broader Legacy\u003c/h2\u003e\n\u003cp\u003eThe memorial is expected to cost between £23 million and £46 million, depending on the selected design, and will be funded by public funds. However, the project extends beyond the physical monument in St James’s Park.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/Untitled-11.jpg\" data-src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/Untitled-11.jpg\" alt=\"\" width=\"1280\" height=\"960\" data-jpibfi-post-excerpt=\"\" data-jpibfi-post-url=\"https://www.yankodesign.com/2025/05/08/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/\" data-jpibfi-post-title=\"A Royal Tribute: Five Designs Unveiled for Queen Elizabeth II National Memorial\" data-jpibfi-src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/Untitled-11.jpg\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe memorial scheme will also provide community projects and facilities around the country, following in the tradition of legacy schemes such as the King George V Playing Fields, which saw almost 500 sports grounds opened in memory of the monarch who died in 1936. Many of those playing fields are still in use today, scattered throughout the country.\u003c/p\u003e\n\u003ch2\u003eA Fitting Tribute to an Extraordinary Reign\u003c/h2\u003e\n\u003cp\u003eThe shortlisted designs for Queen Elizabeth II’s national memorial represent diverse approaches to commemorating Britain’s longest-reigning monarch. From Foster + Partners’ royal gardens to Heatherwick Studio’s lily pad canopy, J\u0026amp;L Gibbons’ stone bridge, Tom Stuart-Smith’s bronze oak, and WilkinsonEyre’s woven pathways, each proposal offers a unique vision for this significant national landmark.\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/Untitled-114.jpg\" data-src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/Untitled-114.jpg\" alt=\"\" width=\"1280\" height=\"960\" data-jpibfi-post-excerpt=\"\" data-jpibfi-post-url=\"https://www.yankodesign.com/2025/05/08/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/\" data-jpibfi-post-title=\"A Royal Tribute: Five Designs Unveiled for Queen Elizabeth II National Memorial\" data-jpibfi-src=\"https://www.yankodesign.com/images/design_news/2025/05/a-royal-tribute-five-designs-unveiled-for-queen-elizabeth-ii-national-memorial/Untitled-114.jpg\"/\u003e\u003c/p\u003e\n\u003cp\u003eThree of the five proposed designs feature the late Queen riding a horse, reflecting her lifelong enthusiasm for equestrianism, while others incorporate elements like recordings of her voice, symbolic oak trees, and interactive pathways.\u003c/p\u003e\n\u003cp\u003eAs the selection process continues and public feedback is gathered, the memorial promises to become a fitting tribute to Queen Elizabeth II’s extraordinary life and legacy. The chosen design will not only serve as a place for reflection and commemoration but will also stand as a testament to the monarch’s 70-year reign and her profound impact on the United Kingdom and the Commonwealth.\u003c/p\u003e\n\u003cp\u003eWhen completed, this new memorial will join other important royal monuments in London, becoming part of the capital’s rich tapestry of historical tributes while creating new opportunities for future generations to connect with this remarkable chapter in British history.\u003c/p\u003e\n\n                                                \n                                                   \n                                            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-05-08T15:30:05-07:00",
  "modifiedTime": "2025-05-08T21:11:36Z"
}
