{
  "id": "6234f709-46a2-4058-9789-0fd0125a39fe",
  "title": "This 1907 Farmhouse Has A Delightfully Unexpected Interior",
  "link": "https://thedesignfiles.wpenginepowered.com/2025/07/interiors-eureka-house-hulleandfulle/",
  "description": "This idyllic 1907 farmhouse in the Byron Shire reveals a perfectly understated renovation, born from a chance meeting between the owners and Berlin-born designers Hülle \u0026 Fülle. Take a look inside the charming home, transformed with a palette of blush pink, earthy terracotta, olive green, raspberry red and generous texture and pattern.",
  "author": "The Design Files",
  "published": "Sun, 13 Jul 2025 20:00:19 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 2492,
  "excerpt": "A chance encounter between the owners and designers Hülle \u0026 Fülle led to the idyllic renovation of this farmhouse in the Byron Shire.",
  "siteName": "",
  "favicon": "",
  "text": "For most designers, getting to know a house and the people who live there is a crucial part of the design process. It helps shape not only the essential parts of the project like the floor plan, but the overall feeling of the house itself. In the case of this holiday home in the Northern Rivers, Nicole Albrecht, one half of Berlin-born interior design practice Hülle \u0026 Fülle, got the rare opportunity to build a personal connection to both the property and her clients, after a chance meeting with Sydney artist Nina Walton and Zeb Rice. ‘Nina, Zeb and their son Oliver walked into our book and furniture store BTWNLNS (Between Lines) in Newtown, NSW in autumn 2021, only half a year after we had arrived from Berlin,’ says Nicole. The group hit it off, bonding over a shared love of Scandinavian design, books and art. And about a year after becoming friends, Nina and Zeb asked Nicole to redesign their farmhouse in Eureka, even inviting her to stay and ‘get a feel for the space’. ‘It’s an interior designer’s dream come true,’ she says. ‘What a rare opportunity to understand their way of living and the house!’ In Nina’s own words, the property was rather ramshackle at the time. It featured a crazy garden over five acres with trees everywhere, a main house,  smaller cottage, and  recording studio built by the previous owner, Australian musician Pete Murray. The main living spaces inside were also reconfigured to create a singular multifunctional family room and kitchen with a playful checkered island bench. Just as the existing interiors mixed materials, Nicole’s consolidated redesign plays with textures and colour — this time with an air of undone sophistication. Dark timber floorboards and white walls are broken up by warm spotted gum timber veneer, soft pink-painted panelling, and patterned rugs. ‘The house is held together by a calming colour palette and Japanese-inspired joinery,’ she says. One of the other highlights of the farmhouse is without a doubt the surrounding landscape. In the main bedroom, large floor-to-ceiling corner windows capture incredible views of the valley. The collaborative process behind the renovation has been special for all involved, especially as it marks Hülle \u0026 Fülle’s first residential project here in Australia. ‘To hear Nina and Zeb when I see them say, “Nicole, this is the best house!” makes me very happy,’ Nicole says. ‘When a client never wants to leave a place and can’t wait to return, that’s the most rewarding outcome.’",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2025/07/Eureka-tdf-homes-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003eFor most designers, getting to know a house and the people who live there is a crucial part of the design process. It helps shape not only the essential parts of the project like the floor plan, but the overall feeling of the house itself.\u003c/h3\u003e\n\u003cp\u003eIn the case of this holiday home in the Northern Rivers, Nicole Albrecht, one half of Berlin-born interior design practice \u003ca href=\"https://huelleundfuelle.net/en\" target=\"_blank\" rel=\"noopener\"\u003eHülle \u0026amp; Fülle\u003c/a\u003e, got the rare opportunity to build a personal connection to both the property and her clients, after a chance meeting with Sydney \u003ca href=\"https://thedesignfiles.wpenginepowered.com/2024/04/studio-visit-nina-walton-artist\" target=\"_blank\" rel=\"noopener\"\u003eartist Nina Walton\u003c/a\u003e and Zeb Rice.\u003c/p\u003e\n\u003cp\u003e‘Nina, Zeb and their son Oliver walked into our book and furniture store \u003ca href=\"https://btwnlns.com/\" target=\"_blank\" rel=\"noopener\"\u003eBTWNLNS\u003c/a\u003e (Between Lines) in Newtown, NSW in autumn 2021, only half a year after we had arrived from Berlin,’ says Nicole.\u003c/p\u003e\n\u003cp\u003eThe group hit it off, bonding over a shared love of Scandinavian design, books and art. And about a year after becoming friends, Nina and Zeb asked Nicole to redesign their farmhouse in Eureka, even inviting her to stay and ‘get a feel for the space’.\u003c/p\u003e\n\u003cp\u003e‘It’s an interior designer’s dream come true,’ she says. ‘What a rare opportunity to understand their way of living and the house!’\u003c/p\u003e\n\u003cp\u003eIn Nina’s own words, the property was rather ramshackle at the time. It featured a crazy garden over five acres with trees everywhere, a main house,  smaller cottage, and  recording studio built by the previous owner, Australian musician Pete Murray.\u003c/p\u003e\n\u003cp\u003eThe main living spaces inside were also reconfigured to create a singular multifunctional family room and kitchen with a playful checkered island bench.\u003c/p\u003e\n\u003cp\u003eJust as the existing interiors mixed materials, Nicole’s consolidated redesign plays with textures and colour — this time with an air of undone sophistication.\u003c/p\u003e\n\u003cp\u003eDark timber floorboards and white walls are broken up by warm spotted gum timber veneer, soft pink-painted panelling, and patterned rugs.\u003c/p\u003e\n\u003cp\u003e‘The house is held together by a calming colour palette and Japanese-inspired joinery,’ she says.\u003c/p\u003e\n\u003cp\u003eOne of the other highlights of the farmhouse is without a doubt the surrounding landscape. In the main bedroom, large floor-to-ceiling corner windows capture incredible views of the valley.\u003c/p\u003e\n\u003cp\u003eThe collaborative process behind the renovation has been special for all involved, especially as it marks Hülle \u0026amp; Fülle’s first residential project here in Australia.\u003c/p\u003e\n\u003cp\u003e‘To hear Nina and Zeb when I see them say, “Nicole, this is the best house!” makes me very happy,’ Nicole says.\u003c/p\u003e\n\u003cp\u003e‘When a client never wants to leave a place and can’t wait to return, that’s the most rewarding outcome.’\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
