{
  "id": "647739e7-e9cc-43b4-a020-78b488e0d3ce",
  "title": "A Revived 1850s Inner-City Cottage With A Generous Green Roof",
  "link": "https://thedesignfiles.wpenginepowered.com/2024/11/architecture-richmond-cottage-nest-architects/",
  "description": "Nest Architects completed their first residential project — a renovation of an inner-city Melbourne cottage with a thriving new green roof — in 2011, serving as a case study on how to create small and sustainable family homes. The project continues to inspire clients today, including the owners of this Richmond cottage, who came to Nest seeking a similar design solution. Working on a relatively limited budget, Nest managed to increase the size of their home while improving its liveability. The cherry on top is the green roof, which features 19 different plant species, and insulates the house while providing habitat for local wildlife!",
  "author": "The Design Files",
  "published": "Mon, 18 Nov 2024 19:00:48 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 4184,
  "excerpt": "This compact inner-city Melbourne cottage is having a big impact thanks to an efficient renovation and green roof by Nest Architects.",
  "siteName": "",
  "favicon": "",
  "text": "The owners of this 1850s weatherboard cottage bought the Richmond property when it was in ‘really bad shape’ — much of which was only revealed after purchasing. ‘The condition of the existing dwelling was very poor, to the point that the existing footings were simply bluestone rocks sitting on the ground,’ says Emilio Fuscaldo, director of Nest Architects. ‘We encountered this during the first few days of demolition, which was a surprise and a huge hurdle to overcome.’ The architects were tasked with remedying these issues, and creating a more functional and environmentally-conscious home. The brief was relatively straightforward, reading in part: ‘I’m looking forward to having sunshine coming into our house during the cold winter days… Overall, I’d like a simple design that allows us to maximise the space we have, be efficient and give us the feel of a homely and comfortable place, rather than a luxurious and over-the-top sort of place.’ The decision was made to prioritise an efficient use of space and durable materials, rather than additional bedrooms and bathrooms. Nest reconfigured the existing house and added a small extension, providing the clients with all the ‘must haves’ (better energy efficiency, natural light, and a functional kitchen), and nearly all of the ‘would be nice’ features (a separate laundry, landscaping, and high ceilings) outlined in their initial brief. ‘We wanted the house to maintain a cottage-like feeling and atmosphere,’ says Emilio. ‘Our goal was to avoid designing an extension that was overly contemporary, slick, or shiny, which would be out of step with the existing dwelling.’ The original layout of the four front rooms was retained, but replanned for better functionality, turning the living space into the main bedroom. Nest also rearranged the bathroom, allowing space for a separate laundry, and powder room. ‘The entire structure was rebuilt due to its poor condition, which allowed the builder to fill in any gaps or holes — an opportunity that usually doesn’t arise during renovations,’ says Emilio. The new extension hosts the open-plan living, kitchen, and dining area, along with a cosy reading nook on the eastern side of the house. Materials were selected for their sustainable and aesthetic qualities, including Weathertex Ecogroove horizontal boards on the extension cladding that mimic the lines of the original home’s existing weatherboards. Silver ash timber lining boards break up rear facade, ‘adding warmth and texture to the areas where we sit and touch the building,’ in the words of Emilio. He adds, ‘Recycled glass benchtops in the kitchen, recycled fabric for the window seat, and reclaimed engineered floorboards all provide warmth, texture, and a sense of history to the space, moving it away from looking brand new to something that feels lived-in from day one.’ The renovated home boasts a 7-star NatHERS rating, which is remarkable for the property’s age and recent condition. ‘Balancing the budget with sustainable aspirations was achieved by focusing the budget on the building’s skin: the floor, roof and walls,’ explains Emilio. ‘We employed simple strategies such as high-performance insulation, all-electric appliances, reverse brick veneer walls, high-performance glazing and, of course, the added insulative layer for the green roof.’ The green roof — designed with Fytogreen — features 19 plant species to insulate the house while attracting local wildlife. ‘Utilising a depth of just 100mm of soil, the roof can support numerous plant species, help filter water before entering the stormwater system, provide a home for all sorts of fauna, and help insulate the house further,’ Emilio says. ‘As a result of this insulative layer, heating and cooling loads are drastically reduced, and when coupled with the 6kW solar array, bills are next to nothing.’ Needless to say, the owners love their newly-improved home. ‘Their utility bills are next to nothing and they are positively contributing to the environment around them. They love that they’ve given a home to numerous species of flora and fauna,’ Emilio says. ‘In short, they’re proud that their little home is having a big impact.’",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2024/11/RichmondCottage-tdf-archi4-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003eThe owners of this 1850s weatherboard cottage bought the Richmond property when it was in ‘really bad shape’ — much of which was only revealed after purchasing.\u003c/h3\u003e\n\u003cp\u003e‘The condition of the existing dwelling was very poor, to the point that the existing footings were simply bluestone rocks sitting on the ground,’ says Emilio Fuscaldo, director of \u003ca href=\"https://nestarchitects.com.au/\"\u003eNest Architects\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e‘We encountered this during the first few days of demolition, which was a surprise and a huge hurdle to overcome.’\u003c/p\u003e\n\u003cp\u003eThe architects were tasked with remedying these issues, and creating a more functional and environmentally-conscious home.\u003c/p\u003e\n\u003cp\u003eThe brief was relatively straightforward, reading in part: ‘I’m looking forward to having sunshine coming into our house during the cold winter days… Overall, I’d like a simple design that allows us to maximise the space we have, be efficient and give us the feel of a homely and comfortable place, rather than a luxurious and over-the-top sort of place.’\u003c/p\u003e\n\u003cp\u003eThe decision was made to prioritise an efficient use of space and durable materials, rather than additional bedrooms and bathrooms.\u003c/p\u003e\n\u003cp\u003eNest reconfigured the existing house and added a small extension, providing the clients with all the ‘must haves’ (better energy efficiency, natural light, and a functional kitchen), and nearly all of the ‘would be nice’ features (a separate laundry, landscaping, and high ceilings) outlined in their initial brief.\u003c/p\u003e\n\u003cp\u003e‘We wanted the house to maintain a cottage-like feeling and atmosphere,’ says Emilio. ‘Our goal was to avoid designing an extension that was overly contemporary, slick, or shiny, which would be out of step with the existing dwelling.’\u003c/p\u003e\n\u003cp\u003eThe original layout of the four front rooms was retained, but replanned for better functionality, turning the living space into the main bedroom.\u003c/p\u003e\n\u003cp\u003eNest also rearranged the bathroom, allowing space for a separate laundry, and powder room.\u003c/p\u003e\n\u003cp\u003e‘The entire structure was rebuilt due to its poor condition, which allowed the builder to fill in any gaps or holes — an opportunity that usually doesn’t arise during renovations,’ says Emilio.\u003c/p\u003e\n\u003cp\u003eThe new extension hosts the open-plan living, kitchen, and dining area, along with a cosy reading nook on the eastern side of the house.\u003c/p\u003e\n\u003cp\u003eMaterials were selected for their sustainable and aesthetic qualities, including Weathertex Ecogroove horizontal boards on the extension cladding that mimic the lines of the original home’s existing weatherboards.\u003c/p\u003e\n\u003cp\u003eSilver ash timber lining boards break up rear facade, ‘adding warmth and texture to the areas where we sit and touch the building,’ in the words of Emilio.\u003c/p\u003e\n\u003cp\u003eHe adds, ‘Recycled glass benchtops in the kitchen, recycled fabric for the window seat, and reclaimed engineered floorboards all provide warmth, texture, and a sense of history to the space, moving it away from looking brand new to something that feels lived-in from day one.’\u003c/p\u003e\n\u003cp\u003eThe renovated home boasts a 7-star NatHERS rating, which is remarkable for the property’s age and recent condition.\u003c/p\u003e\n\u003cp\u003e‘Balancing the budget with sustainable aspirations was achieved by focusing the budget on the building’s skin: the floor, roof and walls,’ explains Emilio.\u003c/p\u003e\n\u003cp\u003e‘We employed simple strategies such as high-performance insulation, all-electric appliances, reverse brick veneer walls, high-performance glazing and, of course, the added insulative layer for the green roof.’\u003c/p\u003e\n\u003cp\u003eThe \u003ca href=\"https://www.instagram.com/p/CzXNExcSero/?img_index=1\"\u003egreen roof\u003c/a\u003e — designed with \u003ca href=\"https://fytogreen.com.au/\"\u003eFytogreen\u003c/a\u003e — features 19 plant species to insulate the house while attracting local wildlife.\u003c/p\u003e\n\u003cp\u003e‘Utilising a depth of just 100mm of soil, the roof can support numerous plant species, help filter water before entering the stormwater system, provide a home for all sorts of fauna, and help insulate the house further,’ Emilio says.\u003c/p\u003e\n\u003cp\u003e‘As a result of this insulative layer, heating and cooling loads are drastically reduced, and when coupled with the 6kW solar array, bills are next to nothing.’\u003c/p\u003e\n\u003cp\u003eNeedless to say, the owners love their newly-improved home. ‘Their utility bills are next to nothing and they are positively contributing to the environment around them. They love that they’ve given a home to numerous species of flora and fauna,’ Emilio says.\u003c/p\u003e\n\u003cp\u003e‘In short, they’re proud that their little home is having a big impact.’\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
