{
  "id": "855cad32-5edf-444b-b1f6-f046bcaf1714",
  "title": "A Romantic English Cottage-Inspired Melbourne Family Home",
  "link": "https://thedesignfiles.wpenginepowered.com/2024/10/homes-posey-marc-broomhall-brighton/",
  "description": "Posey Broomhall’s family home is the house-equivalent of a pretty posy — which is appropriate, given her name! The owner of Harpo Hair and Bompies purchased the Brighton property in 2017 — by which time, almost all of its original 1930s features had been removed. A renovation completed over six years (!) brought the property back to life, instilling the interiors with Posey’s signature English-cottage inspired style, appropriate for the home’s era.",
  "author": "The Design Files",
  "published": "Tue, 08 Oct 2024 19:00:43 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 2626,
  "excerpt": "How Posey and Marc Broomhall gave a rundown 1930s home new life with feminine colour, clashing patterns, and luxurious textiles.",
  "siteName": "",
  "favicon": "",
  "text": "Posey and Marc Broomhall kept missing out at auctions when a real estate agent alerted them to a 1930s home for sale in Brighton. The only issue — the house wasn’t in a state to be photographed. ‘It was a real wreck, some of the rooms were almost derelict,’ recalls Posey, who is the founder of Harpo Hair and sleepwear label Bompies. Regardless, the couple took a chance on the Melbourne property and saw potential in its bones. ‘We put an offer in straight away after viewing the house,’ Posey says. The couple and their twins (Archie and Dusty, now 7) moved into the home before embarking on a renovation to revive and enhance its original design. Firstly, the floor plan was reconfigured, switching the main bedroom and living areas so the latter could appreciate backyard views. The children’s bedroom was also enlarged by removing dead hallway space, and some height was added to Posey and Marc’s bedroom ceiling. The couple then turned their attention to the interiors, working with A Blind Pash Interiors to create a distinctive English cottage-inspired aesthetic, reminiscent of projects by UK designer Sean Symington. Colour and pattern are integral to this style, enabling Posey to be bold with prints, feminine hues, and luxurious textiles — something she can’t do in her everyday working life! She explains, ‘I have to wear black to work, but apart from my salon wardrobe, I don’t own anything black — it’s all colour! ‘When we finished the renovation I could take a step back and see wow, I really do have a signature style!’ Both the bedroom and laundry are now drenched in printed wallpaper, complemented by deliberately clashing patterns across the lamp shades, curtains, cushions, and furniture. The kitchen follows suit with a more subtle, but equally romantic, use of pink colour across the island bench (Dulux Light Blush), upholstered seating in check Anna Spiro Textiles fabric, and floral printed blinds. Inspiration was also taken from Posey’s late mother’s home and the items she cherished, including a reupholstered chair that now lives in the playroom, and a framed tapestry above the living room fireplace. Posey and Marc’s home renovation took almost six years — the result of a lot of DIY around a pandemic, and the arrival of a third baby (Kit, now 3) after twins — but the result is truly bespoke, beautiful, and welcoming. ‘It’s fun and colourful and feels like a home should – warm and joyful,’ says Posey. ‘It’s very much a comfortable home too — the kids have the run of the house and we let them eat snacks on the sofa. The toys spill into every room and they always have friends around.’",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2024/10/posey-tdf-homes4-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003ePosey and Marc Broomhall kept missing out at auctions when a real estate agent alerted them to a 1930s home for sale in Brighton.\u003c/h3\u003e\n\u003cp\u003eThe only issue — the house wasn’t in a state to be photographed.\u003c/p\u003e\n\u003cp\u003e‘It was a real wreck, some of the rooms were almost derelict,’ recalls Posey, who is the founder of \u003ca href=\"https://harpohair.com.au/\" target=\"_blank\" rel=\"noopener\"\u003eHarpo Hair\u003c/a\u003e and sleepwear label \u003ca href=\"https://bompies.com.au/\" target=\"_blank\" rel=\"noopener\"\u003eBompies\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eRegardless, the couple took a chance on the Melbourne property and saw potential in its bones. ‘We put an offer in straight away after viewing the house,’ Posey says.\u003c/p\u003e\n\u003cp\u003eThe couple and their twins (Archie and Dusty, now 7) moved into the home before embarking on a renovation to revive and enhance its original design.\u003c/p\u003e\n\u003cp\u003eFirstly, the floor plan was reconfigured, switching the main bedroom and living areas so the latter could appreciate backyard views.\u003c/p\u003e\n\u003cp\u003eThe children’s bedroom was also enlarged by removing dead hallway space, and some height was added to Posey and Marc’s bedroom ceiling.\u003c/p\u003e\n\u003cp\u003eThe couple then turned their attention to the interiors, working with \u003ca href=\"https://www.ablindpash.com\"\u003eA Blind Pash Interiors\u003c/a\u003e to create a distinctive English cottage-inspired aesthetic, reminiscent of projects by UK designer \u003ca href=\"https://seansymington.com/\"\u003eSean Symington\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eColour and pattern are integral to this style, enabling Posey to be bold with prints, feminine hues, and luxurious textiles — something she can’t do in her everyday working life! She explains, ‘I have to wear black to work, but apart from my salon wardrobe, I don’t own anything black — it’s all colour!\u003c/p\u003e\n\u003cp\u003e‘When we finished the renovation I could take a step back and see wow, I really do have a signature style!’\u003c/p\u003e\n\u003cp\u003eBoth the bedroom and laundry are now drenched in printed wallpaper, complemented by deliberately clashing patterns across the lamp shades, curtains, cushions, and furniture.\u003c/p\u003e\n\u003cp\u003eThe kitchen follows suit with a more subtle, but equally romantic, use of pink colour across the island bench (\u003ca href=\"https://www.dulux.com.au/specifier/colour/s01/light-blush/\" target=\"_blank\" rel=\"noopener\"\u003eDulux Light Blush\u003c/a\u003e), upholstered seating in check \u003ca href=\"https://www.annaspirotextiles.com.au/\" target=\"_blank\" rel=\"noopener\"\u003eAnna Spiro Textiles\u003c/a\u003e fabric, and floral printed blinds.\u003c/p\u003e\n\u003cp\u003eInspiration was also taken from Posey’s late mother’s home and the items she cherished, including a reupholstered chair that now lives in the playroom, and a framed tapestry above the living room fireplace.\u003c/p\u003e\n\u003cp\u003ePosey and Marc’s home renovation took almost six years — the result of a lot of DIY around a pandemic, and the arrival of a third baby (Kit, now 3) after twins — but the result is truly bespoke, beautiful, and welcoming.\u003c/p\u003e\n\u003cp\u003e‘It’s fun and colourful and feels like a home should – warm and joyful,’ says Posey.\u003c/p\u003e\n\u003cp\u003e‘It’s very much a comfortable home too — the kids have the run of the house and we let them eat snacks on the sofa. The toys spill into every room and they always have friends around.’\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
