{
  "id": "8e7bd8b1-d8ce-41bb-b93a-ca5be8d9dfda",
  "title": "How to Make the Fluffiest Stuffed Fabric Pumpkin Pillows",
  "link": "https://www.thriftydecorchick.com/2021/10/how-to-make-fluffy-fabric-stuffed-pumpkins.html",
  "description": "How to make the softest fabric pumpkin pillows without a sewing machine.  These cute stuffed pumpkins are SO soft and will look great in your fall decor, or would work as cute pillows on chairs or sofas. It's easy to make fabric pumpkins and no sewing machine or experience is needed.  They are an easy knock off of the expensive Pottery Barn teddy bear pumpkin pillows. :) When I first saw those adorable stuffed pumpkins, I knew I had to make some of my own.  I ended up making a bunch of them for the price of ONE from the store. This is when I really love DIY! This post may contain affiliate links for your convenience. I may earn a small commission when you make a purchase through links.  See my policies and disclosure page for more information.     These fluffy \"teddy bear\" fabric pumpkins were my inspiration for this project. I thought they were the cutest pumpkins/pillows -- so soft and fluffy!  But the price...nope. At least when I knew I could recreate them for a fraction of what they are charging.  I went to the craft store in search of the softest, fluffiest fabric I could find. I got three colors in very similar fabrics -- one light cream, one medium brown and one dark brown.  They are all SO SOFT and cozy. I just loved all three. The dark fabric is what I think is considered the true \"teddy bear\" fabric, but they all worked beautifully for this project.  I've never made my own fabric pumpkins, but I figured it out along the way. My first method worked OK, but then I did a little research and will be sharing the instructions I ended up using for the rest of the pumpkins.  This DIY fabric pumpkin how-to will work with both the fluffy fabrics I'm using and thinner options for cotton or velvet pumpkins.  First up, cut a rounded square or circle out of your fabric in the size you want:  Read the full postThis content is property of Thrifty Decor Chick LLC. If you are reading this on any other site other than www.thriftydecorchick.com or one of the blog's social media platforms, please contact TDC immediately (thriftydecorchick at gmail dot com). Any other use of this content is strictly forbidden.",
  "author": "Thrifty Decor Chick",
  "published": "Thu, 22 Aug 2024 15:53:00 +0000",
  "source": "http://feeds.feedburner.com/blogspot/ZBcZ",
  "categories": [
    "crafts",
    "DIY",
    "fabric",
    "Fall/Halloween"
  ],
  "byline": "Thrifty Decor Chick",
  "length": 8097,
  "excerpt": "How to make the softest fabric pumpkin pillows without a sewing machine. These cute stuffed pumpkins are SO soft a...",
  "siteName": "Sarah Hayes",
  "favicon": "",
  "text": "How to make the softest fabric pumpkin pillows without a sewing machine.  These cute stuffed pumpkins are SO soft and will look great in your fall decor, or would work as cute pillows on chairs or sofas. It's easy to make fabric pumpkins and no sewing machine or experience is needed.  They are an easy knock off of the expensive Pottery Barn teddy bear pumpkin pillows. :) When I first saw those adorable stuffed pumpkins, I knew I had to make some of my own.  I ended up making a bunch of them for the price of ONE from the store. This is when I really love DIY! This post may contain affiliate links for your convenience. I may earn a small commission when you make a purchase through links.  These fluffy \"teddy bear\" fabric pumpkins were my inspiration for this project. I thought they were the cutest pumpkins/pillows -- so soft and fluffy!  But the price...nope. At least when I knew I could recreate them for a fraction of what they are charging.  I went to the craft store in search of the softest, fluffiest fabric I could find. I got three colors in very similar fabrics -- one light cream, one medium brown and one dark brown.  They are all SO SOFT and cozy. I just loved all three. The dark fabric is what I think is considered the true \"teddy bear\" fabric, but they all worked beautifully for this project.  I've never made my own fabric pumpkins, but I figured it out along the way. My first method worked OK, but then I did a little research and will be sharing the instructions I ended up using for the rest of the pumpkins.  This DIY fabric pumpkin how-to will work with both the fluffy fabrics I'm using and thinner options for cotton or velvet pumpkins.  First up, cut a rounded square or circle out of your fabric in the size you want:  The width of your fabric will depend on the size you want for your pumpkin. I made my large pumpkin with a size about 16-18 inches across.  I highly recommend fabric scissors if you work on projects like this often -- they make it way easier to cut, especially fluffy stuff like this! It turns out you really don't have to cut down your fabric corners -- I found it actually worked fine to leave it a square shape. The corners help fill in the middle part where your stem will go later.  On my first try, I just simply gathered all of the fabric at the top, wrapped it with twine to secure and then cut off of the excess.  I was left with this part:  I flipped it over and added my \"stem\" at the top. It was a little difficult to wrangle all of the fabric together and tie it, and the stem wasn't secured well when I was done.  So I switched to this method, which was really easy with this fabric.  This goes super fast and I promise you don't need to know any sewing experience to do this. Just weave it in and out loosely like I did above.  It doesn't need to be perfect -- you won't even see the thread when you're done! Once you've got it around the circumference of the fabric, you can take each end of the embroidery thread and pull them together to start closing the pumpkin like so:  Before you close it all the way up, you'll want to start filling it with fiber fill. I used about two and a half one pound bags to do nine stuffed pumpkins.  Fiber fill from old pillows or pillow inserts works great for this as well! I always recommend pulling the fill apart a few times to fluff it up before inserting:  It will go a lot further if you do this first! I don't recommend stuffing it completely full at this point, as it's harder to close if overstuffed. You'll want to add some additional stuffing to fill up parts later. Once you've got it filled up to your liking (pull your thread together at the top to see how full it is), you can tie it up, but leave some some space for your stem and for a little final stuffing! At this point you can add your stem and be done if you want -- the \"pillow\" will have a shape that already resembles a pumpkin.  But I wanted the defined sections like the inspiration pillows, and I think they just look more like a real pumpkin anyway. :)  I grabbed my jute twine and started at the top by the hole for the stem, then wrapped the twine tightly around the pumpkin back to the top.  Here's a view of the bottom of the pumpkin so you can see how I was wrapping the twine around:  Leave some excess twine at the top that you can tie each pass around the pumpkin to.  Each time you wrap the pumpkin, tie it off in a knot on top of the pumpkin to keep the jute as tight as possible:  I would wrap with twine, knot it at the top to secure, then take the twine around in another direction, knot, and repeat until I had all the \"sections\" I wanted. You'll be left with a hole that you can still fit a stem into: By the way, I have no clue if this is how it's \"supposed\" to be done. I was winging this for the most part. :) But it worked well and went fast! Before you add the stem, you'll want to fluff up the pumpkin a bit more. Take more fiber fill and tuck it inside and up into to top of the pillow to fill in any flat parts. The fluffier the better! For the stem you can use just about anything that resembles the shape. Cut branches from outside would work without any additional steps.  I wanted ours to be a bit thicker, so I used the extra stems I used for the trunk of my DIY olive tree.  I cut them down and then wrapped with jute using my hot glue gun:  This process seems tedious but it actually goes super quick -- each one only took a minute or two.  If I needed my stem to be thicker to fill the center hole a bit more, I just wrapped it with twine twice to make it a bit wider.  I loaded up the bottom of the stems with hot glue and stuck them into the middle of the pumpkins. They aren't crazy secure -- plenty enough, but I won't be grabbing them by the stem to carry them around.  (If you know of a more secure way to add the stem, please share!) I was planning to make three, but I loved these cute stuffed pumpkin SO much, I kept going.  They are SO CUTE!: The fabric went a long way -- I got less than a half of a yard in each color and was able to make nine pillows. I even have a little extra fabric leftover.  Aren't they adoyable?? (As my niece says.): They are so incredibly soft and I just love them.  The best part? I made all of mine with $30 worth of fabric and fill -- and the smallest Pottery Barn teddy bear pumpkin is $29.  Soooo I got nine for the price of ONE: No shame in buying, believe me...sometimes it's the only way to go in my mind. But if you like the look of these stuffed pumpkins, it's worth trying to make your own for way less! You can't beat nine for the price of one!  This would be such a fun craft project to do with friends or older kids for a craft night.  Try using old sweaters or blankets to make these stuffed pumpkins as well! Have you tried making your own fabric pumpkins?  You can pin this tutorial for later using this image:",
  "image": "https://blogger.googleusercontent.com/img/a/AVvXsEh8RUXuxWBtFTyAWqMFdKYj21oAKEZ3NSiKke5XSzB9B_7ivtuMOX1KRtG30030C52vzIhHL_b0EfWliz01gHJRgif3NmOv0oTk1fZsxU8dxWUhlqgDwYgTohph87eSPWD7n28vfJYVkC9-O-39fYp7ZP4UczYE8PK88Lnt-iaNN6hj2EnT4z8Q8DBG=s16000",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n  \u003ch2\u003e\n    How to make the softest fabric pumpkin pillows without a sewing\n    machine. \n  \u003c/h2\u003e\n  \n  \u003cp\u003e\n    These cute stuffed pumpkins are SO soft and will look great in your fall\n    decor, or would work as cute pillows on chairs or sofas. It\u0026#39;s easy to make\n    fabric pumpkins and \u003cb\u003eno\u003c/b\u003e sewing machine or experience is needed. \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    They are an easy knock off of the expensive Pottery Barn teddy bear pumpkin\n    pillows. :) When I first saw those adorable stuffed pumpkins, I knew I had\n    to make some of my own. \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    I ended up making a bunch of them for the price of ONE from the store. This\n    is when I \u003ci\u003ereally\u003c/i\u003e love DIY!\n  \u003c/p\u003e\n  \n  \u003cdiv\u003e\n    \u003cp\u003e\u003ci\u003eThis post may contain affiliate links for\n        your convenience.\u003c/i\u003e\n    \u003c/p\u003e\n    \u003cp\u003e\u003ci\u003eI may earn a small commission when \u003c/i\u003e\u003ci\u003eyou make a purchase through links. \u003c/i\u003e\n    \u003c/p\u003e\n    \n  \u003c/div\u003e\n  \n  \u003cp\u003e\n    These\n    \u003ca href=\"https://rstyle.me/+NeSeazsD-jb0MxPM0_JVFg\" rel=\"nofollow\" target=\"_blank\"\u003efluffy \u0026#34;teddy bear\u0026#34; fabric pumpkins\u003c/a\u003e\n    were my inspiration for this project. I thought they were the cutest\n    pumpkins/pillows -- so soft and fluffy! \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    But the price...\u003ci\u003enope\u003c/i\u003e. At least when I knew I could recreate them for\n    a fraction of what they are charging. \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    I went to the craft store in search of the softest, fluffiest fabric I could\n    find. I got three colors in very similar fabrics -- one light cream, one\n    medium brown and one dark brown. \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    They are all SO SOFT and cozy. I just loved all three. The dark fabric is\n    what I think is considered the true \u0026#34;teddy bear\u0026#34; fabric, but they all worked\n    beautifully for this project. \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    I\u0026#39;ve never made my own fabric pumpkins, but I figured it out along the way.\n    My first method worked OK, but then I did a little research and will be\n    sharing the instructions I ended up using for the rest of the\n    pumpkins. \n  \u003c/p\u003e\n  \n  \n  \u003cblockquote\u003e\n    \u003cp\u003e\n      This DIY fabric pumpkin how-to will work with both the fluffy fabrics I\u0026#39;m\n      using and thinner options for cotton or velvet pumpkins. \n    \u003c/p\u003e\n    \n  \u003c/blockquote\u003e\n  \n  \u003cp\u003e\n    First up, cut a rounded square or circle out of your fabric in the size you\n    want: \n  \u003c/p\u003e\n  \n  \u003cp\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/a/AVvXsEh8RUXuxWBtFTyAWqMFdKYj21oAKEZ3NSiKke5XSzB9B_7ivtuMOX1KRtG30030C52vzIhHL_b0EfWliz01gHJRgif3NmOv0oTk1fZsxU8dxWUhlqgDwYgTohph87eSPWD7n28vfJYVkC9-O-39fYp7ZP4UczYE8PK88Lnt-iaNN6hj2EnT4z8Q8DBG=s1867\"\u003e\u003cimg alt=\"fluffy teddy bear fabric for DIY pumpkins\" data-original-height=\"1867\" data-original-width=\"1400\" loading=\"lazy\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEh8RUXuxWBtFTyAWqMFdKYj21oAKEZ3NSiKke5XSzB9B_7ivtuMOX1KRtG30030C52vzIhHL_b0EfWliz01gHJRgif3NmOv0oTk1fZsxU8dxWUhlqgDwYgTohph87eSPWD7n28vfJYVkC9-O-39fYp7ZP4UczYE8PK88Lnt-iaNN6hj2EnT4z8Q8DBG=s16000-rw\"/\u003e\u003c/a\u003e\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    The width of your fabric will depend on the size you want for your pumpkin.\n    I made my large pumpkin with a size about 16-18 inches across. \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    I highly recommend\n    \u003ca href=\"https://amzn.to/2YceR2k\" rel=\"nofollow\" target=\"_blank\"\u003efabric scissors\u003c/a\u003e\n    if you work on projects like this often -- they make it \u003ci\u003eway\u003c/i\u003e easier to\n    cut, especially fluffy stuff like this!\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    It turns out you really don\u0026#39;t have to cut down your fabric corners -- I\n    found it actually worked fine to leave it a square shape. The corners help\n    fill in the middle part where your stem will go later. \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    On my first try, I just simply gathered all of the fabric at the top,\n    wrapped it with twine to secure and then cut off of the excess. \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    I was left with this part: \u003cspan\u003e\u003c/span\u003e\n  \u003c/p\u003e\n  \u003cp\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/a/AVvXsEjWVzPh8E4QNW9U2k56BaAgrOIIEmotPzsu2yVt2IXF82bwDzxSlZ4T-x3fYLTKQ7_yNqi8mwF1XKtctAHyCtchF6sezcjtZuYQMV2OHTZSpx7RiA7NTdezHSVH_af0GNW0ytdoMGX7OJIWWhxXgIJy1RuyKdoSEH4SaaAQoYGboRIp-KtntomR9uZN=s1867\"\u003e\u003cimg alt=\"no sew fabric pumpkins\" data-original-height=\"1867\" data-original-width=\"1400\" loading=\"lazy\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEjWVzPh8E4QNW9U2k56BaAgrOIIEmotPzsu2yVt2IXF82bwDzxSlZ4T-x3fYLTKQ7_yNqi8mwF1XKtctAHyCtchF6sezcjtZuYQMV2OHTZSpx7RiA7NTdezHSVH_af0GNW0ytdoMGX7OJIWWhxXgIJy1RuyKdoSEH4SaaAQoYGboRIp-KtntomR9uZN=s16000-rw\"/\u003e\u003c/a\u003e\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    I flipped it over and added my \u0026#34;stem\u0026#34; at the top. It was a little difficult\n    to wrangle all of the fabric together and tie it, and the stem wasn\u0026#39;t\n    secured well when I was done. \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    So I switched to this method, which was really easy with this fabric. \n  \u003c/p\u003e\n  \n  \n  \u003cp\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/a/AVvXsEiKqrYP0fKDEkVYJoc-lW4Mg9f6Mg5ejMpPvvnIK0jGwei9zVuRP6fjf4KB03Ddm-zzLmjUWfGtAi91CxtobYnyokt9-zeeKbGd3epjpoXgEtPvd9I96hu3bwpktVQDEsZoktnXIdIpscGiJoEoonU_S4HcgnkUyr2YviF0SMRJpP2XZ6Z1ZRZ0ARDh=s2001\"\u003e\u003cimg alt=\"easy sewing fabric pumpkins\" data-original-height=\"2001\" data-original-width=\"1400\" loading=\"lazy\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEiKqrYP0fKDEkVYJoc-lW4Mg9f6Mg5ejMpPvvnIK0jGwei9zVuRP6fjf4KB03Ddm-zzLmjUWfGtAi91CxtobYnyokt9-zeeKbGd3epjpoXgEtPvd9I96hu3bwpktVQDEsZoktnXIdIpscGiJoEoonU_S4HcgnkUyr2YviF0SMRJpP2XZ6Z1ZRZ0ARDh=s16000-rw\"/\u003e\u003c/a\u003e\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    This goes super fast and I promise you don\u0026#39;t need to know any sewing\n    experience to do this. Just weave it in and out loosely like I did\n    above. \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    It doesn\u0026#39;t need to be perfect -- you won\u0026#39;t even see the thread when you\u0026#39;re\n    done!\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    Once you\u0026#39;ve got it around the circumference of the fabric, you can take each\n    end of the embroidery thread and pull them together to start closing the\n    pumpkin like so: \n  \u003c/p\u003e\n  \u003cp\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/a/AVvXsEgmoEoSVzE4xWJaE6tk_6irrh-LJzW9t5mvTctCi5cHPO0Iubnm3l-OHCs3xdxLom47or7Mjv-jNi8WTvkhbEUsvCBXVqHrYAaMCYxVcplXiUh9wl1LDg-VsYF6SGU1QhvnqLu5Nz0IqGZpigxb-qWkdoSDKXyn9jg8PPR-mWlLlFfHwFC13Swi6p-_=s1867\"\u003e\u003cimg alt=\"fabric pumpkins no sewing machine\" data-original-height=\"1867\" data-original-width=\"1400\" loading=\"lazy\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEgmoEoSVzE4xWJaE6tk_6irrh-LJzW9t5mvTctCi5cHPO0Iubnm3l-OHCs3xdxLom47or7Mjv-jNi8WTvkhbEUsvCBXVqHrYAaMCYxVcplXiUh9wl1LDg-VsYF6SGU1QhvnqLu5Nz0IqGZpigxb-qWkdoSDKXyn9jg8PPR-mWlLlFfHwFC13Swi6p-_=s16000-rw\"/\u003e\u003c/a\u003e\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    Before you close it all the way up, you\u0026#39;ll want to start filling it with\n    \u003ca href=\"https://amzn.to/3F3ComZ\" rel=\"nofollow\" target=\"_blank\"\u003efiber fill\u003c/a\u003e. I used about two and a half one pound bags to do nine stuffed\n    pumpkins. \n  \u003c/p\u003e\n  \n  \u003cdiv\u003e\n    \u003cblockquote\u003e\n      Fiber fill from old pillows or pillow inserts works great for this as\n      well!\n    \u003c/blockquote\u003e\n  \u003c/div\u003e\n  \n  \u003cp\u003e\n    I always recommend pulling the fill apart a few times to fluff it up before\n    inserting: \n  \u003c/p\u003e\n  \u003cp\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/a/AVvXsEjEPn5oHTsp4gKHDozhz9Rb9XMP8fKhB39bwv4is2UQA_KUUI2Ea6mJbZ7qCFOd9V1HFhZgSXx-JzmigjmSJYx-DA8p6X8uPRWlGaETx31pUhst8f5I0clM6dKZ-YRKCC0wm4cgO3akN3KyAf46m15LU-8pZUMqrRMb9FDkGUi4jv3NdRTqPrBBYEwY=s1867\"\u003e\u003cimg alt=\"fluff up fiber fill\" data-original-height=\"1867\" data-original-width=\"1400\" loading=\"lazy\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEjEPn5oHTsp4gKHDozhz9Rb9XMP8fKhB39bwv4is2UQA_KUUI2Ea6mJbZ7qCFOd9V1HFhZgSXx-JzmigjmSJYx-DA8p6X8uPRWlGaETx31pUhst8f5I0clM6dKZ-YRKCC0wm4cgO3akN3KyAf46m15LU-8pZUMqrRMb9FDkGUi4jv3NdRTqPrBBYEwY=s16000-rw\"/\u003e\u003c/a\u003e\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    It will go a lot further if you do this first!\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    I don\u0026#39;t recommend stuffing it completely full at this point, as it\u0026#39;s harder\n    to close if overstuffed. You\u0026#39;ll want to add some additional stuffing to fill\n    up parts later.\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    Once you\u0026#39;ve got it filled up to your liking (pull your thread together at\n    the top to see how full it is), you can tie it up, but leave some some space\n    for your stem and for a little final stuffing!\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    At this point you can add your stem and be done if you want -- the \u0026#34;pillow\u0026#34;\n    will have a shape that already resembles a pumpkin. \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    But I wanted the defined sections like the inspiration pillows, and I think\n    they just look more like a real pumpkin anyway. :) \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    I grabbed my\n    \u003ca href=\"https://amzn.to/3D08X3l\" rel=\"nofollow\" target=\"_blank\"\u003ejute twine\u003c/a\u003e\n    and started at the top by the hole for the stem, then wrapped the twine\n    tightly around the pumpkin back to the top. \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    Here\u0026#39;s a view of the bottom of the pumpkin so you can see how I was wrapping\n    the twine around: \n  \u003c/p\u003e\n  \u003cp\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/a/AVvXsEhICQQqQYkJNH2rIuhsBm_czkBqV06pL_blXe8i71_7gCT6CXObG7M9Swp-jq0Y-vcxAOSWyDxMj_IPVbd7L0Xie4qNNLsIiLtCL0mlZAM-rLa6I2zvyNdG6L-O9XpW5Vmx7iBIKaYBIVUhEbHdlWQrNPKMPE5jNG534nQbxnEXVcDJEKufJlw-1rCx=s1867\"\u003e\u003cimg alt=\"fluffy fabric DIY pumpkin tutorial\" data-original-height=\"1867\" data-original-width=\"1400\" loading=\"lazy\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEhICQQqQYkJNH2rIuhsBm_czkBqV06pL_blXe8i71_7gCT6CXObG7M9Swp-jq0Y-vcxAOSWyDxMj_IPVbd7L0Xie4qNNLsIiLtCL0mlZAM-rLa6I2zvyNdG6L-O9XpW5Vmx7iBIKaYBIVUhEbHdlWQrNPKMPE5jNG534nQbxnEXVcDJEKufJlw-1rCx=s16000-rw\"/\u003e\u003c/a\u003e\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    Leave some excess twine at the top that you can tie each pass around the\n    pumpkin to. \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    Each time you wrap the pumpkin, tie it off in a knot on top of the pumpkin\n    to keep the jute as tight as possible: \n  \u003c/p\u003e\n  \u003cp\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/a/AVvXsEjgWjEB9jBVVyFS7G6P51KICeUG4JZyPKpH-CY5y8GnvVTRD-0I5-Mu0j2orWPiSlnygvAVAO_wtk0B0LFZ_zVFhjksQeCSjNebmLombH4tKrGGJn8jf4la5Bimh5-IsSxUL57GPcx5oKK_-_4S5r79LGuPQJGzZlSn1cMa0aq0qyPUAhAEdLP9nb3b=s1867\"\u003e\u003cimg alt=\"using jute to make fabric pumpkins\" data-original-height=\"1867\" data-original-width=\"1400\" loading=\"lazy\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEjgWjEB9jBVVyFS7G6P51KICeUG4JZyPKpH-CY5y8GnvVTRD-0I5-Mu0j2orWPiSlnygvAVAO_wtk0B0LFZ_zVFhjksQeCSjNebmLombH4tKrGGJn8jf4la5Bimh5-IsSxUL57GPcx5oKK_-_4S5r79LGuPQJGzZlSn1cMa0aq0qyPUAhAEdLP9nb3b=s16000-rw\"/\u003e\u003c/a\u003e\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    I would wrap with twine, knot it at the top to secure, then take the twine\n    around in another direction, knot, and repeat until I had all the \u0026#34;sections\u0026#34;\n    I wanted.\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    You\u0026#39;ll be left with a hole that you can still fit a stem into:\n  \u003c/p\u003e\n  \u003cp\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/a/AVvXsEgu5mNU-LTmNDF4kmUFMEAEjPuZ0vTZlTEVTBDOMFoFyU6kLpieI-sMYbMWgNrDD8zjeYsKJV5J4PVeO934_Hi0RaDvyJ9Um-qypQyFv9O9H9WOgu4-Ke2Z7lniegym8EOvHlrJgjUrshiJAZjt8SaMUmIzwLOb1_oBELY-YSctniE6779323_fiZmm=s1867\"\u003e\u003cimg alt=\"how to make fluffy stuffed pumpkins\" data-original-height=\"1867\" data-original-width=\"1400\" loading=\"lazy\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEgu5mNU-LTmNDF4kmUFMEAEjPuZ0vTZlTEVTBDOMFoFyU6kLpieI-sMYbMWgNrDD8zjeYsKJV5J4PVeO934_Hi0RaDvyJ9Um-qypQyFv9O9H9WOgu4-Ke2Z7lniegym8EOvHlrJgjUrshiJAZjt8SaMUmIzwLOb1_oBELY-YSctniE6779323_fiZmm=s16000-rw\"/\u003e\u003c/a\u003e\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    By the way, I have no clue if this is how it\u0026#39;s \u0026#34;supposed\u0026#34; to be done. I was\n    winging this for the most part. :) But it worked well and went fast!\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    Before you add the stem, you\u0026#39;ll want to fluff up the pumpkin a bit more.\n    Take more fiber fill and tuck it inside and up into to top of the pillow to\n    fill in any flat parts. The fluffier the better!\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    For the stem you can use just about anything that resembles the shape. Cut\n    branches from outside would work without any additional steps. \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    I wanted ours to be a bit thicker, so I used the extra stems I used for the\n    trunk of \u003ca href=\"https://www.thriftydecorchick.com/2021/02/DIY-fake-olive-tree-for-less.html\"\u003emy DIY olive tree\u003c/a\u003e. \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    I cut them down and then wrapped with jute using my hot glue gun: \n  \u003c/p\u003e\n  \u003cp\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/a/AVvXsEhlAvDV54Zk5aQgw4dVCPAxO9pIWW0Rrd9WSCaHtLmF7HyMn5cvmOladeTryRRKYJVLQ2ILTvY6WAZ2qzYyZQqbOuYfCj9-Ts_Q91H8AtCiu15HRP02CBZTjFcHzcbxPlUJL8r4CguVGNdpDjMhqyHLc9qLXbQEiGOrnRWEHDRjqBLrLMQcj6IUj_Oz=s1867\"\u003e\u003cimg alt=\"DIY pumpkin stem with jute\" data-original-height=\"1867\" data-original-width=\"1400\" loading=\"lazy\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEhlAvDV54Zk5aQgw4dVCPAxO9pIWW0Rrd9WSCaHtLmF7HyMn5cvmOladeTryRRKYJVLQ2ILTvY6WAZ2qzYyZQqbOuYfCj9-Ts_Q91H8AtCiu15HRP02CBZTjFcHzcbxPlUJL8r4CguVGNdpDjMhqyHLc9qLXbQEiGOrnRWEHDRjqBLrLMQcj6IUj_Oz=s16000-rw\"/\u003e\u003c/a\u003e\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    This process seems tedious but it actually goes super quick -- each one only\n    took a minute or two. \n  \u003c/p\u003e\n  \n  \u003cdiv\u003e\n    \u003cblockquote\u003e\n      If I needed my stem to be thicker to fill the center hole a bit more, I\n      just wrapped it with twine twice to make it a bit wider. \n    \u003c/blockquote\u003e\n  \u003c/div\u003e\n  \n  \u003cp\u003e\n    I loaded up the bottom of the stems with hot glue and stuck them into the\n    middle of the pumpkins. They aren\u0026#39;t crazy secure -- plenty enough, but I\n    won\u0026#39;t be grabbing them by the stem to carry them around. \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    (If you know of a more secure way to add the stem, please share!)\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    I was planning to make three, but I loved these cute stuffed pumpkin SO\n    much, I kept going. \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    They are SO CUTE!:\n  \u003c/p\u003e\n  \u003cp\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/a/AVvXsEgzoAsNu1KT48-9_75LSnShrN1XPHFERMsgEZI6EtT_NadXKMOWio3IkSwQOd8Jbnen2ObfW2cuxlDwd3264Dh8Y9CKszO-GW_SR-K_9gbMGq4mkupqrnGH60COfzmz7kXSLAICgUBoTqy5khtj6yKF2wwnwRvK63itTQ9pBZdrFmLeu97ajx2DQSce=s1867\"\u003e\u003cimg alt=\"teddy bear fabric pumpkins\" data-original-height=\"1867\" data-original-width=\"1400\" loading=\"lazy\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEgzoAsNu1KT48-9_75LSnShrN1XPHFERMsgEZI6EtT_NadXKMOWio3IkSwQOd8Jbnen2ObfW2cuxlDwd3264Dh8Y9CKszO-GW_SR-K_9gbMGq4mkupqrnGH60COfzmz7kXSLAICgUBoTqy5khtj6yKF2wwnwRvK63itTQ9pBZdrFmLeu97ajx2DQSce=s16000-rw\"/\u003e\u003c/a\u003e\n  \u003c/p\u003e\n  \n  \u003cp\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/a/AVvXsEh1i2SUJRD7ZEL3JPOE5cL-Eg_NaFk8P3QEZUCc5mJXdjQHclpp5QCvLvidiXeqnVIieWuwILJTjatk3ZtADNMf0Gtc_8b3rfdxGggFUXzeoBOCuch0lkijLMbi6dTMimGjc1lt2KTKvAvtDXsMVWkyvkwK3nKucbDVxeORo_E69Z7jIs6dELHr7loJ=s1867\"\u003e\u003cimg alt=\"knock off Pottery Barn teddy bear pumpkins\" data-original-height=\"1867\" data-original-width=\"1400\" loading=\"lazy\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEh1i2SUJRD7ZEL3JPOE5cL-Eg_NaFk8P3QEZUCc5mJXdjQHclpp5QCvLvidiXeqnVIieWuwILJTjatk3ZtADNMf0Gtc_8b3rfdxGggFUXzeoBOCuch0lkijLMbi6dTMimGjc1lt2KTKvAvtDXsMVWkyvkwK3nKucbDVxeORo_E69Z7jIs6dELHr7loJ=s16000-rw\"/\u003e\u003c/a\u003e\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    The fabric went a long way -- I got less than a half of a yard in each color\n    and was able to make nine pillows. I even have a little extra fabric\n    leftover. \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    Aren\u0026#39;t they \u003ci\u003eadoyable\u003c/i\u003e?? (As my niece says.):\n  \u003c/p\u003e\n  \u003cp\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/a/AVvXsEjw7lQmfnPFAR6WRee-2uMEU7gjoVq8hV5xET7OAigoHF2QQihvhE7pC3mUvL34wuVNnqiBMlr0VBh2TE3hfmKjZz-MGZOB57UCwQv7Ji0Lnw6aJvxmC89AOUIAyhIuJGNOjuANP6YfStrCwKJE43TDBysOrI01YdA1btI3ERQtrG-F6vAGPesPcYHX=s1867\"\u003e\u003cimg alt=\"DIY white, cream and brown fabric pumpkins\" data-original-height=\"1867\" data-original-width=\"1400\" loading=\"lazy\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEjw7lQmfnPFAR6WRee-2uMEU7gjoVq8hV5xET7OAigoHF2QQihvhE7pC3mUvL34wuVNnqiBMlr0VBh2TE3hfmKjZz-MGZOB57UCwQv7Ji0Lnw6aJvxmC89AOUIAyhIuJGNOjuANP6YfStrCwKJE43TDBysOrI01YdA1btI3ERQtrG-F6vAGPesPcYHX=s16000-rw\"/\u003e\u003c/a\u003e\n  \u003c/p\u003e\n  \n  \u003cp\u003e\u003ca href=\"https://www.thriftydecorchick.com/2021/10/how-to-make-fluffy-fabric-stuffed-pumpkins.html\"\u003e\u003cimg alt=\"DIY fluffy fabric pumpkin decor\" data-original-height=\"1867\" data-original-width=\"1400\" loading=\"lazy\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEi42vPmEGzMkDeWA_i45EKO2fDZpbkB4496CjSrXgFD8IF75wehQqt_vB087lCued7kbk7c9t0Sp4lwobewrJN7F2AyN5IhHz5eFNw3Tdetda8yjTy1mhI8EA1kS0-RhvJVsBiYo-RdLDiFFUnaw8gcSsyH4LKht8DxuFYQQsNSWJ-rhys_-HF21rl4=s16000-rw\"/\u003e\u003c/a\u003e\n  \u003c/p\u003e\n  \n  \u003cp\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/a/AVvXsEhftr0ZMQEtzcc1pXEffOFbsMZg6q3-K3hDpRDhsQMFNyieglWEbVrNn9iuJHQxOv9Xxq3S7zg5LVSJMJsmqoM9W26TzZgY5RNty6L_7FyIjSVyR5FGrpqhbVTz9iApJeevcXLjN5eISdC9WjSGtmXc_8TwyYqFZuyAcUx3OxqRYTQs0vD-NxdVGvQq=s1867\"\u003e\u003cimg alt=\"DIY soft fabric pumpkins\" data-original-height=\"1867\" data-original-width=\"1400\" loading=\"lazy\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEhftr0ZMQEtzcc1pXEffOFbsMZg6q3-K3hDpRDhsQMFNyieglWEbVrNn9iuJHQxOv9Xxq3S7zg5LVSJMJsmqoM9W26TzZgY5RNty6L_7FyIjSVyR5FGrpqhbVTz9iApJeevcXLjN5eISdC9WjSGtmXc_8TwyYqFZuyAcUx3OxqRYTQs0vD-NxdVGvQq=s16000-rw\"/\u003e\u003c/a\u003e\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    They are so incredibly soft and I just \u003cb\u003elove\u003c/b\u003e them. \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    The best part? I made all of mine with $30 worth of fabric and fill -- and\n    the smallest Pottery Barn teddy bear pumpkin is $29. \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    Soooo I got nine for the price of ONE:\n  \u003c/p\u003e\n  \u003cdiv\u003e\n    \u003cp\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/a/AVvXsEjGkGJzzLYIHyaeFHSs6JujSXuZN5HqwUwdAUPyrdJOk3PjkaWpetJBp5JM1v712LV_QhuekjuXjJNrOhaWWMm6IefftoaDh-AlZ2ZhvgOuqsLDW8vWShf81LMTwS_JJ6ujbxhJhg8AB2ZiVTn2CMGpH92xz7dMv85RZ02LtgK93y8TN7Yi2VJC7axY=s1867\"\u003e\u003cimg alt=\"soft fabric pumpkin fall decor\" data-original-height=\"1867\" data-original-width=\"1400\" loading=\"lazy\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEjGkGJzzLYIHyaeFHSs6JujSXuZN5HqwUwdAUPyrdJOk3PjkaWpetJBp5JM1v712LV_QhuekjuXjJNrOhaWWMm6IefftoaDh-AlZ2ZhvgOuqsLDW8vWShf81LMTwS_JJ6ujbxhJhg8AB2ZiVTn2CMGpH92xz7dMv85RZ02LtgK93y8TN7Yi2VJC7axY=s16000-rw\"/\u003e\u003c/a\u003e\n    \u003c/p\u003e\n    \u003cp\u003e\n    No shame in buying, believe me...sometimes it\u0026#39;s the only way to go in my\n    mind. But if you like the look of these stuffed pumpkins, it\u0026#39;s worth trying\n    to make your own for way less!\n  \u003c/p\u003e\u003c/div\u003e\n  \n  \u003cp\u003e\n    You can\u0026#39;t beat nine for the price of one! \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    This would be such a fun craft project to do with friends or older kids for\n    a craft night. \n  \u003c/p\u003e\n  \n  \u003cdiv\u003e\n    \u003cblockquote\u003e\n      Try using old sweaters or blankets to make these stuffed pumpkins as well!\n    \u003c/blockquote\u003e\n  \u003c/div\u003e\n  \n  \u003cp\u003e\n    Have you tried making your own fabric pumpkins? \n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    You can pin this tutorial for later using this image:\n  \u003c/p\u003e\n  \u003cp\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/a/AVvXsEi89a5miQeSR0RC8t00XU3Zs-fgcWIze67Rzvhb4L4pmc2Xn_ye0FbJsZ3v5sBvbrTTn5Bz6CtwTk3g5SxBAaHYydlT2kRsN_F0PXoDdXC6Tu-Uhfr7RkRHMNYVnNJHAceb6shXi7tHRM9nKQV-hTG-i7hUt2lFeMFDABCAl_vz5xGKhQbQc-VoDdsa=s1467\"\u003e\u003cimg alt=\"How to make fluffy stuffed pumpkins\" data-original-height=\"1467\" data-original-width=\"1100\" loading=\"lazy\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEi89a5miQeSR0RC8t00XU3Zs-fgcWIze67Rzvhb4L4pmc2Xn_ye0FbJsZ3v5sBvbrTTn5Bz6CtwTk3g5SxBAaHYydlT2kRsN_F0PXoDdXC6Tu-Uhfr7RkRHMNYVnNJHAceb6shXi7tHRM9nKQV-hTG-i7hUt2lFeMFDABCAl_vz5xGKhQbQc-VoDdsa=s16000-rw\"/\u003e\u003c/a\u003e\n  \u003c/p\u003e\n  \u003cbr/\u003e\n  \n  \n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-08-22T11:53:00-04:00",
  "modifiedTime": null
}
