{
  "id": "981d481f-b556-43c6-aa0f-0d7152cbce40",
  "title": "A Day In The Life With TDF’s Lucy Feagins At Melbourne Design Week",
  "link": "https://thedesignfiles.wpenginepowered.com/2025/05/a-day-in-the-life-lucy-mdw/",
  "description": "Melbourne Design Week is one of the times where our city really comes alive. The weather might be cooling down, but the annual festival creates such a buzz, with more than 350 events and exhibitions showcasing all things design, all around Melbourne. And this year’s program is already underway! Find out how The Design Files editor and founder Lucy Feagins spends a day out at Melbourne Design Week, presented by the NGV, supported by longstanding Major Partner Mercedes-Benz.",
  "author": "The Design Files",
  "published": "Wed, 21 May 2025 04:00:02 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 3633,
  "excerpt": "Find out what The Design Files editor Lucy Feagins gets up to during Melbourne Design Week.",
  "siteName": "",
  "favicon": "",
  "text": "As the editor and founder of The Design Files, Lucy Feagins has been going to Melbourne Design Week since its very inception in 2017. She’s watched the program get bigger and better year after year, with the Melbourne Art Book Fair a highly anticipated part of the program, alongside the ever-changing line-up of independent events that now feel like ‘the beating heart’ of Australia’s biggest design festival. ‘What I love most about Melbourne Design Week is the way it really brings together our city’s design community,’ Lucy says. ‘There’s always a great mix of familiar faces and emerging local designers, makers and retailers to discover — it feels like one time of year where everyone puts their best foot forward.’ Lucy spent a day zipping around Melbourne in the all-electric Mercedes-AMG EQE 53 SUV to share some of her favourite events from the 11-day festival, which is on until this Sunday May 25. ‘There a cluster of events in various locations across town, including Brunswick, North Melbourne, Collingwood, Fitzroy, and the CBD, so it’s worth mapping out your top picks and making a day of it like we did!’ Lucy adds. First Thing — Melbourne Art Book Fair First up, I visited the Melbourne Art Book Fair in the NGV’s Great Hall. It was amazing to browse more than 100 publishers showcasing books and magazines with a focus on art, design and architecture, as well as kids’ books, food and fashion. There really is something for everyone! The event was buzzing all weekend, and since we recently started our own bi-annual print magazine, we were lucky to have a stand for The Design Files Magazine this year! It was great to meet some of our readers in person and connect with a new audience too. Morning — 100 Lights I hopped in the all-electric Mercedes-AMG EQE 53 SUV to head to our next event. It was such a smooth, sleek car to drive and the oversized dashboard screen with navigation and voice control made dashing between different locations a breeze. The next car I buy will be electric, so I’m taking notes now! Hosted in North Melbourne’s Meat Market Stables, the 100 Lights showcase was so atmospheric. Curated by local designers Dale Hardiman and Tom Skeehan (known as Friends \u0026 Associates), the event brought together 100 table lamps, floor lamps, wall lights and pendant lights made by all Australian creatives. We have such a strong lighting design industry here in Melbourne, with skills across metalwork and glass blowing, and this exhibition really felt like a wonderful celebration of local manufacturing. Lunch We stopped to try the sandwiches at the Baguette Studios nearby at 15-27 Wreckyn St. Inspired by French and Korean flavours, the food was delicious and very instagrammable — highly recommend if you’re passing through North Melbourne during the festival! Afternoon — Introducing Knotte My last stop for the day was over in Collingwood for an exhibition by a new Sydney-based furniture brand, Knotte, who launched their first ever collection at Melbourne Design Week! It was a super impressive debut collection of modular seating: think plush, oversized shapes and lots of curves, in confident, bold colours. The exhibition was designed in collaboration with Melbourne art duo Oigall Projects, who created a series of stainless-steel panels and screens which served as a striking backdrop to the furniture pieces. Plus, the building itself had some incredible views overlooking the city! Overall, a super impressive debut, and I can’t wait to see more from Knotte. Mercedes-Benz is a Major Partner of Melbourne Design Week 2025. Find out more about the program and plan your visit here.",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2025/05/mercedes-tdf-spons8-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003eAs the editor and founder of The Design Files, Lucy Feagins has been going to \u003ca href=\"https://designweek.melbourne/\" target=\"_blank\" rel=\"noopener\"\u003eMelbourne Design Week\u003c/a\u003e since its very inception in 2017.\u003c/h3\u003e\n\u003cp\u003eShe’s watched the program get bigger and better year after year, with the Melbourne Art Book Fair a highly anticipated part of the program, alongside the ever-changing line-up of independent events that now feel like ‘the beating heart’ of Australia’s biggest design festival.\u003c/p\u003e\n\u003cp\u003e‘What I love most about Melbourne Design Week is the way it really brings together our city’s design community,’ Lucy says.\u003c/p\u003e\n\u003cp\u003e‘There’s always a great mix of familiar faces and emerging local designers, makers and retailers to discover — it feels like one time of year where everyone puts their best foot forward.’\u003c/p\u003e\n\u003cp\u003eLucy spent a day zipping around Melbourne in the \u003ca href=\"https://www.mercedes-benz.com.au/passengercars/models/suv/eqe/amg.html?srsltid=AfmBOoorvjjyop-urT2NkWC3MF8PI6tzI-didUQJME_uFRr1RL_861VK\"\u003eall-electric Mercedes-AMG EQE 53 SUV\u003c/a\u003e to share some of her favourite events from the 11-day festival, which is on until this Sunday May 25.\u003c/p\u003e\n\u003cp\u003e‘There a cluster of events in various locations across town, including Brunswick, North Melbourne, Collingwood, Fitzroy, and the CBD, so it’s worth mapping out your top picks and making a day of it like we did!’ Lucy adds.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eFirst Thing — Melbourne Art Book Fair\u003c/span\u003e \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFirst up, I visited the \u003ca href=\"https://designweek.melbourne/event/mabf-stallholder-fair/\" target=\"_blank\" rel=\"noopener\"\u003eMelbourne Art Book Fair\u003c/a\u003e in the NGV’s Great Hall. It was amazing to browse more than 100 publishers showcasing books and magazines with a focus on art, design and architecture, as well as kids’ books, food and fashion. There really is something for everyone!\u003c/p\u003e\n\u003cp\u003eThe event was buzzing all weekend, and since we recently started our own bi-annual print magazine, we were lucky to have a stand for \u003ca href=\"https://thedesignfiles.wpenginepowered.com/shop\" target=\"_blank\" rel=\"noopener\"\u003eThe Design Files Magazine\u003c/a\u003e this year! It was great to meet some of our readers in person and connect with a new audience too.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eMorning — 100 Lights\u003c/span\u003e \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eI hopped in the all-electric Mercedes-AMG EQE 53 SUV to head to our next event. It was such a smooth, sleek car to drive and the oversized dashboard screen with navigation and voice control made dashing between different locations a breeze. The next car I buy will be electric, so I’m taking notes now!\u003c/p\u003e\n\u003cp\u003eHosted in North Melbourne’s Meat Market Stables, the \u003ca href=\"https://designweek.melbourne/event/100-lights/\" target=\"_blank\" rel=\"noopener\"\u003e100 Lights showcase\u003c/a\u003e was so atmospheric. Curated by local designers Dale Hardiman and Tom Skeehan (known as Friends \u0026amp; Associates), the event brought together 100 table lamps, floor lamps, wall lights and pendant lights made by all Australian creatives.\u003c/p\u003e\n\u003cp\u003eWe have such a strong lighting design industry here in Melbourne, with skills across metalwork and glass blowing, and this exhibition really felt like a wonderful celebration of local manufacturing.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003eLunch\u003c/span\u003e \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe stopped to try the sandwiches at the \u003ca href=\"https://www.instagram.com/baguettestudios_nm/?hl=en\" target=\"_blank\" rel=\"noopener\"\u003eBaguette Studios\u003c/a\u003e nearby at 15-27 Wreckyn St. Inspired by French and Korean flavours, the food was delicious and very instagrammable — highly recommend if you’re passing through North Melbourne during the festival!\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eAfternoon — Introducing Knotte\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eMy last stop for the day was over in Collingwood for an exhibition by a new Sydney-based furniture brand, \u003ca href=\"https://designweek.melbourne/event/introducing-knotte-a-new-voice-in-local-and-responsible-design/\" target=\"_blank\" rel=\"noopener\"\u003eKnotte\u003c/a\u003e, who launched their first ever collection at Melbourne Design Week!\u003c/p\u003e\n\u003cp\u003eIt was a super impressive debut collection of modular seating: think plush, oversized shapes and lots of curves, in confident, bold colours. The exhibition was designed in collaboration with Melbourne art duo \u003ca href=\"https://oigallprojects.com/\" target=\"_blank\" rel=\"noopener\"\u003eOigall Projects,\u003c/a\u003e who created a series of stainless-steel panels and screens which served as a striking backdrop to the furniture pieces.\u003c/p\u003e\n\u003cp\u003ePlus, the building itself had some incredible views overlooking the city! Overall, a super impressive debut, and I can’t wait to see more from Knotte.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eMercedes-Benz is a Major Partner of Melbourne Design Week 2025. \u003c/em\u003e\u003c/strong\u003e\u003ca href=\"https://designweek.melbourne/\"\u003e\u003cstrong\u003e\u003cem\u003eFind out more about the program and plan your visit here.\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
