{
  "id": "aa7bb0d0-f184-400f-a19b-afbd6c983a49",
  "title": "Meet Melbourne’s Newest In-Demand Furniture Designer",
  "link": "https://thedesignfiles.wpenginepowered.com/2024/11/studio-visit-sean-brickhill/",
  "description": "After falling into a furniture design course by default at age 18, Sean Brickhill now sells out his bespoke woodwork in stores like Ma House, pépite, and Bow + Arrow, while taking commissions on the side. Despite finding wood challenging to work with, he says it’s taught him patience over the years. The multi-hyphenate creative also doubles as CocoFlip’s production assistant, and runs a passion project called First Editions Library  — an online library offering rare design, photography and art books. Read more about Sean’s creative process and how he got his start below!",
  "author": "The Design Files",
  "published": "Fri, 22 Nov 2024 03:00:56 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 3677,
  "excerpt": "Woodworker Sean Brickhill shares how he got his start in furniture design — and where he gets his inspiration.",
  "siteName": "",
  "favicon": "",
  "text": "Sean Brickhill fell into furniture design by accident after missing out on studying his dream course in communication design. Instead, he wound up in his backup course — furniture design — at RMIT. Sean imagined completing a year of the furniture course before switching to the communications design degree. That was until he ‘kind of got hooked on furniture’. After experimenting with making a couple of pieces for friends, he took a gap year and completed a three-month stint in Europe, which he says was the perfect place for inspiration and building his knowledge of design history. ‘I definitely came back to Melbourne with a stronger passion for design,’ he reflects. Once graduated, it was getting approached by prolific woodworker and designer Damien Wright that really propelled Sean’s career. Working as Damien’s assistant, he built up his confidence and eventually found a studio for himself. Now, his bespoke, predominately timber stools, chairs, coffee tables, and more can be found in local boutiques including curated homewares and furniture store Ma House in Collingwood, and nearby design gallery pépite, as well as Sydney studio Bow + Arrow. He also takes commissions for custom-made pieces. But there’s no one size fits all approach to Sean’s process — it varies piece by piece. All of his work also requires extensive planning and budgeting, from designing the pieces to sourcing materials to creating the finished product. ‘The average person probably doesn’t even think about it but a piece of furniture requires a whole variety of different machinery and tools,’ Sean explains. ‘I remember in uni we did a costing class where we calculated the costs to set up a base level workshop with all the equipment needed to produce basic furniture. ‘From memory it was around $30,000. There’s no way I could afford that so having a shared space with my own little studio and all the machinery has been a blessing.’ Sean attributes most of his inspiration to ‘books, books, books’. While travelling was his initial main source of inspiration, working more in the studio has meant less time to explore the world. So, the furniture designer has turned to books — and photography — to keep him inspired. Looking at design with the eye of a photographer has helped to shift his perspective and think more about how a piece will look from every angle, and how it will photograph in certain lighting or a particular space. His design process is all about prioritising the visual appeal of a piece over its functionality. ‘When I come up with something that ticks the aesthetic box and then functionality box, that’s when I feel like I’m onto something,’ he notes. When he’s not in the studio working on his next piece, Sean also doubles as CocoFlip’s production assistant, as well as helming his passion project — First Edition Library, an online space dedicated to sourcing, curating and selling rare design, photography and art books. The platform was born from Sean’s desire to share his passion for books with like-minded creatives. After a successful pop-up at local clothing and homewares store Saloon where he presented books from the personal libraries of various Melbourne artists and designers, he began sourcing more rare books from around the world and selling them for a small profit. ‘For me it’s not really about the profit, it’s more so about curating a selection of books that you can hardly ever purchase here in Australia,’ Sean adds. ‘But aside from helping friends with other odd jobs here and there, the rest of my time is spent at the studio making the next piece.’ Shop Sean’s pieces at seanbrickhill.com or DM him on Instagram for custom orders.",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2024/11/SeanBrick-tdf-SV6-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003e\u003ca href=\"https://www.seanbrickhill.com/\" target=\"_blank\" rel=\"noopener\"\u003eSean Brickhill\u003c/a\u003e fell into furniture design by accident after missing out on studying his dream course in communication design.\u003c/h3\u003e\n\u003cp\u003eInstead, he wound up in his backup course — furniture design — at RMIT. \u003ca href=\"https://www.instagram.com/brrrrrrrrick/?hl=en\" target=\"_blank\" rel=\"noopener\"\u003eSean\u003c/a\u003e imagined completing a year of the furniture course before switching to the communications design degree. That was until he ‘kind of got hooked on furniture’.\u003c/p\u003e\n\u003cp\u003eAfter experimenting with making a couple of pieces for friends, he took a gap year and completed a three-month stint in Europe, which he says was the perfect place for inspiration and building his knowledge of design history.\u003c/p\u003e\n\u003cp\u003e‘I definitely came back to Melbourne with a stronger passion for design,’ he reflects.\u003c/p\u003e\n\u003cp\u003eOnce graduated, it was getting approached by prolific woodworker and designer \u003ca href=\"https://wrightstudios.com.au/\" target=\"_blank\" rel=\"noopener\"\u003eDamien Wright\u003c/a\u003e that really propelled Sean’s career. Working as Damien’s assistant, he built up his confidence and eventually found a studio for himself.\u003c/p\u003e\n\u003cp\u003eNow, his bespoke, predominately timber stools, chairs, coffee tables, and more can be found in local boutiques including curated homewares and furniture store \u003ca href=\"https://mahousesupplystore.com.au/\" target=\"_blank\" rel=\"noopener\"\u003eMa House\u003c/a\u003e in Collingwood, and nearby design gallery \u003ca href=\"https://pepite.com.au/\" target=\"_blank\" rel=\"noopener\"\u003epépite\u003c/a\u003e, as well as Sydney studio \u003ca href=\"https://bowandarrowstore.com/\" target=\"_blank\" rel=\"noopener\"\u003eBow + Arrow\u003c/a\u003e. He also takes commissions for custom-made pieces.\u003c/p\u003e\n\u003cp\u003eBut there’s no one size fits all approach to Sean’s process — it varies piece by piece. All of his work also requires extensive planning and budgeting, from designing the pieces to sourcing materials to creating the finished product.\u003c/p\u003e\n\u003cp\u003e‘The average person probably doesn’t even think about it but a piece of furniture requires a whole variety of different machinery and tools,’ Sean explains. ‘I remember in uni we did a costing class where we calculated the costs to set up a base level workshop with all the equipment needed to produce basic furniture.\u003c/p\u003e\n\u003cp\u003e‘From memory it was around $30,000. There’s no way I could afford that so having a shared space with my own little studio and all the machinery has been a blessing.’\u003c/p\u003e\n\u003cp\u003eSean attributes most of his inspiration to ‘books, books, books’. While travelling was his initial main source of inspiration, working more in the studio has meant less time to explore the world. So, the furniture designer has turned to books — and photography — to keep him inspired.\u003c/p\u003e\n\u003cp\u003eLooking at design with the eye of a photographer has helped to shift his perspective and think more about how a piece will look from every angle, and how it will photograph in certain lighting or a particular space. His design process is all about prioritising the visual appeal of a piece over its functionality.\u003c/p\u003e\n\u003cp\u003e‘When I come up with something that ticks the aesthetic box and then functionality box, that’s when I feel like I’m onto something,’ he notes.\u003c/p\u003e\n\u003cp\u003eWhen he’s not in the studio working on his next piece, Sean also doubles as \u003ca href=\"https://cocoflip.com.au/\" target=\"_blank\" rel=\"noopener\"\u003eCocoFlip’s\u003c/a\u003e production assistant, as well as helming his passion project — \u003ca href=\"https://www.instagram.com/firstedition.library/\" target=\"_blank\" rel=\"noopener\"\u003eFirst Edition Library\u003c/a\u003e, an online space dedicated to sourcing, curating and selling rare design, photography and art books.\u003c/p\u003e\n\u003cp\u003eThe platform was born from Sean’s desire to share his passion for books with like-minded creatives. After a successful pop-up at local clothing and homewares store Saloon where he presented books from the personal libraries of various Melbourne artists and designers, he began sourcing more rare books from around the world and selling them for a small profit.\u003c/p\u003e\n\u003cp\u003e‘For me it’s not really about the profit, it’s more so about curating a selection of books that you can hardly ever purchase here in Australia,’ Sean adds. ‘But aside from helping friends with other odd jobs here and there, the rest of my time is spent at the studio making the next piece.’\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eShop Sean’s pieces at \u003ca href=\"https://www.seanbrickhill.com/\" target=\"_blank\" rel=\"noopener\"\u003eseanbrickhill.com\u003c/a\u003e or DM him on \u003ca href=\"https://www.instagram.com/brrrrrrrrick/?hl=en\" target=\"_blank\" rel=\"noopener\"\u003eInstagram\u003c/a\u003e for custom orders.\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
