{
  "id": "ab857ba9-66eb-40f5-a6fa-a923b50a95e7",
  "title": "A Shared South Yarra Apartment With An Eclectic, Parisian Feel",
  "link": "https://thedesignfiles.wpenginepowered.com/2024/10/homes-nicole-williams-ethan-wairau-south-yarra/",
  "description": "Howard Lawson was an architect not appreciated in his own time. 100 years later, however, his buildings are coveted by those in the know — particularly those in South Yarra, including the Beverley Hills complex. Photographer and visual director Nicole Williams lives in one of Lawson’s more under-the-radar buildings, which she instantly recognised as ‘magic’ when inspecting the property for lease. She found a housemate, Ethan Wairau, who shares a similar personal style, leading them to create the eclectic, Parisian-inspired apartment you see today.",
  "author": "The Design Files",
  "published": "Tue, 29 Oct 2024 19:00:59 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 3392,
  "excerpt": "Inside the rented apartment of housemates Nicole Williams and Ethan Wairau, eclectically styled with French, Scandi and Japanese influences.",
  "siteName": "",
  "favicon": "",
  "text": "If you’ve ever frequented the riverside pocket of South Yarra between Punt Road and Darling Street, you’ll likely recognise the architecture of Howard Lawson, even if you don’t know him by name. An architect ahead of his time, Lawson designed and built several apartment buildings that make up this relatively dense pocket, which is unlike any other Melbourne neighbourhood. Photographer and visual director Nicole Williams was living alone when a large two-bedroom apartment in a circa 1923 Lawson building on Punt Road came up for lease. ‘When I inspected the property I was completely in awe. I got to the steps and was greeted by the most lovely landlords who care so much about their house,’ recalls Nicole. ‘I left and started crying in one of the side streets because I didn’t have a housemate and didn’t want to lose the property.’ Nicole turned to her Instagram followers for help, leading her to serendipitously meet Ethan Wairau, owner of Keep Sake. A mutual friend had previously suggested the pair would get along due to their similar styles and interests, and the stars perfectly aligned in that moment. ‘Ethan messaged me without looking at my Instagram stories and was like, “Do you want to grab a coffee?” and I was like, “Do you think you could inspect the property today?” recalls Nicole. ‘Within an hour or so I’d found a housemate and we’d locked in another inspection. There were so many synchronicities, and we found out we got the house the next day!’ Nicole and Ethan’s furniture looks completely at home in the apartment, bringing together Nicole’s ‘French European’-inspired style, and influences of Scandi and Japanese design in Ethan’s. ‘We were lucky that all of our stuff combined just kind of worked together,’ says Nicole. ‘I’m sure there are things we disagree on in our aesthetics, but we end up meeting in the middle. ‘I’m in Paris twice a year for work so I think naturally I want to try and bring that aesthetic home with me. However, I think it’s important to just play and see what works and naturally a combined style starts to form.’ Nicole and Ethan treat the home as their own, making small cosmetic updates to enhance the interiors, such as changing out the light fittings and adding curtains from Ikea. Initially they used suspension kits to enable DIY installation of light pendants, before engaging an electrician. ‘After talking to our landlord he agreed to adding them permanently which meant we could play with the lengths,’ says Nicole. ‘The curtain rods and curtains are all from Ikea — the idea was to bring warmth and bring other dimensions to the home. It’s a really inexpensive thing to do and brings a lot of impact.’ Numerous vintage pieces (including several pieces from Ma House Supply Store owned by Ben Mooney, the housemates’ mutual friend) are on display throughout the apartment, mixed with modern items from Fenton \u0026 Fenton and Lightly for an eclectic, lived-in feel. ‘Our home is extremely warm and very homey. I’ve had people say it’s a bit like an inner-city farmhouse, or that people feel like they’re in Paris when they’re here,’ says Nicole. It’s a layered and loved home, without feeling cluttered or contrived. After decades of slipping through the cracks of architectural history, it’s heartwarming to see the work of Howard Lawson being celebrated and cared for in 2024… Nicole and Ethan are the perfect custodians!",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2024/10/NicoleWilliams-tdf-homes6-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003eIf you’ve ever frequented the riverside pocket of South Yarra between Punt Road and Darling Street, you’ll likely recognise the architecture of \u003ca href=\"https://prov.vic.gov.au/explore-collection/provenance-journal/provenance-2020/howard-r-lawson\"\u003eHoward Lawson\u003c/a\u003e, even if you don’t know him by name.\u003c/h3\u003e\n\u003cp\u003eAn architect ahead of his time, Lawson designed and built several apartment buildings that make up this relatively dense pocket, which is unlike any other Melbourne neighbourhood.\u003c/p\u003e\n\u003cp\u003ePhotographer and visual director\u003ca href=\"https://www.nicwilliams.net/\"\u003e Nicole Williams\u003c/a\u003e was living alone when a large two-bedroom apartment in a circa 1923 Lawson building on Punt Road came up for lease.\u003c/p\u003e\n\u003cp\u003e‘When I inspected the property I was completely in awe. I got to the steps and was greeted by the most lovely landlords who care so much about their house,’ recalls Nicole.\u003c/p\u003e\n\u003cp\u003e‘I left and started crying in one of the side streets because I didn’t have a housemate and didn’t want to lose the property.’\u003c/p\u003e\n\u003cp\u003eNicole turned to her Instagram followers for help, leading her to serendipitously meet Ethan Wairau, owner of \u003ca href=\"https://www.instagram.com/keepsake_world/\"\u003eKeep Sake\u003c/a\u003e. A mutual friend had previously suggested the pair would get along due to their similar styles and interests, and the stars perfectly aligned in that moment.\u003c/p\u003e\n\u003cp\u003e‘Ethan messaged me without looking at my Instagram stories and was like, “Do you want to grab a coffee?” and I was like, “Do you think you could inspect the property today?” recalls Nicole.\u003c/p\u003e\n\u003cp\u003e‘Within an hour or so I’d found a housemate and we’d locked in another inspection. There were so many synchronicities, and we found out we got the house the next day!’\u003c/p\u003e\n\u003cp\u003eNicole and Ethan’s furniture looks completely at home in the apartment, bringing together Nicole’s ‘French European’-inspired style, and influences of Scandi and Japanese design in Ethan’s.\u003c/p\u003e\n\u003cp\u003e‘We were lucky that all of our stuff combined just kind of worked together,’ says Nicole. ‘I’m sure there are things we disagree on in our aesthetics, but we end up meeting in the middle.\u003c/p\u003e\n\u003cp\u003e‘I’m in Paris twice a year for work so I think naturally I want to try and bring that aesthetic home with me. However, I think it’s important to just play and see what works and naturally a combined style starts to form.’\u003c/p\u003e\n\u003cp\u003eNicole and Ethan treat the home as their own, making small cosmetic updates to enhance the interiors, such as changing out the light fittings and adding curtains from \u003ca href=\"https://www.ikea.com/au/en/\" target=\"_blank\" rel=\"noopener\"\u003eIkea\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eInitially they used \u003ca href=\"https://www.bunnings.com.au/brilliant-d-i-y-black-pendant-light-suspension-kit_p7070173\" target=\"_blank\" rel=\"noopener\"\u003esuspension kits\u003c/a\u003e to enable DIY installation of light pendants, before engaging an electrician. ‘After talking to our landlord he agreed to adding them permanently which meant we could play with the lengths,’ says Nicole.\u003c/p\u003e\n\u003cp\u003e‘The curtain rods and curtains are all from Ikea — the idea was to bring warmth and bring other dimensions to the home. It’s a really inexpensive thing to do and brings a lot of impact.’\u003c/p\u003e\n\u003cp\u003eNumerous vintage pieces (including several pieces from\u003ca href=\"https://mahousesupplystore.com.au/\"\u003e Ma House Supply Store\u003c/a\u003e owned by Ben Mooney, the housemates’ mutual friend) are on display throughout the apartment, mixed with modern items from\u003ca href=\"https://thedesignfiles.wpenginepowered.com/directory/retailer/fentonandfenton\"\u003e Fenton \u0026amp; Fenton\u003c/a\u003e and\u003ca href=\"https://www.lightly.com.au/\"\u003e Lightly\u003c/a\u003e for an eclectic, lived-in feel.\u003c/p\u003e\n\u003cp\u003e‘Our home is extremely warm and very homey. I’ve had people say it’s a bit like an inner-city farmhouse, or that people feel like they’re in Paris when they’re here,’ says Nicole.\u003c/p\u003e\n\u003cp\u003eIt’s a layered and loved home, without feeling cluttered or contrived.\u003c/p\u003e\n\u003cp\u003eAfter decades of slipping through the cracks of architectural history, it’s heartwarming to see the work of Howard Lawson being celebrated and cared for in 2024… Nicole and Ethan are the perfect custodians!\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
