{
  "id": "ac0bc39b-404f-4e13-b98f-87983efdc1d8",
  "title": "This Interior Designer Makes Beautiful Weavings After Hours",
  "link": "https://thedesignfiles.wpenginepowered.com/2024/10/studio-visit-claudia-bloxsome/",
  "description": "By day, Claudia Bloxsome is an interior designer, but by night (and on her days off) she spends countless hours at the loom creating enchanting weavings from natural fabrics, sometimes adorned with shells and feathers. It’s a passion that started seven years ago, when Claudia decided to fashion a loom frame out of a dollar shop canvas frame and some nails: ‘It just felt kismet.’ We step inside their intimate Melbourne studio.",
  "author": "The Design Files",
  "published": "Sun, 06 Oct 2024 19:00:40 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 2295,
  "excerpt": "Claudia Bloxsome is an interior designer by day, and a masterful weaver by night. See inside their Melbourne studio!",
  "siteName": "",
  "favicon": "",
  "text": "Many artists, athletes, and creatives speak of being in an enigmatic ‘flow state’ when they work at their craft. Those peaceful moments where your body and mind feel completely connected, and you’re so focused that time melts away. For Claudia Bloxsome, this is exactly what weaving feels like. ‘When I am working at the loom, I feel embodied and present,’ Claudia says. ‘Weaving requires a lot of calculation and forward thinking and simultaneously lends itself to being totally directed by intuition.’ ‘I love the idea of experiencing that phenomenon while simultaneously contributing to something for others to enjoy.’ This sensory experience is part of why she fell in love with weaving about seven years ago. Claudia had just graduated from an interior design course at RMIT and was working for a small furniture design firm called Keith Melbourne. ‘I suddenly had time in the evenings to explore my own creative practice again, and fate would have it that I would make my own frame loom one night out of a dollar-shop canvas frame and some nails — it just felt kismet,’ they say. ‘I became obsessed instantaneously and my love of fibre and weaving has continued to grow.’ Now working for local design practice Kim Kneipp four days a week, Claudia still spends most evenings and days off creating intricate wall hangings and wearable art. These unique pieces are made from exclusively natural fibres including linen, cotton, wool and silks, sometimes adorned with shells or feathers — like dangling charms found in nature. Aside from the obvious links between interior design and the art of weaving, Claudia says juggling the two has expanded her potential for creative problem solving, composition, and understanding of colour. Because behind each weaving, lies an intense level of planning and preparation. ‘It can require a bit of math,’ Claudia explains. ‘The most challenging aspect of the process is when countless hours have gone into designing, problem solving, testing, preparing the fibre, warping the loom, weaving the piece and then reaching this crucial moment when the work is cut off the tension of the loom and it just doesn’t work.’ ‘Of course these are the moments of greatest learning and growth, but boy can they hurt too!’ Visit Claudia’s online store Cloud May Studio.",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2024/10/claudia-tdf-sv5-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003eMany artists, athletes, and creatives speak of being in an enigmatic ‘flow state’ when they work at their craft. Those peaceful moments where your body and mind feel completely connected, and you’re so focused that time melts away.\u003c/h3\u003e\n\u003cp\u003eFor \u003ca href=\"https://www.cloudmaystudio.com.au/\" target=\"_blank\" rel=\"noopener\"\u003eClaudia Bloxsome\u003c/a\u003e, this is exactly what weaving feels like.\u003c/p\u003e\n\u003cp\u003e‘When I am working at the loom, I feel embodied and present,’ Claudia says. ‘Weaving requires a lot of calculation and forward thinking and simultaneously lends itself to being totally directed by intuition.’\u003c/p\u003e\n\u003cp\u003e‘I love the idea of experiencing that phenomenon while simultaneously contributing to something for others to enjoy.’\u003c/p\u003e\n\u003cp\u003eThis sensory experience is part of why she fell in love with weaving about seven years ago.\u003c/p\u003e\n\u003cp\u003eClaudia had just graduated from an interior design course at RMIT and was working for a small furniture design firm called Keith Melbourne.\u003c/p\u003e\n\u003cp\u003e‘I suddenly had time in the evenings to explore my own creative practice again, and fate would have it that I would make my own frame loom one night out of a dollar-shop canvas frame and some nails — it just felt kismet,’ they say.\u003c/p\u003e\n\u003cp\u003e‘I became obsessed instantaneously and my love of fibre and weaving has continued to grow.’\u003c/p\u003e\n\u003cp\u003eNow working for local design practice \u003ca href=\"https://kimkneipp.com/\" target=\"_blank\" rel=\"noopener\"\u003eKim Kneipp\u003c/a\u003e four days a week, Claudia still spends most evenings and days off creating intricate wall hangings and wearable art.\u003c/p\u003e\n\u003cp\u003eThese unique pieces are made from exclusively natural fibres including linen, cotton, wool and silks, sometimes adorned with shells or feathers — like dangling charms found in nature.\u003c/p\u003e\n\u003cp\u003eAside from the obvious links between interior design and the art of weaving, Claudia says juggling the two has expanded her potential for creative problem solving, composition, and understanding of colour. Because behind each weaving, lies an intense level of planning and preparation.\u003c/p\u003e\n\u003cp\u003e‘It can require a bit of math,’ Claudia explains. ‘The most challenging aspect of the process is when countless hours have gone into designing, problem solving, testing, preparing the fibre, warping the loom, weaving the piece and then reaching this crucial moment when the work is cut off the tension of the loom and it just \u003cem\u003edoesn’t\u003c/em\u003e work.’\u003c/p\u003e\n\u003cp\u003e‘Of course these are the moments of greatest learning and growth, but boy can they hurt too!’\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.cloudmaystudio.com.au/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cem\u003e\u003cstrong\u003eVisit Claudia’s online store Cloud May Studio.\u003c/strong\u003e\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
