{
  "id": "b9b9dc5d-0b2f-48c7-a03a-998c87e8e9b3",
  "title": "Style Scouting: Vol. 229",
  "link": "https://inmyownstyle.com/style-scouting-vol-229.html",
  "description": "This post is from the blog, InMyOwnStyle.com Thanks for stopping by for this week’s Style Scouting. My Sunday post where I share the random stuff that captured my attention or inspired me that I found online. After almost summer-like temps and sunshine two weeks ago, this past week was quite the opposite… cold, rainy and grey all week. I... If you enjoyed this post you may also enjoy the easy to follow DIY Decorating Tutorials and Creative Ideas on my blog, In My Own Style.com Republishing this article in full or in part is a violation of Copyright law @2009-2021, all rights reserved",
  "author": "Diane Henkler",
  "published": "Sun, 16 Feb 2025 10:00:00 +0000",
  "source": "https://inmyownstyle.com/feed",
  "categories": [
    "Style Scouting"
  ],
  "byline": "Diane Henkler",
  "length": 1342,
  "excerpt": "Thanks for stopping by for this week’s Style Scouting. My Sunday post where I share the random stuff that captured my attention or inspired me that I found online. photo by Jacqueline Clair via The Glam Pad",
  "siteName": "In My Own Style",
  "favicon": "",
  "text": "Thanks for stopping by for this week’s Style Scouting. My Sunday post where I share the random stuff that captured my attention or inspired me that I found online. After almost summer-like temps and sunshine two weeks ago, this past week was quite the opposite… cold, rainy and grey all week. I love a rainy day, but not a whole week. When searching online for links this week, I made sure to find homes and ideas infused with lots of happy colors that I hope you enjoy. Even in the gloom, the best two contractors got together and finally got the living room ceiling completed. It was supposed to be done right after Christmas. I will share more about this week. Now onto the links I found for you this week. Posts You May Have Missed This Week: My 12+ Must Do Faux Flower Decorating Tips (open in same tab) Something to Think About Take your younger self out for coffee. (open in same tab) “Never let anyone — any person or any force — dampen, dim, or diminish your light.” – John Lewis If you enjoy these posts – You can find past Style Scouting posts here. And… If you’re catching up on blog posts you may have missed, be sure to sign-up to get my newest posts via email to stay up to date with everything that’s happening here on the blog and more. Post navigation",
  "image": "https://inmyownstyle.com/wp-content/uploads/2025/02/Jennifer-Hunter-Frances-Bailey-Jacqueline-Clair-Upper-East-Side-1878.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\t\t\u003cmain id=\"main\" role=\"main\"\u003e\n\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003carticle id=\"post-100293\"\u003e\n\t\u003cdiv\u003e\n\t\n\u003cdiv\u003e\n\u003cp\u003eThanks for stopping by for this week’s Style Scouting. My Sunday post where I share the random stuff that captured my attention or inspired me that I found online.\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\n\n\u003cp\u003eAfter almost summer-like temps and sunshine two weeks ago, this past week was quite the opposite… cold, rainy and grey all week. I love a rainy day, but not a whole week. When searching online for links this week, I made sure to find homes and ideas infused with lots of happy colors that I hope you enjoy. \u003c/p\u003e\n\n\n\n\u003cp\u003eEven in the gloom, the best two contractors got together and finally got the living room ceiling completed. It was supposed to be done right after Christmas. I will share more about this week. \u003c/p\u003e\n\n\n\n\u003cp\u003eNow onto the links I found for you this week.\u003c/p\u003e\n\u003c/div\u003e\n\n\n\n\u003ch2 id=\"h-posts-you-may-have-missed-this-week\"\u003ePosts You May Have Missed This Week:\u003c/h2\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://inmyownstyle.com/12-fake-flower-decorating-tips.html\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eMy 12+ Must Do\u003c/a\u003e Faux Flower Decorating Tips (\u003ca href=\"https://inmyownstyle.com/12-fake-flower-decorating-tips.html\"\u003eopen in same tab\u003c/a\u003e)\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003cdiv\u003e\n\u003ch2 id=\"something-to-think-about\"\u003eSomething to Think About\u003c/h2\u003e\n\n\n\n\u003cp\u003eTake \u003ca href=\"https://www.bustle.com/wellness/met-my-younger-self-for-coffee-tiktok\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eyour younger self\u003c/a\u003e out for coffee. (\u003ca href=\"https://www.bustle.com/wellness/met-my-younger-self-for-coffee-tiktok\"\u003eopen in same tab\u003c/a\u003e)\u003c/p\u003e\n\n\n\n\u003cp\u003e“Never let anyone — any person or any force — dampen, dim, or diminish your light.” – \u003cem\u003eJohn Lewis\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\n\n\n\n\n\n\u003cp\u003eIf you enjoy these posts – You can find past \u003ca href=\"https://inmyownstyle.com/category/creative-stylish-ideas-for-home-and-living\"\u003e\u003cem\u003eStyle Scouting\u003c/em\u003e posts here\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eAnd…\u003c/strong\u003e If you’re catching up on blog posts you may have missed, be sure \u003cstrong\u003e\u003ca href=\"https://inmyownstyle.com/subscribe-to-in-my-own-style-blog\"\u003eto sign-up\u003c/a\u003e \u003c/strong\u003eto get my \u003cstrong\u003enewest posts via email \u003c/strong\u003eto stay up to date with everything that’s happening here on the blog and more.\u003c/p\u003e\n\u003c/div\u003e\n    \n\n\t\u003cnav aria-label=\"Posts\"\u003e\n\t\t\u003ch2\u003ePost navigation\u003c/h2\u003e\n\t\t\n\t\u003c/nav\u003e\u003c/div\u003e\n\u003c/article\u003e\n\n\n\n\t\t\t\t\t\u003c/div\u003e\u003c/main\u003e\n\t\t\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-02-16T10:00:00Z",
  "modifiedTime": "2025-02-15T16:17:12Z"
}
