{
  "id": "bdc49336-b609-47a1-80b6-53c0b2b5a4b7",
  "title": "\"David Lynch was a superb director of architecture\"",
  "link": "https://www.dezeen.com/2025/02/07/david-lynch-anthony-paletta-opinion/",
  "description": "Late film director David Lynch adored design and architecture and mastered the art of wielding it to evocative effect, writes Anthony Paletta. Any director of consequence will pay close attention to set design in their films, but few design interiors in the real world. Many directors are attentive to the furniture that appears in their The post \"David Lynch was a superb director of architecture\" appeared first on Dezeen.",
  "author": "Anthony Paletta",
  "published": "Fri, 07 Feb 2025 10:15:18 +0000",
  "source": "https://www.dezeen.com/interiors/feed/",
  "categories": [
    "all",
    "Architecture",
    "Interiors",
    "Design",
    "Opinion",
    "Set and stage design",
    "David Lynch",
    "Obituaries",
    "Film"
  ],
  "byline": "Anthony Paletta",
  "length": 11459,
  "excerpt": "Late film director David Lynch adored design and architecture and mastered the art of wielding it to evocative effect, writes Anthony Paletta.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Late film director David Lynch adored design and architecture and mastered the art of wielding it to evocative effect, writes Anthony Paletta. Any director of consequence will pay close attention to set design in their films, but few design interiors in the real world. Many directors are attentive to the furniture that appears in their work; few are sawing it in their own carpentry workshops. David Lynch was different. Since his death there has been a torrent of heartfelt tributes to his legacy in all sorts of spheres. Let's not forget his deeply informed enthusiasm for architecture and design. With architecture and design his replies tended to be unusually precise – and unusually good Lynch was not a man who explained himself much on most topics. That doesn't just apply to interviewers trying to unlock some simple meaning from his surreal films; he painted prolifically but discussed it rarely. But with architecture and design his replies tended to be unusually precise – and unusually good. Asked about his favourite architects by the German design magazine Form in 1997, he replied, \"From Bauhaus, all the students of the Bauhaus School, and Pierre Chareau – he did the House of Glass in Paris – Ludwig Mies van de Rohe, all the Wright family, Rudolph Michael Schindler and Richard Neutra. I like really beautifully designed, minimal things.\" In the same interview he recalled a lunch with Charles Eames: \"He was one of the most intelligent, down to earth, greatest persons I ever met. He was just a pure, kind of happy person, somehow childlike, enjoying life.\" He went on to cite Vladimir Kagan and Charlotte Perriand as other favourites. Lynch bought Lloyd Wright's Beverly Johnson House in 1986. Lloyd, the son of Frank, was a highly impressive architect overshadowed by the father with whom he shared most of his name. I obtained a quote from Lynch for a story about Lloyd's work last year. \"I personally like Lloyd Wright more than Frank Lloyd Wright because Lloyd Wright is more minimal, more pure. But just as beautiful.\" Lynch kept hiring from the family, employing Lloyd's son, Eric Lloyd Wright, to design a pool house for the property. He used another adjoining house he owns as Bill Pullman and Patricia Arquette's home in Lost Highway, actually modifying its facade for the film. What do you see in that house? Bertoia's Diamond Chair and the Eames' Elliptical table, as well as furniture of his own design. Drapes were the design tool that Lynch used to greatest effect Frank Lloyd Wright's Ennis House was the set for Twin Peaks' internal soap opera Invitation to Love. Lynch directed an Yves St Laurent commercial set in Chareau's Maison de Verre in Paris, and he made use of all sorts of notable properties otherwise. \"Assessed as a whole, Lynch's career constitutes an idiosyncratic history of architecture and design,\" Richard Martin wrote in his book The Architecture of David Lynch. \"Perhaps, then, we might consider his films as forming an imaginative and unconventional architectural project in their own right.\" Drapes – that rather overlooked soft lining of glassy modernism, employed repeatedly by Mies, Loos and Neutra – were the design tool that Lynch used to greatest effect. They are there in Pullman and Arquette's bedroom in Lost Highway, and they define his most iconic space: the Red Room in Twin Peaks. The associations with theatre are inescapable, and red curtains appear again on a stage in Mulholland Drive's Club Silencio, a space that (sort of) became real in Lynch's Silencio nightclub in Paris, which features chairs of his design. These sorts of directorial forays have become more common; Wes Anderson designed a bar in Milan, and Luca Guadagnino a hotel in Rome, but Lynch was there first. He is the rare director who can actually build his own furniture, having started in art school, and he adored the stuff. In an interview with LA Weekly, he once said: \"Every word has, you know, its spread of power. You could care a little bit or you could care a lot. But if you put this word caring at the maximum-level intensity, it wouldn't begin to be enough to say how much I love furniture.\" Lynch was largely building for himself, designing his own bed and much else, but did step slightly into the market. He had an exhibit of his work at Salone del Mobile in 1997. Now-defunct Swiss furniture company Casanostra produced a limited run of several of his designs subsequently. The minimalism he favoured at home would be deliberately eschewed to evocative purpose Some of these pieces border on absurdism, but a number were designed for an almost-hilarious specificity of use: there is an espresso table and a whiskey and cigar table. The most obvious inspiration seems to be Chareau's discordant-but-perfect meldings of the hand-hewn natural and industrial materials. He was also a prolific lamp designer, veering between driftwood dadaism and Bauhaus rectilinearity. There's a short film of him working on his lamps, proof that he wasn't just handing off sketches to someone else. What are we to make of this all? Among all the glorious traits that might define the Lynchian style is its hallucinogenic attention to the atmosphere of given locations. It's cinematic lingering that flows naturally from someone who was acutely attuned to the vibe of spaces he's in all of the time. As he wrote in his semi-autobiography, tellingly titled Room to Dream, \"the more pure the room, the more the people and the furniture can come forth.\" The average person might bump into a table if it's too large but likely wouldn't say it was deranging their thoughts. Lynch did. In that Form interview, he said: \"To my mind, most tables are too big and they're too high. They shrink the size of the room and eat into space and cause unpleasant mental activity.\" And he made viscerally clear to his audience just what this sort of sensitivity constitutes. The minimalism he favoured at home would be deliberately eschewed to evocative purpose in his work. His was not an uniform cinematic aesthetic in the manner of directors whose film sets look rather the same, but conveyed concentrated attention to the essence of a variety of spaces, whether art deco theatres or Googie diners or various Hollywood fantasyland locations. He knew precisely how to use design and spaces to make us feel a certain way In other words, Lynch was a superb director of architecture. He knew precisely how to use design and spaces to make us feel a certain way, and keep on feeling it long after Twin Peaks, or Mulholland Drive, or Lost Highway are over. These are media that explore the power of space a good deal better than most films ostensibly about architecture. Lynch's last foray into design was at the 2024 edition of Salone del Mobile, where he designed A Thinking Room. What was in it? Deep blue walls, a golden ceiling, and a throne with seven \"chimneys\" connected to the ceiling, for ideas to vent in or out. In some ways, he needn't have bothered; every space he created had us thinking. Anthony Paletta is an architecture journalist based in New York City. His writing has appeared in The Wall Street Journal, The Guardian, Bloomberg CityLab, The Architect's Newspaper and Metropolis, among others. Dezeen In DepthIf you enjoy reading Dezeen's interviews, opinions and features, subscribe to Dezeen In Depth. Sent on the last Friday of each month, this newsletter provides a single place to read about the design and architecture stories behind the headlines. Subscribe to our newsletters Your email address New! Dezeen Agenda US Sent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events. New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2025/02/david-lynch-twin-peaks-hero_dezeen_1704_col_2.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2168413\" data-article-id=\"2168413\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2025/02/david-lynch-twin-peaks-hero_dezeen_1704_col_2.jpg\" id=\"preload-hero\"\u003e\n\t\t\n\n\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2025/02/david-lynch-twin-peaks-hero_dezeen_1704_col_2-852x479.jpg\" alt=\"David Lynch as Gordon Cole in Twin Peaks\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2025/02/david-lynch-twin-peaks-hero_dezeen_1704_col_2-852x479.jpg 1x, https://static.dezeen.com/uploads/2025/02/david-lynch-twin-peaks-hero_dezeen_1704_col_2.jpg 2x\" data-pin-nopin=\"true\" data-cfsrc=\"https://static.dezeen.com/uploads/2025/02/david-lynch-twin-peaks-hero_dezeen_1704_col_2-852x479.jpg\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eLate \u003ca href=\"https://www.dezeen.com/tag/film/\"\u003efilm\u003c/a\u003e director \u003ca href=\"https://www.dezeen.com/tag/david-lynch/\"\u003eDavid Lynch\u003c/a\u003e adored design and architecture and mastered the art of wielding it to evocative effect, writes \u003ca href=\"https://www.dezeen.com/author/anthony-paletta/\"\u003eAnthony Paletta\u003c/a\u003e.\u003cspan id=\"more-2168413\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\u003cp\u003e\u003cstrong\u003eAny director of consequence will pay close attention to set design in their films, but few design interiors in the real world.\u003c/strong\u003e Many directors are attentive to the furniture that appears in their work; few are sawing it in their own carpentry workshops.\u003c/p\u003e\n\u003cp\u003eDavid Lynch was different. Since his death there has been a torrent of heartfelt tributes to his legacy in all sorts of spheres. Let\u0026#39;s not forget his deeply informed enthusiasm for architecture and design.\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eWith architecture and design his replies tended to be unusually precise – and unusually good\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eLynch was not a man who explained himself much on most topics. That doesn\u0026#39;t just apply to interviewers trying to unlock some simple meaning from his surreal films; he painted prolifically but discussed it rarely. But with architecture and design his replies tended to be unusually precise – and unusually good.\u003c/p\u003e\n\n\n\u003cp\u003eAsked about his favourite architects by the German design magazine \u003ca href=\"http://www.thecityofabsurdity.com/\"\u003eForm\u003c/a\u003e in 1997, he replied, \u0026#34;From \u003ca href=\"https://www.dezeen.com/tag/bauhaus/\"\u003eBauhaus\u003c/a\u003e, all the students of the Bauhaus School, and Pierre Chareau – he did the House of Glass in Paris – \u003ca href=\"https://www.dezeen.com/tag/mies-van-der-rohe/\"\u003eLudwig Mies van de Rohe\u003c/a\u003e, all the Wright family, \u003ca href=\"https://www.dezeen.com/tag/rudolph-schindler/\"\u003eRudolph Michael Schindler\u003c/a\u003e and \u003ca href=\"https://www.dezeen.com/tag/richard-neutra/\"\u003eRichard Neutra\u003c/a\u003e. I like really beautifully designed, minimal things.\u0026#34;\u003c/p\u003e\n\u003cp\u003eIn the same interview he recalled a lunch with \u003ca href=\"https://www.dezeen.com/tag/eames/\"\u003eCharles Eames\u003c/a\u003e: \u0026#34;He was one of the most intelligent, down to earth, greatest persons I ever met. He was just a pure, kind of happy person, somehow childlike, enjoying life.\u0026#34; He went on to cite Vladimir Kagan and \u003ca href=\"https://www.dezeen.com/tag/charlotte-perriand/\"\u003eCharlotte Perriand\u003c/a\u003e as other favourites.\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003eLynch bought Lloyd Wright\u0026#39;s Beverly Johnson House in 1986. Lloyd, the son of \u003ca href=\"https://www.dezeen.com/tag/frank-lloyd-wright/\"\u003eFrank\u003c/a\u003e, was a highly impressive architect overshadowed by the father with whom he shared most of his name.\u003c/p\u003e\n\u003cp\u003eI obtained a quote from Lynch for \u003ca href=\"https://www.wsj.com/real-estate/frank-lloyd-wright-jr-was-more-than-the-son-of-a-famous-architect-7739174f\"\u003ea story about Lloyd\u0026#39;s work last year\u003c/a\u003e. \u0026#34;I personally like Lloyd Wright more than Frank Lloyd Wright because Lloyd Wright is more minimal, more pure. But just as beautiful.\u0026#34;\u003c/p\u003e\n\u003cp\u003eLynch kept hiring from the family, employing Lloyd\u0026#39;s son, Eric Lloyd Wright, to design a pool house for the property. He used another adjoining house he owns as Bill Pullman and Patricia Arquette\u0026#39;s home in Lost Highway, actually \u003ca href=\"https://www.rollingstone.com/music/music-news/david-lynch-and-trent-reznor-the-lost-boys-62337/\"\u003emodifying its facade for the film\u003c/a\u003e. What do you see in that house? Bertoia\u0026#39;s \u003ca href=\"https://www.dezeen.com/2024/10/07/harry-bertoia-diamond-chair-mid-century-modern/\"\u003eDiamond Chair\u003c/a\u003e and the Eames\u0026#39; Elliptical table, as well as furniture of his own design.\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eDrapes were the design tool that Lynch used to greatest effect\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eFrank Lloyd Wright\u0026#39;s Ennis House was the set for Twin Peaks\u0026#39; internal soap opera Invitation to Love. Lynch directed \u003ca href=\"https://www.youtube.com/watch?v=N44XXCQ8SEk\"\u003ean Yves St Laurent commercial\u003c/a\u003e set in Chareau\u0026#39;s Maison de Verre in Paris, and he made use of all sorts of notable properties otherwise.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Assessed as a whole, Lynch\u0026#39;s career constitutes an idiosyncratic history of architecture and design,\u0026#34; Richard Martin wrote in his book \u003ca href=\"https://www.bloomsbury.com/us/architecture-of-david-lynch-9781472520234/\"\u003eThe Architecture of David Lynch\u003c/a\u003e. \u0026#34;Perhaps, then, we might consider his films as forming an imaginative and unconventional architectural project in their own right.\u0026#34;\u003c/p\u003e\n\u003cp\u003eDrapes – that rather overlooked soft lining of glassy modernism, employed repeatedly by Mies, Loos and Neutra – were the design tool that Lynch used to greatest effect. They are there in Pullman and Arquette\u0026#39;s bedroom in Lost Highway, and they define his most iconic space: the Red Room in Twin Peaks.\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003eThe associations with theatre are inescapable, and red curtains appear again on a stage in Mulholland Drive\u0026#39;s Club Silencio, a space that (sort of) became real in Lynch\u0026#39;s \u003ca href=\"https://www.dezeen.com/2011/09/07/silencio-by-david-lynch/\"\u003eSilencio nightclub in Paris\u003c/a\u003e, which features chairs of his design. These sorts of directorial forays have become more common; Wes Anderson designed \u003ca href=\"https://www.dezeen.com/2015/06/07/wes-anderson-designed-bar-luce-takes-cues-old-milanese-landmarks-cafes-fondazione-prada-interiors/\"\u003ea bar in Milan\u003c/a\u003e, and Luca Guadagnino \u003ca href=\"https://www.dezeen.com/2024/10/10/luca-guadagnino-palazzo-talia-hotel-rome/\"\u003ea hotel in Rome\u003c/a\u003e, but Lynch was there first.\u003c/p\u003e\n\u003cp\u003eHe is the rare director who can actually build his own furniture, having started in art school, and he adored the stuff. In \u003ca href=\"https://www.laweekly.com/getting-lost-is-beautiful/\"\u003ean interview with LA Weekly\u003c/a\u003e, he once said: \u0026#34;Every word has, you know, its spread of power. You could care a little bit or you could care a lot. But if you put this word caring at the maximum-level intensity, it wouldn\u0026#39;t begin to be enough to say how much I love furniture.\u0026#34;\u003c/p\u003e\n\u003cp\u003eLynch was largely building for himself, designing his own bed and much else, but did step slightly into the market. He had an exhibit of his work at Salone del Mobile in 1997. Now-defunct Swiss furniture company Casanostra \u003ca href=\"https://www.reddit.com/r/FuckYourEamesLounge/comments/1i46i6k/remembering_david_lynchs_furniture_collection_for/\"\u003eproduced a limited run\u003c/a\u003e of several of his designs subsequently.\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eThe minimalism he favoured at home would be deliberately eschewed to evocative purpose\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eSome of these pieces border on absurdism, but a number were designed for an almost-hilarious specificity of use: there is an espresso table and a whiskey and cigar table. The most obvious inspiration seems to be Chareau\u0026#39;s discordant-but-perfect meldings of the hand-hewn natural and industrial materials.\u003c/p\u003e\n\u003cp\u003eHe was also \u003ca href=\"https://www.pinupmagazine.org/articles/eruptions-of-the-strange-david-lynch-lamps\"\u003ea prolific lamp designer\u003c/a\u003e, veering between driftwood dadaism and Bauhaus rectilinearity. There\u0026#39;s \u003ca href=\"https://vimeo.com/501532541\"\u003ea short film\u003c/a\u003e of him working on his lamps, proof that he wasn\u0026#39;t just handing off sketches to someone else.\u003c/p\u003e\n\u003cp\u003eWhat are we to make of this all? Among all the glorious traits that might define the Lynchian style is its hallucinogenic attention to the atmosphere of given locations. It\u0026#39;s cinematic lingering that flows naturally from someone who was acutely attuned to the vibe of spaces he\u0026#39;s in all of the time. As he wrote in his semi-autobiography, tellingly titled \u003ca href=\"https://www.penguinrandomhouse.com/books/545016/room-to-dream-by-david-lynch-and-kristine-mckenna/\"\u003eRoom to Dream\u003c/a\u003e, \u0026#34;the more pure the room, the more the people and the furniture can come forth.\u0026#34;\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003eThe average person might bump into a table if it\u0026#39;s too large but likely wouldn\u0026#39;t say it was deranging their thoughts. Lynch did. In that Form interview, he said: \u0026#34;To my mind, most tables are too big and they\u0026#39;re too high. They shrink the size of the room and eat into space and cause unpleasant mental activity.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAnd he made viscerally clear to his audience just what this sort of sensitivity constitutes. The minimalism he favoured at home would be deliberately eschewed to evocative purpose in his work.\u003c/p\u003e\n\u003cp\u003eHis was not an uniform cinematic aesthetic in the manner of directors whose film sets look rather the same, but conveyed concentrated attention to the essence of a variety of spaces, whether art deco theatres or Googie diners or various Hollywood fantasyland locations.\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eHe knew precisely how to use design and spaces to make us feel a certain way\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eIn other words, Lynch was a superb director of architecture. He knew precisely how to use design and spaces to make us feel a certain way, and keep on feeling it long after Twin Peaks, or Mulholland Drive, or Lost Highway are over. These are media that explore the power of space a good deal better than most films ostensibly about architecture.\u003c/p\u003e\n\u003cp\u003eLynch\u0026#39;s last foray into design was at the 2024 edition of Salone del Mobile, where he designed \u003ca href=\"https://www.dezeen.com/2024/04/18/david-lynch-a-thinking-room-gigantic-wooden-chair/\"\u003eA Thinking Room\u003c/a\u003e. What was in it? Deep blue walls, a golden ceiling, and a throne with seven \u0026#34;chimneys\u0026#34; connected to the ceiling, for ideas to vent in or out. In some ways, he needn\u0026#39;t have bothered; every space he created had us thinking.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAnthony Paletta is an architecture journalist based in New York City. His writing has appeared in \u003c/em\u003e\u003cem\u003eThe Wall Street Journal, The Guardian, Bloomberg CityLab, The Architect\u0026#39;s Newspaper and Metropolis, among others.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eDezeen In Depth\u003c/em\u003e\u003c/strong\u003e\u003cbr/\u003e\u003cem\u003eIf you enjoy reading Dezeen\u0026#39;s interviews, opinions and features, \u003ca href=\"https://www.dezeen.com/dezeenindepth/\"\u003esubscribe to Dezeen In Depth\u003c/a\u003e. Sent on the last Friday of each month, this newsletter provides a single place to read about the design and architecture stories behind the headlines.\u003c/em\u003e\u003c/p\u003e\n\n                \n                \n                \n\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Agenda US\u003c/strong\u003e\n                \u003cp\u003eSent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#2f5f5d46594e4c566f4b4a554a4a41014c4042\"\u003e\u003cspan data-cfemail=\"b7c7c5dec1d6d4cef7d3d2cdd2d2d999d4d8da\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": "2025-02-07T10:15:18Z",
  "modifiedTime": "2025-02-06T16:28:34Z"
}
