{
  "id": "de9adafd-1233-4334-871c-f41437982987",
  "title": "A Tranquil Family Home Hits The Market In Carlton",
  "link": "https://thedesignfiles.wpenginepowered.com/2025/05/on-the-market-10-david-st-carlton-jellis-craig/",
  "description": "When they first purchased their Carlton family home 11 years ago, Emma Telfer and Marcus Smith affectionately referred to it as ‘shearing shed chic’, thanks to its internal corrugated iron and timber-lined walls and feature tree trunk poles. That was until they engaged DesignOffice to undertake a complete and thoughtful renovation in 2016. Now, the light-filled home is a far cry from its corrugated iron origins, with a stained timber batten facade and spacious interiors that transport the family away from Carlton’s happening streets. See more of this tranquil home for sale below!",
  "author": "The Design Files",
  "published": "Fri, 09 May 2025 20:00:27 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 2637,
  "excerpt": "Positioned in the heart of Carlton, this clever family home is a surprisingly serene retreat away from its happening neighbourhood.",
  "siteName": "",
  "favicon": "",
  "text": "Despite being located just two kilometres from the city, in the heart of Carlton, VIC, this tranquil family home for sale invites a surprising sense of privacy and retreat. It’s something the vendor, Emma Telfer, chief operating officer at Assemble, credits to the renovation by DesignOffice in 2016, which transformed the previous ‘unmistakable’ 90s features and captialised on the home’s inherent qualities: the beautiful natural light, timber-lined ceilings, and sense of volume. ‘One of the main challenges was resolving the facade, which was very open to the street,’ explains Emma. ‘We wanted to create a sense of privacy while still allowing light and a connection to the street to come through.’ Inspired by residential architecture in Tokyo (‘where a home’s identity isn’t necessarily revealed through its exterior’), an operable timber batten screen, softens the threshold between public and private space. The screen, which opens up onto the dining and kitchen on the second floor to flood the space with natural light, can also be closed for privacy whilst still filtering soft light into the home. ‘The way the light moves quietly through the house over the course of the day remains one of its quietest pleasures,’ says Emma. ‘Shifting gently to animate surfaces and reveal the home’s understated beauty.’ Other changes DesignOffice implemented during the renovation saw the kitchen upgraded, bathrooms reworked and new flooring installed throughout. ‘DesignOffice brought a highly considered approach to materiality and colour, which is expressed most clearly in the kitchen,’ explains Emma. Rich green cabinetry by Cantilever Interiors and a stainless steel benchtop combine for an elegant interplay of texture, tone and function — an eye-catching feature as you enter the main living space. Meanwhile bluestone flooring was introduced to provide a grounded and tactile base for the home. Sitting alongside these striking architectural features is clever planting by Pop Plant. ‘It truly brought the spaces to life, softening edges and grounding the architecture,’ says Emma, referring to the greenery climbing its way either side of the home to provide a green outlook from most windows. ‘The home carries a quiet sense of resolution,’ she says. ‘Each element has been carefully considered.’ It makes the decision to sell all the more bittersweet. ‘This has been a place of calm, creativity and connection for us,’ Emma explains. ‘It’s not an easy thing to step away from.’ 11 David Street, Carlton, VIC, is listed with David Sanguinedo and Arthur Psarras at Jellis Craig and will go to auction on Saturday May 24, 11am.",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2025/05/10DavidSt-tdf-final6-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003eDespite being located just two kilometres from the city, in the heart of Carlton, VIC, \u003ca href=\"https://www.jelliscraig.com.au/property-details-11-David-Street-Carlton/1680515\" target=\"_blank\" rel=\"noopener\"\u003ethis tranquil family home\u003c/a\u003e for sale invites a surprising sense of privacy and retreat.\u003c/h3\u003e\n\u003cp\u003eIt’s something the vendor, Emma Telfer, chief operating officer at Assemble, credits to the renovation by \u003ca href=\"https://designoffice.com.au/\" target=\"_blank\" rel=\"noopener\"\u003eDesignOffice\u003c/a\u003e in 2016, which transformed the previous ‘unmistakable’ 90s features and captialised on the home’s inherent qualities: the beautiful natural light, timber-lined ceilings, and sense of volume.\u003c/p\u003e\n\u003cp\u003e‘One of the main challenges was resolving the facade, which was very open to the street,’ explains Emma. ‘We wanted to create a sense of privacy while still allowing light and a connection to the street to come through.’\u003c/p\u003e\n\u003cp\u003eInspired by residential architecture in Tokyo (‘where a home’s identity isn’t necessarily revealed through its exterior’), an operable timber batten screen, softens the threshold between public and private space.\u003c/p\u003e\n\u003cp\u003eThe screen, which opens up onto the dining and kitchen on the second floor to flood the space with natural light, can also be closed for privacy whilst still filtering soft light into the home.\u003c/p\u003e\n\u003cp\u003e‘The way the light moves quietly through the house over the course of the day remains one of its quietest pleasures,’ says Emma. ‘Shifting gently to animate surfaces and reveal the home’s understated beauty.’\u003c/p\u003e\n\u003cp\u003eOther changes DesignOffice implemented during the renovation saw the kitchen upgraded, bathrooms reworked and new flooring installed throughout.\u003c/p\u003e\n\u003cp\u003e‘DesignOffice brought a highly considered approach to materiality and colour, which is expressed most clearly in the kitchen,’ explains Emma.\u003c/p\u003e\n\u003cp\u003eRich green cabinetry by \u003ca href=\"https://www.cantileverinteriors.com/\" target=\"_blank\" rel=\"noopener\"\u003eCantilever Interiors\u003c/a\u003e and a stainless steel benchtop combine for an elegant interplay of texture, tone and function — an eye-catching feature as you enter the main living space. Meanwhile bluestone flooring was introduced to provide a grounded and tactile base for the home.\u003c/p\u003e\n\u003cp\u003eSitting alongside these striking architectural features is clever planting by \u003ca href=\"https://popplant.com.au/\" target=\"_blank\" rel=\"noopener\"\u003ePop Plant\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e‘It truly brought the spaces to life, softening edges and grounding the architecture,’ says Emma, referring to the greenery climbing its way either side of the home to provide a green outlook from most windows.\u003c/p\u003e\n\u003cp\u003e‘The home carries a quiet sense of resolution,’ she says. ‘Each element has been carefully considered.’\u003c/p\u003e\n\u003cp\u003eIt makes the decision to sell all the more bittersweet.\u003c/p\u003e\n\u003cp\u003e‘This has been a place of calm, creativity and connection for us,’ Emma explains. ‘It’s not an easy thing to step away from.’\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003e\u003ca href=\"https://www.jelliscraig.com.au/property-details-11-David-Street-Carlton/1680515\" target=\"_blank\" rel=\"noopener\"\u003e11 David Street, Carlton, VIC\u003c/a\u003e, is listed with \u003ca href=\"https://www.jelliscraig.com.au/agents/David-Sanguinedo\" target=\"_blank\" rel=\"noopener\"\u003eDavid Sanguinedo\u003c/a\u003e and \u003ca href=\"https://www.jelliscraig.com.au/agents/Arthur-Psarras\" target=\"_blank\" rel=\"noopener\"\u003eArthur Psarras\u003c/a\u003e at Jellis Craig and will go to auction on Saturday May 24, 11am.\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
