{
  "id": "dee14aab-3cc4-43f2-8cc2-552519938d67",
  "title": "Style Scouting: Vol. 212",
  "link": "https://inmyownstyle.com/style-scouting-vol-212.html",
  "description": "This post is from the blog, InMyOwnStyle.com Thanks for stopping by for this week’s Style Scouting. My Sunday post where I share the random stuff that captured my attention or inspired me that I found online. Before reading through the links I found this week, I wanted to make sure to thank all of you for leaving me such... If you enjoyed this post you may also enjoy the easy to follow DIY Decorating Tutorials and Creative Ideas on my blog, In My Own Style.com Republishing this article in full or in part is a violation of Copyright law @2009-2021, all rights reserved",
  "author": "Diane Henkler",
  "published": "Sun, 06 Oct 2024 09:00:00 +0000",
  "source": "https://inmyownstyle.com/feed",
  "categories": [
    "Style Scouting"
  ],
  "byline": "Diane Henkler",
  "length": 2145,
  "excerpt": "Thanks for stopping by for this week’s Style Scouting. My Sunday post where I share the random stuff that captured my attention or inspired me that I found online. photo: Hymns \u0026 Home Before reading through the",
  "siteName": "In My Own Style",
  "favicon": "",
  "text": "Thanks for stopping by for this week’s Style Scouting. My Sunday post where I share the random stuff that captured my attention or inspired me that I found online. Before reading through the links I found this week, I wanted to make sure to thank all of you for leaving me such nice comments about the damage that Hurricane Helene did to my house. I got to read all of them when I went to my sister’s home where they got their power back two days after the storm. Reading them helped keep my spirits up instead of thinking about all that needs to be done to fix the roof and guest room and living without power for 6 days. I laughed out loud after reading what Janet wrote…  the tree is keeping with your “white and woodsy” design style. :-) The past week will be one I won’t forget, but when I think about all that was lost in the Asheville, NC area and in Florida, my problems are small. Being without power for 6 days was tough, but we got through it. When the power did go back on the fridge that was already giving us problems before the storm basically didn’t restart and leaked all over the floor, ruining the floor. We were able to get a new one right away, but now in the kitchen we have floor damage, plus kitchen ceiling damage from the tree. Insurance will cover some of it, but after lots of thought, we will hire someone to redo the entire kitchen – floor to ceiling. I will post more about all of this soon, right now I am just trying to get back into my daily routine. The rock stars in my life this past week are our neighbors who have helped us remove some of the tree debris and also the tree removal service guys and the power company lineman. They have been working around the clock!!!! I can’t thank them enough for all they did and are still doing!!!!! Now onto this week’s links. If you enjoy these posts – You can find past Style Scouting posts here. And… If you’re catching up on blog posts you may have missed, be sure to sign-up to get my newest posts via email to stay up to date with everything that’s happening here on the blog and more. Post navigation",
  "image": "https://inmyownstyle.com/wp-content/uploads/2024/10/Kalbfleisch-8.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\t\t\u003cmain id=\"main\" role=\"main\"\u003e\n\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003carticle id=\"post-98881\"\u003e\n\t\u003cdiv\u003e\n\t\n\u003cdiv\u003e\n\u003cp\u003eThanks for stopping by for this week’s Style Scouting. My Sunday post where I share the random stuff that captured my attention or inspired me that I found online.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003eBefore reading through the links I found this week, I wanted to make sure to thank all of you for leaving me such nice comments about the damage that Hurricane Helene did to my house. I got to read all of them when I went to my sister’s home where they got their power back two days after the storm. \u003c/p\u003e\n\n\n\n\u003cp\u003eReading them helped keep my spirits up instead of thinking about all that needs to be done to fix the roof and guest room and living without power for 6 days. I laughed out loud after reading what Janet wrote… \u003cem\u003e the tree is keeping with your “white and woodsy” design style.  :-) \u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe past week will be one I won’t forget, but when I think about all that was lost in the Asheville, NC area and in Florida, my problems are small.\u003c/p\u003e\n\n\n\n\u003cp\u003eBeing without power for 6 days was tough, but we got through it. When the power did go back on the fridge that was already giving us problems before the storm basically didn’t restart and leaked all over the floor, ruining the floor.\u003c/p\u003e\n\n\n\n\u003cp\u003eWe were able to get a new one right away, but now in the kitchen we have floor damage, plus kitchen ceiling damage from the tree. Insurance will cover some of it, but after lots of thought, we will hire someone to redo the entire kitchen – floor to ceiling. I will post more about all of this soon, right now I am just trying to get back into my daily routine.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe rock stars in my life this past week are our neighbors who have helped us remove some of the tree debris and also the tree removal service guys and the power company lineman. They have been working around the clock!!!! I can’t thank them enough for all they did and are still doing!!!!!\u003c/p\u003e\n\n\n\n\u003cp\u003eNow onto this week’s links.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003cp\u003eIf you enjoy these posts – You can find past \u003ca href=\"https://inmyownstyle.com/category/creative-stylish-ideas-for-home-and-living\"\u003e\u003cem\u003eStyle Scouting\u003c/em\u003e posts here\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eAnd…\u003c/strong\u003e If you’re catching up on blog posts you may have missed, be sure \u003cstrong\u003e\u003ca href=\"https://inmyownstyle.com/subscribe-to-in-my-own-style-blog\"\u003eto sign-up\u003c/a\u003e \u003c/strong\u003eto get my \u003cstrong\u003enewest posts via email \u003c/strong\u003eto stay up to date with everything that’s happening here on the blog and more.\u003c/p\u003e\n\u003c/div\u003e\n\n\n\t\u003cnav aria-label=\"Posts\"\u003e\n\t\t\u003ch2\u003ePost navigation\u003c/h2\u003e\n\t\t\n\t\u003c/nav\u003e\u003c/div\u003e\n\u003c/article\u003e\n\n\n\n\t\t\t\t\t\u003c/div\u003e\u003c/main\u003e\n\t\t\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-06T09:00:00Z",
  "modifiedTime": "2024-10-06T08:49:55Z"
}
