{
  "id": "e31d0f42-46a8-44f3-95e6-f2417542b235",
  "title": "A Fashion Designer’s Stylish + Warm Melbourne Home",
  "link": "https://thedesignfiles.wpenginepowered.com/2025/01/homes-emma-cutri-sister-studios-brunswick-east/",
  "description": "Emma Cutri, co-owner and designer of Sister Studios, lived in her Brunswick East home with friends for almost 10 years before embarking on a renovation designed by Peter Frederick Cole Architect (PFCA) in collaboration with Anne-Therese Ryan. These inspiring updates have taken the already beloved California bungalow to the next level, by introducing more natural light, a large kitchen, and a warm, earthy colour palette – with a few fun surprises! The result is a home that feels just like Emma’s fashion label: cool, dreamy, and a little bit unexpected.",
  "author": "The Design Files",
  "published": "Tue, 14 Jan 2025 19:00:40 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 3136,
  "excerpt": "Emma Cutri of Sister Studios has given her Melbourne bungalow a mega stylish makeover featuring a surprising use of blue and red.",
  "siteName": "",
  "favicon": "",
  "text": "The Brunswick East home of fashion designer Emma Cutri, founder of Sister Studios, is a serene and stylish sanctuary. After purchasing the property in 2014, Emma spent years living in the house as a share home, before embarking on an ambitious renovation with her partner, architect Chris Mark. The result is a beautifully transformed space that balances modern functionality with earthy warmth, and a touch of retro flair. ‘This house was love at first sight,’ Emma recalls. ‘As soon as I pulled up, it just felt right. The layout and the shape of the house just felt calming and like my home straight away.’ While the original structure had its charms, including a distinctive spiral brickwork in the backyard, it also had a few challenges – a convoluted internal layout, lack of natural light and little connection to outdoors. The recent renovation has addressed all these concerns and more, reimagining the space for modern living, while honouring its past. Designed by Peter Frederick Cole Architect (PFCA) in collaboration with Anne-Therese Ryan, and built by J\u0026RC Builders, the renovation retained the front two rooms of the original single-story house, while expanding and reconfiguring the layout. The aim was to simplify the interiors, and create a more open-plan space that would connect to the backyard. Large sliding doors and clerestory windows were added to flood the home with natural light and facilitate seamless indoor-outdoor living. A highlight of the renovation is the kitchen, a space designed to be the heart of the home. With its generous proportions, dreamy stone bench tops and garden outlook, it’s where Emma spends much of her time cooking and hosting friends. ‘The kitchen is almost industrial size, which makes it perfect for entertaining’ Emma says. The bathroom, a playful departure from the earthy tones, is another standout feature. Inspired by retro design, the contrasting blue and deep red tiles exude a fun, nostalgic charm. Emma explains ‘I loved the checkerboard idea, and wanted to incorporate blue and red because I love the two together, so we did a simple red trim in the top tile, and paired it with the red coming through in the marble.’ Emma’s eye for design extends to every corner of the home, where cherished pieces tell personal stories. Her dining table and chairs from Good Space were purchased even before renovations began, their muted blue hues pairing perfectly with the terracotta floor tiles Emma selected early on in the design process. The outdoor area is Emma’s favourite spot. The couple re-paved the space using leftover bricks, creating circular patterns as an homage to the original spiral brickwork in the garden. ‘My favourite part of the house is my outdoor area, I just love it. I feel so lucky to  have it!’ Emma says. ‘Not many people I know get to have grass in their backyard anymore, so I love my beautiful flower garden and grass’. For Emma, the house is a reflection of her personality and lifestyle. ‘As soon as you walk in it feels so cosy’ she says. ‘Despite being a new build, all the warm features we added make it feel like it’s always been this way.’",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2025/01/EmmaCutri-tdf-homes7-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003eThe Brunswick East home of fashion designer Emma Cutri, founder of \u003ca href=\"https://sisterstudios.com.au/\" target=\"_blank\" rel=\"noopener\"\u003eSister Studios\u003c/a\u003e, is a serene and stylish sanctuary.\u003c/h3\u003e\n\u003cp\u003eAfter purchasing the property in 2014, Emma spent years living in the house as a share home, before embarking on an ambitious renovation with her partner, architect Chris Mark. The result is a beautifully transformed space that balances modern functionality with earthy warmth, and a touch of retro flair.\u003c/p\u003e\n\u003cp\u003e‘This house was love at first sight,’ Emma recalls. ‘As soon as I pulled up, it just felt right. The layout and the shape of the house just felt calming and like my home straight away.’\u003c/p\u003e\n\u003cp\u003eWhile the original structure had its charms, including a distinctive spiral brickwork in the backyard, it also had a few challenges – a convoluted internal layout, lack of natural light and little connection to outdoors. The recent renovation has addressed all these concerns and more, reimagining the space for modern living, while honouring its past.\u003c/p\u003e\n\u003cp\u003eDesigned by \u003ca href=\"https://pfcarchitect.com/\" target=\"_blank\" rel=\"noopener\"\u003ePeter Frederick Cole Architect\u003c/a\u003e (PFCA) in collaboration with Anne-Therese Ryan, and built by \u003ca href=\"https://www.jrcbuilders.com.au/\" target=\"_blank\" rel=\"noopener\"\u003eJ\u0026amp;RC Builders\u003c/a\u003e, the renovation retained the front two rooms of the original single-story house, while expanding and reconfiguring the layout.\u003c/p\u003e\n\u003cp\u003eThe aim was to simplify the interiors, and create a more open-plan space that would connect to the backyard. Large sliding doors and clerestory windows were added to flood the home with natural light and facilitate seamless indoor-outdoor living.\u003c/p\u003e\n\u003cp\u003eA highlight of the renovation is the kitchen, a space designed to be the heart of the home. With its generous proportions, dreamy stone bench tops and garden outlook, it’s where Emma spends much of her time cooking and hosting friends. ‘The kitchen is almost industrial size, which makes it perfect for entertaining’ Emma says.\u003c/p\u003e\n\u003cp\u003eThe bathroom, a playful departure from the earthy tones, is another standout feature. Inspired by retro design, the contrasting blue and deep red tiles exude a fun, nostalgic charm. Emma explains ‘I loved the checkerboard idea, and wanted to incorporate blue and red because I love the two together, so we did a simple red trim in the top tile, and paired it with the red coming through in the marble.’\u003c/p\u003e\n\u003cp\u003eEmma’s eye for design extends to every corner of the home, where cherished pieces tell personal stories. Her dining table and chairs from Good Space were purchased even before renovations began, their muted blue hues pairing perfectly with the terracotta floor tiles Emma selected early on in the design process.\u003c/p\u003e\n\u003cp\u003eThe outdoor area is Emma’s favourite spot. The couple re-paved the space using leftover bricks, creating circular patterns as an homage to the original spiral brickwork in the garden.\u003c/p\u003e\n\u003cp\u003e‘My favourite part of the house is my outdoor area, I just love it. I feel so lucky to  have it!’ Emma says. ‘Not many people I know get to have grass in their backyard anymore, so I love my beautiful flower garden and grass’.\u003c/p\u003e\n\u003cp\u003eFor Emma, the house is a reflection of her personality and lifestyle. ‘As soon as you walk in it feels so cosy’ she says. ‘Despite being a new build, all the warm features we added make it feel like it’s always been this way.’\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
