{
  "id": "e362d393-56c6-4d0d-a945-37be96428e86",
  "title": "An Architect’s Own Bushfire-Safe, Oceanfront House",
  "link": "https://thedesignfiles.wpenginepowered.com/2025/07/architecture-olive-street-cabin-matt-ross-goodman-architecture-office/",
  "description": "Architect Matt Ross Goodman was working pro bono in Separation Creek following the 2015 bushfires when he discovered the ideal block of vacant land for a holiday house. Drawing on the lessons he’d learned working in the Great Ocean Road town, he navigated the sloping block to design the most cost-efficient home possible. Six years of research, design, and construction later, Matt and his family are living the dream!",
  "author": "The Design Files",
  "published": "Fri, 25 Jul 2025 04:00:49 +0000",
  "source": "https://thedesignfiles.net/feed/",
  "categories": null,
  "byline": "",
  "length": 3307,
  "excerpt": "How architect Matt Ross Goodman created his own bushfire-safe home on the Great Ocean Road for under $500,000.",
  "siteName": "",
  "favicon": "",
  "text": "Architect Matt Ross Goodman loves the town of Separation Creek (located along the Great Ocean Road, about 150 kilometres south-west of Melbourne) so when the area was devastated by bushfires in 2015, he pitched in to help. Offering his architectural services to permanent residents who lost their homes, Matt completed three pro bono projects, which in turn informed foundations of his then fledgling practice Matt Ross Goodman Architecture Office. He explains, ‘We learnt so much over the four to five years working on these projects — all invaluable lessons for my career. All of the projects were on difficult steep sites, with high BAL ratings, and landslip risks. ‘These three projects — initiated through our desire to help — enabled me to develop my approach to design, whilst inadvertently developing my knowledge and experience in numerous complex areas that I may have never been exposed to had I not leant a hand.’ At the same time Matt was working in the area, he discovered a dream plot of vacant land for a holiday house to suit his growing family. Matt designed the new house on a relatively small 91-square-metre footprint to minimise both its visual impact and building costs. ‘We wanted the project to sit comfortably within the surrounds and not visually dominate it like some of the newer larger homes,’ he says. ‘Our site is surrounded by some original fibro beach shacks that have a humble scale and simple use of materials, and we wanted to be a nice new neighbour to these old homes… ‘The rectangular footprint was the most cost effective approach.’ Where the design breaks away from the area’s original shacks is through extensive use of glazing on the front facade, and what Matt describes as the relatively fussy detailing to conceal the window frames from view. ‘There were many reasons for this, the main being that we really wanted to be as close and connected as possible to the expansive view,’ he says. Externally, the house is clad in Colorbond Custom Orb sheets, mostly in the colour Windspray, to match to the basalt and riverstones that line nearby Separation Creek beach. Sliding screens close down the rear of the house when not in use, creating an arrival ritual that builds anticipation of the magical view revealed upon each visit. The remainder of the material palette is likewise cost efficient, comprising fibre cement sheet, plasterboard and laminate joinery. Blackbutt timber on the flooring and feature joinery softens what might otherwise be a relatively hard set of materials. The house was built by Basebuild Constructions for $457,000, although Matt says that figure doesn’t account for many favours, and the rising cost of construction post-COVID lockdowns. ‘Based on a number of current projects which we have in the area, I believe the cost of our build would be double at best, likely between $800,000 and $900,000,’ he says. ‘This is due to numerous factors, yet the key factor being scarcity/availability of builders and trades who service the area, and the difficult working conditions which the town poses.’ Matt’s home is one of 14 he’s designed so far in the Separation Creek area following the 2015 bushfires. Now a part-time resident, his love of the town is stronger than ever. ‘It is truly the most amazing place on the Victorian coastline.’",
  "image": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2025/07/OliveStreetCabin-tdf-archi16-2200x2860.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch3\u003eArchitect Matt Ross Goodman loves the town of Separation Creek (located along the Great Ocean Road, about 150 kilometres south-west of Melbourne) so when the area was devastated by bushfires in 2015, he pitched in to help.\u003c/h3\u003e\n\u003cp\u003eOffering his architectural services to permanent residents who lost their homes, Matt completed three pro bono projects, which in turn informed foundations of his then fledgling practice \u003ca href=\"https://www.mgao.com.au/\"\u003eMatt Ross Goodman Architecture Office\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eHe explains, ‘We learnt so much over the four to five years working on these projects — all invaluable lessons for my career. All of the projects were on difficult steep sites, with high BAL ratings, and landslip risks.\u003c/p\u003e\n\u003cp\u003e‘These three projects — initiated through our desire to help — enabled me to develop my approach to design, whilst inadvertently developing my knowledge and experience in numerous complex areas that I may have never been exposed to had I not leant a hand.’\u003c/p\u003e\n\u003cp\u003eAt the same time Matt was working in the area, he discovered a dream plot of vacant land for a holiday house to suit his growing family.\u003c/p\u003e\n\u003cp\u003eMatt designed the new house on a relatively small 91-square-metre footprint to minimise both its visual impact and building costs.\u003c/p\u003e\n\u003cp\u003e‘We wanted the project to sit comfortably within the surrounds and not visually dominate it like some of the newer larger homes,’ he says.\u003c/p\u003e\n\u003cp\u003e‘Our site is surrounded by some original fibro beach shacks that have a humble scale and simple use of materials, and we wanted to be a nice new neighbour to these old homes…\u003c/p\u003e\n\u003cp\u003e‘The rectangular footprint was the most cost effective approach.’\u003c/p\u003e\n\u003cp\u003eWhere the design breaks away from the area’s original shacks is through extensive use of glazing on the front facade, and what Matt describes as the relatively fussy detailing to conceal the window frames from view.\u003c/p\u003e\n\u003cp\u003e‘There were many reasons for this, the main being that we really wanted to be as close and connected as possible to the expansive view,’ he says.\u003c/p\u003e\n\u003cp\u003eExternally, the house is clad in Colorbond Custom Orb sheets, mostly in the colour Windspray, to match to the basalt and riverstones that line nearby Separation Creek beach.\u003c/p\u003e\n\u003cp\u003eSliding screens close down the rear of the house when not in use, creating an arrival ritual that builds anticipation of the magical view revealed upon each visit.\u003c/p\u003e\n\u003cp\u003eThe remainder of the material palette is likewise cost efficient, comprising fibre cement sheet, plasterboard and laminate joinery. Blackbutt timber on the flooring and feature joinery softens what might otherwise be a relatively hard set of materials.\u003c/p\u003e\n\u003cp\u003eThe house was built by \u003ca href=\"https://www.basebuildconstruction.com.au/\" target=\"_blank\" rel=\"noopener\"\u003eBasebuild Constructions\u003c/a\u003e for $457,000, although Matt says that figure doesn’t account for many favours, and the rising cost of construction post-COVID lockdowns.\u003c/p\u003e\n\u003cp\u003e‘Based on a number of current projects which we have in the area, I believe the cost of our build would be double at best, likely between $800,000 and $900,000,’ he says.\u003c/p\u003e\n\u003cp\u003e‘This is due to numerous factors, yet the key factor being scarcity/availability of builders and trades who service the area, and the difficult working conditions which the town poses.’\u003c/p\u003e\n\u003cp\u003eMatt’s home is one of 14 he’s designed so far in the Separation Creek area following the 2015 bushfires. Now a part-time resident, his love of the town is stronger than ever.\u003c/p\u003e\n\u003cp\u003e‘It is truly the most amazing place on the Victorian coastline.’\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
