{
  "id": "e4b2639b-2bc5-4d6b-93c2-05d3f948c0b6",
  "title": "Holloway Li incorporates local craft heritage into Poznań hotel redesign",
  "link": "https://www.dezeen.com/2024/12/28/holloway-li-puro-hotel-poznan/",
  "description": "Design studio Holloway Li has reimagined the interiors of the Puro hotel in Poznań, Poland, integrating natural materials, contemporary furnishings and locally sourced art to create \"a layering of history\". Drawing on Poznań's cultural and craft heritage, the studio aimed to capture the city's identity by weaving historical influences into the redesign of the hotel, The post Holloway Li incorporates local craft heritage into Poznań hotel redesign appeared first on Dezeen.",
  "author": "Gabriella Wong",
  "published": "Sat, 28 Dec 2024 06:00:41 +0000",
  "source": "https://www.dezeen.com/interiors/feed/",
  "categories": [
    "all",
    "Interiors",
    "Poland",
    "Hotels",
    "Poznań",
    "Holloway Li"
  ],
  "byline": "Gabriella Wong",
  "length": 8749,
  "excerpt": "Design studio Holloway Li has reimagined the interiors of the Puro hotel in Poznań, Poland, to create a \"layering of history\".",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Design studio Holloway Li has reimagined the interiors of the Puro hotel in Poznań, Poland, integrating natural materials, contemporary furnishings and locally sourced art to create \"a layering of history\". Drawing on Poznań's cultural and craft heritage, the studio aimed to capture the city's identity by weaving historical influences into the redesign of the hotel, which first opened its doors in 2014. Holloway Li has transformed the interiors of the PURO hotel in Poznań, Poland\"We took inspiration from Poznań's craft heritage, from the streamlined forms and luxurious carriage interiors of the early twentieth-century trains produced in local factories to experimental 1970s glassware,\" Holloway Li co-founder Alex Holloway told Dezeen. \"The aim was to create a layering of history that business travellers, tourists and locals could enjoy.\" The reception desk is made of burnt red glazed tiles and raised on limestone plinthsHolloway Li transformed the existing ground floor and guest rooms, introducing site-specific designs to create a distinctive guest experience. The reception area features a curved desk crafted from burnt red glazed tiles and elevated on sculpted limestone plinths. A hand-tufted rug beneath it incorporates patterns and textures inspired by the nearby Old Market Square, while a pendant light suspended above adds a contemporary touch. A circular brass cutout offers a view of the lounge from the receptionAs a nod to Poznań's industrial history, a partition wall in the lounge is punctuated by a large circular brass cutout, referencing the design language of high-speed trains produced in Poznań's surrounding factories in the early 20th century. The lounge offers a mix of versatile seating options, including the studio's T4 armchairs in collaboration with furniture brand Uma, Swedish design company Fogia's sofas and a large co-working table with inlaid burl wood markings. The lounge offers a variety of seats, including Holloway Li's T4 armchairsA palette of natural materials, including solid oak, leather and glazed ceramics, enhances the sense of warmth and domesticity throughout the space. This material palette extends to the hotel's curated art collection, developed in collaboration with Puro's art director, Gosia Jankowska. The integration of local artistry was a key feature of the hotel's redesign, showcasing works by local artists, many of whom are connected to Poznań University. \"The artwork curation was the result of working closely with Puro's art director Gosia Jankowska, who manages the hotel's growing art collection,\" said project designer Grey Grierson. \"All the artworks on display are connected to Poznań and add an unexpected textural dimension to the space.\" Local craftsmanship is further celebrated through bespoke decorative elements such as glass windows for a private meeting room, which Holloway Li developed in collaboration with local manufacturer Riwal Ceramika i Szkło. The design of the windows was informed by the art nouveau style of Poznań's historic townhouses and traditional crown glass. Bespoke glass windows were created for the private meeting roomThe hotel's restaurant continues this theme, with leather dining chairs and long banquettes that nod to the rail carriage interiors manufactured in Poznań during the 1920s and 1930s. To create a shift in the spaces as guests navigate through the hotel, the corridors take on a darker palette from the rest of the interiors with earthy red tones and dim lighting, guiding guests to lift lobbies clad in staggered pale limestone. The hotel's restaurant is furnished with leather dining chairs and long banquettesOutside the rooms, each guest room number was individually moulded and glazed by ceramics manufacturer Riwal Ceramika i Szkło. Inside, Holloway Li introduced a simple colour palette layered with soft textiles to evoke a sense of home. The guest rooms feature a green datum with a rounded timber beading, while a gradient shower glass inspired by Polish glass homeware is the main focus of the bathrooms. The guest rooms feature a green datum with a rounded timber beading\"There are moments of vibrancy which stand out from the natural palette,\" said Holloway. \"In the guestrooms, we introduced a vibrant gradient to the shower glass inspired by historic Polish pressed glass homeware.\" The suites offer elevated touches, such as limestone side tables carved to complement the curvature of fabric headboards and bathrooms outfitted with green tiles and matching marbled sinks. Holloway Li is an interior design studio founded by Alex Holloway and Na Li in 2018. Other recent projects by the studio include an apartment with a kitchen inspired by a fish and chip shop and a 1970s-inspired advertising agency office. The photography is by PION Studio. Subscribe to our newsletters Your email address New! Dezeen Agenda US Sent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events. New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan-hero_dezeen_2364_col_0-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2156187\" data-article-id=\"2156187\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan-hero_dezeen_2364_col_0.jpg\" id=\"preload-hero\"\u003e\n\t\t\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan-hero_dezeen_2364_col_0-852x479.jpg\" alt=\"PURO Hotel by Holloway Li\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan-hero_dezeen_2364_col_0-852x479.jpg 1x, https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan-hero_dezeen_2364_col_0-1704x959.jpg 2x\" data-pin-nopin=\"true\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eDesign studio \u003ca href=\"https://www.dezeen.com/tag/holloway-li/\"\u003eHolloway Li\u003c/a\u003e has reimagined the interiors of the Puro hotel in \u003ca href=\"https://www.dezeen.com/tag/poznan/\"\u003ePoznań\u003c/a\u003e, Poland, integrating natural materials, contemporary furnishings and locally sourced art to create \u0026#34;a layering of history\u0026#34;.\u003cspan id=\"more-2156187\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eDrawing on Poznań\u0026#39;s cultural and craft heritage, the studio aimed to capture the city\u0026#39;s identity by weaving historical influences into the redesign of the hotel, which first opened its doors in 2014.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2156201\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_4.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_4-852x568.jpg\" alt=\"Lobby of PURO Hotel by Holloway Li\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_4-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_4-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2156201\"\u003eHolloway Li has transformed the interiors of the PURO hotel in Poznań, Poland\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;We took inspiration from Poznań\u0026#39;s craft heritage, from the streamlined forms and luxurious carriage interiors of the early twentieth-century trains produced in local factories to experimental 1970s glassware,\u0026#34; \u003ca href=\"https://hollowayli.com/\"\u003eHolloway Li\u003c/a\u003e co-founder Alex Holloway told Dezeen.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The aim was to create a layering of history that business travellers, tourists and locals could enjoy.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2156197\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_0.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_0-852x568.jpg\" alt=\"Reception desk PURO Hotel by Holloway Li\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_0-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_0-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2156197\"\u003eThe reception desk is made of burnt red glazed tiles and raised on limestone plinths\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eHolloway Li transformed the existing ground floor and guest rooms, introducing site-specific designs to create a distinctive guest experience.\u003c/p\u003e\n\n\n\u003cp\u003eThe reception area features a curved desk crafted from burnt red glazed tiles and elevated on sculpted limestone plinths. A hand-tufted rug beneath it incorporates patterns and textures inspired by the nearby Old Market Square, while a pendant light suspended above adds a contemporary touch.\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2156202\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_5-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_5-852x1278.jpg\" alt=\"Cutout of PURO Hotel by Holloway Li\" width=\"1576\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_5-852x1278.jpg 1x, https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_5-1704x2556.jpg 2x\" sizes=\"(max-width: 1576px) 100vw, 1576px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2156202\"\u003eA circular brass cutout offers a view of the lounge from the reception\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eAs a nod to Poznań\u0026#39;s industrial history, a partition wall in the lounge is punctuated by a large circular brass cutout, referencing the design language of high-speed trains produced in Poznań\u0026#39;s surrounding factories in the early 20th century.\u003c/p\u003e\n\u003cp\u003eThe lounge offers a mix of versatile seating options, including the studio\u0026#39;s T4 armchairs in collaboration with furniture brand \u003ca href=\"https://www.umaobjects.com/\"\u003eUma\u003c/a\u003e, Swedish design company \u003ca href=\"https://www.dezeen.com/showroom/fogia/\"\u003eFogia\u003c/a\u003e\u0026#39;s sofas and a large co-working table with inlaid burl wood markings.\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2156204\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_7.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_7-852x568.jpg\" alt=\"Lounge of PURO Hotel by Holloway Li\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_7-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_7-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2156204\"\u003eThe lounge offers a variety of seats, including Holloway Li\u0026#39;s T4 armchairs\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eA palette of natural materials, including solid oak, leather and glazed ceramics, enhances the sense of warmth and domesticity throughout the space.\u003c/p\u003e\n\u003cp\u003eThis material palette extends to the hotel\u0026#39;s curated art collection, developed in collaboration with Puro\u0026#39;s art director, Gosia Jankowska. The integration of local artistry was a key feature of the hotel\u0026#39;s redesign, showcasing works by local artists, many of whom are connected to Poznań University.\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003e\u0026#34;The artwork curation was the result of working closely with Puro\u0026#39;s art director Gosia Jankowska, who manages the hotel\u0026#39;s growing art collection,\u0026#34; said project designer Grey Grierson. \u0026#34;All the artworks on display are connected to Poznań and add an unexpected textural dimension to the space.\u0026#34;\u003c/p\u003e\n\u003cp\u003eLocal craftsmanship is further celebrated through bespoke decorative elements such as glass windows for a private meeting room, which Holloway Li developed in collaboration with local manufacturer \u003ca href=\"https://ceramikaiszklo.riwal.pl/en/start-english/\"\u003eRiwal Ceramika i Szkło\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThe design of the windows was informed by the art nouveau style of Poznań\u0026#39;s historic townhouses and traditional crown glass.\u003c/p\u003e\n\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-2156198\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_1-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_1-852x1278.jpg\" alt=\"Meeting room of PURO Hotel by Holloway Li\" width=\"1576\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_1-852x1278.jpg 1x, https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_1-1704x2556.jpg 2x\" sizes=\"(max-width: 1576px) 100vw, 1576px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2156198\"\u003eBespoke glass windows were created for the private meeting room\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe hotel\u0026#39;s restaurant continues this theme, with leather dining chairs and long banquettes that nod to the rail carriage interiors manufactured in Poznań during the 1920s and 1930s.\u003c/p\u003e\n\u003cp\u003eTo create a shift in the spaces as guests navigate through the hotel, the corridors take on a darker palette from the rest of the interiors with earthy red tones and dim lighting, guiding guests to lift lobbies clad in staggered pale limestone.\u003c/p\u003e\n\u003cfigure id=\"preload-5\" aria-describedby=\"caption-attachment-2156214\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_0-2.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_0-2-852x568.jpg\" alt=\"Restaurant of PURO Hotel by Holloway Li\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_0-2-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_0-2-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2156214\"\u003eThe hotel\u0026#39;s restaurant is furnished with leather dining chairs and long banquettes\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eOutside the rooms, each guest room number was individually moulded and glazed by ceramics manufacturer \u003ca href=\"https://ceramikaiszklo.riwal.pl/\"\u003eRiwal Ceramika i Szkło\u003c/a\u003e. Inside, Holloway Li introduced a simple colour palette layered with soft textiles to evoke a sense of home.\u003c/p\u003e\n\u003cp\u003eThe guest rooms feature a green datum with a rounded timber beading, while a gradient shower glass inspired by Polish glass homeware is the main focus of the bathrooms.\u003c/p\u003e\n\u003cfigure id=\"preload-6\" aria-describedby=\"caption-attachment-2156212\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_6-1.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_6-1-852x568.jpg\" alt=\"Guestrooms of PURO Hotel by Holloway Li\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_6-1-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/12/holloway-li-puro-hotel-poznan_dezeen_2364_col_6-1-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2156212\"\u003eThe guest rooms feature a green datum with a rounded timber beading\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;There are moments of vibrancy which stand out from the natural palette,\u0026#34; said Holloway. \u0026#34;In the guestrooms, we introduced a vibrant gradient to the shower glass inspired by historic Polish pressed glass homeware.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe suites offer elevated touches, such as limestone side tables carved to complement the curvature of fabric headboards and bathrooms outfitted with green tiles and matching marbled sinks.\u003c/p\u003e\n\u003cp\u003eHolloway Li is an interior design studio founded by Alex Holloway and Na Li in 2018.\u003c/p\u003e\n\u003cp\u003eOther recent projects by the studio include an \u003ca href=\"https://www.dezeen.com/2022/12/12/holloway-li-studio-co-founder-london-apartment/\"\u003eapartment with a kitchen inspired by a fish and chip shop\u003c/a\u003e and a \u003ca href=\"https://www.dezeen.com/2024/05/01/holloway-li-mother-london-office-london/\"\u003e1970s-inspired advertising agency office\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe photography is by \u003ca href=\"https://www.pionstudio.com/\"\u003ePION Studio\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\n                \n                \n                \n\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Agenda US\u003c/strong\u003e\n                \u003cp\u003eSent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#50202239263133291034352a35353e7e333f3d\"\u003e\u003cspan data-cfemail=\"7505071c0314160c3511100f10101b5b161a18\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-12-28T06:00:41Z",
  "modifiedTime": "2024-12-27T09:20:53Z"
}
