{
  "id": "e547733d-aa9c-4871-82b7-47fa5abb57c8",
  "title": "Industrial Design Case Study: Minimal's Solution to Combat Single-Use Package Design",
  "link": "https://www.core77.com/posts/134204/Industrial-Design-Case-Study-Minimals-Solution-to-Combat-Single-Use-Package-Design",
  "description": "Startup Small Wonder seeks to shake up the packaging and delivery methods of haircare products, making them more sustainable. To realize their goals, they turned to Scott Wilson's Chicago-based ID firm Minimal. Tiny Footprint, Lasting ImpactSmall Wonder is a company on a mission to produce no-compromise, salon-grade, powdered beauty care products, all while reducing or eliminating the reliance on single-use plastic containers in the beauty industry. MINIMAL designers and engineers worked to design and develop a reusable, refillable package that makes dispensing powdered haircare products easy, consistent and mess-free.Unlike dry shampoo, Small Wonder's products are meant to be used in the shower. Traditional shampoo is 75%–85% water, with the remaining volume made up of active ingredients. Powder concentrates are the opposite: they are 100% active ingredients and no water. Consumers simply add water to Small Wonder's powder in the shower, eliminating the need to ship the one thing everyone already has in their shower—water. Rubbing both wet hands together for about 10 seconds will activate the powder into a thick and luxurious lather. SustainabilityInvesting in ReusabilityPurchasing shampoo or conditioner normally means buying a single-use plastic bottle that will end up in a landfill. To change this paradigm, Small Wonder created a system that pairs a reusable powder-coated aluminum bottle with small, 100% recyclable refill tubes. Consumers receive the reusable bottle with their initial purchase, and subsequent purchases include a paper tube containing enough powder concentrate for 3–6 months of daily use. With Small Wonder, less truly is more—less waste, more product. Design ProcessElevating the Experience of Powder Hair-Care Powder hair care is more sustainable than traditional products, but Small Wonder will only fulfill its sustainability mission if people enjoy using it and replace their plastic shampoo bottles. Together Small Wonder and MINIMAL went the extra mile to ensure a user-friendly, mess-free, and delightful experience. We created over 50 prototypes to prove out the functionality and design of the bottle. Our reusable bottle includes a patented cap design that is a novel way to dose and dispense powder hair-care products. An internal silicone diaphragm seals the bottle, protecting the powder from the steamy shower environment, while allowing easy and consistent dispensing every time. The hourglass bottle design is not only colorful, playful, and iconic, but also functional. The bottle opening faces down and the top surface is domed. These features discourage upside-down storage, which might lead to water pooling around the opening and leaking into the powder. The bottom of the cap provides a stable base, but is also used to activate the dispensing mechanism by simply pressing the bottom of the bottle against your hand. And when it's time to refill, the compostable paper refill tube is designed to perfectly fit into the bottle, ensuring the powder ends up in the bottle and not on the bathroom floor. You can see more of Minimal's work here.",
  "author": "Rain Noe",
  "published": "",
  "source": "http://feeds.feedburner.com/core77/blog",
  "categories": [
    "Design Business|Design-Business",
    "Packaging|Packaging",
    "Sustainability|Sustainability"
  ],
  "byline": "",
  "length": 3501,
  "excerpt": "Startup Small Wonder seeks to shake up the packaging and delivery methods of haircare products, making them more sustainable. To realize their goals, they turned to Scott Wilson's Chicago-based ID firm Minimal. Tiny Footprint, Lasting ImpactSmall Wonder is a company on a mission to produce no-compromise, salon-grade, powdered",
  "siteName": "Core77",
  "favicon": "https://static.core77.com/images/favicons/favicon-192x192.png",
  "text": "Industrial Design Case Study: Minimal's Solution to Combat Single-Use Package Design Reusable powdered haircare packaging Startup Small Wonder seeks to shake up the packaging and delivery methods of haircare products, making them more sustainable. To realize their goals, they turned to Scott Wilson's Chicago-based ID firm Minimal. Tiny Footprint, Lasting ImpactSmall Wonder is a company on a mission to produce no-compromise, salon-grade, powdered beauty care products, all while reducing or eliminating the reliance on single-use plastic containers in the beauty industry. MINIMAL designers and engineers worked to design and develop a reusable, refillable package that makes dispensing powdered haircare products easy, consistent and mess-free.Unlike dry shampoo, Small Wonder's products are meant to be used in the shower. Traditional shampoo is 75%–85% water, with the remaining volume made up of active ingredients. Powder concentrates are the opposite: they are 100% active ingredients and no water. Consumers simply add water to Small Wonder's powder in the shower, eliminating the need to ship the one thing everyone already has in their shower—water. Rubbing both wet hands together for about 10 seconds will activate the powder into a thick and luxurious lather. SustainabilityInvesting in ReusabilityPurchasing shampoo or conditioner normally means buying a single-use plastic bottle that will end up in a landfill. To change this paradigm, Small Wonder created a system that pairs a reusable powder-coated aluminum bottle with small, 100% recyclable refill tubes. Consumers receive the reusable bottle with their initial purchase, and subsequent purchases include a paper tube containing enough powder concentrate for 3–6 months of daily use. With Small Wonder, less truly is more—less waste, more product. Design ProcessElevating the Experience of Powder Hair-Care Powder hair care is more sustainable than traditional products, but Small Wonder will only fulfill its sustainability mission if people enjoy using it and replace their plastic shampoo bottles. Together Small Wonder and MINIMAL went the extra mile to ensure a user-friendly, mess-free, and delightful experience. We created over 50 prototypes to prove out the functionality and design of the bottle. Our reusable bottle includes a patented cap design that is a novel way to dose and dispense powder hair-care products. An internal silicone diaphragm seals the bottle, protecting the powder from the steamy shower environment, while allowing easy and consistent dispensing every time. The hourglass bottle design is not only colorful, playful, and iconic, but also functional. The bottle opening faces down and the top surface is domed. These features discourage upside-down storage, which might lead to water pooling around the opening and leaking into the powder. The bottom of the cap provides a stable base, but is also used to activate the dispensing mechanism by simply pressing the bottom of the bottle against your hand. And when it's time to refill, the compostable paper refill tube is designed to perfectly fit into the bottle, ensuring the powder ends up in the bottle and not on the bathroom floor. You can see more of Minimal's work here. Favorite This Comment",
  "image": "https://s3files.core77.com/blog/images/lead_n_spotlight/1592583_lead_400_134204_.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-post-id=\"134204\" id=\"c77_content\"\u003e\n            \n    \u003cdiv id=\"post_header\"\u003e\n        \n\n            \u003cul\u003e\n                \n\n\n                            \u003c/ul\u003e\n        \n\n            \u003ch2\u003eIndustrial Design Case Study: Minimal\u0026#39;s Solution to Combat Single-Use Package Design \u003c/h2\u003e\n                    \u003ch2\u003eReusable powdered haircare packaging\u003c/h2\u003e\n                    \n\n        \n    \u003c/div\u003e\n\n    \n\n\n\n\n            \u003csection id=\"post\"\u003e\n\n\n\n\n\u003cp id=\"2b6da1_3349\" data-ic-marker=\"946f4a_1700\"\u003eStartup \u003ca href=\"https://smallwonder.world/\" rel=\"\"\u003eSmall Wonder\u003c/a\u003e seeks to shake up the packaging and delivery methods of haircare products, making them more sustainable. To realize their goals, they turned to Scott Wilson\u0026#39;s Chicago-based ID firm \u003ca href=\"https://www.mnml.com/small-wonder\" rel=\"\"\u003eMinimal\u003c/a\u003e.\u003c/p\u003e\u003cp id=\"3c39f5_1538\" data-ic-marker=\"51151_926\"\u003e\u003cimg src=\"https://s3files.core77.com/blog/images/1592591_81_134204_Xdh9HTS6v.png\"/\u003e \u003c/p\u003e\u003ch2 id=\"186f9e_2556_c_c\"\u003eTiny Footprint, Lasting Impact\u003c/h2\u003e\u003cblockquote id=\"d52192_5469_c\"\u003eSmall Wonder is a company on a mission to produce no-compromise, salon-grade, powdered beauty care products, all while reducing or eliminating the reliance on single-use plastic containers in the beauty industry. MINIMAL designers and engineers worked to design and develop a reusable, refillable package that makes dispensing powdered haircare products easy, consistent and mess-free.\u003c/blockquote\u003e\u003cblockquote id=\"d0d72_1779_c\"\u003eUnlike dry shampoo, Small Wonder\u0026#39;s products are meant to be used in the shower. Traditional shampoo is 75%–85% water, with the remaining volume made up of active ingredients. Powder concentrates are the opposite: they are 100% active ingredients and no water. Consumers simply add water to Small Wonder\u0026#39;s powder in the shower, eliminating the need to ship the one thing everyone already has in their shower—water. Rubbing both wet hands together for about 10 seconds will activate the powder into a thick and luxurious lather.\u003c/blockquote\u003e\u003cp id=\"25414b_3501\" data-ic-marker=\"f2eb7b_1324\"\u003e\u003cimg src=\"https://s3files.core77.com/blog/images/1592593_81_134204_YCj9BgClf.png\"/\u003e\u003c/p\u003e\u003cp id=\"cda0c9_5394\" data-ic-marker=\"3cf9bb_1550\"\u003e\u003cimg src=\"https://s3files.core77.com/blog/images/1592602_81_134204_2gfQxx9QW.png\"/\u003e \u003c/p\u003e\u003ch2 id=\"924e7f_3578_c_c\"\u003e\u003cb\u003eSustainability\u003c/b\u003e\u003c/h2\u003e\u003ch2 id=\"491abc_1293_c_c\"\u003eInvesting in Reusability\u003c/h2\u003e\u003cblockquote id=\"80dbb_6655_c\"\u003ePurchasing shampoo or conditioner normally means buying a single-use plastic bottle that will end up in a landfill. To change this paradigm, Small Wonder created a system that pairs a reusable powder-coated aluminum bottle with small, 100% recyclable refill tubes. Consumers receive the reusable bottle with their initial purchase, and subsequent purchases include a paper tube containing enough powder concentrate for 3–6 months of daily use. With Small Wonder, less truly is more—less waste, more product.\u003c/blockquote\u003e\u003cp id=\"b36182_2368\" data-ic-marker=\"3b0d58_1810\"\u003e\u003cimg src=\"https://s3files.core77.com/blog/images/1592604_81_134204_PMzxs8L3u.gif\"/\u003e \u003c/p\u003e\u003cp id=\"14eed8_2063\" data-ic-marker=\"bfb69e_1523\"\u003e\u003cimg src=\"https://s3files.core77.com/blog/images/1592600_81_134204_LaaQ8LIil.png\"/\u003e\u003c/p\u003e\u003cp id=\"575023_2466\" data-ic-marker=\"37f7c6_250\"\u003e\u003cimg src=\"https://s3files.core77.com/blog/images/1592603_81_134204_5vwbMyjzC.png\"/\u003e\u003c/p\u003e\u003cp id=\"10355b_2880\" data-ic-marker=\"44597c_1322\"\u003e\u003cimg src=\"https://s3files.core77.com/blog/images/1592598_81_134204_Na2l0SGOQ.gif\"/\u003e \u003c/p\u003e\u003ch2 id=\"6a1bb1_2083_c_c\"\u003e\u003cb\u003eDesign Process\u003c/b\u003e\u003c/h2\u003e\u003ch2 id=\"14106c_868_c_c\"\u003eElevating the Experience of Powder Hair-Care \u003c/h2\u003e\u003cblockquote id=\"b3f166_1056_c\"\u003ePowder hair care is more sustainable than traditional products, but Small Wonder will only fulfill its sustainability mission if people enjoy using it and replace their plastic shampoo bottles. Together Small Wonder and MINIMAL went the extra mile to ensure a user-friendly, mess-free, and delightful experience. We created over 50 prototypes to prove out the functionality and design of the bottle.\u003c/blockquote\u003e\u003cp id=\"39c06d_1889\" data-ic-marker=\"f93802_1550\"\u003e\u003cimg src=\"https://s3files.core77.com/blog/images/1592585_81_134204_lzEQxPUOV.jpg\"/\u003e\u003c/p\u003e\u003cp id=\"e289fd_1023\" data-ic-marker=\"656fdd_1286\"\u003e\u003cimg src=\"https://s3files.core77.com/blog/images/1592595_81_134204_0d_awQ9st.png\"/\u003e  \u003c/p\u003e\u003cblockquote id=\"e079b2_4366_c\"\u003eOur reusable bottle includes a patented cap design that is a novel way to dose and dispense powder hair-care products. An internal silicone diaphragm seals the bottle, protecting the powder from the steamy shower environment, while allowing easy and consistent dispensing every time. The hourglass bottle design is not only colorful, playful, and iconic, but also functional. The bottle opening faces down and the top surface is domed. These features discourage upside-down storage, which might lead to water pooling around the opening and leaking into the powder.\u003c/blockquote\u003e\u003cp id=\"e96383_7350\" data-ic-marker=\"b53e1e_1271\"\u003e\u003cimg src=\"https://s3files.core77.com/blog/images/1592587_81_134204_hY50GUstr.jpg\"/\u003e\u003c/p\u003e\u003cp id=\"dbe1f6_9431\" data-ic-marker=\"55213_1295\"\u003e\u003cimg src=\"https://s3files.core77.com/blog/images/1592589_81_134204_QawFYIAWi.jpg\"/\u003e\u003c/p\u003e\u003cp id=\"f57316_5836\" data-ic-marker=\"7e87e_2178\"\u003e\u003cimg src=\"https://s3files.core77.com/blog/images/1592597_81_134204_8CmonVFd6.png\"/\u003e \u003c/p\u003e\u003cblockquote id=\"75e9b6_3249_c\"\u003eThe bottom of the cap provides a stable base, but is also used to activate the dispensing mechanism by simply pressing the bottom of the bottle against your hand. And when it\u0026#39;s time to refill, the compostable paper refill tube is designed to perfectly fit into the bottle, ensuring the powder ends up in the bottle and not on the bathroom floor. \u003c/blockquote\u003e\u003cp id=\"7c78f_961\" data-ic-marker=\"c1fe81_1851\"\u003eYou can see more of Minimal\u0026#39;s work \u003ca href=\"https://www.mnml.com/work\" rel=\"\"\u003ehere\u003c/a\u003e. \u003c/p\u003e\n\n            \u003c/section\u003e\n\n                \n\n\n                \n\n\n\u003cdiv\u003e\n    \u003cul\u003e\n        \u003cli data-this-post-id=\"134204\" data-this-author-id=\"0\"\u003e\n            \n            \n            \u003cp\u003eFavorite This\u003c/p\u003e\n        \u003c/li\u003e\n       \u003cli data-this-post-title=\"Industrial Design Case Study: Minimal\u0026#39;s Solution to Combat Single-Use Package Design \" data-this-post-id=\"134204\" data-this-author-id=\"0\"\u003e\n            \n            \n            \u003cp\u003eComment\u003c/p\u003e\n        \u003c/li\u003e\n        \n    \u003c/ul\u003e \n\u003c/div\u003e\n\n\n\n\n\n\n           \n\n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
