{
  "id": "ed188c4f-06be-43ff-96d0-765b6164d422",
  "title": "sensiterre by florim and matteo thun recreates renaissance artistry in ceramic surfaces",
  "link": "https://www.designboom.com/design/sensiterre-florim-matteo-thun-renaissance-artistry-ceramic-surfaces-11-25-2024/",
  "description": "with earthy tones, unique textures, and sustainable production methods, sensiterre by florim and matteo thun celebrates a renaissance revival in surface design. The post sensiterre by florim and matteo thun recreates renaissance artistry in ceramic surfaces appeared first on designboom | architecture \u0026 design magazine.",
  "author": "lisa kostyra",
  "published": "Mon, 25 Nov 2024 07:45:09 +0000",
  "source": "https://www.designboom.com/design/feed",
  "categories": [
    "design",
    "ceramic art and design",
    "florim ceramiche spa",
    "matteo thun"
  ],
  "byline": "lisa kostyra",
  "length": 2884,
  "excerpt": "florim and matteo thun introduce sensiterre, a ceramic collection that blends renaissance artistry with sustainable surface design.",
  "siteName": "designboom | architecture \u0026 design magazine",
  "favicon": "",
  "text": "A COLLABORATION BETWEEN FLORIM AND MATTEO THUNFlorim re-explores the world of clay and earth with SensiTerre, a collection that bridges tradition and modernity in surface design. Developed in collaboration with Matteo Thun, the project draws inspiration from handcrafted ceramics, celebrating archetypal forms while reinterpreting them for contemporary architectural applications. Unique textures, such as gauze imprints, comb marks, and engravings, evoke the artistry of Renaissance craftsmanship, offering a tactile connection to tradition within modern environments.Florim and Matteo Thun collaborate for SensiTerre | all images courtesy of FlorimSENSITERRE SURFACES EVOLVE FROM TERRACOTTA VASES Born from a celebration of the tenth anniversary of the limited-edition ‘Venere Bianca’ terracotta vases, designed by Matteo Thun and Benedetto Fasciana in collaboration with Bitossi, SensiTerre evolves from artisanal to architectural dimensions, incorporating the precision of modern manufacturing techniques. The collection is produced in facilities that recover 100% of raw production waste and water, reflecting Florim’s broader eco-conscious ethos. As a certified B Corp and Benefit Corporation, the Italian company minimizes its environmental footprint by using renewable energy and ensuring carbon neutrality through its CarbonZero project.SensiTerre is born from a celebration of the tenth anniversary of the limited-edition ‘Venere Bianca’ terracotta vasesCLAY TRANSLATED INTO CONTEMPORARY CLADDING SOLUTIONS The colors and textures of SensiTerre capture the natural essence of clay, translating its charm into a versatile range of surfaces. Available in six earthy shades – Cotone, Sabbia, Rosato, Mattone, Amaranto, and Carbone – the palette brings warmth and depth to interiors, deepening the deliberate connection to tradition while offering versatility for contemporary applications. The collection features four distinct surface finishes, each with its own tactile appeal. Naturale retains the original materiality of clay, while Grana, inspired by the ancient Roman cocciopesto technique, introduces a textured finish reminiscent of crushed brick and lime-based mortar. Cannettato and Rigatino recreate the engraved and combed patterns of the ‘Venere Bianca’ vases, adding a layer of artisanal detail.SensiTerre captures the essence of clay, translating its charm into contemporary surfacesThe SensiTerre finishes allow for versatile applications in both flooring and wall cladding, except for Cannettato, which is recommended for vertical walls. Modular formats, ranging from small to large dimensions, further enhance the collection’s adaptability, offering architects and designers the flexibility to craft spaces that are both visually and texturally engaging.The collection offers architects and designers to craft spaces that are visually and texturally engaging",
  "image": "https://www.designboom.com/twitterimages/uploads/2024/11/florim-sensiterre-designboom-facebook.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003carticle\u003e\u003ch2\u003e\u003cstrong\u003eA COLLABORATION BETWEEN FLORIM AND MATTEO THUN\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003e\u003ca href=\"https://www.designboom.com/tag/florim-ceramiche-spa/\"\u003e\u003cb\u003eFlorim\u003c/b\u003e\u003c/a\u003e\u003cspan\u003e re-explores the world of clay and earth with SensiTerre, a collection that bridges tradition and modernity in surface design. Developed in collaboration with \u003c/span\u003e\u003ca href=\"https://www.designboom.com/tag/matteo-thun/\"\u003e\u003cb\u003eMatteo Thun\u003c/b\u003e\u003c/a\u003e\u003cspan\u003e, the project draws inspiration from handcrafted \u003c/span\u003e\u003ca href=\"https://www.designboom.com/tag/ceramics/\"\u003e\u003cb\u003eceramics\u003c/b\u003e\u003c/a\u003e\u003cspan\u003e, celebrating archetypal forms while reinterpreting them for contemporary architectural applications. Unique textures, such as gauze imprints, comb marks, and engravings, evoke the artistry of Renaissance craftsmanship, offering a tactile connection to tradition within modern environments.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" alt=\"sensiterre by florim and matteo thun recreates renaissance artistry in ceramic surfaces\" width=\"818\" height=\"545\" data-src=\"https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-01.jpg\" data-srcset=\"https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-01.jpg 818w, https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-01-768x512.jpg 768w\" data-sizes=\"auto\" loading=\"lazy\" src=\"https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-01.jpg\" srcset=\"https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-01.jpg 818w, https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-01-768x512.jpg 768w\"/\u003e\u003cbr/\u003eFlorim and Matteo Thun collaborate for SensiTerre | all images courtesy of \u003ca href=\"https://www.florim.com/en/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003eFlorim\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003eSENSITERRE SURFACES EVOLVE FROM TERRACOTTA VASES\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003e \u003cspan\u003eBorn from a celebration of the tenth anniversary of the limited-edition ‘Venere Bianca’ terracotta vases, designed by Matteo Thun and Benedetto Fasciana in collaboration with Bitossi, SensiTerre evolves from artisanal to architectural dimensions, incorporating the precision of modern manufacturing techniques. The collection is produced in facilities that recover 100% of raw production waste and water, reflecting Florim’s broader eco-conscious ethos. As a certified B Corp and Benefit Corporation, \u003c/span\u003e\u003ca href=\"https://www.florim.com/en\" target=\"_blank\" rel=\"noopener\"\u003e\u003cb\u003ethe Italian company\u003c/b\u003e\u003c/a\u003e\u003cspan\u003e minimizes its environmental footprint by using renewable energy and ensuring carbon neutrality through its CarbonZero project.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cimg decoding=\"async\" alt=\"sensiterre by florim and matteo thun recreates renaissance artistry in ceramic surfaces\" width=\"818\" height=\"545\" data-src=\"https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-02.jpg\" data-srcset=\"https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-02.jpg 818w, https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-02-768x512.jpg 768w\" data-sizes=\"auto\" loading=\"lazy\" src=\"https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-02.jpg\" srcset=\"https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-02.jpg 818w, https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-02-768x512.jpg 768w\"/\u003e\u003cbr/\u003eSensiTerre is born from a celebration of the tenth anniversary of the limited-edition ‘Venere Bianca’ terracotta vases\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003eCLAY TRANSLATED INTO CONTEMPORARY CLADDING SOLUTIONS\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003e \u003cspan\u003eThe colors and textures of SensiTerre capture the natural essence of clay, translating its charm into a versatile range of surfaces. Available in six earthy shades – Cotone, Sabbia, Rosato, Mattone, Amaranto, and Carbone – the palette brings warmth and depth to interiors, deepening the deliberate connection to tradition while offering versatility for contemporary applications.\u003c/span\u003e\u003cspan\u003e\u003cbr/\u003e \u003c/span\u003e\u003cspan\u003e\u003cbr/\u003e \u003c/span\u003e\u003cspan\u003eThe collection features four distinct surface finishes, each with its own tactile appeal. Naturale retains the original materiality of clay, while Grana, inspired by the ancient Roman cocciopesto technique, introduces a textured finish reminiscent of crushed brick and lime-based mortar. Cannettato and Rigatino recreate the engraved and combed patterns of the ‘Venere Bianca’ vases, adding a layer of artisanal detail.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cimg decoding=\"async\" alt=\"sensiterre by florim and matteo thun recreates renaissance artistry in ceramic surfaces\" width=\"818\" height=\"545\" data-src=\"https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-03.jpg\" data-srcset=\"https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-03.jpg 818w, https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-03-768x512.jpg 768w\" data-sizes=\"auto\" loading=\"lazy\" src=\"https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-03.jpg\" srcset=\"https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-03.jpg 818w, https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-03-768x512.jpg 768w\"/\u003e\u003cbr/\u003eSensiTerre captures the essence of clay, translating its charm into contemporary surfaces\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe SensiTerre finishes allow for versatile applications in both flooring and wall cladding, except for Cannettato, which is recommended for vertical walls. Modular formats, ranging from small to large dimensions, further enhance the collection’s adaptability, offering architects and designers the flexibility to craft spaces that are both visually and texturally engaging.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cimg decoding=\"async\" alt=\"sensiterre by florim and matteo thun recreates renaissance artistry in ceramic surfaces\" width=\"818\" height=\"545\" data-src=\"https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-05.jpg\" data-srcset=\"https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-05.jpg 818w, https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-05-768x512.jpg 768w\" data-sizes=\"auto\" loading=\"lazy\" src=\"https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-05.jpg\" srcset=\"https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-05.jpg 818w, https://static.designboom.com/wp-content/uploads/2024/11/florim-sensiterre-designboom-05-768x512.jpg 768w\"/\u003e\u003cbr/\u003eThe collection offers architects and designers to craft spaces that are visually and texturally engaging\u003c/p\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-25T07:45:09Z",
  "modifiedTime": "2024-11-25T07:10:24Z"
}
