{
  "id": "ff93d6f2-a456-4515-ae5f-bd0a21a76211",
  "title": "22RE takes \"deconstructivist\" approach to menswear store in LA",
  "link": "https://www.dezeen.com/2024/09/22/22re-takes-deconstructivist-approach-to-menswear-store-in-la/",
  "description": "Los Angeles-based studio 22RE has combined metal grids, black and mirrored surfaces, and bold splashes of colour inside this men's multi-brand boutique in the city's Arts District. The second Departamento location is situated in the Signal retail enclave, which occupies a series of warehouses southeast of Downtown LA. Using the building's industrial bones to inform The post 22RE takes \"deconstructivist\" approach to menswear store in LA appeared first on Dezeen.",
  "author": "Dan Howarth",
  "published": "Sun, 22 Sep 2024 17:00:36 +0000",
  "source": "https://www.dezeen.com/interiors/feed/",
  "categories": [
    "Retail",
    "all",
    "Interiors",
    "Shops",
    "Los Angeles",
    "California",
    "USA",
    "boutiques"
  ],
  "byline": "Dan Howarth",
  "length": 5693,
  "excerpt": "Los Angeles-based studio 22RE has combined metal grids, black and mirrored surfaces, and bold splashes of colour inside this men's multi-brand boutique in the city's Arts District.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Los Angeles-based studio 22RE has combined metal grids, black and mirrored surfaces, and bold splashes of colour inside this men's multi-brand boutique in the city's Arts District. The second Departamento location is situated in the Signal retail enclave, which occupies a series of warehouses southeast of Downtown LA. The Departamento store features custom elements like a green fibreglass and resin jewellery displayUsing the building's industrial bones to inform design decisions, 22RE took styling sensibilities of 20th-century modernists like Rudolph Schindler and Richard Neutra. \"Inside, 22RE leans into the original architecture's industrial elements through a deconstructivist lens,\" said the studio. From inside a coffee shop, visitors pass through a concealed entrance and a mirrored portal to access the storeThe store's entrance is concealed inside a Concierge Coffee, leading to a mirrored portal that opens onto the shop floor. While the layout follows a typical grid, the designers have inserted a variety of partitions, volumes and displays that \"disrupt\" the flow and encourage shoppers to explore. A triangular niche with mirrored walls creates infinite reflections\"This non-linear layout challenges the traditional browsing experience and provides an unconventional yet effective approach to shopping,\" said 22RE. A pair of curved metal-clad walls that evoke a Richard Serra sculpture form a narrow corridor from one area to another, while also displaying garments on their concave sides. Partitions and volumes are strategically placed to frame views and encourage explorationBlackened wood panels form an enclosed space, inside which bright white walls and repurposed wooden framing contrast dramatically with the rest of the store interior. \"The space, entered via a slatted, sliding door, invites guests to experience the collection in a ryokan-inspired setting, evoking the traditional Japanese inn,\" said 22RE. A red cylindrical element acts a fitting roomThis shop-in-shop was designed in collaboration with fashion brand Taiga Takahashi, and also features shelving made from tatami mats and flooring intended to resemble pebble stones. Another triangular niche features mirrored walls that create infinite reflections of the apparel and the aubergine-coloured carpet on the floor. \"Collections are hung and displayed via monolithic and sculpturesque forms that divide up the space, creating a fluid but juxtaposing dichotomy between the heavier wood forms and the lighter metallic elements,\" 22RE said. A red cylindrical volume is used as a fitting room, while further dressing areas are tucked away behind silver curtains. 22RE collaborated with Taiga Takahashi on a blackened wood shop-in-shop spaceCustom elements include a green fibreglass resin-and-foam jewellery case and a chiselled aluminium side table. A white aluminium ceiling grid stretches across the entire store, extending over all of the freestanding elements, with lighting embedded behind creating futuristic glowing patches. Influenced by Japanese ryokan inns, the space features white walls and repurposed timber framing22RE was founded by principal Dean Levin in 2021, and has since completed a range of interior design projects across the US. The studio recently wrapped up the offices for a creative music agency in LA that include a 1970s-style sunken meeting room and a golf clothing boutique in Miami lined with pale-green stucco. The photography is by Erik Stackpole Undehn. Subscribe to our newsletters Your email address New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_hero1-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003carticle id=\"post-2120665\" data-article-id=\"2120665\"\u003e\n\u003cheader\u003e\n\n\u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_hero1.jpg\" id=\"preload-hero\"\u003e\n\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_hero1-852x479.jpg\" alt=\"Departamento by 22RE\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_hero1-852x479.jpg 1x, https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_hero1-1704x958.jpg 2x\" data-pin-nopin=\"true\"/\u003e \u003c/figure\u003e\n\n\n\n\u003c/header\u003e\n\u003csection\u003e\n\n\u003cp\u003eLos Angeles-based studio 22RE has combined metal grids, black and mirrored surfaces, and bold splashes of colour inside this men\u0026#39;s multi-brand \u003ca href=\"https://www.dezeen.com/tag/boutiques\"\u003eboutique\u003c/a\u003e in the city\u0026#39;s Arts District.\u003cspan id=\"more-2120665\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\u003cp\u003eThe second \u003ca href=\"https://www.dpto.la/\" target=\"_blank\" rel=\"noopener\"\u003eDepartamento\u003c/a\u003e location is situated in the \u003ca href=\"https://www.signal-la.com/\" target=\"_blank\" rel=\"noopener\"\u003eSignal\u003c/a\u003e retail enclave, which occupies a series of warehouses southeast of Downtown LA.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2121696\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_hero3.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_hero3-852x479.jpg\" alt=\"Menswear boutique with metal apparel display and green jewellery case\" width=\"2364\" height=\"1329\" srcset=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_hero3-852x479.jpg 1x, https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_hero3-1704x958.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2121696\"\u003eThe Departamento store features custom elements like a green fibreglass and resin jewellery display\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eUsing the building\u0026#39;s industrial bones to inform design decisions, \u003ca href=\"https://22reoffice.com/\" target=\"_blank\" rel=\"noopener\"\u003e22RE\u003c/a\u003e took styling sensibilities of 20th-century modernists like \u003ca href=\"https://www.dezeen.com/tag/rudolph-schindler/\"\u003eRudolph Schindler\u003c/a\u003e and \u003ca href=\"https://www.dezeen.com/tag/richard-neutra/\"\u003eRichard Neutra\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Inside, 22RE leans into the original architecture\u0026#39;s industrial elements through a deconstructivist lens,\u0026#34; said the studio.\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2120688\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_22.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_22-852x639.jpg\" alt=\"Metal wall with a mirrored portal inside\" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_22-852x639.jpg 1x, https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_22-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2120688\"\u003eFrom inside a coffee shop, visitors pass through a concealed entrance and a mirrored portal to access the store\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe store\u0026#39;s entrance is concealed inside a Concierge Coffee, leading to a mirrored portal that opens onto the shop floor.\u003c/p\u003e\n\n\u003cp\u003eWhile the layout follows a typical grid, the designers have inserted a variety of partitions, volumes and displays that \u0026#34;disrupt\u0026#34; the flow and encourage shoppers to explore.\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2120666\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_0-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_0-852x1136.jpg\" alt=\"A triangular niche with mirrored walls that create infinite reflections \" width=\"1773\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_0-852x1136.jpg 1x, https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_0-1704x2272.jpg 2x\" sizes=\"(max-width: 1773px) 100vw, 1773px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2120666\"\u003eA triangular niche with mirrored walls creates infinite reflections\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;This non-linear layout challenges the traditional browsing experience and provides an unconventional yet effective approach to shopping,\u0026#34; said 22RE.\u003c/p\u003e\n\u003cp\u003eA pair of curved metal-clad walls that evoke a \u003ca href=\"https://www.dezeen.com/tag/richard-serra/\"\u003eRichard Serra\u003c/a\u003e sculpture form a narrow corridor from one area to another, while also displaying garments on their concave sides.\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2120679\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_13-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_13-852x1136.jpg\" alt=\"View through two blackened wood volumes to a red cylinder\" width=\"1773\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_13-852x1136.jpg 1x, https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_13-1704x2272.jpg 2x\" sizes=\"(max-width: 1773px) 100vw, 1773px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2120679\"\u003ePartitions and volumes are strategically placed to frame views and encourage exploration\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eBlackened wood panels form an enclosed space, inside which bright white walls and repurposed wooden framing contrast dramatically with the rest of the store interior.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The space, entered via a slatted, sliding door, invites guests to experience the collection in a ryokan-inspired setting, evoking the traditional Japanese inn,\u0026#34; said 22RE.\u003c/p\u003e\n\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-2120677\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_11.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_11-852x639.jpg\" alt=\"A red cylindrical elements that acts a fitting room\" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_11-852x639.jpg 1x, https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_11-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2120677\"\u003eA red cylindrical element acts a fitting room\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThis shop-in-shop was designed in collaboration with fashion brand \u003ca href=\"https://taigatakahashi.com/\"\u003eTaiga Takahashi\u003c/a\u003e, and also features shelving made from tatami mats and flooring intended to resemble pebble stones.\u003c/p\u003e\n\u003cp\u003eAnother triangular niche features mirrored walls that create infinite reflections of the apparel and the aubergine-coloured carpet on the floor.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Collections are hung and displayed via monolithic and sculpturesque forms that divide up the space, creating a fluid but juxtaposing dichotomy between the heavier wood forms and the lighter metallic elements,\u0026#34; 22RE said.\u003c/p\u003e\n\u003cp\u003eA red cylindrical volume is used as a fitting room, while further dressing areas are tucked away behind silver curtains.\u003c/p\u003e\n\u003cfigure id=\"preload-5\" aria-describedby=\"caption-attachment-2120683\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_17.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_17-852x639.jpg\" alt=\"Blackened wood shop-in-shop\" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_17-852x639.jpg 1x, https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_17-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2120683\"\u003e22RE collaborated with Taiga Takahashi on a blackened wood shop-in-shop space\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eCustom elements include a green fibreglass resin-and-foam jewellery case and a chiselled aluminium side table.\u003c/p\u003e\n\u003cp\u003eA white aluminium ceiling grid stretches across the entire store, extending over all of the freestanding elements, with lighting embedded behind creating futuristic glowing patches.\u003c/p\u003e\n\u003cfigure id=\"preload-6\" aria-describedby=\"caption-attachment-2120694\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_28-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_28-852x1136.jpg\" alt=\"Space featuring white walls and repurposed timber framing\" width=\"1773\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_28-852x1136.jpg 1x, https://static.dezeen.com/uploads/2024/09/departamento_22re_dezeen_2364_col_28-1704x2272.jpg 2x\" sizes=\"(max-width: 1773px) 100vw, 1773px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2120694\"\u003eInfluenced by Japanese ryokan inns, the space features white walls and repurposed timber framing\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e22RE was founded by principal Dean Levin in 2021, and has since completed a range of interior design projects across the US.\u003c/p\u003e\n\u003cp\u003eThe studio recently wrapped up the \u003ca href=\"https://www.dezeen.com/2024/08/17/ceremony-of-roses-offices-los-angeles-22re/\"\u003eoffices for a creative music agency\u003c/a\u003e in LA that include a 1970s-style sunken meeting room and a \u003ca href=\"https://www.dezeen.com/2024/03/10/malbon-miami-golf-boutique-22re/\"\u003egolf clothing boutique\u003c/a\u003e in Miami lined with pale-green stucco.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe photography is by \u003ca href=\"https://erik-undehn.squarespace.com/\" target=\"_blank\" rel=\"noopener\"\u003eErik Stackpole Undehn\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\n\u003c/section\u003e\n\u003cdiv id=\"newsletter-form\"\u003e\n\u003cform action=\"\" method=\"POST\"\u003e\n\u003cdiv id=\"newsletter-step-1\"\u003e\n\u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n\u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n\n\n\u003c/p\u003e\u003c/div\u003e\n\u003cdiv id=\"newsletter-step-2\"\u003e\n\u003cp\u003e\u003clabel\u003e\n\u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n\u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n\n\u003cspan\u003e\u003c/span\u003e\n\u003c/label\u003e\n\u003clabel\u003e\n\u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n\u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n\n\u003cspan\u003e\u003c/span\u003e\n\u003c/label\u003e\n\u003clabel\u003e\n\u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n\u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n\n\u003cspan\u003e\u003c/span\u003e\n\u003c/label\u003e\n\u003clabel\u003e\n\u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n\u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n\n\u003cspan\u003e\u003c/span\u003e\n\u003c/label\u003e\n\u003clabel\u003e\n\u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n\u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n\n\u003cspan\u003e\u003c/span\u003e\n\u003c/label\u003e\n\u003clabel\u003e\n\u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n\u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n\n\u003cspan\u003e\u003c/span\u003e\n\u003c/label\u003e\n\u003clabel\u003e\n\u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n\u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n\n\u003cspan\u003e\u003c/span\u003e\n\u003c/label\u003e\n\u003clabel\u003e\n\u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n\u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n\n\u003cspan\u003e\u003c/span\u003e\n\u003c/label\u003e\n\u003clabel\u003e\n\u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n\u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n\n\u003cspan\u003e\u003c/span\u003e\n\u003c/label\u003e\n\u003clabel\u003e\n\u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n\u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n\n\u003cspan\u003e\u003c/span\u003e\n\u003c/label\u003e\n\u003c/p\u003e\n\u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#d0a0a2b9a6b1b3a990b4b5aab5b5befeb3bfbd\"\u003e\u003cspan data-cfemail=\"83f3f1eaf5e2e0fac3e7e6f9e6e6edade0ecee\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\n\u003c/div\u003e\n\u003cdiv id=\"newsletter-step-3\"\u003e\n\u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/form\u003e\n\u003c/div\u003e\n\n\n\u003c/article\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-09-22T17:00:36Z",
  "modifiedTime": "2024-09-21T15:41:52Z"
}
