{
  "id": "11161732-41c6-42d4-90ec-b91e18e7ac0c",
  "title": "‘Ozempic arrived and everything changed’: plus-size models on the body positivity backlash",
  "link": "https://www.theguardian.com/fashion/2025/apr/15/ozempic-arrived-and-everything-changed-plus-size-models-on-the-body-positivity-backlash",
  "description": "The fashion industry seemed to be inching towards a new era of inclusivity. Then came a wave of weight-loss drugs and the demonisation of ‘wokeness’ …In 2021, Skye Standley was considered one of modelling’s rising stars. With her beautiful face, curves and distinctive red hair, she was in demand: she appeared in advertising campaigns for Dolce \u0026 Gabbana, the Danish label Ganni and Rihanna’s brand Savage X Fenty. Last year, she was appearing in roundups of ones to watch, alongside established “curve” or plus-size models – typically a size 12 and above – such as Ashley Graham and Paloma Elsesser, who were predicted to be “everywhere”. In reality, it was one of her toughest years.“The past two years have been really challenging,” says Standley. “I think there’s been a lot of erasure all around. I’ve noticed a lot less work.” She only worked a couple of times last year, she says, “compared with the two years before, where I was working continuously. I’ve definitely noticed, when it comes to [London] fashion week, there being no castings, and throughout the year, just a lot of regression, even from brands I’ve worked with. I spent all of last year trying to find a way to navigate everything that was changing with the industry.” Just over three weeks ago, Standley left her agency. Continue reading...",
  "author": "Emine Saner",
  "published": "Tue, 15 Apr 2025 04:00:37 GMT",
  "source": "https://www.theguardian.com/fashion/rss",
  "categories": [
    "Models",
    "Fashion",
    "Body image",
    "Beauty",
    "Life and style",
    "Fashion weeks"
  ],
  "byline": "Emine Saner",
  "length": 12284,
  "excerpt": "The fashion industry seemed to be inching towards a new era of inclusivity. Then came a wave of weight-loss drugs and the demonisation of ‘wokeness’ …",
  "siteName": "the Guardian",
  "favicon": "https://assets.guim.co.uk/static/frontend/icons/homescreen/apple-touch-icon-512.png",
  "text": "In 2021, Skye Standley was considered one of modelling’s rising stars. With her beautiful face, curves and distinctive red hair, she was in demand: she appeared in advertising campaigns for Dolce \u0026 Gabbana, the Danish label Ganni and Rihanna’s brand Savage X Fenty. Last year, she was appearing in roundups of ones to watch, alongside established “curve” or plus-size models – typically a size 12 and above – such as Ashley Graham and Paloma Elsesser, who were predicted to be “everywhere”. In reality, it was one of her toughest years.“The past two years have been really challenging,” says Standley. “I think there’s been a lot of erasure all around. I’ve noticed a lot less work.” She only worked a couple of times last year, she says, “compared with the two years before, where I was working continuously. I’ve definitely noticed, when it comes to [London] fashion week, there being no castings, and throughout the year, just a lot of regression, even from brands I’ve worked with. I spent all of last year trying to find a way to navigate everything that was changing with the industry.” Just over three weeks ago, Standley left her agency.For all the strides the body positivity movement has made over the past decade, including within the fashion industry, there have been signs that the thin ideal was always going to make a comeback. You can blame the “wellness” culture that idealises thinness, or the return of 90s fashion, and the “heroin chic” bodies that wore it. Blame the rise of weight-loss injections such as Ozempic, or the way fashion tends to swing back and forth. Or blame the demonisation of “wokeness” and diversity initiatives by conservatives. Or, blame it all, along with the fatphobia that never really went away, even though it pretended to. Models, activists and those of us who had hoped that fashion’s embrace of a range of sizes signified a genuine culture change are left wondering how it could have reversed so quickly. “I think you’re seeing the separation between people that were doing it because there was a movement at the time,” says Standley, “and the people who are truly passionate about it.”Standley: ‘I think a lot of the inclusivity movement was performative – and performative attitudes are easily abandoned.’ Photograph: Sarah Ellen TreacherWhen fashion did embrace larger bodies, “it kind of felt like the Renaissance,” says the model Tess Holliday, “like we were going into this beautiful period where we were at a new awakening. I don’t want to say it’s plateaued – it hasn’t. It’s really gone downhill so quickly. A shift that has left me and so many of my colleagues just feeling really disheartened.” Holliday, who has modelled for labels such as Chromat and appeared on the cover of Cosmopolitan, has noticed her work dropping off, but says she was moving away from modelling anyway (her book for young people, Take Up Space Y’all, is out later this year). “To see such a drastic slide back, it really does make you feel like the progress didn’t matter, but I know that’s just what society wants me to say and feel, and I refuse to give in to that. But do I have moments where I sit around and feel like perhaps I was one of a handful of people that were used to make it seem like people cared? Yeah, maybe sometimes.”Felicity Hayward, a model and activist, thinks 2023 was a turning point. “Ozempic arrived into our industry, and there was a definite change,” she says. Hayward, who has modelled for Mac and appeared on the cover of i-D magazine, monitors the number of designers using curve models across the fashion weeks in London, Paris, New York and Milan for her report Inside the Curve. At first the drop was slow, but this season, she says, “we’ve started to see a huge decline. New York, which had 70 plus-size models in 2023, had 23 earlier this year. At the September 2024 London fashion week, 80 plus-size models were on the runway, but just 26 this year.” Of these, 17 were used by Sinéad O’Dwyer (without her show, London would have had the fewest). The designer Karoline Vitto, whose models are diverse, didn’t hold a runway show. Milan, says Hayward, never really embraced size inclusivity (just 10 looks were worn by plus-size models at the February shows), and Paris had 22. “I thought, naively maybe, we had come to a place now where women’s bodies in particular had stopped being criticised,” she says, “and we were just accepting everybody for who they are.”She started monitoring inclusion to hold designers accountable. “It’s all well and good us seeing a curve model on a runway and automatically thinking that that brand is suddenly size-inclusive, when actually you need the stats – it could be the next season they don’t use curve at all, which is kind of what happened.” Or, if they do, she says, they are using fewer, or they are “mid-size” – UK size 12 to 16 – rather than plus-size. Many models have lost weight, says Hayward. “The girls who used to be a size 16 or 18 are now size 12. It’s really difficult because, on one hand, I don’t want to speak about women’s bodies, but if the only plus-size representation we have are also losing weight, it does feel like the whole industry is turning their back on us.” The latest size inclusivity survey by Vogue Business found similar data – at 198 fashion shows earlier this year, just 12 designers used plussize models. The report also noted that of the mid-size models used, it tended to be “the same two or three faces”. The celebration of a handful of mid-size models – in 2023, Precious Lee, Jill Kortleve and Paloma Elsesser were declared “the new Supers” on the cover of British Vogue – hasn’t translated into a wider acceptance.Ashley Graham during a Michael Kors fashion show in New York. Photograph: Gotham/GC ImagesIn 2021, the model and activist Nyome Nicholas-Williams was working a lot (she has worked for brands such as Adidas, H\u0026M and the activewear company Lululemon). “I was never getting booked more in my life. It was amazing,” she says. Although there are still brands Nicholas-Williams works for repeatedly, in the last couple of years, there has been a drop in other work; she has increasingly worked as a hand model, and she’s now also looking for a part-time job. It has affected her financially, and had an impact on her mental health. “I’m tired from all the fighting, just to have clothes that fit, or brands and designers actually wanting to put out clothes that plus people can wear.”Even when brands appeared to embrace size inclusivity, Nicholas-Williams says she was pessimistic that they would stick to it. “I was, like, this is going to be something that’s for a short period, and then we’re going to go back to how it was. I didn’t think it would be this soon, and so overtly.” If larger models are used, she says, they tend to be mid-size, rather than the bigger sizes used in the past. She has observed plus-size models lose weight to get more work. “I think there is a pressure,” she says, though she adds it’s not something she would do. “I would never lose weight for a brand to hire me, because I don’t want to change myself for them, because then you don’t want me authentically as myself.”Standley also feared the move towards inclusivity wouldn’t last. “When you’re actually on the sets and you’re having certain experiences that are not good, you can see through a lot of it,” she says. “Things don’t fit, and things are not always great, and you need to work three times as hard to make it work. You push through because you want to get something good out of it.”And a lot of good did come out of it, she says. “It helped to energise people and get more people a platform and exposure.” For the models themselves, and activists working for inclusivity, it brought a sense of community. For the rest of us, including anyone who has ever struggled with their weight, or felt they didn’t fit the body ideal – and with the average UK dress size a 16, that’s a lot of women – it felt good to see different bodies represented and celebrated. “I think it has inspired some designers and some people that do want to still keep pushing,” says Standley. “Those are the good things that came out of it. But I do feel, especially now, a lot of it was and is performative.” And performative attitudes, she says, are easily abandoned.“I also think, from what I’ve observed in the industry, it tends to be a domino effect,” she says. Just as brands copied each other, not wanting to be left out – or worse, called out – by not including plus-size models, now they’re chasing each other the other way. “Now that regression has taken place, it seems like everyone has just followed.” Ultimately, says Standley, the fashion industry always prizes thinness, and possibly always will. “Most of the industry is deeply rooted in a lot of fatphobia and that was maybe put to the side for a proportion of time, but now that things have settled, and people are back to how they really want to be, it’s really just accepted.”Worse, it seems to some working in this area that the backlash has been huge. “One of the things I’ve noticed is the amount of hate and abuse I have received online has skipped back to pre-2016 levels, when that sort of hate towards bigger bodies was kind of the norm,” says Hayward. “I didn’t really expect it.” Last month, the clothing brand Snag told the BBC it was getting more than 100 complaints a day that the models it uses are too fat, and were employing staff just to remove negative and hateful comments on its social media pages. But, Brigitte Read, Snag’s founder, isn’t convinced this is a new thing. “Honestly, I don’t think attitudes ever really changed to be more positive. When you look at the kind of hatred that you see in the comments, and overall on the internet, and myself as a fat person – I get shouted at just as much on the street now as I used to – I didn’t personally see a decrease in that level of animosity.”Emma Matell, known as one of the fashion industry’s most inclusive casting directors, says she worries about the plus-size models whose careers she has helped develop, from those she has scouted to those she regularly casts in shows and advertising campaigns. “It’s really sad to see that they don’t get the bookings they deserve.” Matell often works with O’Dwyer, one of the few designers who actively promotes diverse casting. In the past, O’Dwyer has used friends and family in her shows, but for her show at London fashion week in February, they took a more traditional path. “We really focused on booking models, because there were barely any shows that book curve models,” says Matell. “It felt important to highlight that there are amazing curve models that are not working.”Holliday: ‘It felt like the Renaissance, but it’s gone downhill so quickly.’Even during the time more diverse models were being employed, there were frustrations. Matell might want to cast a plus-size model in a magazine shoot, for instance, and so would the stylist and editor, but frequently would find there weren’t the clothes samples from designers to fit them. “Which is why a lot of the time when you see imagery of curve models, they’re not ever fully dressed.” Sometimes this is to make a statement about their body, she acknowledges, “but it’s also just because there simply aren’t enough clothes available for those models”.Even if there hasn’t been a huge revolution towards size inclusivity, Matell thinks some progress has been made. Consumers saw themselves reflected, and she hopes people will demand more of that from brands. “Whether or not the brands are choosing to take steps back, I think that’s going to come back in their face when their consumer is saying: ‘Why am I suddenly no longer part of your brand when you were preaching that two years ago?’ I do think there is a generational shift coming up in who the consumer is and what they’ll demand.”In the meantime, Standley still feels “a responsibility to represent my community” when it comes to her work. “Being over a certain dress size, larger than most plus-size models that are working, and not having a super-conventional or commercial look, I keep trying to push back and fight for change – to change the narrative on what it is to be plus size, existing in the world and also in this industry.”",
  "image": "https://i.guim.co.uk/img/media/12de617a2b2a9bdfe77fdddc3c424ed874016701/197_281_5254_3152/master/5254.jpg?width=1200\u0026height=630\u0026quality=85\u0026auto=format\u0026fit=crop\u0026overlay-align=bottom%2Cleft\u0026overlay-width=100p\u0026overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc\u0026enable=upscale\u0026s=4c7cc39a01278d9707b24ef9cd24839d",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"maincontent\"\u003e\u003cp\u003e\u003cspan\u003eI\u003c/span\u003en 2021, Skye Standley was considered one of modelling’s rising stars. With her beautiful face, curves and distinctive red hair, she was in demand: she appeared in advertising campaigns for Dolce \u0026amp; Gabbana, the Danish label Ganni and Rihanna’s brand Savage X Fenty. Last year, she was appearing in roundups of ones to watch, alongside established “curve” or plus-size models – typically a size 12 and above – such as Ashley Graham and Paloma Elsesser, who were predicted to be “everywhere”. In reality, it was one of her toughest years.\u003c/p\u003e\u003cp\u003e“The past two years have been really challenging,” says Standley. “I think there’s been a lot of erasure all around. I’ve noticed a lot less work.” She only worked a couple of times last year, she says, “compared with the two years before, where I was working continuously. I’ve definitely noticed, when it comes to [London] fashion week, there being no castings, and throughout the year, just a lot of regression, even from brands I’ve worked with. I spent all of last year trying to find a way to navigate everything that was changing with the industry.” Just over three weeks ago, Standley left her agency.\u003c/p\u003e\u003cp\u003eFor all the strides the body positivity movement has made over the past decade, including within the fashion industry, there have been signs that the thin ideal was always going to make a comeback. You can blame the “wellness” culture that idealises thinness, or \u003ca href=\"https://amp.theguardian.com/commentisfree/2022/nov/25/the-guardian-view-on-the-return-of-super-thin-models-a-worrying-trend\" data-link-name=\"in body link\"\u003ethe return of 90s fashion, and the “heroin chic” bodies that wore it\u003c/a\u003e. Blame the rise of weight-loss injections such as Ozempic, or the way fashion tends to swing back and forth. Or blame the demonisation of “wokeness” and diversity initiatives by conservatives. Or, blame it all, along with the fatphobia that never really went away, even though it pretended to. Models, activists and those of us who had hoped that fashion’s embrace of a range of sizes signified a genuine culture change are left wondering how it could have reversed so quickly. “I think you’re seeing the separation between people that were doing it because there was a movement at the time,” says Standley, “and the people who are truly passionate about it.”\u003c/p\u003e\u003cfigure id=\"555e929c-7838-4ac8-ab85-3f4d6d2785cc\" data-spacefinder-role=\"supporting\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-2\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/846325941991b4b7c3dab0655d672b04ca9668db/0_0_2500_3750/master/2500.jpg?width=380\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1300px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 1300px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/846325941991b4b7c3dab0655d672b04ca9668db/0_0_2500_3750/master/2500.jpg?width=380\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1300px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/846325941991b4b7c3dab0655d672b04ca9668db/0_0_2500_3750/master/2500.jpg?width=300\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 980px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 980px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/846325941991b4b7c3dab0655d672b04ca9668db/0_0_2500_3750/master/2500.jpg?width=300\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 980px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/846325941991b4b7c3dab0655d672b04ca9668db/0_0_2500_3750/master/2500.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/846325941991b4b7c3dab0655d672b04ca9668db/0_0_2500_3750/master/2500.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/846325941991b4b7c3dab0655d672b04ca9668db/0_0_2500_3750/master/2500.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/846325941991b4b7c3dab0655d672b04ca9668db/0_0_2500_3750/master/2500.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/846325941991b4b7c3dab0655d672b04ca9668db/0_0_2500_3750/master/2500.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/846325941991b4b7c3dab0655d672b04ca9668db/0_0_2500_3750/master/2500.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"Plus size model Skye Standley with her hair scraped back in a white vest - black and white from waist up with hands cradling her chin\" src=\"https://i.guim.co.uk/img/media/846325941991b4b7c3dab0655d672b04ca9668db/0_0_2500_3750/master/2500.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" width=\"445\" height=\"667.5\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003eStandley: ‘I think a lot of the inclusivity movement was performative – and performative attitudes are easily abandoned.’\u003c/span\u003e Photograph: Sarah Ellen Treacher\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eWhen fashion did embrace larger bodies, “it kind of felt like the Renaissance,” says the model Tess Holliday, “like we were going into this beautiful period where we were at a new awakening. I don’t want to say it’s plateaued – it hasn’t. It’s really gone downhill so quickly. A shift that has left me and so many of my colleagues just feeling really disheartened.” Holliday, who has modelled for labels such as Chromat and appeared on the cover of Cosmopolitan, has noticed her work dropping off, but says she was moving away from modelling anyway (her book for young people, Take Up Space Y’all, is out later this year). “To see such a drastic slide back, it really does make you feel like the progress didn’t matter, but I know that’s just what society wants me to say and feel, and I refuse to give in to that. But do I have moments where I sit around and feel like perhaps I was one of a handful of people that were used to make it seem like people cared? Yeah, maybe sometimes.”\u003c/p\u003e\u003cp\u003eFelicity Hayward, a model and activist, thinks 2023 was a turning point. “Ozempic arrived into our industry, and there was a definite change,” she says. Hayward, who has modelled for Mac and appeared on the cover of i-D magazine, monitors the number of designers using curve models across the fashion weeks in London, Paris, New York and Milan for her report \u003ca href=\"https://www.glamourmagazine.co.uk/article/fashion-month-plus-size-models\" data-link-name=\"in body link\"\u003eInside the Curve\u003c/a\u003e. At first the drop was slow, but this season, she says, “we’ve started to see a huge decline. New York, which had 70 plus-size models in 2023, had 23 earlier this year. At the September 2024 London fashion week, 80 plus-size models were on the runway, but just 26 this year.” Of these, 17 were used by Sinéad O’Dwyer (without her show, London would have had the fewest). The designer Karoline Vitto, whose models are diverse, didn’t hold a runway show. Milan, says Hayward, never really embraced size inclusivity (just 10 looks were worn by plus-size models at the February shows), and Paris had 22. “I thought, naively maybe, we had come to a place now where women’s bodies in particular had stopped being criticised,” she says, “and we were just accepting everybody for who they are.”\u003c/p\u003e\u003cp\u003eShe started monitoring inclusion to hold designers accountable. “It’s all well and good us seeing a curve model on a runway and automatically thinking that that brand is suddenly size-inclusive, when actually you need the stats – it could be the next season they don’t use curve at all, which is kind of what happened.” Or, if they do, she says, they are using fewer, or they are “mid-size” – UK size 12 to 16 – rather than plus-size. Many models have lost weight, says Hayward. “The girls who used to be a size 16 or 18 are now size 12. It’s really difficult because, on one hand, I don’t want to speak about women’s bodies, but if the only plus-size representation we have are also losing weight, it does feel like the whole industry is turning their back on us.” The latest \u003ca href=\"https://www.voguebusiness.com/story/fashion/the-vogue-business-autumn-winter-2025-size-inclusivity-report\" data-link-name=\"in body link\"\u003esize inclusivity survey by Vogue Business\u003c/a\u003e found similar data – at 198 fashion shows earlier this year, just 12 designers used plussize models. The report also noted that of the mid-size models used, it tended to be “the same two or three faces”. The celebration of a handful of mid-size models – in 2023, Precious Lee, Jill Kortleve and Paloma Elsesser were declared “\u003ca href=\"https://www.yahoo.com/news/top-models-paloma-elsesser-precious-190821621.html?guccounter=1\u0026amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8\u0026amp;guce_referrer_sig=AQAAACbGDfnxi9uW1NlQNkU3Cw4t0Ct82oDaaXRj4iga_DbH7m4Gz-A8LvtxmX0LYoyjaIEb-7b-8Ryp1YFUwTRGXLys_dWWqjTJ7ySRYs68j2cI9BZkaURvrOAd07eMG4SIKjqVp2x0maXEcsQ0q2pEuxA5IcSjTGBU_jGCxJh2dh3R\" data-link-name=\"in body link\"\u003ethe new Supers\u003c/a\u003e” on the cover of British Vogue – hasn’t translated into a wider acceptance.\u003c/p\u003e\u003cfigure id=\"7b39ebd7-9da3-48ef-ba92-6a0cca5045ca\" data-spacefinder-role=\"showcase\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-3\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/94c0eb722ee3361d219b1a5b23cd76319bb730b4/0_0_3000_2000/master/3000.jpg?width=880\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1300px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 1300px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/94c0eb722ee3361d219b1a5b23cd76319bb730b4/0_0_3000_2000/master/3000.jpg?width=880\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1300px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/94c0eb722ee3361d219b1a5b23cd76319bb730b4/0_0_3000_2000/master/3000.jpg?width=800\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1140px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 1140px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/94c0eb722ee3361d219b1a5b23cd76319bb730b4/0_0_3000_2000/master/3000.jpg?width=800\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1140px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/94c0eb722ee3361d219b1a5b23cd76319bb730b4/0_0_3000_2000/master/3000.jpg?width=640\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 980px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 980px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/94c0eb722ee3361d219b1a5b23cd76319bb730b4/0_0_3000_2000/master/3000.jpg?width=640\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 980px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/94c0eb722ee3361d219b1a5b23cd76319bb730b4/0_0_3000_2000/master/3000.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/94c0eb722ee3361d219b1a5b23cd76319bb730b4/0_0_3000_2000/master/3000.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/94c0eb722ee3361d219b1a5b23cd76319bb730b4/0_0_3000_2000/master/3000.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/94c0eb722ee3361d219b1a5b23cd76319bb730b4/0_0_3000_2000/master/3000.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/94c0eb722ee3361d219b1a5b23cd76319bb730b4/0_0_3000_2000/master/3000.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/94c0eb722ee3361d219b1a5b23cd76319bb730b4/0_0_3000_2000/master/3000.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"Plus size model Ashley Graham dressed in black walking along a New York street lit up with colourful neon \" src=\"https://i.guim.co.uk/img/media/94c0eb722ee3361d219b1a5b23cd76319bb730b4/0_0_3000_2000/master/3000.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" width=\"445\" height=\"296.66666666666663\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003eAshley Graham during a Michael Kors fashion show in New York.\u003c/span\u003e Photograph: Gotham/GC Images\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eIn 2021, the model and activist Nyome Nicholas-Williams was working a lot (she has worked for brands such as Adidas, H\u0026amp;M and the activewear company Lululemon). “I was never getting booked more in my life. It was amazing,” she says. Although there are still brands Nicholas-Williams works for repeatedly, in the last couple of years, there has been a drop in other work; she has increasingly worked as a hand model, and she’s now also looking for a part-time job. It has affected her financially, and had an impact on her mental health. “I’m tired from all the fighting, just to have clothes that fit, or brands and designers actually wanting to put out clothes that plus people can wear.”\u003c/p\u003e\u003cp\u003eEven when brands appeared to embrace size inclusivity, Nicholas-Williams says she was pessimistic that they would stick to it. “I was, like, this is going to be something that’s for a short period, and then we’re going to go back to how it was. I didn’t think it would be this soon, and so overtly.” If larger models are used, she says, they tend to be mid-size, rather than the bigger sizes used in the past. She has observed plus-size models lose weight to get more work. “I think there is a pressure,” she says, though she adds it’s not something she would do. “I would never lose weight for a brand to hire me, because I don’t want to change myself for them, because then you don’t want me authentically as myself.”\u003c/p\u003e\u003cp\u003eStandley also feared the move towards inclusivity wouldn’t last. “When you’re actually on the sets and you’re having certain experiences that are not good, you can see through a lot of it,” she says. “Things don’t fit, and things are not always great, and you need to work three times as hard to make it work. You push through because you want to get something good out of it.”\u003c/p\u003e\u003cp\u003eAnd a lot of good did come out of it, she says. “It helped to energise people and get more people a platform and exposure.” For the models themselves, and activists working for inclusivity, it brought a sense of community. For the rest of us, including anyone who has ever struggled with their weight, or felt they didn’t fit the body ideal – and with the average UK dress size a 16, that’s a lot of women – it felt good to see different bodies represented and celebrated. “I think it has inspired some designers and some people that do want to still keep pushing,” says Standley. “Those are the good things that came out of it. But I do feel, especially now, a lot of it was and is performative.” And performative attitudes, she says, are easily abandoned.\u003c/p\u003e\u003cp\u003e“I also think, from what I’ve observed in the industry, it tends to be a domino effect,” she says. Just as brands copied each other, not wanting to be left out – or worse, called out – by not including plus-size models, now they’re chasing each other the other way. “Now that regression has taken place, it seems like everyone has just followed.” Ultimately, says Standley, the fashion industry always prizes thinness, and possibly always will. “Most of the industry is deeply rooted in a lot of fatphobia and that was maybe put to the side for a proportion of time, but now that things have settled, and people are back to how they really want to be, it’s really just accepted.”\u003c/p\u003e\u003cp\u003eWorse, it seems to some working in this area that the backlash has been huge. “One of the things I’ve noticed is the amount of hate and abuse I have received online has skipped back to pre-2016 levels, when that sort of hate towards bigger bodies was kind of the norm,” says Hayward. “I didn’t really expect it.” Last month, \u003ca href=\"https://www.bbc.co.uk/news/articles/cx2xjd41g33o\" data-link-name=\"in body link\"\u003ethe clothing brand Snag told the BBC\u003c/a\u003e it was getting more than 100 complaints a day that the models it uses are too fat, and were employing staff just to remove negative and hateful comments on its social media pages. But, Brigitte Read, Snag’s founder, isn’t convinced this is a new thing. “Honestly, I don’t think attitudes ever really changed to be more positive. When you look at the kind of hatred that you see in the comments, and overall on the internet, and myself as a fat person – I get shouted at just as much on the street now as I used to – I didn’t personally see a decrease in that level of animosity.”\u003c/p\u003e\u003cp\u003eEmma Matell, known as one of the fashion industry’s most inclusive casting directors, says she worries about the plus-size models whose careers she has helped develop, from those she has scouted to those she regularly casts in shows and advertising campaigns. “It’s really sad to see that they don’t get the bookings they deserve.” Matell often works with O’Dwyer, one of the few designers who actively promotes diverse casting. In the past, O’Dwyer has used friends and family in her shows, but for her show at London fashion week in February, they took a more traditional path. “We really focused on booking models, because there were barely any shows that book curve models,” says Matell. “It felt important to highlight that there are amazing curve models that are not working.”\u003c/p\u003e\u003cfigure id=\"8f1f0027-e40f-454e-99ab-dec3cea1e3f2\" data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-4\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/47e37dc8ca1b519d10e5b05072ecbedc0d785673/2_582_1238_867/master/1238.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/47e37dc8ca1b519d10e5b05072ecbedc0d785673/2_582_1238_867/master/1238.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/47e37dc8ca1b519d10e5b05072ecbedc0d785673/2_582_1238_867/master/1238.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/47e37dc8ca1b519d10e5b05072ecbedc0d785673/2_582_1238_867/master/1238.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/47e37dc8ca1b519d10e5b05072ecbedc0d785673/2_582_1238_867/master/1238.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/47e37dc8ca1b519d10e5b05072ecbedc0d785673/2_582_1238_867/master/1238.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"Tess Holliday wearing a floral kaftan sitting on a lawn at night\" src=\"https://i.guim.co.uk/img/media/47e37dc8ca1b519d10e5b05072ecbedc0d785673/2_582_1238_867/master/1238.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" width=\"445\" height=\"311.6437802907916\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003eHolliday: ‘It felt like the Renaissance, but it’s gone downhill so quickly.’\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eEven during the time more diverse models were being employed, there were frustrations. Matell might want to cast a plus-size model in a magazine shoot, for instance, and so would the stylist and editor, but frequently would find there weren’t the clothes samples from designers to fit them. “Which is why a lot of the time when you see imagery of curve models, they’re not ever fully dressed.” Sometimes this is to make a statement about their body, she acknowledges, “but it’s also just because there simply aren’t enough clothes available for those models”.\u003c/p\u003e\u003cp\u003eEven if there hasn’t been a huge revolution towards size inclusivity, Matell thinks some progress has been made. Consumers saw themselves reflected, and she hopes people will demand more of that from brands. “Whether or not the brands are choosing to take steps back, I think that’s going to come back in their face when their consumer is saying: ‘Why am I suddenly no longer part of your brand when you were preaching that two years ago?’ I do think there is a generational shift coming up in who the consumer is and what they’ll demand.”\u003c/p\u003e\u003cp\u003eIn the meantime, Standley still feels “a responsibility to represent my community” when it comes to her work. “Being over a certain dress size, larger than most plus-size models that are working, and not having a super-conventional or commercial look, I keep trying to push back and fight for change – to change the narrative on what it is to be plus size, existing in the world and also in this industry.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "14 min read",
  "publishedTime": "2025-04-15T04:00:37Z",
  "modifiedTime": "2025-04-15T04:00:37Z"
}
