{
  "id": "3480494a-c751-4e81-b6db-37c97f7b78aa",
  "title": "Dress to impress: eight Guardian writers on what they – and their partners – wore when they fell in love",
  "link": "https://www.theguardian.com/fashion/2025/feb/12/fashion-statement-valentines-day-outfits-love-relationships",
  "description": "From an H\u0026M shift admired at a distance to a shiny jacket that belongs in Vegas, our writers reflect on the sometimes stunning, often shocking outfits they wore when they met their valentinesWith Valentine’s Day just around the corner we’ve been thinking about what we and our loved ones wore the first time we met.It might sound frivolous, but try listening to Bella Freud’s high-brow, low-fi hit podcast, Fashion Neurosis, in which she almost always asks her guests: “If you fancy someone and you don’t like the clothes they’re wearing, does it kill your attraction?” It’s often far more revealing than you might think. Who would have thought Nick Cave’s feelings about ankle boots – “a bit of a disaster” – could have been make or break between him and his wife, Susie? Continue reading...",
  "author": "Ellie Violet Bramley",
  "published": "Thu, 13 Feb 2025 17:00:43 GMT",
  "source": "https://www.theguardian.com/fashion/rss",
  "categories": [
    "Fashion",
    "Life and style",
    "Valentine's Day",
    "Relationships"
  ],
  "byline": "Ellie Violet Bramley",
  "length": 5874,
  "excerpt": "From an H\u0026M shift admired at a distance to a shiny jacket that belongs in Vegas, our writers reflect on the sometimes stunning, often shocking outfits they wore when they met their valentines",
  "siteName": "the Guardian",
  "favicon": "https://assets.guim.co.uk/static/frontend/icons/homescreen/apple-touch-icon-512.png",
  "text": "With Valentine’s Day just around the corner we’ve been thinking about what we and our loved ones wore the first time we met.It might sound frivolous, but try listening to Bella Freud’s high-brow, low-fi hit podcast, Fashion Neurosis, in which she almost always asks her guests: “If you fancy someone and you don’t like the clothes they’re wearing, does it kill your attraction?” It’s often far more revealing than you might think. Who would have thought Nick Cave’s feelings about ankle boots – “a bit of a disaster” – could have been make or break between him and his wife, Susie?With that in mind, we spoke to a few Guardian writers about their experiences. Did it foretell something about the relationship that would go on to blossom? Or did it require that future partner to look past what was on the outside?For me, it was a bit of both. When I first laid eyes on the person who would become my partner and the father of my child, he was wearing a Christmas jumper. It had all of the typical hallmarks: it was red, covered in snowflakes and accessorised by a hungover man. He was feeling fragile, he told me later, but you wouldn’t have known it. The ardour of his festive cheer then – heartfelt and charming – lives on, for the most part, to this day. The Christmas jumper is​, thankfully, gone. But the spirit of the person inside it, fun and kind – even in the face of, shall we say, adversity – isn’t.Dressed to impressAfter my over-a-decade-long relationship ended, my wardrobe was lacking in first-date attire. I wore a long, pale-blue Dôen dress that I’d had for years to dinner with a man travelling from Scotland to meet me – elegant, I thought, yet able to accommodate a sizeable meal. As it turned out, I hardly ate a bite. Many months later, I wore the same dress to meet his mother. On closer inspection, it turned out to be – rather unsubtly – covered from head to toe in thistle print. Leah Harper, assistant features editor Disco daysRemember what I was wearing the night I met my future wife? Are you having a laugh? It was over 20 years ago – I’d be hard pushed to recall what I was wearing yesterday. She can’t remember, either – look, we were very drunk, OK? Although given it was at an indie disco (yes, I was DJing and she did request a record), I’d bet on some variation of scuffed Converse, skinny jeans and band T-shirt. Not exactly a Jasper Conran trouser suit, but at least proof that what you’re wearing isn’t the only thing that matters. Tim Jonze, associate culture editorFuzzy love … Jenny Stevens in her beloved (and not beloved) Shrimps coat. Photograph: Courtesy of Jenny StevensLove the lady, hate the coatI was wearing an amazing Shrimps coat, with a check pattern with a giant furry collar and cuffs. Our first date was in the pandemic, so it was a walk around the local park. I still love the coat but my boyfriend has since admitted he hates it. Lol. Jenny Stevens, deputy features editor‘Like a cartoon cat burglar’As all men on dating apps do, my now-partner rounded his height upwards to the nearest whole number, 6’2”. However, even with this rounding, I had a height advantage. My boyfriend chose to address this by artificially boosting his own height by repeatedly folding a sock and placing the wad under his heels, leading to what he called “a tip-toe ‘sneaking’ motion when walking, like a cartoon cat-burglar”. Three years later, a height gap of nearer four inches (I had rounded down) has been no barrier to our relationship – other than arguments about who should paint the ceiling. Frances Perraudin, deputy national editorA dress to rememberWhen I first met my boyfriend, we were both 19. We didn’t get together then, but I became lodged in his mind, in part, he told me later, because of what I was wearing: a cotton burgundy floral dress. It was incredibly cheap, reduced H\u0026M – £15 down to £8. It was shift-shaped, with no give, and sat above the knee. I wore that dress a lot that summer, when we hung out as friends, and in the summers since. In fact I held on to it for about 12 years, which works out at about 21p per wear. But every time I wore it, he noticed it. Two children later, there is no way I could wear it, let alone find it, but I hope I haven’t lost it for good. Morwenna Ferrier, fashion and lifestyle editorskip past newsletter promotionafter newsletter promotionWhat happens in Vegas …I can’t for the life of me remember what I wore on my first date with my husband but I can sure as hell remember what he wore: a sparkly blazer. As the relationship progressed, it became the butt of our jokes, and we called it his Vegas jacket. I cannot think of a single item of clothing that so inaccurately conveys his character. He could not be less of a sparkly blazer kind of guy. His prized outfits are his “inside clothes” – Adidas jersey joggers and hoodie. Always black. Not a jazzy sheen in sight. I’ve asked him what that blazer was about, was it a (slightly misjudged) attempt to woo me? “Dunno,” he retorts. “Fashion was different back then.” Lucky for him, I saw past the shiny lapel and fell for the man on the inside … who prefers a hoodie. Abigail Radnor, lifestyle editor, Saturday Magazine Back in blackI am sure on our first date I wore an old favourite black sleeveless Uniqlo dress because it was the day after the hottest day that year and still unbearably warm. But when I went to confirm that with my boyfriend, now, eight years later, he was adamant I was wearing a long black dress with a vintage AC/DC T-shirt. A shirt I distinctly remember him mentioning, a few years ago, that he didn’t like. It’s amazing there was ever a second date. Helen Seamons, menswear editorTo read the complete version of this newsletter – complete with this week’s trending topics in The Measure and your wardrobe dilemmas solved – subscribe to receive Fashion Statement in your inbox every Thursday.",
  "image": "https://i.guim.co.uk/img/media/e9b1a8c641703f92d2fc290fd35d3148881d4755/0_204_7454_4472/master/7454.jpg?width=1200\u0026height=630\u0026quality=85\u0026auto=format\u0026fit=crop\u0026overlay-align=bottom%2Cleft\u0026overlay-width=100p\u0026overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc\u0026enable=upscale\u0026s=8b9a0e7378f130882c16231baf2d0d07",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"maincontent\"\u003e\u003cp\u003eWith Valentine’s Day just around the corner we’ve been thinking about what we and our loved ones wore the first time we met.\u003c/p\u003e\u003cp\u003eIt might sound frivolous, but try listening to Bella Freud’s high-brow, low-fi hit podcast, Fashion Neurosis, in which she almost always asks her guests: “If you fancy someone and you don’t like the clothes they’re wearing, does it kill your attraction?” It’s often far more revealing than you might think. Who would have thought Nick Cave’s feelings about ankle boots – “a bit of a disaster” – could have been make or break between him and his wife, Susie?\u003c/p\u003e\u003cp\u003eWith that in mind, we spoke to a few Guardian writers about their experiences. Did it foretell something about the relationship that would go on to blossom? Or did it require that future partner to look past what was on the outside?\u003c/p\u003e\u003cp\u003eFor me, it was a bit of both. When I first laid eyes on the person who would become my partner and the father of my child, he was wearing a Christmas jumper. It had all of the typical hallmarks: it was red, covered in snowflakes and accessorised by a hungover man. He was feeling fragile, he told me later, but you wouldn’t have known it. The ardour of his festive cheer then – heartfelt and charming – lives on, for the most part, to this day. The Christmas jumper is​, thankfully, gone. But the spirit of the person inside it, fun and kind – even in the face of, shall we say, adversity – isn’t.\u003c/p\u003e\u003cp\u003e\u003cem\u003e\u003cstrong\u003eDressed to impress\u003c/strong\u003e\u003c/em\u003e\u003cstrong\u003e\u003cbr/\u003e\u003c/strong\u003eAfter my over-a-decade-long relationship ended, my wardrobe was lacking in first-date attire. I wore a long, pale-blue Dôen dress that I’d had for years to dinner with a man travelling from Scotland to meet me – elegant, I thought, yet able to accommodate a sizeable meal. As it turned out, I hardly ate a bite. Many months later, I wore the same dress to meet his mother. On closer inspection, it turned out to be – rather unsubtly – covered from head to toe in thistle print. \u003cstrong\u003eLeah Harper, assistant features editor \u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003e\u003cstrong\u003eDisco days\u003c/strong\u003e\u003c/em\u003e\u003cstrong\u003e\u003cbr/\u003e\u003c/strong\u003eRemember what I was wearing the night I met my future wife? Are you having a laugh? It was over 20 years ago – I’d be hard pushed to recall what I was wearing yesterday. She can’t remember, either – look, we were very drunk, OK? Although given it was at an indie disco (yes, I was DJing and she \u003cem\u003edid\u003c/em\u003e request a record), I’d bet on some variation of scuffed Converse, skinny jeans and band T-shirt. Not exactly a Jasper Conran trouser suit, but at least proof that what you’re wearing isn’t the only thing that matters. \u003cstrong\u003eTim Jonze, associate culture editor\u003c/strong\u003e\u003c/p\u003e\u003cfigure id=\"2e18da08-5dd4-4c91-8504-9962651bfd3e\" data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-2\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/d9242e7b8155f71477d37458c3667096452e6687/0_489_3024_3543/master/3024.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/d9242e7b8155f71477d37458c3667096452e6687/0_489_3024_3543/master/3024.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/d9242e7b8155f71477d37458c3667096452e6687/0_489_3024_3543/master/3024.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/d9242e7b8155f71477d37458c3667096452e6687/0_489_3024_3543/master/3024.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/d9242e7b8155f71477d37458c3667096452e6687/0_489_3024_3543/master/3024.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/d9242e7b8155f71477d37458c3667096452e6687/0_489_3024_3543/master/3024.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"The Guardian’s Jenny Stevens in her beloved Shrimps coat.\" src=\"https://i.guim.co.uk/img/media/d9242e7b8155f71477d37458c3667096452e6687/0_489_3024_3543/master/3024.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" width=\"445\" height=\"521.374007936508\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003eFuzzy love … Jenny Stevens in her beloved (and not beloved) Shrimps coat.\u003c/span\u003e Photograph: Courtesy of Jenny Stevens\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003cem\u003e\u003cstrong\u003eLove the lady, hate the coat\u003c/strong\u003e\u003c/em\u003e\u003cstrong\u003e\u003cbr/\u003e\u003c/strong\u003eI was wearing an amazing Shrimps coat, with a check pattern with a giant furry collar and cuffs. Our first date was in the pandemic, so it was a walk around the local park. I still love the coat but my boyfriend has since admitted he hates it. Lol. \u003cstrong\u003eJenny Stevens, deputy features editor\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003e\u003cstrong\u003e‘Like a cartoon cat burglar’\u003c/strong\u003e\u003c/em\u003e\u003cstrong\u003e\u003cbr/\u003e\u003c/strong\u003eAs all men on dating apps do, my now-partner rounded his height upwards to the nearest whole number, 6’2”. However, even with this rounding, I had a height advantage. My boyfriend chose to address this by artificially boosting his own height by repeatedly folding a sock and placing the wad under his heels, leading to what he called “a tip-toe ‘sneaking’ motion when walking, like a cartoon cat-burglar”. Three years later, a height gap of nearer four inches (I had rounded down) has been no barrier to our relationship – other than arguments about who should paint the ceiling. \u003cstrong\u003eFrances Perraudin, deputy national editor\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eA dress to remember\u003cbr/\u003e\u003c/strong\u003eWhen I first met my boyfriend, we were both 19. We didn’t get together then, but I became lodged in his mind, in part, he told me later, because of what I was wearing: a cotton burgundy floral dress. It was incredibly cheap, \u003cem\u003ereduced\u003c/em\u003e H\u0026amp;M – £15 down to £8. It was shift-shaped, with no give, and sat above the knee. I wore that dress a lot that summer, when we hung out as friends, and in the summers since. In fact I held on to it for about 12 years, which works out at about 21p per wear. But every time I wore it, he noticed it. Two children later, there is no way I could wear it, let alone find it, but I hope I haven’t lost it for good. \u003cstrong\u003eMorwenna Ferrier, fashion and lifestyle editor\u003c/strong\u003e\u003c/p\u003e\u003cfigure data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.NewsletterSignupBlockElement\"\u003e\u003ca data-ignore=\"global-link-styling\" href=\"#EmailSignup-skip-link-10\"\u003eskip past newsletter promotion\u003c/a\u003e\u003cp id=\"EmailSignup-skip-link-10\" tabindex=\"0\" aria-label=\"after newsletter promotion\" role=\"note\"\u003eafter newsletter promotion\u003c/p\u003e\u003c/figure\u003e\u003cp\u003e\u003cstrong\u003eWhat happens in Vegas …\u003cbr/\u003e\u003c/strong\u003eI can’t for the life of me remember what I wore on my first date with my husband but I can sure as hell remember what he wore: a sparkly blazer. As the relationship progressed, it became the butt of our jokes, and we called it his Vegas jacket. I cannot think of a single item of clothing that so inaccurately conveys his character. He could not be less of a sparkly blazer kind of guy. His prized outfits are his “inside clothes” – Adidas jersey joggers and hoodie. Always black. Not a jazzy sheen in sight. I’ve asked him what that blazer was about, was it a (slightly misjudged) attempt to woo me? “Dunno,” he retorts. “Fashion was different back then.” Lucky for him, I saw past the shiny lapel and fell for the man on the inside … who prefers a hoodie. \u003cstrong\u003eAbigail Radnor, lifestyle editor, Saturday Magazine \u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBack in black\u003cbr/\u003e\u003c/strong\u003eI am sure on our first date I wore an old favourite black sleeveless Uniqlo dress because it was the day after the hottest day that year and still unbearably warm. But when I went to confirm that with my boyfriend, now, eight years later, he was adamant I was wearing a long black dress with a vintage AC/DC T-shirt. A shirt I distinctly remember him mentioning, a few years ago, that he didn’t like. It’s amazing there was ever a second date. \u003cstrong\u003eHelen Seamons, menswear editor\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eTo read the complete version of this newsletter – complete with this week’s trending topics in The Measure and your wardrobe dilemmas solved – \u003ca href=\"https://www.theguardian.com/global/2022/sep/20/sign-up-for-the-fashion-statement-newsletter-our-free-fashion-email\" data-link-name=\"in body link\"\u003esubscribe to receive Fashion Statement\u003c/a\u003e in your inbox every Thursday.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-02-13T17:00:43Z",
  "modifiedTime": "2025-02-13T17:02:31Z"
}
