{
  "id": "49b0b5a4-dfea-46ed-9929-a8368e0ad019",
  "title": "I Tried Kylie Jenner's Viral Skintight Catsuit - and It Was Surprisingly Demure",
  "link": "https://www.popsugar.com/fashion/kylie-jenner-khy-smooth-stretch-capri-catsuit-review-49405177",
  "description": "When I first saw Kylie Jenner modeling her Khy Smooth Stretch Capri Catsuit ($78) on Instagram, I was struck by the simplicity of the look. We've seen the 27-year-old entrepreneur and beauty mogul in everything from intricate corsets to unfathomable cutouts, so this pared back moment really stopped me in my tracks. Jenner was in Italy, rocking the backless number to dinner with nothing but Maison Margiela leather flats, gold jewelry, and an oversize woven tote. The outfit honestly stuck with me for a while. And when, months later, I saw that the design - available in black, light gray, and cherry - was a bestseller on Khy.com, I was convinced I needed to try it. I've never been much of a one-piece lover. If anything, I'd consider a nylon-spandex silhouette like this appropriate material for a workout set, not a going-out moment. And seeing how flattering it was on Jenner didn't exactly bestow me with any confidence. Chalk it up to the simultaneous rise of the demure trend and its impact on fashion, but I just really liked how Jenner's styling of the catsuit felt considered yet uncomplicated. Ahead, you can see how I styled her exact design and how I felt wearing it out in public. About the Khy Clothing Brand by Kylie Jenner Khy was launched in October 2023 as a collaborative brand inspired by Jenner's wardrobe that teams up with high-fashion designers on drops. Sizes range from XXS-4X/00-34 and prices range from $28 to $252. To date, Khy's global design collaborators include Namilia, Atlein, Ioannes, Natasha Zinko, and Entire Studios. The bestselling Khy Smooth Stretch Capri Catsuit was part of Drop 009 Golden Hour. What I Like About Kylie Jenner's Khy Smooth Stretch Capri Catsuit Like many Skims products I've tried, the Khy Smooth Stretch Capri Catsuit fits like a second skin. It's extremely comfortable, especially since you can adjust it to your liking with the halter neck tie at the back. The piece is constructed from 85 percent nylon and 15 percent spandex, making it flexible and smooth, but still opaque and not at all sheer like a pair of tights. (In other words, I couldn't make out every little butt dimple or body curve through the fabric.) I felt sexy when I put it on, but still relatively covered up. I didn't look naked; rather, surprisingly elegant and graceful - like a ballerina. How to Style the Khy Catsuit Like Kylie Jenner As previously mentioned, I took a liking to Jenner's styling with a simple pair of black flats - mine being a patent iteration with a bow at the toe from Cider - but I felt most comfortable when I added my oversize Frame denim jacket and pushed up the sleeves for an effortless streetwear touch. I accessorized with my rectangular Otra Eyewear frames and a pop of yellow, courtesy of my Fendi croissant shoulder bag sourced from Vivrelle. As a bonus, I even wore the catsuit on Halloween with a pair of black leather knee-high boots, which is a popular way to style the Khy Smooth Stretch Capri Catsuit, according to social media. What to Consider Before Buying Kylie Jenner's Khy Smooth Stretch Capri Catsuit At the end of the day, the catsuit is a very tight article of clothing that bares skin and is designed to show off the body, so it's natural to feel weary about slipping into it - especially without any extra layers. As I wore it, I also felt like the crotch area \"dropped\" a bit over time, rather than staying perfectly taut and in place. This tends to bother me when it comes to wearing one-pieces, although others may not even notice a little natural slippage. Note the black version of the Khy catsuit isn't currently stocked in all sizes. And if you're looking for something like this in a full-length leg, I would browse through the alternative options below, because the inseam is cropped at only 23 inches. Where to Buy Kylie Jenner's Catsuit From Khy You can purchase the Khy Smooth Stretch Capri Catsuit directly on the brand's site, or shop similar options from Skims ($148), Popilush ($59, originally $69), Lane Bryant ($90), Amazon ($30), Spiritual Gangster ($128), or Shapellx ($39, originally $58). Rating: Sarah Wasilak (she/her) is the associate director of Shopping at PS. With plenty of experience in the commerce market, a keen interest in SEO, and 10 years as an editor at the brand, she enjoys writing across the lifestyle and health-and-fitness categories. She has bylines at PS, InStyle, Elle, Refinery29, Who What Wear, Elite Daily, Byrdie, and The Quality Edit and aims to amplify minority voices in all her work.",
  "author": "Sarah Wasilak",
  "published": "Tue, 29 Oct 2024 10:52:03 -0700",
  "source": "https://www.popsugar.com/fashion/feed",
  "categories": [
    "Kylie Jenner",
    "Product Reviews",
    "Fashion Shopping",
    "Shopping",
    "Jumpsuits"
  ],
  "byline": "Sarah Wasilak",
  "length": 4749,
  "excerpt": "PS editor Sarah Wasilak tries out Kylie Jenner's Khy Smooth Stretch Capri Catsuit in black, a bestseller on the clothing brand's site — read her review.",
  "siteName": "Popsugar",
  "favicon": "",
  "text": "While each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our Product Review Guidelines here. When I first saw Kylie Jenner modeling her Khy Smooth Stretch Capri Catsuit ($78) on Instagram, I was struck by the simplicity of the look. We've seen the 27-year-old entrepreneur and beauty mogul in everything from intricate corsets to unfathomable cutouts, so this pared back moment really stopped me in my tracks. Jenner was in Italy, rocking the backless number to dinner with nothing but Maison Margiela leather flats, gold jewelry, and an oversize woven tote. The outfit honestly stuck with me for a while. And when, months later, I saw that the design — available in black, light gray, and cherry — was a bestseller on Khy.com, I was convinced I needed to try it. I've never been much of a one-piece lover. If anything, I'd consider a nylon-spandex silhouette like this appropriate material for a workout set, not a going-out moment. And seeing how flattering it was on Jenner didn't exactly bestow me with any confidence. Chalk it up to the simultaneous rise of the demure trend and its impact on fashion, but I just really liked how Jenner's styling of the catsuit felt considered yet uncomplicated. Ahead, you can see how I styled her exact design and how I felt wearing it out in public. About the Khy Clothing Brand by Kylie Jenner Khy was launched in October 2023 as a collaborative brand inspired by Jenner's wardrobe that teams up with high-fashion designers on drops. Sizes range from XXS-4X/00-34 and prices range from $28 to $252. To date, Khy's global design collaborators include Namilia, Atlein, Ioannes, Natasha Zinko, and Entire Studios. The bestselling Khy Smooth Stretch Capri Catsuit was part of Drop 009 Golden Hour. What I Like About Kylie Jenner's Khy Smooth Stretch Capri CatsuitLike many Skims products I've tried, the Khy Smooth Stretch Capri Catsuit fits like a second skin. It's extremely comfortable, especially since you can adjust it to your liking with the halter neck tie at the back. The piece is constructed from 85 percent nylon and 15 percent spandex, making it flexible and smooth, but still opaque and not at all sheer like a pair of tights. (In other words, I couldn't make out every little butt dimple or body curve through the fabric.) I felt sexy when I put it on, but still relatively covered up. I didn't look naked; rather, surprisingly elegant and graceful — like a ballerina. How to Style the Khy Catsuit Like Kylie JennerAs previously mentioned, I took a liking to Jenner's styling with a simple pair of black flats — mine being a patent iteration with a bow at the toe from Cider — but I felt most comfortable when I added my oversize Frame denim jacket and pushed up the sleeves for an effortless streetwear touch. I accessorized with my rectangular Otra Eyewear frames and a pop of yellow, courtesy of my Fendi croissant shoulder bag sourced from Vivrelle. As a bonus, I even wore the catsuit on Halloween with a pair of black leather knee-high boots, which is a popular way to style the Khy Smooth Stretch Capri Catsuit, according to social media. What to Consider Before Buying Kylie Jenner's Khy Smooth Stretch Capri CatsuitAt the end of the day, the catsuit is a very tight article of clothing that bares skin and is designed to show off the body, so it's natural to feel weary about slipping into it — especially without any extra layers. As I wore it, I also felt like the crotch area \"dropped\" a bit over time, rather than staying perfectly taut and in place. This tends to bother me when it comes to wearing one-pieces, although others may not even notice a little natural slippage. Note the black version of the Khy catsuit isn't currently stocked in all sizes. And if you're looking for something like this in a full-length leg, I would browse through the alternative options below, because the inseam is cropped at only 23 inches. Where to Buy Kylie Jenner's Catsuit From KhyYou can purchase the Khy Smooth Stretch Capri Catsuit directly on the brand's site, or shop similar options from Skims ($148), Popilush ($59, originally $69), Lane Bryant ($90), Amazon ($30), Spiritual Gangster ($128), or Shapellx ($39, originally $58). Rating: ★★★★☆ Sarah Wasilak (she/her) is the associate director of Shopping at PS. With plenty of experience in the commerce market, a keen interest in SEO, and 10 years as an editor at the brand, she enjoys writing across the lifestyle and health-and-fitness categories. She has bylines at PS, InStyle, Elle, Refinery29, Who What Wear, Elite Daily, Byrdie, and The Quality Edit and aims to amplify minority voices in all her work.",
  "image": "https://media1.popsugar-assets.com/files/thumbor/6TYr-oFuAbVduRxZd-PoUl23K90=/0x0:1198x629/fit-in/1200x630/top/filters:format_auto():quality(85):upscale()/2024/10/29/625/n/1922564/add568f26720ea64adb492.21976777_.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eWhile each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our \u003ca href=\"https://www.popsugar.com/ps-product-review-guidelines-disclosures\" target=\"_blank\"\u003eProduct Review Guidelines here\u003c/a\u003e.\u003c/p\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"2\"\u003e\u003cp data-element-index=\"0\"\u003e\nWhen I first saw Kylie Jenner modeling her \u003ca href=\"http://www.khy.com/products/smooth-stretch-capri-catsuit-black?ref=popsugar.com\u0026amp;=___psv__p_49405177__t_w_\" target=\"_blank\"\u003eKhy Smooth Stretch Capri Catsuit\u003c/a\u003e ($78) on \u003ca href=\"https://www.instagram.com/p/C9qBZs7tgP3/?ref=popsugar.com\u0026amp;=___psv__p_49405177__t_w_\" target=\"_blank\"\u003eInstagram\u003c/a\u003e, I was struck by the simplicity of the look. We\u0026#39;ve seen the 27-year-old entrepreneur and beauty mogul in everything from intricate corsets to unfathomable cutouts, so this pared back moment really stopped me in my tracks. Jenner was in Italy, rocking the backless number to dinner with nothing but Maison Margiela leather flats, gold jewelry, and an oversize woven tote. \n\u003c/p\u003e\u003cdiv\u003e\u003ca href=\"http://www.khy.com/products/smooth-stretch-capri-catsuit-black?ref=popsugar.com\u0026amp;=___psv__p_49405177__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\" aria-label=\"\" data-vars-action=\"product image\" data-vars-retailer=\"khy.com\" data-vars-price=\"$78\" data-vars-href=\"http://www.khy.com/products/smooth-stretch-capri-catsuit-black\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/WcR023gsQjXFzFhWy0unedaaVu8=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2024/10/29/655/n/44344577/shopSfRdVk.jpg\" media=\"(min-width: 1024px)\" data-size=\"desktop\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/WcR023gsQjXFzFhWy0unedaaVu8=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2024/10/29/655/n/44344577/shopSfRdVk.jpg\" media=\"(min-width: 768px) and (max-width: 1023px)\" data-size=\"tablet\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/KZ8hch4MbsVdo99ye2HPH9uTxsM=/fit-in/700x700/filters:format_auto():extract_cover():upscale():fill(ffffff)/2024/10/29/655/n/44344577/shopSfRdVk.jpg\" media=\"(max-width: 767px)\" data-size=\"mobile\" width=\"350\" height=\"350\"/\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/ZQEyx6l2WthLYe5BjhrThQke8II=/fit-in/350x350/filters:format_auto():quality(70):extract_cover():upscale():fill(ffffff)/2024/10/29/655/n/44344577/shopSfRdVk.jpg\" alt=\"Main Image\" width=\"350\" height=\"350\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/div\u003e\u003cp data-element-index=\"1\"\u003eThe outfit honestly stuck with me for a while. And when, months later, I saw that the design — available in black, light gray, and cherry — was a bestseller on \u003ca href=\"https://www.khy.com/?ref=popsugar.com\u0026amp;=___psv__p_49405177__t_w_\" target=\"_blank\"\u003eKhy.com\u003c/a\u003e, I was convinced I needed to try it. I\u0026#39;ve never been much of a one-piece lover. If anything, I\u0026#39;d consider a nylon-spandex silhouette like this appropriate material for a \u003ca href=\"https://www.popsugar.com/fitness/best-matching-workout-sets-44225156\" target=\"_blank\"\u003eworkout set\u003c/a\u003e, not a going-out moment. And seeing how flattering it was on Jenner didn\u0026#39;t exactly bestow me with any confidence.\n\u003c/p\u003e\u003cp data-element-index=\"2\"\u003eChalk it up to the simultaneous rise of the \u003ca href=\"https://www.popsugar.com/shopping/demure-tiktok-trend-product-recommendations-49386222\" target=\"_blank\"\u003edemure trend\u003c/a\u003e and its impact on fashion, but I just really liked how Jenner\u0026#39;s styling of the catsuit felt considered yet uncomplicated. Ahead, you can see how I styled her exact design and how I felt wearing it out in public.\n\u003c/p\u003e\u003cp data-element-index=\"3\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eAbout the Khy Clothing Brand by Kylie Jenner\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-element-index=\"4\" data-element-has-ending-title=\"false\"\u003e\u003cul\u003e\n\u003cli\u003eKhy was launched in October 2023 as a collaborative brand inspired by Jenner\u0026#39;s wardrobe that teams up with high-fashion designers on drops.\u003c/li\u003e\n\u003cli\u003eSizes range from XXS-4X/00-34 and prices range from $28 to $252.\u003c/li\u003e\n\u003cli\u003eTo date, Khy\u0026#39;s global design collaborators include Namilia, Atlein, Ioannes, Natasha Zinko, and Entire Studios.\u003c/li\u003e\n\u003cli\u003eThe bestselling Khy Smooth Stretch Capri Catsuit was part of \u003ca href=\"https://www.khy.com/collections/golden-hour?ref=popsugar.com\u0026amp;=___psv__p_49405177__t_w_\" target=\"_blank\"\u003eDrop 009 Golden Hour\u003c/a\u003e.\u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003cp data-element-index=\"5\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eWhat I Like About Kylie Jenner\u0026#39;s Khy Smooth Stretch Capri Catsuit\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"6\"\u003eLike many \u003ca href=\"https://www.popsugar.com/fashion/skims-nipple-bra-review-49371344\" target=\"_blank\"\u003eSkims products I\u0026#39;ve tried\u003c/a\u003e, the Khy Smooth Stretch Capri Catsuit fits like a second skin. It\u0026#39;s extremely comfortable, especially since you can adjust it to your liking with the halter neck tie at the back. The piece is constructed from 85 percent nylon and 15 percent spandex, making it flexible and smooth, but still opaque and not at all sheer like a pair of tights. (In other words, I couldn\u0026#39;t make out every little butt dimple or body curve through the fabric.) I felt sexy when I put it on, but still relatively covered up. I didn\u0026#39;t look naked; rather, surprisingly elegant and graceful — like a ballerina. \n\u003c/p\u003e\u003c/div\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"5\" data-element-has-beginning-title=\"true\"\u003e\u003cp data-element-index=\"0\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eHow to Style the Khy Catsuit Like Kylie Jenner\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"1\"\u003eAs previously mentioned, I took a liking to Jenner\u0026#39;s styling with a simple pair of black flats — mine being a patent iteration with a bow at the toe from \u003ca href=\"https://go.skimresources.com/?id=1025X1701743\u0026amp;url=https%3A%2F%2Fwww.shopcider.com%2Fgoods%2Fbow-decor-square-toe-mary-jane-flats-1035864\u0026amp;xcust=___psv__p_49405177__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eCider\u003c/a\u003e — but I felt most comfortable when I added my oversize Frame denim jacket and pushed up the sleeves for an effortless streetwear touch. I accessorized with my rectangular Otra Eyewear frames and a pop of yellow, courtesy of my Fendi croissant shoulder bag sourced from \u003ca href=\"https://go.skimresources.com/?id=1025X1701743\u0026amp;url=https%3A%2F%2Fwww.vivrelle.com%2Fproducts%2Fsmall-croissant-shoulder-bag\u0026amp;xcust=___psv__p_49405177__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eVivrelle\u003c/a\u003e. As a bonus, I even \u003ca href=\"https://www.instagram.com/p/DBmEbSNRkbv/?img_index=1\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_49405177__t_w_\" target=\"_blank\"\u003ewore the catsuit on Halloween\u003c/a\u003e with a pair of black leather knee-high boots, which is a popular way to style the Khy Smooth Stretch Capri Catsuit, according to \u003ca href=\"https://www.instagram.com/p/C_tENoRvIuA/?img_index=1\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_49405177__t_w_\" target=\"_blank\"\u003esocial media\u003c/a\u003e. \u003c/p\u003e\u003cp data-element-index=\"2\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eWhat to Consider Before Buying Kylie Jenner\u0026#39;s Khy Smooth Stretch Capri Catsuit\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"3\"\u003eAt the end of the day, the catsuit is a very tight article of clothing that bares skin and is designed to show off the body, so it\u0026#39;s natural to feel weary about slipping into it — especially without any extra layers. As I wore it, I also felt like the crotch area \u0026#34;dropped\u0026#34; a bit over time, rather than staying perfectly taut and in place. This tends to bother \u003cem\u003eme\u003c/em\u003e when it comes to wearing one-pieces, although others may not even notice a little natural slippage.  \u003c/p\u003e\u003cp data-element-index=\"4\"\u003eNote the black version of the Khy catsuit isn\u0026#39;t currently stocked in all sizes. And if you\u0026#39;re looking for something like this in a full-length leg, I would browse through the alternative options below, because the inseam is cropped at only 23 inches. \u003c/p\u003e\u003cp data-element-index=\"5\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eWhere to Buy Kylie Jenner\u0026#39;s Catsuit From Khy\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"6\"\u003eYou can purchase the Khy Smooth Stretch Capri Catsuit directly on the \u003ca href=\"https://www.khy.com/products/smooth-stretch-capri-catsuit-black?ref=popsugar.com\u0026amp;=___psv__p_49405177__t_w_\" target=\"_blank\"\u003ebrand\u0026#39;s site\u003c/a\u003e, or shop similar options from \u003ca href=\"https://nordstrom.sjv.io/c/1141873/1960196/23920?u=https%3A%2F%2Fwww.nordstrom.com%2Fs%2Fbody-super-push-up-catsuit-regular-plus%2F7942030\u0026amp;subId1=___psv__p_49405177__t_w_\u0026amp;subId3=product\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eSkims\u003c/a\u003e ($148), \u003ca href=\"https://go.skimresources.com/?id=1025X1701743\u0026amp;url=https%3A%2F%2Fwww.popilush.com%2Fproducts%2Fbuilt-in-shapewear-halter-jumpsuit%3Fvariant%3D43185737466032\u0026amp;xcust=___psv__p_49405177__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003ePopilush\u003c/a\u003e ($59, originally $69), \u003ca href=\"https://go.skimresources.com/?id=1025X1701743\u0026amp;url=https%3A%2F%2Fwww.lanebryant.com%2Ftotally-smooth-smoothing-unitard-11%2Fprd-601244960.html\u0026amp;xcust=___psv__p_49405177__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eLane Bryant\u003c/a\u003e ($90), \u003ca href=\"https://www.amazon.com/LuFeng-Sleeveless-Bodycon-Rompers-Jumpsuit/dp/B088PH5Q25/ref=sr_1_2_sspa?tag=popsugarshopx-20\u0026amp;asc_source=Sailthru\u0026amp;asc_campaign=wellness-winner-10292024\u0026amp;asc_refurl=https://www.popsugar.com/fashion/kylie-jenner-khy-smooth-stretch-capri-catsuit-review-49405177\u0026amp;ascsubtag=___psv__p_49405177__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eAmazon\u003c/a\u003e ($30), \u003ca href=\"https://nordstrom.sjv.io/c/1141873/1960196/23920?u=https%3A%2F%2Fwww.nordstrom.com%2Fs%2Fmargot-crossover-strap-bodysuit%2F7898215\u0026amp;subId1=___psv__p_49405177__t_w_\u0026amp;subId3=product\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eSpiritual Gangster\u003c/a\u003e ($128), or \u003ca href=\"https://go.skimresources.com/?id=1025X1701743\u0026amp;url=https%3A%2F%2Fwww.shapellx.com%2Fproducts%2F8-in-1-happy-butt-solution-jumpsuit\u0026amp;xcust=___psv__p_49405177__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eShapellx\u003c/a\u003e ($39, originally $58). \u003c/p\u003e\u003cp data-element-index=\"7\"\u003e\u003cstrong\u003eRating:\u003c/strong\u003e\u003cbr/\u003e ★★★★☆ \u003c/p\u003e\u003cp data-element-index=\"9\"\u003e\u003cem\u003e\u003ca href=\"https://www.popsugar.com/author/sarah-wasilak\" target=\"_blank\"\u003eSarah Wasilak\u003c/a\u003e (she/her) is the associate director of Shopping at PS. With plenty of experience in the commerce market, a keen interest in SEO, and 10 years as an editor at the brand, she enjoys writing across the lifestyle and health-and-fitness categories. She has bylines at PS, InStyle, Elle, Refinery29, Who What Wear, Elite Daily, Byrdie, and The Quality Edit and aims to amplify minority voices in all her work.\u003c/em\u003e\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-10-29T17:52:03Z",
  "modifiedTime": "2024-10-29T17:52:03Z"
}
