{
  "id": "6ff86876-86f9-4ea0-810c-de8f369f90b4",
  "title": "Nordstrom’s Fall Sale Has Landed — Here Are The 22 Best Fashion Finds",
  "link": "https://www.refinery29.com/en-us/best-nordstrom-deals?utm_source=feed\u0026utm_medium=rss",
  "description": "Fall is the perfect time to rethink your style direction. After all, the change in temperature calls for a switch in fabrics, silhouettes, and even mood. It’s also an opportunity to stock up on wardrobe must-haves or experiment with a trend you’ve been eyeing, with all the seasonal sales. One of the most anticipated ones is Nordstrom’s. The retailer just rolled out its Fall Sale, and it’s brimming with the best of runway-approved fashion trends, including wide-leg jeans, knee-high boots, metallic sneakers, and Brat green accessories — all up to 60% off. There's truly no time like the present to round out your seasonal wardrobe with these discounted items. If, however, you're feeling overwhelmed by the deluge of quickly-selling pieces, don't worry: We’re here to help. Ahead, we've compiled the best Nordstrom deals across women’s fashion — from Refinery29 reader-favorite brands like Skims, Free People, JW Pei, Dolce Vita, and more — that we think are worth adding to your cart ASAP. Be sure to check back here for new discounted fashion finds before the sale ends on October 28.All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.For more can't-miss shopping stories delivered straight to your inbox, sign up for our Most Wanted newsletter.25% off Good American Good Skate Ripped Hem Wide Leg Jeans Shop NordstromGood American Good Skate Ripped Hem Wide Leg Jeans, $, available at Nordstrom60% off Dolce Vita Annika Pointed Toe Boot Shop NordstromDolce Vita Annika Pointed Toe Boot, $, available at Nordstrom25% off Avec Les Filles Cutaway Tailored Maxi Coat Shop NordstromAvec Les Filles Cutaway Tailored Maxi Coat, $, available at Nordstrom30% off Sam Edelman Michaela Rhinestone Mary Jane Flat Shop NordstromSam Edelman Michaela Rhinestone Mary Jane Flat, $, available at Nordstrom25% off True \u0026 Co True Body Boost Longline BraletteShop NordstromTrue \u0026 Co True Body Boost Longline Bralette, $, available at Nordstrom40% off Converse Chuck Taylor All Star 70 Metallic High Top Sneaker Shop NordstromConverse Callie Bootie, $, available at Nordstrom50% off Skims New Vintage Long Sleeve T-Shirt Shop NordstromSkims New Vintage Long Sleeve T-Shirt, $, available at Nordstrom60% off JW Pei Joy Faux Leather Shoulder BagShop NordstromJW PEI Joy Faux Leather Shoulder Bag, $, available at Nordstrom40% off Nordstrom Lyocell \u0026 Wool Turtleneck Shop NordstromNordstrom Lyocell \u0026 Wool Turtleneck, $, available at Nordstrom38% off Marc Fisher LTD Lalita Knee High Boot Shop NordstromMarc Fisher LTD Lalita Knee High Boot, $, available at Nordstrom25% off Free People We The Free Palmer Cuffed Baggy JeansShop NordstromFree People We the Free Palmer Cuffed Baggy Jeans, $, available at Nordstrom33% off Nordstrom Madyson Mary Jane Pump Shop NordstromNordstrom Madyson Mary Jane Pump, $, available at Nordstrom25% off Luxely Open Stitch Fringe Long Sleeve Asymmetric Sweater Dress Shop NordstromLuxely Open Stitch Fringe Long Sleeve Asymmetric Sweater Dress, $, available at Nordstrom41% off Franco Sarto Katherine Knee High Boot Shop NordstromFranco Sarto Katherine Knee High Boot, $, available at Nordstrom61% off Papinelle Anniversary Stripe Long Sleeve \u0026 Short PajamasShop NordstromPapinelle Anniversary Stripe Long Sleeve \u0026 Short Pajamas, $, available at Nordstrom40% off Open Edit Relaxed Fit Blazer Shop NordstromOpen Edit Relaxed Fit Blazer, $, available at Nordstrom40% off Kurt Geiger London Kensington Crossbody Bag Shop NordstromKurt Geiger London Kensington Crossbody Bag, $, available at Nordstrom25% off BP. Cargo PantsShop NordstromBP. Cargo Pants, $, available at Nordstrom30% off Vince Iliana Slingback Pointed Toe Flat Shop NordstromVince Iliana Slingback Pointed Toe Flat, $, available at Nordstrom40% off DKNY Transfer Stitch SweaterShop NordstromDKNY Transfer Stitch Sweater, $, available at Nordstrom60% off Steve Madden Gleeson Moto Boot Shop NordstromSteve Madden Gleeson Moto Boot, $, available at Nordstrom60% off House of CB Antonella Lace-Up Faux Leather CorsetShop NordstromHouse of CB Antonella Lace-Up Faux Leather Corset, $, available at NordstromBest Nordstrom Dresses On SaleWhether you're in search of the aforementioned fall wardrobe refresh, wedding guest cocktail attire, or a casual everyday dress, Nordstrom has many suitable styles on sale right now. And our top picks are up to almost 60% off, so you get the most bang for your buck.Shop Steve Madden At NordstromSteve Madden Lucielle Handkerchief Hem Satin Slipdress, $, available at Nordstrom25% Off Rare London Devore Floral Tie Front Chiffon Maxi Dress Shop Rare London At NordstromRare London Devore Floral Tie Front Chiffon Maxi Dress, $, available at Nordstrom25% Off Eloquii One Shoulder Long Sleeve Maxi Sweater Dress Shop Eloquii At Nordstrom Eloquii Zip Collar Long Sleeve Rib Maxi Dress, $, available at Nordstrom56% Off All Saints Hadley Butterfly Print Cowl Neck Satin Slipdress Shop All Saints At NordstromAll Saints Hadley Butterfly Print Cowl Neck Satin Slipdress, $, available at Nordstom30% Off Velvet Cowl Bardot Maxi DressShop QUIZ At NordstromQuiz Velvet Cowl Bardot Maxi Dress, $, available at NordstromBest Nordstrom Jewelry \u0026 Accessories On SaleThe Nordstrom sale section has pretty much every accessory category covered: sunglasses, jewelry, everyday handbags, and even stylish baseball caps.Shop Kurt Geiger London At NordstromKurt Geiger London Evil Eye Huggie Drop Earrings, $, available at Nordstom35% Off Senreve Mini Maestra Pebbled Leather 4-Way Convertible Handbag Shop Senreve At NordstromSenreve Mini Maestra Pebbled Leather 4-Way Convertible Handbag, $, available at Nordstom60% Off Lost Days Cat Eye Sunglasses Shop Le Specs At NordstromLe Specs Lost Days Cat Eye Sunglasses, $, available at Nordstrom10% Off Oradina 14K Solid Gold Stack Ribbon RingShop Oradina At NordstromOradina 14K Solid Gold Stack Ribbon Ring, $, available at Nordstrom25% Off BP. Destination Adjustable Baseball CapShop BP. At NordstromBP. Destination Adjustable Baseball Cap, $, available at NordstromBest Nordstrom Tops \u0026 Bottoms On SaleNordstrom also has an expansive range of the latest tops, bottoms, intimates, and outerwear on sale, too. If you're looking for a fall-friendly skirt or cool pleather pants, the retailer has you covered.Shop Caslon At NordstromCaslon Leather Bomber Jacket, $, available at Nordstrom35% off Frame Francoise Wide Leg JeansShop Frame at NordstromFrame Francoise Wide Leg Jeans, $, available at Nordstrom25% Off Open Edit Wrap SweaterShop Open Edit at NordstromOpen Edit Wrap Sweater, $, available at Nordstrom32% Off Alice + Olivia Dylan High Waist Faux Leather Wide Leg Pants Shop Alice + Olivia at Nordstrom Alice + Olivia Dylan High Waist Faux Leather Wide Leg Pants, $, available at Nordstrom24% Off Eloquii Midi Sequin SkirtShop Eloquii at NordstromEloquii Sequin Midi Skirt, $, available at Nordstrom20% Off Avec Les Filles Oversize Leather BlazerShop Avec Les Filles at NordstromAvec Les Filles Oversize Leather Blazer Avec Les Filles, $, available at NordstromBest Nordstrom Shoes On SaleYou can never have too many shoes, especially when new ones are on sale. Nordstrom has a mix fall-appropriate styles, including heels, booties, clogs, and mules — all at a discount.Shop Steve Madden At NordstromSteve Madden Glimmer Imitation Pearl Mule, $, available at Nordstrom25% Off Nordstrom Kiplyn Kitten Heel Pump Shop Nordstrom at NordstromNordstrom Kiplyn Kitten Heel Pump, $, available at Nordstrom50% Off Kenneth Cole Block Heel Stretch Bootie Shop Kenneth Cole at NordstromKenneth Cole Block Heel Stretch Bootie, $, available at Nordstrom40% Off Paul Green Ursula Ballet FlatShop Paul Green at Nordstrom Paul Green Ursula Ballet Flat, $, available at NordstromBest Nordstrom Beauty Buys On SaleIf you want to refresh your makeup for fall, Nordstrom has luxurious beauty products that are heavily discounted. Along with gift sets, we've thrown a couple of bestselling lipsticks into this list.Shop Fresh At NordstromFresh Skin-Smoothing Mask Set (Nordstrom Exclusive), $, available at NordstromShop 15% Off Benefit Cosmetics Benetint Rose Lip \u0026 Cheek Stain \u0026 Case SetShop Benefit Cosmetics at NordstromBenefit Cosmetics Benetint Rose Lip \u0026 Cheek Stain \u0026 Case Set, $, available at Nordstrom30% Off Armani Beauty Lip Maestro Matte Liquid Lipstick Shop Armani Beauty At NordstromArmani Beauty Lip Maestro Matte Liquid Lipstick, $, available at NordstromBest Nordstrom Home Decor \u0026 Kitchenware On SaleCheck out Nordstrom's discounted home pieces for ideas on how to refresh your space for fall. Toss out that rusty pan or those scratchy sheets, and bring something new and fresh into your life.Shop Boll \u0026 Branch At NordstromBoll \u0026 Branch Waffle Weave Organic Cotton Duvet Cover \u0026 Sham Set, $, available at NordstromShop 24% Off Our place Diwali Oven Pan \u0026 Mat SetShop Our Place at NordstromOur Place Diwali Oven Pan \u0026 Mat Set, $, available at NordstromShop 20% Off Le Creuset Signature 5.5-Quart Round Enamel Cast Iron French/Dutch OvenShop Le Creuset at NordstromLe Creuset Signature 5.5-Quart Round Enamel Cast Iron French/Dutch, $, available at NordstromLike what you see? How about some more R29 goodness, right here?This Weekend's Best Sales, According To UsHow Editors Style Barrel-Leg Jeans For Fall LooksShop Nordstrom x Harlem’s Fashion Row Fall Capsule",
  "author": "Victoria Montalti",
  "published": "Thu, 17 Oct 2024 19:01:28 +0000",
  "source": "https://www.refinery29.com/fashion/rss.xml",
  "categories": null,
  "byline": "Victoria Montalti",
  "length": 2744,
  "excerpt": "Take up to 60% off clothing, shoes, and handbags during Nordstrom’s Fall Sale. Shop discounted fashion from now until October 28.",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "Photo: Courtesy of Nordstrom.Fall is the perfect time to rethink your style direction. After all, the change in temperature calls for a switch in fabrics, silhouettes, and even mood. It’s also an opportunity to stock up on wardrobe must-haves or experiment with a trend you’ve been eyeing, with all the seasonal sales. AdvertisementADVERTISEMENTThere's truly no time like the present to round out your seasonal wardrobe with these discounted items. If, however, you're feeling overwhelmed by the deluge of quickly-selling pieces, don't worry: We’re here to help. Ahead, we've compiled the best Nordstrom deals across women’s fashion — from Refinery29 reader-favorite brands like Skims, Free People, JW Pei, Dolce Vita, and more — that we think are worth adding to your cart ASAP. Be sure to check back here for new discounted fashion finds before the sale ends on October 28.All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.1 of 2225% off Good American Good Skate Ripped Hem Wide Leg Jeans Shop Nordstrom2 of 2260% off Dolce Vita Annika Pointed Toe Boot Shop NordstromAdvertisementADVERTISEMENT3 of 2225% off Avec Les Filles Cutaway Tailored Maxi Coat Shop Nordstrom4 of 2230% off Sam Edelman Michaela Rhinestone Mary Jane Flat Shop Nordstrom5 of 2225% off True \u0026 Co True Body Boost Longline BraletteShop Nordstrom6 of 2240% off Converse Chuck Taylor All Star 70 Metallic High Top Sneaker Shop Nordstrom7 of 2250% off Skims New Vintage Long Sleeve T-Shirt Shop NordstromAdvertisementADVERTISEMENT8 of 2260% off JW Pei Joy Faux Leather Shoulder BagShop Nordstrom9 of 2240% off Nordstrom Lyocell \u0026 Wool Turtleneck Shop Nordstrom10 of 2238% off Marc Fisher LTD Lalita Knee High Boot Shop Nordstrom11 of 2225% off Free People We The Free Palmer Cuffed Baggy JeansShop Nordstrom12 of 2233% off Nordstrom Madyson Mary Jane Pump Shop NordstromAdvertisementADVERTISEMENT13 of 2225% off Luxely Open Stitch Fringe Long Sleeve Asymmetric Sweater Dress Shop Nordstrom14 of 2241% off Franco Sarto Katherine Knee High Boot Shop Nordstrom15 of 2261% off Papinelle Anniversary Stripe Long Sleeve \u0026 Short PajamasShop Nordstrom16 of 2240% off Open Edit Relaxed Fit Blazer Shop Nordstrom17 of 2240% off Kurt Geiger London Kensington Crossbody Bag Shop NordstromAdvertisementADVERTISEMENT19 of 2230% off Vince Iliana Slingback Pointed Toe Flat Shop Nordstrom20 of 2240% off DKNY Transfer Stitch SweaterShop Nordstrom21 of 2260% off Steve Madden Gleeson Moto Boot Shop Nordstrom22 of 2260% off House of CB Antonella Lace-Up Faux Leather CorsetShop NordstromAdvertisementADVERTISEMENTAdvertisementADVERTISEMENTAdvertisementADVERTISEMENTAdvertisementADVERTISEMENTAdvertisementADVERTISEMENT",
  "image": "https://www.refinery29.com/images/11795337.jpg?crop=2000%2C1050%2Cx0%2Cy914",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"r29-container\"\u003e\u003cdiv\u003e\u003carticle\u003e\u003cdiv id=\"article-main-content\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cfigure\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cp\u003ePhoto: Courtesy of Nordstrom.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003csection\u003e\u003cdiv\u003e\u003cp\u003eFall is the perfect time to rethink your style direction. After all, the change in temperature calls for a switch in fabrics, silhouettes, and even mood. It’s also an opportunity to stock up on \u003ca href=\"https://www.refinery29.com/en-us/fall-clothes-accessories-2024\"\u003ewardrobe must-haves\u003c/a\u003e or experiment with a trend you’ve been eyeing, with all the seasonal sales. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThere\u0026#39;s truly no time like the present to round out your seasonal wardrobe with these discounted items. If, however, you\u0026#39;re feeling overwhelmed by the deluge of \u003ca href=\"https://www.nordstrom.com/browse/sale/new-markdowns/women\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003equickly-selling pieces\u003c/a\u003e, don\u0026#39;t worry: We’re here to help. Ahead, we\u0026#39;ve compiled the best Nordstrom deals across women’s fashion — from Refinery29 reader-favorite brands like \u003ca href=\"https://www.refinery29.com/en-us/best-skims-bras-bralettes\"\u003eSkims\u003c/a\u003e, \u003ca href=\"https://www.refinery29.com/en-us/free-people-new-arrivals\"\u003eFree People\u003c/a\u003e, \u003ca href=\"https://www.refinery29.com/en-us/selena-gomez-jw-pei-gabbi-bag-golden-globes\"\u003eJW Pei\u003c/a\u003e, Dolce Vita, and more — that we think are worth adding to your cart ASAP. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eBe sure to check back here for new discounted fashion finds before the sale ends on \u003cstrong\u003eOctober 28\u003c/strong\u003e.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e\u003csection\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e1 of 22\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e25% off Good American Good Skate Ripped Hem Wide Leg Jeans \u003c/h2\u003e\u003cp\u003e\u003cem\u003eShop \u003cstrong\u003e\u003ca href=\"https://www.nordstrom.com/s/good-skate-ripped-hem-wide-leg-jeans-regular-plus/7741512\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Nordstrom (opens in a new tab)\"\u003eNordstrom\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e2 of 22\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e60% off Dolce Vita Annika Pointed Toe Boot \u003c/h2\u003e\u003cp\u003e\u003cem\u003eShop \u003cstrong\u003e\u003ca href=\"https://www.nordstrom.com/s/dolce-vita-annika-pointed-toe-boot-women-regular-wide-calf/7771691 \" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Nordstrom (opens in a new tab)\"\u003eNordstrom\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e3 of 22\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e25% off Avec Les Filles Cutaway Tailored Maxi Coat \u003c/h2\u003e\u003cp\u003e\u003cem\u003eShop \u003cstrong\u003e\u003ca href=\"https://www.nordstrom.com/s/cutaway-tailored-maxi-coat/7950907?color=carmine\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Nordstrom (opens in a new tab)\"\u003eNordstrom\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e4 of 22\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e30% off Sam Edelman Michaela Rhinestone Mary Jane Flat \u003c/h2\u003e\u003cp\u003e\u003cem\u003eShop \u003cstrong\u003e\u003ca href=\"https://www.nordstrom.com/s/sam-edelman-michaela-rhinestone-mary-jane-flat-women/7550858\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Nordstrom (opens in a new tab)\"\u003eNordstrom\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e5 of 22\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e25% off True \u0026amp; Co True Body Boost Longline Bralette\u003c/h2\u003e\u003cp\u003e\u003cem\u003eShop \u003cstrong\u003e\u003ca href=\"https://www.nordstrom.com/s/true-body-boost-longline-bralette/7490216\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Nordstrom (opens in a new tab)\"\u003eNordstrom\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e6 of 22\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e40% off Converse Chuck Taylor All Star 70 Metallic High Top Sneaker \u003c/h2\u003e\u003cp\u003e\u003cem\u003eShop \u003cstrong\u003e\u003ca href=\"https://www.nordstrom.com/s/chuck-taylor-all-star-70-metallic-high-top-sneaker-women/7780817\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Nordstrom (opens in a new tab)\"\u003eNordstrom\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e7 of 22\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e50% off Skims New Vintage Long Sleeve T-Shirt \u003c/h2\u003e\u003cp\u003e\u003cem\u003eShop \u003cstrong\u003e\u003ca href=\"https://www.nordstrom.com/s/new-vintage-long-sleeve-t-shirt/7922543?color=smoke\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Nordstrom (opens in a new tab)\"\u003eNordstrom\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e8 of 22\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e60% off JW Pei Joy Faux Leather Shoulder Bag\u003c/h2\u003e\u003cp\u003e\u003cem\u003eShop \u003cstrong\u003e\u003ca href=\"https://www.nordstrom.com/s/jw-pei-joy-faux-leather-shoulder-bag/7528874?color=grass%20green \" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Nordstrom (opens in a new tab)\"\u003eNordstrom\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e9 of 22\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e40% off Nordstrom Lyocell \u0026amp; Wool Turtleneck \u003c/h2\u003e\u003cp\u003e\u003cem\u003eShop \u003cstrong\u003e\u003ca href=\"https://www.nordstrom.com/s/nordstrom-lyocell-wool-turtleneck/7693535?color=white\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Nordstrom (opens in a new tab)\"\u003eNordstrom\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e10 of 22\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e38% off Marc Fisher LTD Lalita Knee High Boot \u003c/h2\u003e\u003cp\u003e\u003cem\u003eShop \u003cstrong\u003e\u003ca href=\"https://www.nordstrom.com/s/marc-fisher-ltd-lalita-knee-high-boot-women/7904321 \" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Nordstrom (opens in a new tab)\"\u003eNordstrom\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e11 of 22\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e25% off Free People We The Free Palmer Cuffed Baggy Jeans\u003c/h2\u003e\u003cp\u003e\u003cem\u003eShop \u003cstrong\u003e\u003ca href=\"https://www.nordstrom.com/s/we-the-free-palmer-cuffed-baggy-jeans/7577114\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Nordstrom (opens in a new tab)\"\u003eNordstrom\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e12 of 22\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e33% off Nordstrom Madyson Mary Jane Pump \u003c/h2\u003e\u003cp\u003e\u003cem\u003eShop \u003cstrong\u003e\u003ca href=\"https://www.nordstrom.com/s/madyson-mary-jane-pump-women/7816428?color=brown%20herringbone\u0026amp;width=m\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Nordstrom (opens in a new tab)\"\u003eNordstrom\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e13 of 22\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e25% off Luxely Open Stitch Fringe Long Sleeve Asymmetric Sweater Dress \u003c/h2\u003e\u003cp\u003e\u003cem\u003eShop \u003cstrong\u003e\u003ca href=\"https://www.nordstrom.com/s/open-stitch-fringe-long-sleeve-asymmetric-sweater-dress/7907503?color=evening%20blue\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Nordstrom (opens in a new tab)\"\u003eNordstrom\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e14 of 22\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e41% off Franco Sarto Katherine Knee High Boot \u003c/h2\u003e\u003cp\u003e\u003cem\u003eShop \u003cstrong\u003e\u003ca href=\"https://www.nordstrom.com/s/franco-sarto-katherine-knee-high-boot-women/7115358\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Nordstrom (opens in a new tab)\"\u003eNordstrom\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e15 of 22\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e61% off Papinelle Anniversary Stripe Long Sleeve \u0026amp; Short Pajamas\u003c/h2\u003e\u003cp\u003e\u003cem\u003eShop \u003cstrong\u003e\u003ca href=\"https://www.nordstrom.com/s/anniversary-stripe-long-sleeve-short-pajamas/7758606\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Nordstrom (opens in a new tab)\"\u003eNordstrom\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e16 of 22\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e40% off Open Edit Relaxed Fit Blazer \u003c/h2\u003e\u003cp\u003e\u003cem\u003eShop \u003cstrong\u003e\u003ca href=\"https://www.nordstrom.com/s/relaxed-fit-blazer/7681564?color=grey%20chia\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Nordstrom (opens in a new tab)\"\u003eNordstrom\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e17 of 22\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e40% off Kurt Geiger London Kensington Crossbody Bag \u003c/h2\u003e\u003cp\u003e\u003cem\u003eShop \u003cstrong\u003e\u003ca href=\"https://www.nordstrom.com/s/kensington-crossbody-bag/7552617 \" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Nordstrom (opens in a new tab)\"\u003eNordstrom\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e19 of 22\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e30% off Vince Iliana Slingback Pointed Toe Flat \u003c/h2\u003e\u003cp\u003e\u003cem\u003eShop \u003cstrong\u003e\u003ca href=\"https://www.nordstrom.com/s/iliana-slingback-pointed-toe-flat-women/7744876?color=silver\u0026amp;width=m\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Nordstrom (opens in a new tab)\"\u003eNordstrom\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e20 of 22\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e40% off DKNY Transfer Stitch Sweater\u003c/h2\u003e\u003cp\u003e\u003cem\u003eShop \u003cstrong\u003e\u003ca href=\"https://www.nordstrom.com/s/transfer-stitch-sweater/7887139?color=dark%20olive/%20black\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\"\u003eNordstrom\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e21 of 22\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e60% off Steve Madden Gleeson Moto Boot \u003c/h2\u003e\u003cp\u003e\u003cem\u003eShop \u003cstrong\u003e\u003ca href=\"https://www.nordstrom.com/s/gleeson-moto-boot-women/7856653\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Nordstrom (opens in a new tab)\"\u003eNordstrom\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e22 of 22\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e60% off House of CB Antonella Lace-Up Faux Leather Corset\u003c/h2\u003e\u003cp\u003e\u003cem\u003eShop \u003cstrong\u003e\u003ca href=\"https://www.nordstrom.com/s/antonella-lace-up-faux-leather-corset/7221201 \" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Nordstrom (opens in a new tab)\"\u003eNordstrom\u003c/a\u003e\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003cdiv id=\"below-the-fold-modules\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-17T19:01:28Z",
  "modifiedTime": null
}
