{
  "id": "8bab1c0a-9e2f-4a46-b774-9c3b0cbba66d",
  "title": "Anthropologie’s New Wedding Dress Collection Has A Style For Every Type Of Bride",
  "link": "https://www.refinery29.com/en-us/anthropologie-weddings-bridal-dresses?utm_source=feed\u0026utm_medium=rss",
  "description": ".disclaimer{width:90%;margin-bottom:1rem}.disclaimer__lines{width:100%;margin:0 auto;border-bottom:1px solid #999;padding:0;max-width:150px}.disclaimer__copy{width:100%;max-width:355px;font-family:Brown Regular,sans-serif;font-size:.9rem;font-weight:300;line-height:1.3em;color:#333;padding:0 0 .4rem;margin:1rem auto;text-align:center} All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. From fall dresses to winter wedding guest looks, Anthropologie is a go-to destination for occasion-worthy dressing. And now, for all the 2025 brides out there, the beloved retailer will truly be your one-stop shop because Anthropologie Weddings has just dropped its new collection of over 30 bridal dresses.“We’re thrilled to unveil our new bridal drop where each gown embodies the essence of individuality and romance,” chief merchandising officer of apparel at Anthropologie, Holly Thrasher, told Refinery29. “Our latest assortment offers three unique design sensibilities that highlight new bridal trends and exclusive styles.”The three bridal silhouettes and aesthetics are divided by classic ball gowns, modern styles, and trending drop-waist dresses — perfect to serve every bride and every aisle. The exclusive designs come from brands like Ouma, Mirror Palais, Sebastian Luke, and Costarellos, all ranging between $1,150 and $4,370. Read on to start perusing the new Anthropologie Weddings collection and to get style inspiration for your big day.  DashDividers_1_500x100 Anthropologie Wedding Dresses: Classic Ballgowns “Our classic ballgowns celebrate the bride’s desire for a timeless moment while incorporating modern touches that make each gown uniquely her own,” Thrasher said. The collection includes over 10 voluminous styles that will help you make the grandest of entrances. From exaggerated lace and tulle skirts to ruffled taffeta skirts, these dresses offer a mix of classic and contemporary design elements for the more traditional brides. Bonus: Some styles come with matching gloves or scarves to complete your wedding look. DashDividers_1_500x100 Anthropologie Wedding Dresses: Modern \u0026 Romantic Gowns For the bride who doesn’t want to feel weighed down by too much fabric or volume, Anthropologie Weddings offers a selection of ethereal and vintage-inspired dresses. “Our modern and romantic gowns capture the spirit of today’s bride. Each design balances contemporary style with enchanting details,” Thrasher said. See: modern takes on corsetry, delicate embellishments, and dramatic overlays. DashDividers_1_500x100 Anthropologie Wedding Dresses: Drop-Waist Gowns If you’re a trendsetter looking for a timeless design that’ll stand out from the crowd, consider a drop-waist silhouette. “Drop-waist silhouette offers a fresh, flattering take on bridal fashion, allowing brides to embrace a beloved trend while exuding elegance,” Thrasher says. You can find the trending silhouette across the collection’s ball gowns, A-line dresses, and high-low styles. Shop full Anthropologie Weddings collection Like what you see? How about some more R29 goodness, right here?The 7 Biggest Bridal Fashion Trends For 202525 Winter Wedding Guest Dresses, Jumpsuits \u0026 PantsGap x Cult Gaia Is Ringing In Holiday Dressing",
  "author": "Victoria Montalti",
  "published": "Mon, 28 Oct 2024 14:48:22 +0000",
  "source": "https://www.refinery29.com/fashion/rss.xml",
  "categories": null,
  "byline": "Victoria Montalti",
  "length": 2693,
  "excerpt": "2025 brides will love Anthropologie Weddings’ new bridal dress collection, which features classic, modern, and trendy styles.",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. Photo: Courtesy of Anthropologie.From fall dresses to winter wedding guest looks, Anthropologie is a go-to destination for occasion-worthy dressing. And now, for all the 2025 brides out there, the beloved retailer will truly be your one-stop shop because Anthropologie Weddings has just dropped its new collection of over 30 bridal dresses.“We’re thrilled to unveil our new bridal drop where each gown embodies the essence of individuality and romance,” chief merchandising officer of apparel at Anthropologie, Holly Thrasher, told Refinery29. “Our latest assortment offers three unique design sensibilities that highlight new bridal trends and exclusive styles.”The three bridal silhouettes and aesthetics are divided by classic ball gowns, modern styles, and trending drop-waist dresses — perfect to serve every bride and every aisle. The exclusive designs come from brands like Ouma, Mirror Palais, Sebastian Luke, and Costarellos, all ranging between $1,150 and $4,370. Read on to start perusing the new Anthropologie Weddings collection and to get style inspiration for your big day. AdvertisementADVERTISEMENTAnthropologie Wedding Dresses: Classic Ballgowns“Our classic ballgowns celebrate the bride’s desire for a timeless moment while incorporating modern touches that make each gown uniquely her own,” Thrasher said. The collection includes over 10 voluminous styles that will help you make the grandest of entrances. From exaggerated lace and tulle skirts to ruffled taffeta skirts, these dresses offer a mix of classic and contemporary design elements for the more traditional brides. Bonus: Some styles come with matching gloves or scarves to complete your wedding look.Anthropologie Wedding Dresses: Modern \u0026 Romantic GownsFor the bride who doesn’t want to feel weighed down by too much fabric or volume, Anthropologie Weddings offers a selection of ethereal and vintage-inspired dresses. “Our modern and romantic gowns capture the spirit of today’s bride. Each design balances contemporary style with enchanting details,” Thrasher said. See: modern takes on corsetry, delicate embellishments, and dramatic overlays.Anthropologie Wedding Dresses: Drop-Waist GownsIf you’re a trendsetter looking for a timeless design that’ll stand out from the crowd, consider a drop-waist silhouette. “Drop-waist silhouette offers a fresh, flattering take on bridal fashion, allowing brides to embrace a beloved trend while exuding elegance,” Thrasher says. You can find the trending silhouette across the collection’s ball gowns, A-line dresses, and high-low styles.",
  "image": "https://www.refinery29.com/images/11800715.jpg?crop=40%3A21",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"editorial-content\"\u003e\u003cdiv\u003e\n\n\u003cp\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.\u003c/p\u003e\n\n\u003c/div\u003e\u003cdiv\u003e\u003cp\u003ePhoto: Courtesy of Anthropologie.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eFrom \u003ca href=\"https://www.refinery29.com/en-us/fall-dresses-for-women\"\u003efall dresses\u003c/a\u003e to \u003ca href=\"https://www.refinery29.com/en-us/best-winter-wedding-guest-dresses-outfits\"\u003ewinter wedding guest looks\u003c/a\u003e, Anthropologie is a go-to destination for occasion-worthy dressing. And now, for all the \u003ca href=\"https://www.refinery29.com/en-us/bridal-fashion-trends-2025\"\u003e2025 brides\u003c/a\u003e out there, the beloved retailer will truly be your one-stop shop because Anthropologie Weddings has just dropped its \u003ca href=\"https://www.anthropologie.com/bhldn-new-wedding-dresses\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003enew collection of over 30 bridal dresses\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e“We’re thrilled to unveil our new bridal drop where each gown embodies the essence of individuality and romance,” chief merchandising officer of apparel at Anthropologie, Holly Thrasher, told Refinery29. “Our latest assortment offers three unique design sensibilities that highlight new bridal trends and exclusive styles.”\u003c/p\u003e\u003cp\u003eThe three bridal silhouettes and aesthetics are divided by classic ball gowns, modern styles, and \u003ca href=\"https://www.refinery29.com/en-us/best-drop-waist-dresses\"\u003etrending drop-waist dresses\u003c/a\u003e — perfect to serve every bride and every aisle. The exclusive designs come from brands like Ouma, Mirror Palais, Sebastian Luke, and Costarellos, all ranging between $1,150 and $4,370. Read on to start perusing the new Anthropologie Weddings collection and to get style inspiration for your big day. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eAnthropologie Wedding Dresses: Classic Ballgowns\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“Our classic ballgowns celebrate the bride’s desire for a timeless moment while incorporating modern touches that make each gown uniquely her own,” Thrasher said. The collection includes over 10 voluminous styles that will help you make the grandest of entrances. From exaggerated lace and tulle skirts to ruffled taffeta skirts, these dresses offer a mix of classic and contemporary design elements for the more traditional brides. Bonus: Some styles come with matching gloves or scarves to complete your wedding look.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eAnthropologie Wedding Dresses: Modern \u0026amp; Romantic Gowns\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eFor the bride who doesn’t want to feel weighed down by too much fabric or volume, Anthropologie Weddings offers a selection of ethereal and vintage-inspired dresses. “Our modern and romantic gowns capture the spirit of today’s bride. Each design balances contemporary style with enchanting details,” Thrasher said. See: modern takes on corsetry, delicate embellishments, and dramatic overlays.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eAnthropologie Wedding Dresses: Drop-Waist Gowns\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIf you’re a trendsetter looking for a timeless design that’ll stand out from the crowd, consider a drop-waist silhouette. “Drop-waist silhouette offers a fresh, flattering take on bridal fashion, allowing brides to embrace a beloved trend while exuding elegance,” Thrasher says. You can find the trending silhouette across the collection’s ball gowns, A-line dresses, and high-low styles.\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-28T14:48:22Z",
  "modifiedTime": null
}
