{
  "id": "a876a72e-452b-4e93-9af8-756eaa3e6a18",
  "title": "The Best R29-Approved Free People Sale Styles For Under $100",
  "link": "https://www.refinery29.com/en-us/best-free-people-sale-deals?utm_source=feed\u0026utm_medium=rss",
  "description": "While it's legit fall in some places, others are already flirting with winter. How?! Either way, we’re leaning into all of the sweater-weather activities this time of year has to offer. With even cooler temps on the horizon, it’s the perfect excuse to round out our wardrobe with fluffy cardigans, dreamy knit dresses, and bold layers from slouchy jackets to scarf coats. And when it comes to layering essentials, no one does that better than Free People. Luckily, some of the brand's most versatile pieces are on sale right now. That's why we combed through the Free People sale section to uncover the marked-down gems under $100. From trendy monochromatic sets to cool-weather basics, there’s plenty of versatile goodness to shop — and none of it is full price. Sit back, scroll on, and enjoy all the time we saved you with our edit of the best deals from Free People's sale section.All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. For more can’t-miss shopping stories delivered straight to your inbox, sign up for our Most Wanted newsletter. WINTER INTRO :::New year, new clothes. It's time to get going. Donate that pile of attire you haven't touched since 2022, and refresh your winter wardrobe with some Free People goodies. Since the cold weather really just begun, you're likely snuggled up in your favorite flannel pajamas. You might even be thinking: How can people even consider putting together an outfit when it's freezing? The answer is simple: layers. And no one does that better than Free People. Fortunately, some of the brand's most layerable pieces are on sale right now. It's the perfect time to stock up on styles you can leave in your closet year-round. That's why we went through Free People's sale section to unearth the discounted gems that are under $100. From cozy winter accessories to cold weather dresses, there’s a host of versatile goodness ahead — and none of it is full price. So sit back, click on, and enjoy all the time we saved you with our roundup of the best deals from Free People'ssale section.Summer INTRO :::The sun is out in full force, we’ve traded in our knit dresses for dreamy skirts, and picnic time is here. And with a new season comes the perfect opportunity to refresh our summer wardrobe. Your summer styling answer is simple: breathable clothing. And no one does that better than Free People. Fortunately, some of the brand's most airy pieces are on sale right now.That's why we went through Free People's sale section to unearth the discounted gems that are under $100. From the trendiest monochromatic looks to flowy dresses, there’s a host of versatile goodness ahead — and none of it is full price. So sit back, click on, and enjoy all the time we saved you with our roundup of the best deals from Free People'ssale section.Spring INTRO :::Tulips are blooming, puffer coats are being shed for denim jackets, and the Met Gala is right around the corner. Spring is definitely here. And with a new season comes the perfect opportunity to refresh our spring wardrobes with some new Free People goodies. As we kick off our favorite flannels, your spring styling answer is simple: layers. And no one does that better than Free People. Fortunately, some of the brand's most layerable pieces are on sale right now.That's why we went through Free People's sale section to unearth the discounted gems that are under $100. From the trendiest monochromatic looks to flowy dresses, there’s a host of versatile goodness ahead — and none of it is full price. So sit back, click on, and enjoy all the time we saved you with our roundup of the best deals from Free People's sale section.Fall IntroFall is in full swing and we’re leaning into all of the sweater weather activities this time of year has to offer. And with even cooler temps on the horizon, we’ll take this as an opportunity to keep filling out our wardrobe with things like fluffy cardigans and dreamy knit dresses. Your fall styling answer is simple: cozy layerable clothing. And no one does that better than Free People. Fortunately, some of the brand's most versatile items are on sale right now.That's why we went through Free People's sale section to unearth the discounted gems that are under $100. From the trendiest monochromatic looks to cool-weather basics, there’s a host of versatile goodness ahead — and none of it is full price. So sit back, click on, and enjoy all the time we saved you with our roundup of the best deals from Free People's sale section.Free People Tops On Sale Basics, but make it elevated. Think long sleeves, sweaters, and outerwear to make your heart skip a beat.We The Free Band Of Horses Embroidered Shirt, $, available at Free People[BLANKYNYC] On The Move Trench Coat, $, available at Free PeopleWe The Free Rosario Henley, $, available at Free PeopleWe The Free Hibiscus Foldover Long-Sleeve Top, $, available at Free PeopleVero Moda Lea Raglan Sweater, $, available at Free PeopleFree People River Knit Top, $, available at Free PeopleWe The Free Sunday Shirt, $, available at Free PeopleFree People Accessories On Sale Jewelry? Bags? Shoes? Score the best deals on Free People’s latest accessories.FP Collection Piper Puff Crossbody, $, available at Free PeopleFree People Phoenix Star Dangles, $, available at Free PeopleJeffrey Campbell Bae Low-Pro Mules, $, available at Free PeopleFree People Simply Textured Soft Headband, $, available at Free PeopleFP Movement Upwind Weekender, $, available at Free PeopleFree People Bottoms On Sale Slide into a pair of comfy pants (or a skirt) that you can style for workdays and weekends.Free People Alitza Micro Skort, $, available at Free PeopleFree People River Stone Pants, $, available at Free PeopleIntimately Gimme More Jogger, $, available at Free PeopleWe The Free Hayden Pull-On Pants, $, available at Free PeopleFP Movement Activewear On Sale It's always the right time to upgrade your athleisure game — especially when it's FP Movement.FP Movement Scrunchy Glossy Printed Pippa Packable Puffer Jacket, $, available at Free PeopleFP Movement Right On Run Printed Long Sleeve Layer, $, available at Free PeopleFP Movement Rosette Onesie, $, available at Free PeopleFP Movement Never Better Structured Zip-Up, $, available at Free PeopleFP Movement Straight Up Pants, $, available at Free PeopleFree People Dresses On Sale Feast your eyes on these marked-down Free People dresses, from playful patterns to layerable sets.Free People Montecito Set, $, available at Free PeopleFree People Tulie Plaid Midi Dress, $, available at Free PeopleFree People Porto Set, $, available at Free PeopleFree People City Slicker Aviator Sunglasses, $, available at Free PeopleFree People The New Classic Belly Chain, $, available at Free PeopleSebago Jackman Boater Shoes, $, available at Free PeopleFree People Accessories On Sale Jewelry? Bags? Shoes? Get the best deals on the latest Free People accessories.Free People Camryn Lace Bow Set Of 4, $, available at Free PeopleFree People Bottoms On Sale Glide into a pair of comfy pants (or a skirt) that you can style for workdays and weekends.Free People Gaia Skirt, $, available at Free PeopleFree People Dresses On Sale Who knew a sales section could be this great? Feast your eyes on these discounted Free People frocks, from silky silhouettes to sweater dresses.Free People Rowley Mini Dress, $, available at Free PeopleFree People Tops On Sale Basics but make it elevated. Find all the sweaters, long sleeves, and button-ups to make your heart content.Free People Fall Into Place Smocked Buttondown, $, available at Free PeopleFP Movement Activewear On Sale It's never a bad time to get some new athleisure, especially when it's FP Movement.FP Movement Mesmerize Me Solid Pants, $, available at FP MovementFree People Tops On Sale Basics but make it elevated. Find all the sweaters, long sleeves, and bodysuits to make your heart content.Intimately Meg Seamless Bodysuit, $, available at Free PeopleFree People Accessories On Sale Jewelry? Bags? Sandals? Get the best deals on the latest Free People accessories.Free People Nautical Choker, $, available at Free PeopleFree People Dresses On Sale Who knew a sales section could be this great? Feast your eyes on these discounted Free People frocks, from silky silhouettes to sweater dresses.free-est Jane Shift Mini, $, available at Free PeopleFree People Bottoms On Sale Glide into a pair of comfy pants (or a skirt) that you can style for workdays and weekends.Free People Nora Mini Trouser Shorts, $, available at Free PeopleFree People Accessories On Sale Sneakers? Bags? Sandals? Get the best deals on the latest Free People accessories.Dr. Martens Carlson Slingbacks, $, available at Free PeopleFree People Tops On Sale Basics but make it elevated. Find all the sweaters, long-sleeves, and bodysuits to make your heart content.Free People Wrapped In Love Tunic, $, available at Free PeopleFree People Dresses On Sale Who knew a sales section could be this great? Feast your eyes on these discounted Free People frocks, from silky silhouettes to sun dresses.Tach Anturio Dress, $, available at Free PeopleFree People Tops On Sale Basics but make it elevated. Find all the cardigans (for cool nights), sheer tops, and bodysuits to make your heart content.Nigel Preston Valentine Vest, $, available at Free PeopleFree People Dresses On Sale Who knew a sales section could be this great? Feast your eyes on these discounted Free People frocks, from silky silhouettes to sun dresses.free-est Clarissa Cotton-Linen Sweater Mini, $, available at Free PeopleFree People Outerwear On Sale It's a known fact that the R29 team has a penchant for Free People's puffers and fleeces for winter. However, spring weather is here and there's other outerwear calling our names — all at a hefty discount.Free People Fast Lane Denim Moto Jacket, $, available at Free PeopleFree People Tops On Sale Basics and knits but make it elevated. Find all the sweaters, sheer tops, and bodysuits to make your heart content.We The Free El Sol Layering Top, $, available at Free PeopleFree People Bottoms On Sale Glide into a pair of comfy pants (or a skirt) that you can style for workdays and weekends.Free People Roma Vegan Suede Shorts, $, available at Free PeopleFree People Dresses On Sale Who knew a sales section could be this great? Feast your eyes on these discounted Free People frocks, from silky silhouettes to cute corduroy dresses.free-est Amiga Mini, $, available at Free PeopleFree People Shoes On Sale Boots? Sneakers? Get the best deals on the latest Free People shoes. Vagabond Cosmo 2.0 Loafers, $, available at Free PeopleFree People Bottoms On Sale Glide into a pair of comfy pants (or a skirt) that you can style for workdays and weekends.FP Movement Have It All Pants, $, available at FP MovementFree People Outerwear On Sale It's a known fact that the R29 team has a penchant for Free People's puffers and fleeces. However, there's other outerwear calling our names — all at a hefty discount. FP Movement Care FP Outta Left Field Jacket, $, available at Free PeopleFree People Dresses On Sale Who knew a sales section could be this great? Feast your eyes on these discounted Free People frocks, from sheer sequin-adorned silhouettes to glossy slip dresses and leather minis. Free People Amber Vegan Mini, $, available at Free PeopleFree People Basics On Sale Basics, but make it elevated. Find all the shimmering velvet socks, sheer tops, and a plethora of bodysuits for layering.Free People Vibrant Velvet Socks, $, available at Free PeopleFree People Dresses On Sale Who knew a sales section could be this great? Feast your eyes on these discounted Free People frocks, from sultry silky silhouettes to corduroy cutie dresses. Free People Sundrenched Silky Maxi Dress, $, available at Free PeopleFree People Outerwear On Sale It's a known fact that the R29 team has a penchant for Free People's puffers and fleeces. However, there's other outerwear calling our names — all at a hefty discount.FP Movement Warm Down Pullover, $, available at FP MovementFree People Bottoms On Sale Glide into a pair of comfy wide-leg jeans, trousers, and pants that you can style for workdays and weekends. We The Free Wallflower Wide-Leg Jeans, $, available at Free PeopleFree People Skirts On Sale If you're tired of pants, give them a break and opt for airy mini and maxi skirts from Free People. All the under-$100 styles are hidden in the brand's sale section. We The Free Come As You Are Cord Maxi Skirt, $, available at Free PeopleFree People Shoes On Sale Boots? Sneakers? Get the best deals on the latest Free People shoes with select styles that are almost 50% off. FP Collection Jones Lug Sole Lace Up Boots, $, available at Free PeopleFree People Winter Accessories On Sale Stay cozy all winter long with colorful striped beanies, faux-fur hats, and super-soft scarves. The cuddly accessories are the cherry on top of a cold-weather outfit.Free People Airy Rib Stripe Beanie, $, available at Free PeopleFree People Handbags On Sale Add a new bag to your rotation with a trendy messenger, clutch, or convertible backpack from Free People. There are deals on all the best handbag styles. Free People Viva La Vegan Clutch, $, available at Free PeopleLike what you see? How about some more R29 goodness, right here?FP Movement’s Puffer Vest Is A Spring Must HaveOur Favorite Looks From Free People's Spring DropWhy This Free People Dress Is A Compliment-Magnet",
  "author": "Mercedes Viera",
  "published": "Fri, 22 Nov 2024 19:05:29 +0000",
  "source": "https://www.refinery29.com/fashion/rss.xml",
  "categories": null,
  "byline": "Mercedes Viera",
  "length": 1954,
  "excerpt": "Don't waste time combing through pages and pages of your favorite boho-style website for the must-have styles. We went through all of Free People's sale section to unearth its hidden style gems.",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "Photo: Courtesy of Free People.While it's legit fall in some places, others are already flirting with winter. How?! Either way, we’re leaning into all of the sweater-weather activities this time of year has to offer. With even cooler temps on the horizon, it’s the perfect excuse to round out our wardrobe with fluffy cardigans, dreamy knit dresses, and bold layers from slouchy jackets to scarf coats. And when it comes to layering essentials, no one does that better than Free People. Luckily, some of the brand's most versatile pieces are on sale right now. That's why we combed through the Free People sale section to uncover the marked-down gems under $100. From trendy monochromatic sets to cool-weather basics, there’s plenty of versatile goodness to shop — and none of it is full price. Sit back, scroll on, and enjoy all the time we saved you with our edit of the best deals from Free People's sale section.AdvertisementADVERTISEMENTAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.1 of 24Free People Tops On Sale Basics, but make it elevated. Think long sleeves, sweaters, and outerwear to make your heart skip a beat.AdvertisementADVERTISEMENTAdvertisementADVERTISEMENT8 of 24Free People Accessories On Sale Jewelry? Bags? Shoes? Score the best deals on Free People’s latest accessories.AdvertisementADVERTISEMENT13 of 24Free People Bottoms On Sale Slide into a pair of comfy pants (or a skirt) that you can style for workdays and weekends.17 of 24FP Movement Activewear On Sale It's always the right time to upgrade your athleisure game — especially when it's FP Movement.AdvertisementADVERTISEMENT22 of 24Free People Dresses On Sale Feast your eyes on these marked-down Free People dresses, from playful patterns to layerable sets.AdvertisementADVERTISEMENTAdvertisementADVERTISEMENTAdvertisementADVERTISEMENTAdvertisementADVERTISEMENTAdvertisementADVERTISEMENT",
  "image": "https://www.refinery29.com/images/11816581.jpg?crop=40%3A21",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"r29-container\"\u003e\u003cdiv\u003e\u003carticle\u003e\u003cdiv id=\"article-main-content\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cfigure\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cp\u003ePhoto: Courtesy of Free People.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003csection\u003e\u003cdiv\u003e\u003cp\u003eWhile it\u0026#39;s legit fall in some places, others are already flirting with winter. How?! Either way, we’re leaning into all of the sweater-weather activities this time of year has to offer. With even cooler temps on the horizon, it’s the perfect excuse to round out our wardrobe with fluffy cardigans, dreamy knit dresses, and bold layers from \u003ca href=\"https://www.refinery29.com/en-us/slouchy-jackets-trend\"\u003eslouchy jackets\u003c/a\u003e to \u003ca href=\"https://www.refinery29.com/en-us/2023/01/11247479/scarf-jackets-coats-trend\"\u003escarf coats\u003c/a\u003e. And when it comes to layering essentials, no one does that better than\u003ca href=\"https://www.freepeople.com/sale-all/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003e Free People\u003c/a\u003e. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eLuckily, some of the brand\u0026#39;s most versatile pieces are on sale right now. That\u0026#39;s why we combed through\u003ca href=\"https://www.freepeople.com/sale-all/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003e the Free People sale section\u003c/a\u003e to uncover the marked-down gems under $100. From \u003ca href=\"https://www.refinery29.com/en-us/free-people-spring-clothing-trends\"\u003etrendy monochromatic sets \u003c/a\u003eto cool-weather basics, there’s plenty of versatile goodness to shop — and none of it is full price. Sit back, scroll on, and enjoy all the time we saved you with our edit of the best deals from Free People\u0026#39;s sale section.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e\u003csection\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e1 of 24\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003eFree People Tops On Sale \u003cbr/\u003e\u003c/h2\u003e \u003cp\u003e\u003ca href=\"https://www.refinery29.com/en-us/skims-cotton-jersey-tshirt-review\"\u003eBasics\u003c/a\u003e, but make it elevated. Think long sleeves, sweaters, and outerwear to make your heart skip a beat.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e8 of 24\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003eFree People Accessories On Sale \u003c/h2\u003e\u003cp\u003e\u003ca href=\"https://www.refinery29.com/en-us/best-tarnish-free-gold-jewelry\"\u003eJewelry\u003c/a\u003e? Bags? Shoes? Score the best deals on Free People’s latest accessories.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e13 of 24\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003eFree People Bottoms On Sale \u003c/h2\u003e\u003cp\u003eSlide into a pair of \u003ca href=\"https://www.refinery29.com/en-us/best-palazzo-sweatpants-styles\"\u003ecomfy pants\u003c/a\u003e (or a skirt) that you can style for workdays and weekends.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e17 of 24\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003eFP Movement Activewear On Sale \u003cbr/\u003e\u003c/h2\u003e\u003cp\u003eIt\u0026#39;s always the right time to upgrade your athleisure game — especially when it\u0026#39;s\u003ca href=\"https://www.refinery29.com/en-us/free-people-movement-on-cloud-sneaker-collaboration\"\u003e FP Movement\u003c/a\u003e.\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e22 of 24\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003eFree People Dresses On Sale  \u003c/h2\u003e\u003cp\u003eFeast your eyes on these marked-down Free People dresses, from\u003ca href=\"https://www.refinery29.com/en-us/best-slip-dress\"\u003e \u003c/a\u003e\u003ca href=\"https://www.refinery29.com/en-us/best-fall-midi-dresses\"\u003eplayful patterns\u003c/a\u003e to layerable sets.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003cdiv id=\"below-the-fold-modules\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-22T19:05:29Z",
  "modifiedTime": null
}
