{
  "id": "a984472d-8839-464e-8b14-96f8812588fd",
  "title": "Calvin Klein’s first female creative director finds succour in a fictional New York",
  "link": "https://www.theguardian.com/fashion/2025/feb/07/calvin-kleins-first-female-creative-director-finds-succour-in-a-fictional-new-york",
  "description": "Veronica Leoni’s first collection mixed hat-tips to the CK archive with the Italian’s own ‘dreams of America’Calvin Klein’s first female creative director, Veronica Leoni, presented her debut collection on Friday, watched on by Kate Moss – the brand’s most famous face during the 1990s, when its billboard ads ruled the zeitgeist – Calvin Klein himself, 82, and Christy Turlington.The brand had a lot riding on Friday’s show, its first catwalk presentation for six and a half years, and the highlight of a New York fashion week schedule that has been light on big names as American fashion struggles to compete with European brands owned by the French conglomerates LVMH and Kering. Continue reading...",
  "author": "Hannah Marriott",
  "published": "Fri, 07 Feb 2025 21:26:22 GMT",
  "source": "https://www.theguardian.com/fashion/rss",
  "categories": [
    "New York fashion week",
    "Fashion",
    "Fashion weeks",
    "Life and style"
  ],
  "byline": "Hannah Marriott",
  "length": 3629,
  "excerpt": "Veronica Leoni’s first collection mixed hat-tips to the CK archive with the Italian’s own ‘dreams of America’",
  "siteName": "the Guardian",
  "favicon": "https://assets.guim.co.uk/static/frontend/icons/homescreen/apple-touch-icon-512.png",
  "text": "Calvin Klein’s first female creative director, Veronica Leoni, presented her debut collection on Friday, watched on by Kate Moss – the brand’s most famous face during the 1990s, when its billboard ads ruled the zeitgeist – Calvin Klein himself, 82, and Christy Turlington.The brand had a lot riding on Friday’s show, its first catwalk presentation for six and a half years, and the highlight of a New York fashion week schedule that has been light on big names as American fashion struggles to compete with European brands owned by the French conglomerates LVMH and Kering.Speaking backstage after the show, Leoni said her biggest challenge was “to be inspired by the archive, without getting into nostalgia”.That was expressed through a commitment to minimalism, seen in the opening look of a black mock-turtle knee-length dress and a preponderance of perfectly executed tailoring on the black-white-greige spectrum.There were also more playful elements, including trompe-l’oeil modern monochrome ballgowns destined for awards season, pops of colour (a rose-pink, form-fitting, off-the-shoulder dress; a flowing tomato-red gown) and tiny animal-print clutch bags inspired by the silhouette of the CK One bottle. Leoni, 41, recently described herself as being of the “CK One generation”.Some of the standout looks featured a slim silhouette that felt fresh – black trousers and shrunken jumpers over shirts that recalled Gwyneth Paltrow’s officewear in Sliding Doors. The moodboard for the collection included photographs of David Byrne, whose influence was felt in oversized shoulders, and Paltrow and Brad Pitt as a couple in the 90s.New York fashion week, which began on Thursday, has the unenviable task of bringing cheer and glamour to a fretful city reeling from the chaos of Donald Trump’s first weeks as president.The brand has felt the impact directly. This week its parent company, PVH – which also owns Tommy Hilfiger – was blacklisted by China in a retaliatory action after Trump imposed a 10% tariff. The results of this action are unclear, but they could include fines and shutdowns. About 18% of PVH’s suppliers and factories, and 6% of its sales, are in the region.Little known outside fashion, Leoni – who is Italian and lives in Rome with her wife – has never led a major house, but has an impressive CV working among fashion’s most influential minimalists, including Jil Sander, The Row, and CELINE, under Phoebe Philo. She launched her own brand, Quira, in 2021.Like many who grew up outside the US, she said she had a fictional view of the country, and of New York specifically, gleaned from movies and media before she ever visited.skip past newsletter promotionafter newsletter promotionThe collection expressed her “personal dream of America” and explored characters from the movies that came to life for her on the runway. “You’ve got the sexy worker, you’ve got the taxi driver, you’ve got Jessica Rabbit, you’ve got Clark Kent. And I feel that these kind of moments help to shape a variety of personalities.”Klein, who founded his company in 1968 and who has kept a relatively low profile since he retired from it in 2004, told her after that he was happy with her collection and that “he found a new coat to buy”.The brand’s most recent show, before its catwalk hiatus, took place in 2018, under the Belgian designer Raf Simons, now co-designing at Prada. At the time, Simons found inspiration in the horrors of the first Trump administration, presenting a dark view of Americana. This time, its rather more upbeat interpretation of American style was based on a seductive and much longed-for fiction.",
  "image": "https://i.guim.co.uk/img/media/3151fa1d8c37666057cda203779e4563c2e6ce28/0_104_5000_3002/master/5000.jpg?width=1200\u0026height=630\u0026quality=85\u0026auto=format\u0026fit=crop\u0026overlay-align=bottom%2Cleft\u0026overlay-width=100p\u0026overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc\u0026enable=upscale\u0026s=7e06da6702f45db384f25dabb6ca0a26",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"maincontent\"\u003e\u003cp\u003eCalvin Klein’s first female creative director, Veronica Leoni, presented her debut collection on Friday, watched on by Kate Moss – the brand’s most famous face during the 1990s, when its billboard ads ruled the zeitgeist – Calvin Klein himself, 82, and Christy Turlington.\u003c/p\u003e\u003cp\u003eThe brand had a lot riding on Friday’s show, its first catwalk presentation for six and a half years, and the highlight of a \u003ca href=\"https://www.theguardian.com/fashion/new-york-fashion-week\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\"\u003eNew York fashion week\u003c/a\u003e schedule that has been light on big names as American fashion struggles to compete with European brands owned by the French conglomerates LVMH and Kering.\u003c/p\u003e\u003cp\u003eSpeaking backstage after the show, Leoni said her biggest challenge was “to be inspired by the archive, without getting into nostalgia”.\u003c/p\u003e\u003cp\u003eThat was expressed through a commitment to minimalism, seen in the opening look of a black mock-turtle knee-length dress and a preponderance of perfectly executed tailoring on the black-white-greige spectrum.\u003c/p\u003e\u003cp\u003eThere were also more playful elements, including trompe-l’oeil modern monochrome ballgowns destined for awards season, pops of colour (a rose-pink, form-fitting, off-the-shoulder dress; a flowing tomato-red gown) and tiny animal-print clutch bags inspired by the silhouette of the CK One bottle. Leoni, 41, recently described herself as being of the “CK One generation”.\u003c/p\u003e\u003cp\u003eSome of the standout looks featured a slim silhouette that felt fresh – black trousers and shrunken jumpers over shirts that recalled Gwyneth Paltrow’s officewear in Sliding Doors. The moodboard for the collection included photographs of David Byrne, whose influence was felt in oversized shoulders, and Paltrow and Brad Pitt as a couple in the 90s.\u003c/p\u003e\u003cp\u003eNew York fashion week, which began on Thursday, has the unenviable task of bringing cheer and glamour to a fretful city reeling from \u003ca href=\"https://www.theguardian.com/us-news/2025/jan/29/donald-trump-executive-orders-signed-list\" data-link-name=\"in body link\"\u003ethe chaos of Donald Trump’s first weeks as president\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe brand has felt the impact directly. This week its parent company, PVH – which also owns Tommy Hilfiger – was blacklisted by China in a retaliatory action after \u003ca href=\"https://www.theguardian.com/news/2025/feb/06/bring-me-my-tariffs-how-trumps-china-plan-was-40-years-in-the-making\" data-link-name=\"in body link\"\u003eTrump imposed a 10% tariff\u003c/a\u003e. The results of this action are unclear, but they could include fines and shutdowns. About 18% of PVH’s suppliers and factories, and 6% of its sales, are in the region.\u003c/p\u003e\u003cp\u003eLittle known outside fashion, Leoni – who is Italian and lives in Rome with her wife – has never led a major house, but has an impressive CV working among fashion’s most influential minimalists, including Jil Sander, The Row, and CELINE, under Phoebe Philo.\u003cem\u003e \u003c/em\u003eShe launched her own brand, Quira, in 2021.\u003c/p\u003e\u003cp\u003eLike many who grew up outside the US, she said she had a fictional view of the country, and of New York specifically, gleaned from movies and media before she ever visited.\u003c/p\u003e\u003cfigure data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.NewsletterSignupBlockElement\"\u003e\u003ca data-ignore=\"global-link-styling\" href=\"#EmailSignup-skip-link-10\"\u003eskip past newsletter promotion\u003c/a\u003e\u003cp id=\"EmailSignup-skip-link-10\" tabindex=\"0\" aria-label=\"after newsletter promotion\" role=\"note\"\u003eafter newsletter promotion\u003c/p\u003e\u003c/figure\u003e\u003cp\u003eThe collection expressed her “personal dream of America” and explored characters from the movies that came to life for her on the runway. “You’ve got the sexy worker, you’ve got the taxi driver, you’ve got Jessica Rabbit, you’ve got Clark Kent. And I feel that these kind of moments help to shape a variety of personalities.”\u003c/p\u003e\u003cp\u003eKlein, who founded his company in 1968 and who has kept a relatively low profile since he retired from it in 2004, told her after that he was happy with her collection and that “he found a new coat to buy”.\u003c/p\u003e\u003cp\u003eThe brand’s most recent show, before its catwalk hiatus, \u003ca href=\"https://www.theguardian.com/fashion/2018/sep/12/calvin-klein-is-all-bite-in-new-york-with-jaws-homage\" data-link-name=\"in body link\"\u003etook place in 2018\u003c/a\u003e, under\u003cem\u003e \u003c/em\u003ethe Belgian designer Raf Simons, now co-designing at Prada. At the time, Simons found inspiration in the horrors of the first Trump administration, \u003ca href=\"https://www.theguardian.com/fashion/2018/feb/14/calvin-klein-rewrites-script-to-give-a-vision-of-a-turbulent-america-on-the-catwalk\" data-link-name=\"in body link\"\u003epresenting a dark view of Americana\u003c/a\u003e. This time, its rather more upbeat interpretation of American style was based on a seductive and much longed-for fiction.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-02-07T21:26:22Z",
  "modifiedTime": "2025-02-07T22:46:14Z"
}
