{
  "id": "d4c3228a-fa6f-4ea1-9691-b9538ae574f4",
  "title": "Rosé Loves Feeling Comfortable in Her H-Street Sneakers",
  "link": "https://www.elle.com/fashion/celebrity-style/a64812780/puma-h-street-rose-interview-2025/",
  "description": "Puma celebrated the return of the sleek silhouette with an immersive bazaar in Seoul.",
  "author": "",
  "published": "Mon, 19 May 2025 18:46:00 +0000",
  "source": "https://www.elle.com/rss/fashion.xml/",
  "categories": null,
  "byline": "Alexandra Hildreth",
  "length": 2608,
  "excerpt": "Puma celebrated the revamped silhouette with an immersive bazaar in Seoul.",
  "siteName": "ELLE",
  "favicon": "https://www.elle.com/_assets/design-tokens/elle/static/images/apple-touch-icon.0dd915e.png",
  "text": "Where Rosé goes, Seoul follows. This past weekend, the solo artist and Blackpink member partnered with Puma to celebrate the latest version of the iconic H-Street sneaker ahead of its June release. To celebrate, the brand kicked things off with a pop-up experience. Fans gathered in crowds outside the venue Layer 41, craning their necks to catch a mere glimpse of the K-pop sensation. The fanfare didn’t stop there—other all-star guests included Itsy’s Yeji and Squid Game’s Yuri Jo. Inside, Rosé toured the immersive installations alongside press and select VIP guests, learning about the history of Puma’s sneakers while decked out in her own neon green H-Street pair. “I think of comfort the most when I head out,” the global ambassador tells ELLE. “Being able to look cute and comfy all at the same time, whether at rehearsals or in the studio, [working with Puma] has been really rewarding.” For the singer, ease has always been key to her personal style as a performer. As she explains, “At the very beginning, I didn’t understand what made me feel comfortable and what didn’t. Now just knowing that, and no matter what other people say, as long as I feel comfortable that’s all that matters.”Courtesy of Sangbok BaekWhen asked what drew the brand to Rosé and to Seoul, Gregor Abenstein, head of Puma Select, says, “We very much look to Seoul when we want to see what’s next. When we kicked off the Speedcat [sneaker], Seoul was also the first city where we saw the shoes on the feet of the right people. Our Korean team basically gave us the heads up that low profile might be coming back.” Abenstein also explained that they wanted the immersive experience to feel authentic to the venue’s neighborhood and the city’s style. “We relied heavily on our partners and the communities that they acquired to help lead us to the heart of the city. From the food that’s been chosen, down to the DJs and the nail artists, it has been specifically curated to be part of our cultural community.”As a result, the event tapped vendors including Cold Archive and Inside Tag to curate an installation of interactive art zones. Featuring everything from custom screen-printed T-shirts emblazoned with “___ Sucks” to alien-like nail art, each station complemented the display of archival Puma products. On the main floor, guests were able to walk through the history of the brand, tracing its very first pair of track spikes to the H-Street sneaker’s inception in 2003. The Puma H-Street sneakers, including the event’s signature neon green colorway, as sported by Rosé, will be available for purchase in late June.",
  "image": "https://hips.hearstapps.com/hmg-prod/images/final-s3-1-019a0632-682b41208303e.jpg?crop=1.00xw:0.332xh;0,0.229xh\u0026resize=1200:*",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-journey-body=\"standard-article\"\u003e\u003cp data-journey-content=\"true\" data-node-id=\"0\"\u003eWhere Rosé goes, Seoul follows. This past weekend, the solo artist and Blackpink member partnered with \u003ca href=\"https://www.elle.com/fashion/shopping/a64637165/puma-speedcat-ballet-sneaker-trend-2025/\" target=\"_blank\" data-vars-ga-outbound-link=\"https://www.elle.com/fashion/shopping/a64637165/puma-speedcat-ballet-sneaker-trend-2025/\" data-vars-ga-ux-element=\"Hyperlink\" data-vars-ga-call-to-action=\"Puma\" data-node-id=\"0.1\"\u003ePuma\u003c/a\u003e to celebrate the latest version of the iconic H-Street sneaker ahead of its June release. To celebrate, the brand kicked things off with a pop-up experience. Fans gathered in crowds outside the venue Layer 41, craning their necks to catch a mere glimpse of the K-pop sensation. The fanfare didn’t stop there—other all-star guests included Itsy’s Yeji and \u003cem data-node-id=\"0.3\"\u003eSquid Game’s\u003c/em\u003e Yuri Jo. \u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"1\"\u003eInside, Rosé toured the immersive installations alongside press and select VIP guests, learning about the history of Puma’s sneakers while decked out in her own neon green H-Street pair. “I think of comfort the most when I head out,” the global ambassador tells ELLE. “Being able to look cute and comfy all at the same time, whether at rehearsals or in the studio, [working with Puma] has been really rewarding.” For the singer, ease has always been key to her personal style as a performer. As she explains, “At the very beginning, I didn’t understand what made me feel comfortable and what didn’t. Now just knowing that, and no matter what other people say, as long as I feel comfortable that’s all that matters.”\u003c/p\u003e\u003cdiv size=\"medium\" data-embed=\"body-image\" data-lazy-id=\"P0-9\" data-node-id=\"2\"\u003e\u003cp\u003e\u003cimg alt=\"rosé for puma\" title=\"rosé for puma\" loading=\"lazy\" width=\"1785\" height=\"2630\" decoding=\"async\" data-nimg=\"1\" sizes=\"100vw\" srcset=\"https://hips.hearstapps.com/hmg-prod/images/final-s3-2-019a0638-682b5ddda4c2a.jpg?crop=1.00xw:0.850xh;0,0.129xh\u0026amp;resize=640:* 640w, https://hips.hearstapps.com/hmg-prod/images/final-s3-2-019a0638-682b5ddda4c2a.jpg?crop=1.00xw:0.850xh;0,0.129xh\u0026amp;resize=768:* 980w, https://hips.hearstapps.com/hmg-prod/images/final-s3-2-019a0638-682b5ddda4c2a.jpg?crop=1.00xw:0.850xh;0,0.129xh\u0026amp;resize=980:* 1120w\" src=\"https://hips.hearstapps.com/hmg-prod/images/final-s3-2-019a0638-682b5ddda4c2a.jpg?crop=1.00xw:0.850xh;0,0.129xh\u0026amp;resize=980:*\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cfigcaption data-theme-key=\"photo-credit-figcaption\"\u003e\u003cspan data-theme-key=\"photo-credit-creditor\"\u003eCourtesy of Sangbok Baek\u003c/span\u003e\u003c/figcaption\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-journey-content=\"true\" data-node-id=\"3\"\u003eWhen asked what drew the brand to Rosé and to Seoul, Gregor Abenstein, head of Puma Select, says, “We very much look to Seoul when we want to see what’s next. When we kicked off the \u003ca href=\"https://www.elle.com/fashion/shopping/a64637165/puma-speedcat-ballet-sneaker-trend-2025/\" target=\"_blank\" data-vars-ga-outbound-link=\"https://www.elle.com/fashion/shopping/a64637165/puma-speedcat-ballet-sneaker-trend-2025/\" data-vars-ga-ux-element=\"Hyperlink\" data-vars-ga-call-to-action=\"Speedcat\" data-node-id=\"3.1\"\u003eSpeedcat\u003c/a\u003e [sneaker], Seoul was also the first city where we saw the shoes on the feet of the right people. Our Korean team basically gave us the heads up that low profile might be coming back.”  \u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"5\"\u003eAbenstein also explained that they wanted the immersive experience to feel authentic to the venue’s neighborhood and the city’s style. “We relied heavily on our partners and the communities that they acquired to help lead us to the heart of the city. From the food that’s been chosen, down to the DJs and the nail artists, it has been specifically curated to be part of our cultural community.”\u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"6\"\u003eAs a result, the event tapped vendors including Cold Archive and Inside Tag to curate an installation of interactive art zones. Featuring everything from custom screen-printed T-shirts emblazoned with “___ Sucks” to alien-like nail art, each station complemented the display of archival Puma products. On the main floor, guests were able to walk through the history of the brand, tracing its very first pair of track spikes to the H-Street sneaker’s inception in 2003. \u003c/p\u003e\u003cp data-journey-content=\"true\" data-node-id=\"7\"\u003e\u003cem data-node-id=\"7.0\"\u003eThe Puma H-Street sneakers, including the event’s signature neon green colorway, as sported by Rosé, will be available for purchase in late June. \u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-05-19T18:46:40.281142-04:00",
  "modifiedTime": "2025-05-19T18:46:00Z"
}
