{
  "id": "eb7e1e71-aecf-4cad-9746-0c4c3c18995f",
  "title": "The 27 Summer Fashion Must-Haves R29 Editors Swear By",
  "link": "https://www.refinery29.com/en-us/summer-clothes-shoes-accessories-2025?utm_source=feed\u0026utm_medium=rss",
  "description": "As Addison Rae blasts in our headphones, hot dogs sizzle on the grill, sand collects in beach bags, and European vacation plans get finalized, we’re deep in summer mode. And at Refinery29, that means leaning into the good vibes (and hot temps) with fashion that matches the mood.Right now, we’re all about our go-to denim shorts and easy summer dresses, plus heat-wave-ready accessories like comfortable sandals and and baseball caps — the kind that instantly pull a look together. We’ve also included the travel MVPs making it into our packed bags to build the best vacation outfits. Think: Foldable ballet flats, blister-proof socks, water-resistant anklets, and so-fun matching sets. Ahead, find 27 editor-approved pieces we’re wearing on repeat — from reader-favorite brands like Lululemon, Madewell, and Vivaia to new discoveries like Chord, Shezza, and Anonymous Copenhagen.All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.For more can't-miss shopping stories delivered straight to your inbox, sign up for our Most Wanted newsletter.Lululemon Court Rival High-Rise Short 3”“I bought these Lululemon shorts last year… and then again this year in more colors because I wear them nonstop. I recently picked up the black with white piping — they’re lightweight, breathable, and technically designed for tennis and running (I do neither). The mesh liner keeps me cool in 95-degree heat, and they work just as well with a comfy T-shirt and they do with a nicer top for work.” — Lisa Dionisio, Newsletter DirectorShop LululemonLululemon Court Rival High-Rise Short 3\", $, available at LululemonOnitsuka Tiger Mexico 66 Sneaker“I’ve wanted these sneakers forever, and I’m so glad they’re finally in my summer shoe rotation. Famously worn by Uma Thurman in Kill Bill, the Mexico 66 silhouette is slim and sexy — and even better in this shiny silver hue. I added yellow hiking laces (a nod to the OG yellow pair), and now they make a statement with every single outfit.” — Alicia Lansom, Culture EditorShop FarfetchOnitsuka Tiger MEXICO 66 Sneakers, $, available at FarfetchPhoto: Courtesy of Alicia Lansom.Tree of Life Peace Angel Dress “I have never felt as pretty — or more myself — than I did in this dress. I truly felt like a fairy princess at a recent wedding, especially when I found a rose garden to twirl about in. It’s from Tree of Life, an Australian brand that creates the ethereal, boho clothes of my dreams. The corset-like cinch hugs my curves beautifully, but is fully adjustable, so it’s super comfortable (perfect for post-dinner bloating or dancing all night). Made of breathable cotton, it kept me cool even on a sweltering day. FYI: My dark purple version is no longer available, but the brand just launched this gorgeous chocolate brown iteration (and more colors are always dropping).” — Esther Newman, Affiliate WriterShop Tree of LifeTree Of Life Peace Angel Dress, $, available at Tree of LifePhoto: Courtesy of Esther Newman.FitFlop Lulu Resin-Buckle Leather Back-Strap Sandals“I'm extremely practical about summer shoes: I want lightweight sandals with real arch support and secure straps, preferably with a little lift. This pair ticks all the boxes. The heavily cushioned midsole weighs next to nothing and keeps my feet comfortable even after a whole day of walking around in the city. The tortoiseshell buckles look polished with some of my dressier outfits, and the slip-resistant outsole has come in handy during sudden British downpours.” — Venus Wong, Senior WriterShop FitFlopLulu Resin-Buckle Leather Back-Strap Sandals, $, available at FitFlopPhoto: Courtesy of Venus Wong.Aerie Good Day Button Down Shirt \u0026 Short“I’ve been living in this matching Aerie set all summer long. The oversized button-down top and elastic-waist shorts don’t cling in the heat —  a major win. The nautical stripes are a vibe, and while it’s my go-to beach coverup, I’ve also worn it to festivals and packed it for trips.” — Victoria Montalti, Associate Fashion WriterShop AerieAerie Good Day Button Down Shirt, $, available at AerieAerie Good Day Short, $, available at AeriePhoto: Courtesy of Victoria Montalti.Ece London The Aphrodite Baroque Pearl Ring“If you want jewelry that looks like it came from a Pirates of the Caribbean treasure chest, put Ece London on your radar. Think molten gold that looks washed ashore, mythological motifs, raw gemstones, and delicate hand-carved details. I picked out this baroque pearl ring to fulfill my fantasy of being a secret, landlocked mermaid (blame the solid diet of The Little Mermaid, H20: Just Add Water, and Aquamarine movies that I grew up on).” — Esther Newman, Affiliate WriterShop Ece LondonEce London The Aphrodite Baroque Pearl Ring, $, available at Ece LondonPhoto: Courtesy of Esther Newman.Farm Rio Off-White Fresh Table Midi Skirt“A scroll past this Farm Rio skirt on Instagram, and I was instantly enchanted, immediately knowing it was the one for my birthday. The picnic-inspired print is joyful and unexpected — a standout in a sea of florals and palms. It’s part of a matching set, but I prefer styling it solo with a bright cotton tee so the print gets all the attention.” — Venus Wong, Senior WriterShop Farm RioFarm Rio Fresh Table Lenzing Ecovero Euroflax Midi Skirt, $, available at Farm RioPhoto: Courtesy of Venus Wong.Vivaia Round-Toe Satin Sneakerina“Charli XCX made me do it. I saw her wearing these blush pink sneakerinas with denim shorts at a festival, and was instantly fixated. They’re super padded, unlike a lot of ballet flats, and actually comfortable. I wear mine with black capris because I’m not as insouciantly cool as Charli, but still feel on point.” — Susan Devaney, Lifestyle DirectorShop VivaiaVivaia Round-Toe Satin Sneakerina, $, available at VivaiaPhoto: Courtesy of Susan Devaney.Summer Away Deia Shorts“Okay, I’m decidedly not a shorts person. And yet — here I am, inching my way out of my comfort zone. And what better gateway than a zany green striped short? The mid-thigh length feels polished enough to dress up, while still delivering carefree summer fun. Also: no chafing (bless). Styled with an oversized button-down and low heels, I’m somehow comfy and feeling myself. A new era.” — Laura Lajiness Kaupke, Contributing Editor Shop Summer AwaySummer Away Deia Shorts, $, available at Summer AwayPhoto: Courtesy of Laura Lajiness.Chord Ivory Bouclé Cap“I have plenty of baseball hats, but I’ve long struggled to find a quality, minimalistic one without a logo that actually fits well. This high-end brand nails the details: luxe hardware, leather strap closure, and, most importantly, a brown sweatband that hides makeup stains. While the brand offers styles in a range of fabrications from cotton to denim, I love this textured bouclé version that I’ve worn nonstop since it arrived.” — Irina Grechko, Fashion DirectorShop ChordChord Ivory Bouclé Cap, $, available at ChordPhoto: Courtesy of Irina Grechko.Anonymous Copenhagen Sessi 40 Hand-Braided Heel“I’ve had a horrific time finding a smart summer shoe. I live in loafers and find the idea of wearing sandals in the city the stuff of nightmares. But the rise of braided ballet flats and kitten heels in my feed felt like a sign. This pair from Anonymous Copenhagen is exactly what I was looking for: buttery-soft leather, a block heel for height without pain, and handcrafted quality (these are by skilled artisans in Portugal and Italy). These are my date-night, special-occasion, and summer-wedding shoes.” — Alicia Lansom, Culture EditorShop Anonymous CopenhagenAnonymous Copenhagen Sessi 40 Hand-Braided, $, available at Anonymous CopenhagenPhoto: Courtesy of Alicia Lansom.\u0026 Other Stories Alpaca-Blend Knit Cardigan \u0026 Nobody’s Child Broderie Anglaise Maxi Skirt“When in doubt, I always go back to this outfit formula: white skirt, red top, red ballet flats. It’s sweet, timeless, and just feels like summer — fresh berries, picnics, classic gingham, and listening to Lana Del Rey on repeat. (Don’t ask me why, but she’s a red-and-white vibe to me.)” — Esther Newman, Affiliate WriterShop Nobody’s Child\u0026 Other Stories Alpaca-Blend Knitted Cardigan, $, available at \u0026 Other StoriesNobody's Child Broderie Anglaise Maxi Skirt, $, available at Nobody's ChildPhoto: Courtesy of Esther Newman.Jenny Bird Dane Anklet \u0026 Dhani Anklet“I wear Jenny Bird jewelry on the regular, and these anklets are my latest obsession. The Dane is like an ankle bangle — sleek, oval-shaped, and water-resistant. The hidden closure is genius. I’ve been pairing it with the chunky chainlink Dhani anklet in the 10-inch sizes for a fresh, stacked look.” — Victoria Montalti, Associate Fashion Writer  Shop Jenny BirdJenny Bird Dane Anklet, $, available at Jenny BirdJenny Bird Dhani Anklet, $, available at Jenny BirdPhoto: Courtesy of Victoria Montalti.Madewell Poplin Smocked Maxi Dress“I’m a dress girl through and through. Correction: I’m a long dress girl. Come summer, the only viable option on the hottest days is a non-clingy cotton style — and this one from Madewell is my ideal. The length? Perfection. The smocking? Skims the body just right without feeling suffocating. And the red? The exact punchy shade I reach for in the summer.” — Laura Lajiness Kaupke, Contributing Editor Shop MadewellMadewell Poplin Smocked Maxi Dress, $, available at MadewellPhoto: Courtesy of Laura Lajiness.Toms x Jamie Mizrahi Alp FWD Slip-On Sneaker“So soft, so comfy, so vibrant. These are the ultimate everyday summer shoes. I usually need time to break this shape in, but these felt perfect from the get-go. The bright purple feels so summery and fun, adding color without being over the top. They look like flower petals and feel just as gentle on my feet.” — Tanyel Mustafa, Senior WriterShop TomsToms x Jamie Mizrahi Alp FWD Slip-On Sneaker, $, available at TOMSPhoto: Courtesy of Tanyel Mustafa.Gap × Dôen Eyelet Top“I was so excited for the second Gap x Dôen collab and shopped early to snag this cotton eyelet top. It’s a signature Dôen silhouette — airy, embroidered, and easy to style with jeans, skirts, or even office trousers. A perfect summer staple.” — Lisa Dionisio, Newsletter DirectorShop GapGap x Dôen Eyelet Top, $, available at GapPhoto: Courtesy of Lisa Dionisio.Vagabond Vivian Pumps “I just can’t hack heels anymore. I’ve become that girl walking barefoot home from events — someone I vowed never to be. But then I wore these Vagabond courts to a wedding and didn’t want to take them off. Yes, I felt short at 5’1”, but these shoes were so cute, it didn’t matter. They work for everything — office, date nights, travel  — and the block-y shape adds edge and polish to any look.” — Kelly Washington, Senior Social EditorShop VagabondVagabond Vivian Pumps, $, available at VagabondPhoto: Courtesy of Kelly Washington.Levi’s High Rise Baggy Linen+Denim Lightweight Shorts“These are easily some of the most comfortable shorts I own — the linen-denim blend is breathable, lightweight, and made for hot days. They’re not stretchy, but the mid-thigh cut and wider hems offer coverage without riding up or chafing. I’ve been reaching for them daily.” — Victoria Montalti, Associate Fashion Writer  Shop Levi’sLevi's High Rise Baggy Linen+Denim Lightweight Shorts, $, available at Levi'sPhoto: Courtesy of Victoria Montalti.Rothy’s The Square Mary Jane“I got these Mary Janes at the end of last summer and they’ve been my go-to for every warm-weather moment since. They’re incredibly comfortable and a must-pack for trips — they bend easily and tuck into any suitcase crevice. Plus: The bright red adds the perfect pop to my otherwise minimal summer looks.” — Irina Grechko, Fashion DirectorShop Rothy’sRothy's The Square Mary Jane, $, available at Rothy'sPhoto: Courtesy of Irina Grechko.Maison de Sabré The Sabrémoji Lime Fruit Charm“I’m a big Maison de Sabré fan — their (sold-out) Little Miss Bad charm lives on my work bag. This lime fruit style is the latest star of my bag charm collection. It’s summery and fun, complements my Kelly green shoulder bag, and is surprisingly functional — it fits an Apple AirTag.”  — Victoria Montalti, Associate Fashion WriterShop Maison de SabréMaison de Sabré The SABRÉMOJI Fruit Charm, $, available at Maison de SabréPhoto: Courtesy of Victoria Montalti.Minka Dink London The Esme Blouse“I’ve been into oversized shirts for ages, but needed a switch-up for summer. This ruched blouse from Minka Dink is fitted in all the right places, has the sweetest sleeve frills, and features mother-of-pearl buttons. While it looks like it could be tight and uncomfortable, the 100% cotton is super breathable — perfect for work or play. (Bonus: It now comes in a lemon yellow).” — Alicia Lansom, Culture EditorShop Minka Dink LondonMinka Dink London The Esme Blouse, $, available at Minka Dink LondonPhoto: Courtesy of Alicia Lansom.Shezza Lace Socks“My Dr. Martens 1461 Bex Oxfords have gathered dust for two years because they destroy my ankles — until now. Shezza socks have built-in heel padding, and they’ve totally changed the game. These lace ones look great with my Docs, ballet flats, and Mary Janes. I also got the black crew socks for Glastonbury — fingers crossed they save my feet from festival miles.” — Esther Newman, Affiliate WriterShop ShezzaShezza Lace Socks, $, available at ShezzaPhoto: Courtesy of Esther Newman.Dr. Scholl's x Favorite Daughter Heartbreak Sandal“Dr. Scholl’s clog sandals were already iconic — now they’re even better, thanks to this new Favorite Daughter collaboration. The croc leather uppers and kitten heel give them a more evening update. I went with the chocolate brown, and I’m obsessed. Paired with a mini skirt, dress, or capris, they make me feel like I stepped out of a ‘90s rom-com or early-aughts episode of Sex and The City.” — Victoria Montalti, Associate Fashion Writer  Shop Dr. Scholl’sDr. Scholl's x Favorite Daughter Heartbreak Sandal, $, available at Dr. Scholl'sPhoto: Courtesy of Victoria Montalti.Paige Dani Short“I’ve been hunting for denim shorts with a flared, A-line silhouette that aren’t uncomfortable — and these are it. The denim is soft and lived-in, making them great for travel, and the contrast stitching and pintuck pleat give off a ’70s vibe I love, especially with a brown leather belt. I’ll be living in these all summer.” — Venus Wong, Senior WriterShop PaigePAIGE Dani Short, $, available at PAIGEPhoto: Courtesy of Venus Wong.Birkenstock Florida Fresh Nubuck Leather Sandals“I live, laugh, love in my Birks. My OG Arizonas have lasted six years, but I wanted a pair that felt a little more refined for everyday wear — enter the Florida Fresh. The slimmer straps and soft sage hue are a perfect match for light denim and summer whites.” — Esther Newman, Affiliate Writer Shop BirkenstockBirkenstock Florida Fresh, $, available at BirkenstockPhoto: Courtesy of Esther Newman.Sach Atelier Hail Belt “Sach Atelier has been flooding my feed lately, and for good reason. This handmade, non-leather belt blends South Asian jewelry traditions with Y2K energy. The mirrored silver threading adds a bold touch to floaty skirts or jeans — I’m deeming it my pop princess concert fit essential. — Alicia Lansom, Culture EditorShop Sach AtelierSach Atelier Hail Belt, $, available at Sach AtelierPhoto: Courtesy of Alicia Lansom.Peachaus Striped Ethical-cotton Pyjama Shorts“These boxer shorts have become my top pick from Peachaus’s lightweight cotton set. I wear them for nearly everything — sleeping, working from home, lounging in the garden, even brunch with a chunky knit and biker boots. I’m already planning to grab a few more colors for summer.” — Esther Newman, Affiliate WriterShop PeachausPeachaus Lomandra Striped Ethical-Cotton Pyjama Shorts, $, available at PeachausPhoto: Courtesy of Esther Newman.Like what you see? How about some more R29 goodness, right here?R29 Editors' Top Nordstrom Anniversary Sale Picks15 Trending June Products Our Readers LovedBest Summer Fashion Picks Under $150",
  "author": "Victoria Montalti",
  "published": "Mon, 21 Jul 2025 18:38:19 +0000",
  "source": "https://www.refinery29.com/fashion/rss.xml",
  "categories": null,
  "byline": "Victoria Montalti",
  "length": 599,
  "excerpt": "Refinery29 editors share 27 summer fashion must-haves, from vacation styles and comfortable shoes to denim shorts — that they’re wearing all season long.",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "As Addison Rae blasts in our headphones, hot dogs sizzle on the grill, sand collects in beach bags, and European vacation plans get finalized, we’re deep in summer mode. And at Refinery29, that means leaning into the good vibes (and hot temps) with fashion that matches the mood.Ahead, find 27 editor-approved pieces we’re wearing on repeat — from reader-favorite brands like Lululemon, Madewell, and Vivaia to new discoveries like Chord, Shezza, and Anonymous Copenhagen.All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.",
  "image": "https://www.refinery29.com/images/11919727.jpg?crop=40%3A21",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"r29-container\"\u003e\u003carticle\u003e\u003csection id=\"article-main-content\"\u003e\u003cdiv\u003e\u003cp\u003eAs \u003ca href=\"https://www.refinery29.com/en-us/addison-rae-style-summer-outfits\"\u003eAddison Rae\u003c/a\u003e blasts in our headphones, hot dogs sizzle on the grill, sand collects in beach bags, and \u003ca href=\"https://www.refinery29.com/en-us/european-summer-outfits-wardrobe\"\u003eEuropean vacation\u003c/a\u003e plans get finalized, we’re deep in summer mode. And at Refinery29, that means leaning into the good vibes (and hot temps) with fashion that matches the mood.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAhead, find 27 editor-approved pieces we’re wearing on repeat — from reader-favorite brands like \u003ca href=\"https://www.refinery29.com/en-us/lululemon-sale-summer-scores-event\"\u003eLululemon\u003c/a\u003e, Madewell, and Vivaia to new discoveries like Chord, Shezza, and Anonymous Copenhagen.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": "2025-07-21T18:38:19Z",
  "modifiedTime": null
}
