{
  "id": "ef0ee60a-dcb3-4fbf-98c0-6e5870a053af",
  "title": "The 11 Biggest Fashion News Stories of 2024",
  "link": "https://fashionista.com/2024/12/top-biggest-fashion-news-stories-2024",
  "description": "This year was jam-packed with fashion industry headlines — whether they felt unfortunately bleak or positively inspiring. The most notable news of the year typically had to do with the ongoing creative director musical chairs game, with several major resignations, appointments, swaps and shakeups ...Continue reading",
  "author": "Brooke Frischer",
  "published": "Fri, 27 Dec 2024 14:00:00 GMT",
  "source": "https://fashionista.com/.rss/excerpt/",
  "categories": [
    "Mara Hoffman",
    "Victoria's Secret",
    "Alessandro Michele",
    "Kering ",
    "Saks Potts",
    "Kim Jones",
    "Year In Review",
    "designer musical chairs",
    "Phillip Lim",
    "Chanel ",
    "News",
    "unions",
    "Rhode",
    "Network",
    "Conde Nast",
    "Pierpaolo Piccioli",
    "Dries Van Noten",
    "Victoria's Secret Fashion Show",
    "News",
    "Peter Hawkings",
    "Moschino",
    "Peter Do",
    "Hedi Slimane",
    "Chanel",
    "Tom Ford",
    "Celine",
    "Interior",
    "Kering",
    "Roberto Cavalli",
    "Blumarine",
    "met gala",
    "Gap",
    "John Galliano",
    "Zac Posen",
    "MatchesFashion",
    "Creative Director",
    "fendi",
    "Virginie Viard",
    "Peter Copping",
    "Valentino",
    "Matthieu Blazy",
    "Old Navy",
    "Fendi "
  ],
  "byline": "Brooke Frischer",
  "length": 9822,
  "excerpt": "The revolving door of creative directors continued to spin this year, while beloved publications and brands shut their doors amid declining sales and rising costs.",
  "siteName": "Fashionista",
  "favicon": "https://fashionista.com/site/images/apple-touch-icon-114x114-precomposed.png?v=2024-12-19-210641-5ef57f8-000577",
  "text": "This year was jam-packed with fashion industry headlines — whether they felt unfortunately bleak or positively inspiring. The most notable news of the year typically had to do with the ongoing creative director musical chairs game, with several major resignations, appointments, swaps and shakeups happening over the last 12 months. Meanwhile, 2024 was also a year marked by struggle for many smaller brands and independent fashion labels, with some making the difficult decision to close up shop for good. In more positive news, unionized Condé Nast employees negotiated agreements for fair contracts and The Costume Institute announced its first-ever exhibit that will solely spotlight designers of color.Read on for recaps of 2024's biggest news stories — and prepare for their ripple effects to be felt well into 2025.Mass Creative Director ResignationsThough the creative director revolving door is endlessly rotating, this year saw several major fashion houses face significant departures, starting with Walter Chiapponi, who exited Blumarine in March after designing just one season. A couple of days later, Dries Van Noten announced he was stepping away from his eponymous label after 38 years. Pierpaolo Piccioli followed suit, leaving Valentino after two decades with the brand. In June, Virginie Viard left Chanel, opening the door for Matthieu Blazy, who left Bottega Veneta to assume the French house's helm. Peter Hawkings left Tom Ford, Kim Jones parted ways with Fendi, Peter Do exited Helmut Lang and Phillip Lim left his namesake label to \"pursue new ventures.\" Most significantly, perhaps, John Galliano bid farewell to Maison Margiela after a triumphant final Artisinal collection for Spring 2024.Photo: Courtesy of RhodeIndie Brands Shut Their DoorsBehind the glamorous parties and fashion shows, designers and brands continued to face an increasingly challenging retail landscape throughout 2024. Faced with the many financial issues and obstacles in navigating the fashion industry, multiple small indie labels shut their doors this year. In May, Mara Hoffman announced her eponymous line would be closing, citing high costs of sustainable materials and calling the decision \"by far the hardest thing I've ever had to do in my life.\" In late August, NYC-based brand Interior closed down, effective immediately. The Danish brand Saks Potts, best known for its colorful fur-trimmed trench coats, announced it would be closing this Spring. At the start of December, beloved Los Angeles-based ready-to-wear brand Rhode shared it would be shutting down after 10 years of business. Coveteur Shuts DownJust a few months after rebranding its website and naming designer and \"The Real Housewives of New York\" star Jenna Lyons as Editor-in-Chief, news broke that digital fashion and beauty outlet Coveteur would be ceasing its operations in the summer. Mark Stenberg, who first reported the news first for Adweek, said the closure was not a result of financial or traffic woes.Brands Hire New Creative DirectorsAt the start of the year, Moschino announced it had tapped Adrian Appiolaza, an alum of Alexander McQueen, Phoebe Philo, Marc Jacobs and Loewe, as its new creative director. Since then, the designer has released multiple collections with the brand honoring its novelty and playful history. In February, Zac Posen was appointed Creative Director of Gap and Chief Creative Officer of Old Navy, delivering memorable custom denim red carpet looks at the Met Gala, CFDA Awards and more. Valentino named Alessandro Michele as Pierpaolo Piccioli's successor. He made his debut for the brand with a 171-look Resort collection. LVMH Prize finalist and The Row designer Veronica Leoni was named creative director of Calvin Klein in May, followed by Peter Copping assuming the role of artistic director at Lanvin in June. In October, Celine announced that Michael Rider would replace Hedi Slimane after the latter's seven-year reign. Matthieu Blazy departed Bottega Veneta for Chanel in December. Louise Trotter left Carven and is set to take over Blazy's former role at the end of January 2025.Condé Nast Employees Threaten to Strike Ahead of Met GalaJust one week before fashion's biggest night (otherwise known as the Met Gala, which is largely supported and staffed by Vogue) unionized Condé Nast employees warned their management that they were \"ready to walk off the job\" if the media conglomerate didn't move forward with negotiating a fair contract. On the morning of the event, Condé Union and NewsGuild of New York announced that unionized employees would not strike due to reaching a tentative agreement with management. Scroll to ContinueRecommended Articles\"Our pledge to take any action necessary to get our contract, including walking off the job ahead of the Met Gala, and all the actions we took this week, pushed the company to really negotiate. We made every effort this week to meet with them and get this contract completed and we're thrilled to say we did it,\" said Mark Alan Burger, Vanity Fair social media manager and a member of the Condé Union bargaining team, in a statement.Photo: TheStewartofNY/FilmMagic via Getty ImagesVictoria's Secret Brings Back Its Fashion ShowSix years after announcing its discontinuation, Victoria's Secret revived its iconic (and controversial) runway fashion show. In a press release, the company said the new version would \"reflect who the brand is today, plus everything you know and love — the glamour, wings, musical entertainment and more.\" The show was met with mixed reviews, with many online viewers feeling excited by the return of the brand's hypersexualized and ultra-glamorous aesthetics, while others argued the company's commitment to increased diversity was not kept.Tapestry and Capri Holdings Terminate $8.5 Billion MergerAfter the U.S. Federal Trade Commission (FTC) sued to block Tapestry Inc.'s acquisition of Capri Holdings in April after taking issue with the fact that the acquisition could potentially eliminate competition between the companies' brands, the two entities mutually agreed to terminate their merger proposal. The plan would have been to combine Tapestry's brand portfolio of Coach, Stuart Weitzman and Kate Spade with Capri's Michael Kors, Jimmy Choo and Versace. In a Tapestry press release, the company stated that terminating the agreement \"is in the best interest of both companies.\"Kering's Half-Year Results Were DisappointingIn July, luxury fashion conglomerate Kering announced its net profit declined 50% in the first half of 2024, even more startling than the 40 to 45% drop the company previously forecasted in April. \"In a challenging market environment, which adds pressure on our top line and profitability, we are working assiduously to create the conditions for a return to growth,\" CEO and Chairman François-Henri Pinault said, in a statement. \"Our Houses pursue their investments to enrich their offer, intensify the impact of their communications, and reinforce the exclusivity of their distribution. We make certain that every one of these investments creates value for the long term. While the current context might impact the pace of our execution, our determination and confidence are stronger than ever.\" Though Kering doesn't specify the individual earnings of each of its brands, the company reported that Gucci sales took the biggest hit, with first-half revenue down 20% and sales dropping 19% in 2024's second quarter. The Costume Institute of the Metropolitan Museum of Art Announces Its Next Exhibit Theme Will Celebrate Black DandyismAt a press conference in October, it was announced that The Costume Institute of the Metropolitan Museum of Art's next exhibit theme will be \"Superfine: Tailoring Black Style,\" an examination of the history of Black dandy from the 18th century to modern day. A$AP Rocky, Pharrell Williams, Colman Domingo, Lewis Hamilton and Anna Wintour will co-chair the associated Spring 2025 Met Gala, for which a specific theme has not yet been announced. This will be the first time the Costume Institute will have an exhibit wholly focused on designers of color. It will also mark the first menswear-focused exhibit in 20 years. Photo: Arnaldo Magnani/Liaison via Getty ImagesRoberto Cavalli Passes AwayThe acclaimed Italian designer Roberto Cavalli passed away at the age of 83 in April. \"It is with great sadness that today we say our final goodbyes to our founder Roberto Cavalli,\" read a statement from his namesake brand, posted to Instagram. \"From humble beginnings in Florence, Roberto succeeded in becoming a globally recognized name loved and respected by all. Naturally talented and creative, Roberto believed that everyone can discover and nurture the artist within themselves. Roberto Cavalli's legacy will live on via his creativity, his love of nature and via his family who he cherished.\"Matchesfashion Closes DownIn March, British retail firm Frasers Group announced that luxury e-commerce site Matchesfashion would be shutting down. Sky News had previously reported that the company had been failing to pay brands on time and that some had even gone as far as to sever ties. \"Whilst Matches' management team has tried to find a way to stabilize the business, it has become clear that too much change would be required to restructure it, and the continued funding requirements would be far in excess of amounts that the Group considers to be viable,\" Frasers Group said in a statement provided to Fashionista. \"In light of this, Frasers has been informed that the directors of Matches have taken the decision to put the Matches group into administration. Frasers remains committed to the luxury market and its brand partners.\"Tune into The Fashionista Network to join the conversation with fashion and beauty industry leaders. Sign up here.",
  "image": "https://fashionista.com/.image/ar_1.91%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_1200/MjExNjc4MDM0NDE0NDc5MzM2/biggest-fashion-news-2024.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eThis year was jam-packed with \u003ca href=\"https://fashionista.com/news\"\u003efashion industry headlines\u003c/a\u003e — whether they felt unfortunately bleak or positively inspiring. The most notable news of the year typically had to do with the \u003ca href=\"https://fashionista.com/tag/designer-musical-chairs\"\u003eongoing creative director musical chairs game\u003c/a\u003e, with several major resignations, appointments, swaps and shakeups happening over the last 12 months. Meanwhile, 2024 was also a year marked by struggle for many smaller brands and independent fashion labels, with some making the difficult decision to close up shop for good. In more positive news, unionized Condé Nast employees negotiated agreements for fair contracts and The Costume Institute announced its first-ever exhibit that will solely spotlight designers of color.\u003c/p\u003e\u003cp\u003eRead on for recaps of 2024\u0026#39;s biggest news stories — and prepare for their ripple effects to be felt well into 2025.\u003c/p\u003e\u003ch2 id=\"mass-creative-director-resignations\"\u003eMass Creative Director Resignations\u003c/h2\u003e\u003cp\u003eThough the \u003ca href=\"https://fashionista.com/2023/12/fashion-creative-directors-2023-hires-exits\"\u003ecreative director revolving door\u003c/a\u003e is endlessly rotating, this year saw several major fashion houses face significant departures, starting with \u003ca href=\"https://fashionista.com/2024/03/blumarine-creative-director-walter-chiapponi-exits\"\u003eWalter Chiapponi\u003c/a\u003e, who exited Blumarine in March after designing just one season. A couple of days later, Dries Van Noten announced he was \u003ca href=\"https://fashionista.com/2024/03/dries-van-noten-stepping-down\"\u003estepping away\u003c/a\u003e from his eponymous label after 38 years. Pierpaolo Piccioli followed suit, \u003ca href=\"https://fashionista.com/2024/03/pierpaolo-piccioli-valentino-leaving\"\u003eleaving Valentino\u003c/a\u003e after two decades with the brand. \u003c/p\u003e\u003cp\u003eIn June, \u003ca href=\"https://fashionista.com/2024/06/virginie-viard-leaving-chanel\"\u003eVirginie Viard\u003c/a\u003e left \u003ca href=\"https://fashionista.com/designers/chanel\"\u003eChanel\u003c/a\u003e, opening the door for \u003ca href=\"https://fashionista.com/2024/12/matthieu-blazy-chanel-creative-director\"\u003eMatthieu Blazy\u003c/a\u003e, who left \u003ca href=\"https://fashionista.com/designers/bottega-veneta\"\u003eBottega Veneta\u003c/a\u003e to assume the French house\u0026#39;s helm. \u003ca href=\"https://fashionista.com/2024/07/peter-hawkings-leaves-tom-ford\"\u003ePeter Hawkings\u003c/a\u003e left Tom Ford, \u003ca href=\"https://fashionista.com/2024/10/kim-jones-leaves-fendi\"\u003eKim Jones\u003c/a\u003e parted ways with Fendi, \u003ca href=\"https://fashionista.com/2024/11/peter-do-leaves-helmut-lang\"\u003ePeter Do\u003c/a\u003e exited Helmut Lang and \u003ca href=\"https://fashionista.com/2024/11/phillip-lim-leaves-3-1-phillip-lim\"\u003ePhillip Lim\u003c/a\u003e left his namesake label to \u0026#34;pursue new ventures.\u0026#34; Most significantly, perhaps, John Galliano \u003ca href=\"https://fashionista.com/2024/12/john-galliano-leaves-maison-margiela\"\u003ebid farewell\u003c/a\u003e to Maison Margiela after a triumphant final Artisinal collection for Spring 2024.\u003c/p\u003e\u003cdiv\u003e\u003cfigure itemscope=\"\" itemtype=\"http://schema.org/ImageObject\"\u003e\u003cphoenix-picture\u003e\u003ca\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" sizes=\"(min-width: 1240px) 700px, (min-width: 675px) 620px, calc(100vw - 40px)\" data-srcset=\"https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_380/MjExMzUwMjk1OTI4NzExMTU2/rhode-clothing-2.webp 380w, https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_620/MjExMzUwMjk1OTI4NzExMTU2/rhode-clothing-2.webp 620w, https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_700/MjExMzUwMjk1OTI4NzExMTU2/rhode-clothing-2.webp 700w\"/\u003e\u003csource sizes=\"(min-width: 1240px) 700px, (min-width: 675px) 620px, calc(100vw - 40px)\" data-srcset=\"https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_380/MjExMzUwMjk1OTI4NzExMTU2/rhode-clothing-2.png 380w, https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_620/MjExMzUwMjk1OTI4NzExMTU2/rhode-clothing-2.png 620w, https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_700/MjExMzUwMjk1OTI4NzExMTU2/rhode-clothing-2.png 700w\"/\u003e\u003cimg alt=\"rhode clothing 2\" decoding=\"async\" src=\"https://fashionista.com/.image/t_share/MjExMzUwMjk1OTI4NzExMTU2/rhode-clothing-2.png\" data-src=\"https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_700/MjExMzUwMjk1OTI4NzExMTU2/rhode-clothing-2.png\" height=\"1358\" width=\"940\" srcset=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" itemprop=\"contentUrl url\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/phoenix-picture\u003e\u003cfigcaption\u003e\u003cp itemprop=\"author\"\u003e\u003cspan\u003ePhoto: Courtesy of Rhode\u003c/span\u003e\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003ch2 id=\"indie-brands-shut-their-doors\"\u003eIndie Brands Shut Their Doors\u003c/h2\u003e\u003cp\u003eBehind the glamorous parties and fashion shows, designers and brands continued to face an increasingly \u003ca href=\"https://fashionista.com/2024/09/independent-designers-retail-wholesale-strategy-challenges-2024\"\u003echallenging retail landscape\u003c/a\u003e throughout 2024. Faced with the many financial issues and obstacles in navigating the fashion industry, multiple small indie labels shut their doors this year. In May, \u003ca href=\"https://fashionista.com/2024/05/mara-hoffman-closing-brand\"\u003eMara Hoffman\u003c/a\u003e announced her eponymous line would be closing, citing high costs of \u003ca href=\"https://fashionista.com/tag/sustainability\"\u003esustainable\u003c/a\u003e materials and calling the decision \u0026#34;by far the hardest thing I\u0026#39;ve ever had to do in my life.\u0026#34; In late August, NYC-based brand \u003ca href=\"https://fashionista.com/2024/08/interior-nyc-shutting-down-closing\"\u003eInterior closed down\u003c/a\u003e, effective immediately. The Danish brand \u003ca href=\"https://fashionista.com/2024/11/saks-potts-closing\"\u003eSaks Potts\u003c/a\u003e, best known for its colorful fur-trimmed trench coats, announced it would be closing this Spring. At the start of December, beloved Los Angeles-based ready-to-wear brand \u003ca href=\"https://fashionista.com/2024/12/rhode-clothing-brand-closes-down\"\u003eRhode shared it would be shutting down\u003c/a\u003e after 10 years of business. \u003c/p\u003e\u003ch2 id=\"coveteur-shuts-down\"\u003eCoveteur Shuts Down\u003c/h2\u003e\u003cp\u003eJust a few months after rebranding its website and naming designer and \u0026#34;The Real Housewives of New York\u0026#34; star Jenna Lyons as Editor-in-Chief, news broke that digital fashion and \u003ca href=\"https://fashionista.com/beauty\"\u003ebeauty\u003c/a\u003e outlet Coveteur would be \u003ca href=\"https://fashionista.com/2024/05/coveteur-shutting-down-closing\"\u003eceasing its operations\u003c/a\u003e in the summer. Mark Stenberg, who first reported the news first for \u003ca href=\"https://www.adweek.com/media/coveteur-shutters/\" rel=\"noopener\" onclick=\"return phoenixTrackClickEvent(this, event);\" target=\"_blank\"\u003eAdweek\u003c/a\u003e, said the closure was not a result of financial or traffic woes.\u003c/p\u003e\u003ch2 id=\"brands-hire-new-creative-directors\"\u003eBrands Hire New Creative Directors\u003c/h2\u003e\u003cp\u003eAt the start of the year, Moschino announced it had tapped Adrian Appiolaza, an alum of Alexander McQueen, Phoebe Philo, \u003ca href=\"https://fashionista.com/designers/marc-jacobs\"\u003eMarc Jacobs\u003c/a\u003e and \u003ca href=\"https://fashionista.com/designers/loewe\"\u003eLoewe\u003c/a\u003e, as its new creative director. Since then, the designer has released multiple collections with the brand honoring its novelty and playful history. In February, Zac Posen was \u003ca href=\"https://fashionista.com/2024/02/zac-posen-old-navy-gap-creative-director-announcement\"\u003eappointed\u003c/a\u003e Creative Director of Gap and Chief Creative Officer of Old Navy, delivering memorable custom denim red carpet looks at the Met Gala, CFDA Awards and more. Valentino \u003ca href=\"https://fashionista.com/2024/03/alessandro-michele-valentino-creative-director\"\u003enamed Alessandro Michele\u003c/a\u003e as Pierpaolo Piccioli\u0026#39;s successor. He made his debut for the brand with a \u003ca href=\"https://fashionista.com/2024/06/valentino-resort-2025-collection-review\"\u003e171-look Resort collection\u003c/a\u003e. LVMH Prize finalist and The Row designer \u003ca href=\"https://fashionista.com/2024/05/calvin-klein-collection-veronica-leoni-creative-director\"\u003eVeronica Leoni\u003c/a\u003e was named creative director of Calvin Klein in May, followed by Peter Copping \u003ca href=\"https://fashionista.com/2024/06/peter-copping-lanvin-creative-director\"\u003eassuming the role of artistic director\u003c/a\u003e at Lanvin in June. In October, Celine announced that \u003ca href=\"https://fashionista.com/2024/10/hedi-slimane-leaving-celine-michael-rider-creative-director\"\u003eMichael Rider\u003c/a\u003e would replace Hedi Slimane after the latter\u0026#39;s seven-year reign. Matthieu Blazy \u003ca href=\"https://fashionista.com/2024/12/matthieu-blazy-chanel-creative-director\"\u003edeparted\u003c/a\u003e Bottega Veneta for Chanel in December. Louise Trotter left \u003ca href=\"https://fashionista.com/designers/carven\"\u003eCarven\u003c/a\u003e and is set to \u003ca href=\"https://fashionista.com/2024/12/louise-trotter-exits-carven-joins-bottega-veneta\"\u003etake over Blazy\u0026#39;s former role\u003c/a\u003e at the end of January 2025.\u003c/p\u003e\u003ch2 id=\"cond-nast-employees-threaten-to-strike-ahead-of-met-gala\"\u003eCondé Nast Employees Threaten to Strike Ahead of Met Gala\u003c/h2\u003e\u003cp\u003eJust one week before fashion\u0026#39;s biggest night (otherwise known as the Met Gala, which is largely supported and staffed by \u003cem\u003eVogue\u003c/em\u003e) unionized \u003ca href=\"https://fashionista.com/tag/conde-nast\"\u003eCondé Nast\u003c/a\u003e employees \u003ca href=\"https://fashionista.com/2024/04/conde-nast-union-threatens-strike-walk-off-2024\"\u003ewarned their management\u003c/a\u003e that they were \u0026#34;ready to walk off the job\u0026#34; if the media conglomerate didn\u0026#39;t move forward with negotiating a fair contract. On the morning of the event, Condé Union and NewsGuild of New York announced that unionized employees would not strike due to reaching a tentative agreement with management. \u003c/p\u003e\u003csection id=\"phx-3\"\u003e\u003cp\u003e\u003cspan\u003eScroll to Continue\u003c/span\u003e\u003c/p\u003e\u003cdiv id=\"phx-5\"\u003e\u003cp\u003e\u003ch2 role=\"heading\" aria-level=\"2\"\u003eRecommended Articles\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003cp\u003e\u0026#34;Our pledge to take any action necessary to get our contract, including walking off the job ahead of the Met Gala, and all the actions we took this week, pushed the company to really negotiate. We made every effort this week to meet with them and get this contract completed and we\u0026#39;re thrilled to say we did it,\u0026#34; said Mark Alan Burger, \u003cem\u003eVanity Fair\u003c/em\u003e social media manager and a member of the Condé Union bargaining team, in a statement.\u003c/p\u003e\u003cdiv\u003e\u003cfigure itemscope=\"\" itemtype=\"http://schema.org/ImageObject\"\u003e\u003cphoenix-picture\u003e\u003ca\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" sizes=\"(min-width: 1240px) 700px, (min-width: 675px) 620px, calc(100vw - 40px)\" data-srcset=\"https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_380/MjExNjc3NzUzMDkzNjYyNjk2/victorias-secret-fashion-show-2024.webp 380w, https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_620/MjExNjc3NzUzMDkzNjYyNjk2/victorias-secret-fashion-show-2024.webp 620w, https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_700/MjExNjc3NzUzMDkzNjYyNjk2/victorias-secret-fashion-show-2024.webp 700w\"/\u003e\u003csource sizes=\"(min-width: 1240px) 700px, (min-width: 675px) 620px, calc(100vw - 40px)\" data-srcset=\"https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Cq_auto:good%2Cw_380/MjExNjc3NzUzMDkzNjYyNjk2/victorias-secret-fashion-show-2024.jpg 380w, https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Cq_auto:good%2Cw_620/MjExNjc3NzUzMDkzNjYyNjk2/victorias-secret-fashion-show-2024.jpg 620w, https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Cq_auto:good%2Cw_700/MjExNjc3NzUzMDkzNjYyNjk2/victorias-secret-fashion-show-2024.jpg 700w\"/\u003e\u003cimg alt=\"victoria\u0026#39;s secret fashion show 2024\" decoding=\"async\" src=\"https://fashionista.com/.image/t_share/MjExNjc3NzUzMDkzNjYyNjk2/victorias-secret-fashion-show-2024.jpg\" data-src=\"https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Cq_auto:good%2Cw_700/MjExNjc3NzUzMDkzNjYyNjk2/victorias-secret-fashion-show-2024.jpg\" height=\"2000\" width=\"3000\" srcset=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" itemprop=\"contentUrl url\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/phoenix-picture\u003e\u003cfigcaption\u003e\u003cp itemprop=\"author\"\u003e\u003cspan\u003ePhoto: TheStewartofNY/FilmMagic via Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003ch2 id=\"victoria-s-secret-brings-back-its-fashion-show\"\u003eVictoria\u0026#39;s Secret Brings Back Its Fashion Show\u003c/h2\u003e\u003cp\u003eSix years after announcing its discontinuation, \u003ca href=\"https://fashionista.com/tag/victoria-s-secret\"\u003eVictoria\u0026#39;s Secret\u003c/a\u003e \u003ca href=\"https://fashionista.com/2024/05/victorias-secret-fashion-show-returns-rebrand\"\u003erevived\u003c/a\u003e its iconic (and controversial) runway fashion show. In a press release, the company said the new version would \u0026#34;reflect who the brand is today, plus everything you know and love — the glamour, wings, musical entertainment and more.\u0026#34; The show was met with mixed reviews, with many online viewers feeling excited by the return of the brand\u0026#39;s hypersexualized and ultra-glamorous aesthetics, while others \u003ca href=\"https://www.allure.com/story/victorias-secret-fashion-show-2024-review\" rel=\"noopener\" onclick=\"return phoenixTrackClickEvent(this, event);\" target=\"_blank\"\u003eargued\u003c/a\u003e the company\u0026#39;s commitment to increased diversity was not kept.\u003c/p\u003e\u003ch2 id=\"tapestry-and-capri-holdings-terminate-8-5-billion-merger\"\u003eTapestry and Capri Holdings Terminate $8.5 Billion Merger\u003c/h2\u003e\u003cp\u003eAfter the U.S. Federal Trade Commission (FTC) \u003ca href=\"https://fashionista.com/2024/04/tapestry-capri-acquisition-merger-ftc-lawsuit\"\u003esued\u003c/a\u003e to block \u003ca href=\"https://fashionista.com/tag/tapestry-inc\"\u003eTapestry Inc\u003c/a\u003e.\u0026#39;s acquisition of \u003ca href=\"https://fashionista.com/tag/capri-holdings\"\u003eCapri Holdings\u003c/a\u003e in April after taking issue with the fact that the acquisition could potentially eliminate competition between the companies\u0026#39; brands, the two entities mutually agreed to terminate their merger proposal. The plan would have been to combine Tapestry\u0026#39;s brand portfolio of Coach, Stuart Weitzman and Kate Spade with Capri\u0026#39;s Michael Kors, Jimmy Choo and Versace. In a Tapestry \u003ca href=\"https://tapestry.gcs-web.com/news-releases/news-release-details/tapestry-inc-announces-termination-merger-agreement-capri\" rel=\"noopener\" onclick=\"return phoenixTrackClickEvent(this, event);\" target=\"_blank\"\u003epress release\u003c/a\u003e, the company stated that terminating the agreement \u0026#34;is\u003cstrong\u003e \u003c/strong\u003ein the best interest of both companies.\u0026#34;\u003c/p\u003e\u003ch2 id=\"kering-s-half-year-results-were-not-good\"\u003eKering\u0026#39;s Half-Year Results Were Disappointing\u003c/h2\u003e\u003cp\u003eIn July, luxury fashion conglomerate \u003ca href=\"https://fashionista.com/tag/kering\"\u003eKering\u003c/a\u003e \u003ca href=\"https://fashionista.com/2024/07/kering-group-first-half-2024-report\"\u003eannounced\u003c/a\u003e its net profit declined 50% in the first half of 2024, even more startling than the 40 to 45% drop the company previously forecasted in April. \u0026#34;In a challenging market environment, which adds pressure on our top line and profitability, we are working assiduously to create the conditions for a return to growth,\u0026#34; CEO and Chairman François-Henri Pinault said, in a statement. \u0026#34;Our Houses pursue their investments to enrich their offer, intensify the impact of their communications, and reinforce the exclusivity of their distribution. We make certain that every one of these investments creates value for the long term. While the current context might impact the pace of our execution, our determination and confidence are stronger than ever.\u0026#34; Though Kering doesn\u0026#39;t specify the individual earnings of each of its brands, the company reported that \u003ca href=\"https://fashionista.com/designers/gucci\"\u003eGucci\u003c/a\u003e sales took the biggest hit, with first-half revenue down 20% and sales dropping 19% in 2024\u0026#39;s second quarter. \u003c/p\u003e\u003ch2 id=\"the-costume-institue-of-the-metropolitan-museum-of-art-announces-its-next-exhibit-theme-will-celebrate-black-dandyism\"\u003eThe Costume Institute of the Metropolitan Museum of Art Announces Its Next Exhibit Theme Will Celebrate Black Dandyism\u003c/h2\u003e\u003cp\u003eAt a press conference in October, it was announced that \u003ca href=\"https://fashionista.com/tag/costume-institute\"\u003eThe Costume Institute\u003c/a\u003e of the Metropolitan Museum of Art\u0026#39;s \u003ca href=\"https://fashionista.com/2024/10/met-costume-institute-exhibit-2025-superfine-tailoring-black-style\"\u003enext exhibit theme\u003c/a\u003e will be \u0026#34;Superfine: Tailoring Black Style,\u0026#34; an examination of the history of Black dandy from the 18th century to modern day. \u003ca href=\"https://fashionista.com/tag/asap-rocky\"\u003eA$AP Rocky\u003c/a\u003e, \u003ca href=\"https://fashionista.com/tag/pharrell-williams\"\u003ePharrell Williams\u003c/a\u003e, \u003ca href=\"https://fashionista.com/2024/03/oscars-2024-red-carpet-best-dressed-celebrities\"\u003eColman Domingo\u003c/a\u003e, \u003ca href=\"https://fashionista.com/tag/lewis-hamilton\"\u003eLewis Hamilton\u003c/a\u003e and \u003ca href=\"https://fashionista.com/tag/anna-wintour\"\u003eAnna Wintour\u003c/a\u003e will co-chair the associated Spring 2025 \u003ca href=\"https://fashionista.com/tag/met-gala\"\u003eMet Gala\u003c/a\u003e, for which a specific theme has not yet been announced. This will be the first time the Costume Institute will have an exhibit wholly focused on designers of color. It will also mark the first menswear-focused exhibit in 20 years. \u003c/p\u003e\u003cdiv\u003e\u003cfigure itemscope=\"\" itemtype=\"http://schema.org/ImageObject\"\u003e\u003cphoenix-picture\u003e\u003ca\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" sizes=\"(min-width: 1240px) 700px, (min-width: 675px) 620px, calc(100vw - 40px)\" data-srcset=\"https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_380/MjExNjc3NzM1OTEzNzkzNTEy/roberto-cavalli.webp 380w, https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_620/MjExNjc3NzM1OTEzNzkzNTEy/roberto-cavalli.webp 620w, https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cq_auto:good%2Cw_700/MjExNjc3NzM1OTEzNzkzNTEy/roberto-cavalli.webp 700w\"/\u003e\u003csource sizes=\"(min-width: 1240px) 700px, (min-width: 675px) 620px, calc(100vw - 40px)\" data-srcset=\"https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Cq_auto:good%2Cw_380/MjExNjc3NzM1OTEzNzkzNTEy/roberto-cavalli.jpg 380w, https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Cq_auto:good%2Cw_620/MjExNjc3NzM1OTEzNzkzNTEy/roberto-cavalli.jpg 620w, https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Cq_auto:good%2Cw_700/MjExNjc3NzM1OTEzNzkzNTEy/roberto-cavalli.jpg 700w\"/\u003e\u003cimg alt=\"roberto cavalli\" decoding=\"async\" src=\"https://fashionista.com/.image/t_share/MjExNjc3NzM1OTEzNzkzNTEy/roberto-cavalli.jpg\" data-src=\"https://fashionista.com/.image/c_limit%2Ccs_srgb%2Cfl_progressive%2Cq_auto:good%2Cw_700/MjExNjc3NzM1OTEzNzkzNTEy/roberto-cavalli.jpg\" height=\"3026\" width=\"1990\" srcset=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" itemprop=\"contentUrl url\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/phoenix-picture\u003e\u003cfigcaption\u003e\u003cp itemprop=\"author\"\u003e\u003cspan\u003ePhoto: Arnaldo Magnani/Liaison via Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003ch2 id=\"roberto-cavalli-passes-away\"\u003eRoberto Cavalli Passes Away\u003c/h2\u003e\u003cp\u003eThe acclaimed Italian designer \u003ca href=\"https://fashionista.com/designers/roberto-cavalli\"\u003eRoberto Cavalli\u003c/a\u003e passed away at the age of 83 in April. \u0026#34;It is with great sadness that today we say our final goodbyes to our founder Roberto Cavalli,\u0026#34; read a statement from his namesake brand, \u003ca href=\"https://www.instagram.com/p/C5q_PeZIx_O/?utm_source=ig_embed\u0026amp;ig_rid=ab755d47-85e0-4eb6-98e2-8238c58d8d80\" rel=\"noopener\" onclick=\"return phoenixTrackClickEvent(this, event);\" target=\"_blank\"\u003eposted to Instagram\u003c/a\u003e. \u0026#34;From humble beginnings in Florence, Roberto succeeded in becoming a globally recognized name loved and respected by all. Naturally talented and creative, Roberto believed that everyone can discover and nurture the artist within themselves. Roberto Cavalli\u0026#39;s legacy will live on via his creativity, his love of nature and via his family who he cherished.\u0026#34;\u003c/p\u003e\u003ch2 id=\"matchesfashion-closes-down\"\u003eMatchesfashion Closes Down\u003c/h2\u003e\u003cp\u003eIn March, British retail firm Frasers Group announced that luxury e-commerce site \u003ca href=\"https://fashionista.com/2024/03/matches-fashion-closing-administration\"\u003eMatchesfashion would be shutting down.\u003c/a\u003e \u003cem\u003eSky News\u003c/em\u003e had previously \u003ca href=\"https://news.sky.com/story/ashleys-frasers-group-pulls-plug-on-matchesfashion-13089400\" rel=\"noopener\" onclick=\"return phoenixTrackClickEvent(this, event);\" target=\"_blank\"\u003ereported\u003c/a\u003e that the company had been failing to pay brands on time and that some had even gone as far as to sever ties. \u0026#34;Whilst Matches\u0026#39; management team has tried to find a way to stabilize the business, it has become clear that too much change would be required to restructure it, and the continued funding requirements would be far in excess of amounts that the Group considers to be viable,\u0026#34; Frasers Group said in a statement provided to Fashionista. \u0026#34;In light of this, Frasers has been informed that the directors of Matches have taken the decision to put the Matches group into administration. Frasers remains committed to the luxury market and its brand partners.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://f.chat/S522\" rel=\"noopener\" onclick=\"return phoenixTrackClickEvent(this, event);\" target=\"_blank\"\u003e\u003cem\u003eTune into The Fashionista Network to join the conversation with fashion and beauty industry leaders. Sign up here.\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2024-12-27T14:00:00Z",
  "modifiedTime": null
}
