{
  "id": "01492ff2-7d0c-42c6-8ad7-7fc953d61491",
  "title": "Israel-Hezbollah ceasefire: What it means for Lebanon’s future",
  "link": "https://timesofindia.indiatimes.com/world/middle-east/israel-hezbollah-ceasefire-what-it-means-for-lebanons-future/articleshow/115710986.cms",
  "description": "A US-brokered ceasefire between Israel and Hezbollah is set to begin, halting over a year of fighting. The deal involves Israeli troop withdrawals and Hezbollah's retreat north of the Litani River, with UN peacekeepers deployed. While offering a reprieve, the agreement's fragility is underscored by the unresolved Gaza conflict and the broader Palestinian question.",
  "author": "TOI World Desk",
  "published": "2024-11-27T04:13:13+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 3024,
  "excerpt": "Middle East News: A US-brokered ceasefire between Israel and Hezbollah is set to begin, halting over a year of fighting. The deal involves Israeli troop withdrawals and",
  "siteName": "Times Of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "In this screen grab image from video provide by the Israeli Government Press Office, Israeli Prime Minister Benjamin Netanyahu makes a televised statement . (AP)A US-brokered ceasefire between Israel and Lebanon’s Hezbollah has gained the backing of Israeli leaders, signaling a possible end to more than a year of cross-border fighting. Hezbollah leaders have also shown tentative support for the deal, marking a critical juncture in the conflict that has displaced millions and killed thousands.Terms of the agreementThe ceasefire, set to begin at 4 am Wednesday local time, includes a 60-day halt in hostilities. Israeli troops will retreat from southern Lebanon, while Hezbollah is expected to withdraw its fighters north of the Litani River. Thousands of Lebanese soldiers and UN peacekeepers are to be deployed in the region to ensure compliance.President Joe Biden described the deal as a “permanent cessation of hostilities,” with an international panel, led by the US, overseeing its implementation. However, Israel insists on maintaining the right to act should Hezbollah breach the terms. Israeli Defense Minister Israel Katz warned of military action if UN forces fail to enforce the agreement effectively.Hezbollah’s conditional supportHezbollah’s deputy political leader, Mahmoud Qamati, expressed cautious optimism, emphasizing the need for clarity and assurances from Israel. “We want an end to the aggression, of course, but not at the expense of the sovereignty of the state of Lebanon,” Qamati told Al Jazeera.The European Union's foreign policy chief, Josep Borrell, noted that the deal addresses Israel’s security concerns while offering a path to de-escalation.Impact of the fightingThe conflict has taken a heavy toll. Israeli airstrikes killed over 3,700 Lebanese, many civilians, while Hezbollah’s rockets displaced tens of thousands in Israel. The militant group suffered significant losses, including the assassination of its leader, Hassan Nasrallah, and other top commanders.For Israel, the ceasefire offers a reprieve for its military, which remains engaged in Gaza. Hezbollah, despite its resistance, faces scrutiny for linking Lebanon’s fate to Gaza and exacerbating its already dire economic crisis.Gaza conflict remains unresolvedDespite the agreement, the situation in Gaza remains dire. Hezbollah’s initial involvement was tied to Hamas’ October 2023 attack on Israel, which triggered the war in Gaza. Israel’s continued military campaign in Gaza has killed over 44,000 Palestinians but has yet to secure the release of Israeli hostages held by Hamas.Palestinian Authority President Mahmoud Abbas highlighted the broader stakes of the conflict, urging international intervention to resolve the Palestinian question as a pathway to lasting peace.“The only way to halt the dangerous escalation... is to resolve the question of Palestine,” Abbas said in a speech to the UN.As the ceasefire takes effect, it offers a fragile respite, but the region’s deeper tensions remain far from resolved.",
  "image": "https://static.toiimg.com/thumb/msid-115710914,width-1070,height-580,imgsize-57250,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003csection\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-115710914,imgsize-57250,width-400,resizemode-4/115710914.jpg\" alt=\"Israel-Hezbollah ceasefire: What it means for Lebanon’s future\" title=\"In this screen grab image from video provide by the Israeli Government Press Office, Israeli Prime Minister Benjamin Netanyahu makes a televised statement . (AP)\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan title=\"In this screen grab image from video provide by the Israeli Government Press Office, Israeli Prime Minister Benjamin Netanyahu makes a televised statement . (AP)\"\u003eIn this screen grab image from video provide by the Israeli Government Press Office, Israeli Prime Minister Benjamin Netanyahu makes a televised statement . (AP)\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003cp\u003eA US-brokered ceasefire between Israel and Lebanon’s Hezbollah has gained the backing of Israeli leaders, signaling a possible end to more than a year of cross-border fighting. Hezbollah leaders have also shown tentative support for the deal, marking a critical juncture in the conflict that has displaced millions and killed thousands.\u003cbr/\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eTerms of the agreement\u003c/span\u003e\u003cbr/\u003eThe ceasefire, set to begin at 4 am Wednesday local time, includes a 60-day halt in hostilities. Israeli troops will retreat from southern Lebanon, while Hezbollah is expected to withdraw its fighters north of the Litani River. Thousands of Lebanese soldiers and UN peacekeepers are to be deployed in the region to ensure compliance.\u003cbr/\u003ePresident Joe Biden described the deal as a “permanent cessation of hostilities,” with an international panel, led by the US, overseeing its implementation. However, Israel insists on maintaining the right to act should Hezbollah breach the terms. Israeli Defense Minister Israel Katz warned of military action if UN forces fail to enforce the agreement effectively.\u003c/p\u003e\u003cp\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eHezbollah’s conditional support\u003c/span\u003e\u003cbr/\u003eHezbollah’s deputy political leader, Mahmoud Qamati, expressed cautious optimism, emphasizing the need for clarity and assurances from Israel. “We want an end to the aggression, of course, but not at the expense of the sovereignty of the state of Lebanon,” Qamati told Al Jazeera.\u003cbr/\u003eThe European Union\u0026#39;s foreign policy chief, Josep Borrell, noted that the deal addresses Israel’s security concerns while offering a path to de-escalation.\u003c/p\u003e\u003cp\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eImpact of the fighting\u003c/span\u003e\u003cbr/\u003eThe conflict has taken a heavy toll. Israeli airstrikes killed over 3,700 Lebanese, many civilians, while Hezbollah’s rockets displaced tens of thousands in Israel. The militant group suffered significant losses, including the assassination of its leader, Hassan Nasrallah, and other top commanders.\u003cbr/\u003eFor Israel, the ceasefire offers a reprieve for its military, which remains engaged in Gaza. Hezbollah, despite its resistance, faces scrutiny for linking Lebanon’s fate to Gaza and exacerbating its already dire economic crisis.\u003cbr/\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eGaza conflict\u003c/span\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e remains unresolved\u003c/span\u003e\u003cbr/\u003eDespite the agreement, the situation in Gaza remains dire. Hezbollah’s initial involvement was tied to Hamas’ October 2023 attack on Israel, which triggered the war in Gaza. Israel’s continued military campaign in Gaza has killed over 44,000 Palestinians but has yet to secure the release of Israeli hostages held by Hamas.\u003cbr/\u003ePalestinian Authority President Mahmoud Abbas highlighted the broader stakes of the conflict, urging international intervention to resolve the Palestinian question as a pathway to lasting peace.\u003cbr/\u003e“The only way to halt the dangerous escalation... is to resolve the question of Palestine,” Abbas said in a speech to the UN.\u003cbr/\u003eAs the ceasefire takes effect, it offers a fragile respite, but the region’s deeper tensions remain far from resolved.\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-27T04:13:00+05:30",
  "modifiedTime": null
}
