{
  "id": "014ca577-ec9a-46f9-bbfe-f4fa3cb8d762",
  "title": "Germany's fiscal U-turn could be a 'game changer' for the country's sluggish economy, analysts say",
  "link": "https://www.cnbc.com/2025/03/05/germanys-fiscal-u-turn-could-be-a-game-changer-for-the-countrys-sluggish-economy-analysts-say.html",
  "description": "Leaders of the likely incoming coalition government announced plans to reform the debt brake and create a special investment fund.",
  "author": "",
  "published": "Wed, 05 Mar 2025 16:37:34 GMT",
  "source": "https://www.cnbc.com/id/100727362/device/rss/rss.html",
  "categories": null,
  "byline": "Sophie Kiderlin",
  "length": 6939,
  "excerpt": "Leaders of the likely incoming coalition government announced plans to reform the debt brake and create a special investment fund.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "Markus Söder (l-r), Chairman of the CSU and Minister President of Bavaria, Friedrich Merz, candidate for Chancellor of the CDU/CSU, Chairman of the CDU/CSU parliamentary group and Federal Chairman of the CDU, Lars Klingbeil, Chairman of the SPD parliamentary group and Federal Chairman of the SPD, and Saskia Esken, Party Chairwoman of the SPD, hold a press conference on the exploratory talks between the CDU/CSU and the SPD.Kay Nietfeld/dpa | Picture Alliance | Getty ImagesGermany's prospective fiscal U-turn could prove transformational for the country's struggling economy and for European defense — but Berlin lawmakers don't have much time to make the historic shift happen.Fiscal and economic policies were seen as highly contentious during Germany's previous ruling coalition and contributed to its eventual break-up at the end of last year. Amid ongoing negotiations for a new governing alliance, the Christian Democratic Union and its Christian Social Union affiliate — which led in the February polls — and the Social Democratic Party appear to have achieved something of a breakthrough.On Tuesday, likely-to-be chancellor Friedrich Merz and other political leaders announced plans to reform the long standing fiscal pillar known as Germany's debt brake, specifically to allow for higher defense spending. They also revealed a new 500 billion euros ($535 billion) special fund for infrastructure.Materializing these plans will mean changes to the German constitution, which requires the support of a two-thirds majority in parliament. This would likely work at present — but would be very difficult to achieve once the newly elected parliament representatives come together for the first time later this month.A vote on the constitutional tweaks could therefore be pushed through within the week.'Big, bold, unexpected — a game changer'\"Big, bold, unexpected - a game changer for the outlook,\" Bank of America Global Research economists and analysts said in a Wednesday note, adding that the package \"meaningfully\" changed the outlook for Germany's economy.For a couple of years now, Germany's economy has been sluggishly teetering on the edge of a technical recession, defined as two consecutive quarters of gross domestic product declines. The national GDP has been alternating between expansion and contraction in each quarter throughout 2023 and 2024.The country is facing a wide range of issues, including infrastructure problems, a struggling housebuilding sector and pressure on some of the industries that have historically strongly contributed to its growth, such as autos.There is now hope for change. The planned special investment vehicle could benefit the country's economy, experts believe.Markets can expect an economic boost and Germany's growth estimates could likely be increased, Florian Schuster-Johnson, senior economist at Dezernat Zukunft, told CNBC's \"Street Signs Europe\" on Wednesday.\"I think in the short term this will just boost domestic demand obviously because there will be a lot of demand for people building these new infrastructures and companies that [are] getting new government orders now,\" he said.Higher defense spending could also have a long-term effect on the economy, leading to increased production capacities that could eventually also come into civil use, Schuster-Johnson added.It could push Germany above the current NATO target of spending 2% of GDP on defense, Deutsche Bank Research economists said Tuesday.\"Tonight's robust rhetoric implies that the open-ended borrowing room for defence will be used at a pace that could bring German defence spending to at least 3% perhaps as early as next year,\" they said.Merz suggested that geopolitical developments showed that major measures need to be taken to strengthen Germany's and Europe's security and defense capabilities.\"In light of the threats to our freedom and peace on our continent, 'whatever it takes' now also needs to apply to our defense,\" he added, according to a CNBC translation.While the policy announcements would largely be beneficial, other fiscal and budget plans from the likely new coalition are still to come and could have their own impact on Germany's economy, ING's global head of macro Carsten Brzeski noted.\"We wouldn't rule out that the official coalition talks will still bring some expenditure cuts, which would lower the positive impact of the announced fiscal stimulus,\" he said.Elsewhere, lawmaker Bernd Baumann who is part of the German far-right party Alternative fuer Deutschland, told Reuters that the party was conducting an initial legal review of the announcement, and reserved the right to take action.Policy detailsGoing over the details, the 500 billion euro special investment fund will not be part of the federal budget, but it will be financed through credit without contributing to new debt. The funds are set to be used over 10 years, focusing on transport, energy, education, civil protection and other infrastructure. Federal states will also be allocated some of the funds to support their finances.To avoid the cash being subject to the debt brake, the fund will be rooted in the constitution and exempted from the fiscal rule.As it stands, the debt brake limits how much debt the government can take on, and dictates that the size of the federal government's structural budget deficit must not exceed 0.35% of the country's annual GDP.One key change under the new plan is that defense spending that goes beyond 1% of Germany's GDP will not be counted towards the debt brake cap, meaning that such expenses will no longer be limited.Germany's states will also be allowed to take on more debt than previously, and long-term proposals to modernize the debt brake and strengthen investments will also be undertaken.The proposed debt brake overhaul also mark a major shift from the CDU-CSU's election campaign, during which the parties repeatedly positioned themselves as wanting to stick with the Angela Merkel-era rule. Merz eventually suggested he may be open to some reform.Market reactionThe plans have sparked a widespread market reaction, with the German DAX jumping 3.4% by 12:51 p.m. London time, as German companies led the pan-European Stoxx 600 higher. Construction and manufacturing firms notched significant gains, as did German lenders.German borrowing costs soared. The yield on German 10-year bonds, which are seen as the euro zone benchmark, were last up by over 25 basis points, and the 2-year yield spiked by more than 16 basis points.Dezernat Zukunft's Schuster-Johnson told CNBC the market reaction suggested surprise at the pace and magnitude of the proposed changes.\"The bottom line is Germany is back and Germany is funded,\" he said. \"This move we've seen last night is really remarkable. you know Germans sometimes move late and sometimes delayed when big steps are needed however this is a big step and when they take it they do it so very radically.\"",
  "image": "https://image.cnbcfm.com/api/v1/image/108111115-1741173784704-gettyimages-2202711843-20090101250304-99-116602.jpeg?v=1741173817\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108111115\" data-test=\"InlineImage\"\u003e\u003cp\u003eMarkus Söder (l-r), Chairman of the CSU and Minister President of Bavaria, Friedrich Merz, candidate for Chancellor of the CDU/CSU, Chairman of the CDU/CSU parliamentary group and Federal Chairman of the CDU, Lars Klingbeil, Chairman of the SPD parliamentary group and Federal Chairman of the SPD, and Saskia Esken, Party Chairwoman of the SPD, hold a press conference on the exploratory talks between the CDU/CSU and the SPD.\u003c/p\u003e\u003cp\u003eKay Nietfeld/dpa | Picture Alliance | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eGermany\u0026#39;s prospective fiscal U-turn could prove transformational for the country\u0026#39;s struggling economy and for European defense — but Berlin lawmakers don\u0026#39;t have much time to make the historic shift happen.\u003c/p\u003e\u003cp\u003eFiscal and economic policies were seen as highly contentious during Germany\u0026#39;s previous ruling coalition and contributed to its eventual \u003ca href=\"https://www.cnbc.com/2024/11/06/german-chancellor-olaf-scholz-fires-finance-minister-christian-lindner.html\"\u003ebreak-up\u003c/a\u003e at the end of last year. Amid ongoing negotiations for a new governing alliance, the Christian Democratic Union and its Christian Social Union affiliate — which led in the February polls — and the Social Democratic Party appear to have achieved something of a breakthrough.\u003c/p\u003e\u003cp\u003eOn Tuesday, likely-to-be chancellor \u003ca href=\"https://www.cnbc.com/2025/02/20/who-is-friedrich-merz-the-favorite-to-become-germanys-new-chancellor.html\"\u003eFriedrich Merz\u003c/a\u003e and other political leaders announced plans to reform the long standing fiscal pillar known as Germany\u0026#39;s \u003ca href=\"https://www.cnbc.com/2024/11/22/the-debt-brake-rule-that-helped-collapse-germanys-government.html\"\u003edebt brake,\u003c/a\u003e specifically to allow for higher defense spending. They also revealed a new 500 billion euros ($535 billion) special fund for infrastructure.\u003c/p\u003e\u003cp\u003eMaterializing these plans will mean changes to the German constitution, which requires the support of a two-thirds majority in parliament. This would likely work at present — but would be very difficult to achieve once the newly elected parliament representatives come together for the first time later this month.\u003c/p\u003e\u003cp\u003eA vote on the constitutional tweaks could therefore be pushed through within the week.\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline0\"\u003e\u003c/a\u003e\u0026#39;Big, bold, unexpected — a game changer\u0026#39;\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003e\u0026#34;Big, bold, unexpected - a game changer for the outlook,\u0026#34; Bank of America Global Research economists and analysts said in a Wednesday note, adding that the package \u0026#34;meaningfully\u0026#34; changed the outlook for Germany\u0026#39;s economy.\u003c/p\u003e\u003cp\u003eFor a couple of years now, Germany\u0026#39;s economy has been sluggishly teetering on the edge of a technical recession, defined as two consecutive quarters of gross domestic product declines. The national GDP has been alternating between expansion and contraction in each quarter throughout 2023 and 2024.\u003c/p\u003e\u003cp\u003eThe country is facing a wide range of issues, including infrastructure problems, a struggling housebuilding sector and pressure on some of the industries that have historically strongly contributed to its growth, such as autos.\u003c/p\u003e\u003cp\u003eThere is now hope for change. The planned special investment vehicle could benefit the country\u0026#39;s economy, experts believe.\u003c/p\u003e\u003cp\u003eMarkets can expect an economic boost and Germany\u0026#39;s growth estimates could likely be increased, Florian Schuster-Johnson, senior economist at Dezernat Zukunft, told CNBC\u0026#39;s \u0026#34;Street Signs Europe\u0026#34; on Wednesday.\u003c/p\u003e\u003cp\u003e\u0026#34;I think in the short term this will just boost domestic demand obviously because there will be a lot of demand for people building these new infrastructures and companies that [are] getting new government orders now,\u0026#34; he said.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108111325\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000368642\" aria-labelledby=\"Placeholder-ArticleBody-Video-108111325\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108111326-17411910171741191012-38753750769-1080pnbcnews.jpg?v=1741191016\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"Proposal for fiscal shift in Germany is \u0026#39;remarkable,\u0026#39; economist says\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eHigher defense spending could also have a long-term effect on the economy, leading to increased production capacities that could eventually also come into civil use, Schuster-Johnson added.\u003c/p\u003e\u003cp\u003eIt could push Germany above the current NATO target of spending 2% of GDP on defense, Deutsche Bank Research economists said Tuesday.\u003c/p\u003e\u003cp\u003e\u0026#34;Tonight\u0026#39;s robust rhetoric implies that the open-ended borrowing room for defence will be used at a pace that could bring German defence spending to at least 3% perhaps as early as next year,\u0026#34; they said.\u003c/p\u003e\u003cp\u003eMerz suggested that geopolitical developments showed that major measures need to be taken to strengthen Germany\u0026#39;s and Europe\u0026#39;s security and defense capabilities.\u003c/p\u003e\u003cp\u003e\u0026#34;In light of the threats to our freedom and peace on our continent, \u0026#39;whatever it takes\u0026#39; now also needs to apply to our defense,\u0026#34; he added, according to a CNBC translation.\u003c/p\u003e\u003cp\u003eWhile the policy announcements would largely be beneficial, other fiscal and budget plans from the likely new coalition are still to come and could have their own impact on Germany\u0026#39;s economy, ING\u0026#39;s global head of macro Carsten Brzeski noted.\u003c/p\u003e\u003cp\u003e\u0026#34;We wouldn\u0026#39;t rule out that the official coalition talks will still bring some expenditure cuts, which would lower the positive impact of the announced fiscal stimulus,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eElsewhere, lawmaker Bernd Baumann who is part of the German far-right party Alternative fuer Deutschland, told Reuters that the party was conducting an initial legal review of the announcement, and reserved the right to take action.\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline1\"\u003e\u003c/a\u003ePolicy details\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003eGoing over the details, the 500 billion euro special investment fund will not be part of the federal budget, but it will be financed through credit without contributing to new debt. The funds are set to be used over 10 years, focusing on transport, energy, education, civil protection and other infrastructure. Federal states will also be allocated some of the funds to support their finances.\u003c/p\u003e\u003cp\u003eTo avoid the cash being subject to the debt brake, the fund will be rooted in the constitution and exempted from the fiscal rule.\u003c/p\u003e\u003cp\u003eAs it stands, the debt brake limits how much debt the government can take on, and dictates that the size of the federal government\u0026#39;s structural budget deficit must not exceed 0.35% of the country\u0026#39;s annual GDP.\u003c/p\u003e\u003cp\u003eOne key change under the new plan is that defense spending that goes beyond 1% of Germany\u0026#39;s GDP will not be counted towards the debt brake cap, meaning that such expenses will no longer be limited.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108106182\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000367485\" aria-labelledby=\"Placeholder-ArticleBody-Video-108106182\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108106183-17403829581740382955-38604670476-1080pnbcnews.jpg?v=1740382957\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"German \u0026#39;debt brake\u0026#39; rule remains the elephant in the room after election: ING\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eGermany\u0026#39;s states will also be allowed to take on more debt than previously, and long-term proposals to modernize the debt brake and strengthen investments will also be undertaken.\u003c/p\u003e\u003cp\u003eThe proposed debt brake overhaul also mark a major shift from the CDU-CSU\u0026#39;s election campaign, during which the parties repeatedly positioned themselves as wanting to stick with the Angela Merkel-era rule. Merz eventually suggested he may be open to some reform.\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline2\"\u003e\u003c/a\u003eMarket reaction\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003eThe plans have sparked a widespread \u003ca href=\"https://www.cnbc.com/2025/03/05/european-markets-live-updates-stocks-news-earnings-and-data.html\"\u003emarket reaction\u003c/a\u003e, with the German \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-5\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/.GDAXI/\"\u003eDAX\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e jumping 3.4% by 12:51 p.m. London time, as German companies led the pan-European Stoxx 600 higher. Construction and manufacturing firms notched significant gains, as did German lenders.\u003c/p\u003e\u003cp\u003eGerman borrowing costs soared. The yield on German \u003ca href=\"https://www.cnbc.com/quotes/DE10Y-DE\"\u003e10-year bonds\u003c/a\u003e, which are seen as the euro zone benchmark, were last up by over 25 basis points, and the \u003ca href=\"https://www.cnbc.com/quotes/DE2Y-DE\"\u003e2-year\u003c/a\u003e yield spiked by more than 16 basis points.\u003c/p\u003e\u003cp\u003eDezernat Zukunft\u0026#39;s Schuster-Johnson told CNBC the market reaction suggested surprise at the pace and magnitude of the proposed changes.\u003c/p\u003e\u003cp\u003e\u0026#34;The bottom line is Germany is back and Germany is funded,\u0026#34; he said. \u0026#34;This move we\u0026#39;ve seen last night is really remarkable. you know Germans sometimes move late and sometimes delayed when big steps are needed however this is a big step and when they take it they do it so very radically.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-03-05T13:04:44Z",
  "modifiedTime": "2025-03-05T16:37:34Z"
}
