{
  "id": "03a6c34c-89d9-47db-9c7b-8643530bfbba",
  "title": "Iran's President to Trump: I will not negotiate, 'do whatever the hell you want'",
  "link": "https://www.yahoo.com/news/irans-president-trump-not-negotiate-174849201.html",
  "description": "",
  "author": "",
  "published": "2025-03-11T17:48:49Z",
  "source": "https://www.yahoo.com/news/rss",
  "categories": null,
  "byline": "Parisa Hafezi",
  "length": 1548,
  "excerpt": "(Reuters) -President Masoud Pezeshkian said Iran would not negotiate with the U.S. while being threatened, telling President Donald Trump to \"do whatever the...",
  "siteName": "Yahoo News",
  "favicon": "",
  "text": "By Parisa Hafezi(Reuters) -President Masoud Pezeshkian said Iran would not negotiate with the U.S. while being threatened, telling President Donald Trump to \"do whatever the hell you want\", Iranian state media reported on Tuesday.\"It is unacceptable for us that they (the U.S.) give orders and make threats. I won’t even negotiate with you. Do whatever the hell you want\", state media quoted Pezeshkian as saying.Iran's Supreme Leader Ayatollah Ali Khamenei said on Saturday that Tehran would not be bullied into negotiations, a day after Trump said he had sent a letter urging Iran to engage in talks on a new nuclear deal.While expressing openness to a deal with Tehran, Trump has reinstated the \"maximum pressure\" campaign he applied in his first term as president to isolate Iran from the global economy and drive its oil exports down towards zero.In an interview with Fox Business, Trump said last week, \"There are two ways Iran can be handled: militarily, or you make a deal\" to prevent Tehran from acquiring nuclear weapons.Iran has long denied wanting to develop a nuclear weapon. However, it is \"dramatically\" accelerating enrichment of uranium to up to 60% purity, close to the roughly 90% weapons-grade level, the IAEA has warned.Iran has accelerated its nuclear work since 2019, a year after then-President Trump ditched Tehran's 2015 nuclear pact with six world powers and reimposed sanctions that have crippled the country's economy.(Additional reporting by Jaidaa Ahmad Writing and reporting by Parisa Hafezi; Editing by Hugh Lawson)",
  "image": "https://media.zenfs.com/en/reuters.com/b939cda3b9ade52b9703299527756690",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-article-body=\"true\"\u003e\u003cp\u003eBy Parisa Hafezi\u003c/p\u003e\u003cp\u003e(Reuters) -President Masoud Pezeshkian said Iran would not negotiate with the U.S. while being threatened, telling President Donald Trump to \u0026#34;do whatever the hell you want\u0026#34;, Iranian state media reported on Tuesday.\u003c/p\u003e\u003cp\u003e\u0026#34;It is unacceptable for us that they (the U.S.) give orders and make threats. I won’t even negotiate with you. Do whatever the hell you want\u0026#34;, state media quoted Pezeshkian as saying.\u003c/p\u003e\u003cp\u003eIran\u0026#39;s Supreme Leader Ayatollah Ali Khamenei said on Saturday that Tehran would not be bullied into negotiations, a day after Trump said he had sent a letter urging Iran to engage in talks on a new nuclear deal.\u003c/p\u003e\u003cp\u003eWhile expressing openness to a deal with Tehran, Trump has reinstated the \u0026#34;maximum pressure\u0026#34; campaign he applied in his first term as president to isolate Iran from the global economy and drive its oil exports down towards zero.\u003c/p\u003e\u003cp\u003eIn an interview with Fox Business, Trump said last week, \u0026#34;There are two ways Iran can be handled: militarily, or you make a deal\u0026#34; to prevent Tehran from acquiring nuclear weapons.\u003c/p\u003e\u003cp\u003eIran has long denied wanting to develop a nuclear weapon. However, it is \u0026#34;dramatically\u0026#34; accelerating enrichment of uranium to up to 60% purity, close to the roughly 90% weapons-grade level, the IAEA has warned.\u003c/p\u003e\u003cp\u003eIran has accelerated its nuclear work since 2019, a year after then-President Trump ditched Tehran\u0026#39;s 2015 nuclear pact with six world powers and reimposed sanctions that have crippled the country\u0026#39;s economy.\u003c/p\u003e\u003cp\u003e(Additional reporting by Jaidaa Ahmad Writing and reporting by Parisa Hafezi; Editing by Hugh Lawson)\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-03-11T17:48:49Z",
  "modifiedTime": null
}
