{
  "id": "06096b90-cae5-47d3-9c58-2e878455f37d",
  "title": "Vigil held in Graz, Austria as school shooting death toll rises to 11",
  "link": "https://www.bbc.com/news/articles/ced27g4e6xwo",
  "description": "Victim injured in attack dies in hospital, while police say the gunman, a former student, took his life after shooting",
  "author": "",
  "published": "Wed, 11 Jun 2025 01:06:42 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Nick Thorpe",
  "length": 6472,
  "excerpt": "Victim injured in attack dies in hospital, while police say the gunman, a former student, took his life after shooting",
  "siteName": "BBC News",
  "favicon": "https://static.files.bbci.co.uk/bbcdotcom/web/20250529-103858-de9d27ef1-web-2.22.3-1/apple-touch-icon.png",
  "text": "Vigil held in Graz, Austria as school shooting death toll rises to 11 Nick ThorpeCentral Europe CorrespondentReporting fromGraz, AustriaWatch: Tearful Graz residents light candles at Austrian school shooting vigilResidents of the Austrian city of Graz held a candlelight vigil on Tuesday night for victims of a school shooting in which 10 people were killed. The gun attack is the deadliest in the country's recent history.Police said the 21-year-old gunman, a former student, took his own life in a school bathroom shortly after. The incident took place at Dreierschützengasse secondary school in the north-west of the city. Nine people were killed during the attack, said Interior Minister Gerhard Karner. A further 12 people were injured, some seriously, according to police.Later on Tuesday, local media reported an injured female had died in hospital, bringing the number of victims killed to 10.At the vigil, Graz residents said they wanted to turn the city's main square into a sea of candles, and that is what they did. In the whispering silence, thousands of mostly young people gathered over the course of the evening, alone or clutching the arms or shoulders of their friends. They lit candles, cried, or stood for a while in prayer or contemplation. Then they slowly came forward to hand candles to volunteers who arranged them carefully on the steps of the fountain.The Archbishop Johann fountain is known as the heart of the old town of Graz, in front of the city hall. On Tuesday night it became a symbol of the grief, and solidarity, of the people of Austria.\"When you hear about it, you have so much sympathy for the people, maybe you could have known someone,\" Felix Platzer, a passerby at the vigil, told the Reuters news agency. \"This is an example of solidarity and you grieve together and together it is easier to cope,\" he added.Three days of mourningThree days of mourning have been declared in Austria, and a nationwide minute's silence will be held on Wednesday at 10:00 local time in memory of the victims.Flags on the Hofburg Palace in Vienna, where the President Alexander Van der Bellen has his office, will fly at half mast.The school where the attack took place will remain closed until further notice, according to Austria's Education Minister Christoph Wiederkehr.The Austrian Chancellor Christian Stocker said Tuesday was a \"dark day in [the] history of our country\" and declared the shooting a \"national tragedy\".\"A school is more than just a place to learn - it is a space for trust, for feeling comfortable and for having a future,\" he told the conference, adding this safe place had been \"violated\".\"In these difficult hours, being human is our strongest point,\" he said.Austria's APA news agency has reported that seven of those killed were pupils. The attack \"strikes our country right at its heart\", Stocker said in the immediate aftermath.\"These were young people who had their whole lives ahead of them.\"Gunman was former studentThe gunman, who has not yet been named, was a former Dreierschützengasse student who didn't graduate from the school, Karner told a news conference on Tuesday afternoon.Six females and three males were killed in the attack, and a fourth female died later in hospital. There has been a lot of speculation about the case, Karner noted, adding it is now the job of the criminal office to investigate.In the same conference, police said the gunman's motive was still under investigation.Officers also confirmed the gunman was not known to police before the attack. Current information suggests the shooter legally owned the two guns used in the attack and had a firearms licence, police added. Local media outlets have reported the suspect used a pistol and a shotgun to carry out the shooting.He was an Austrian man from the wider Graz region who acted alone, police said.Gunshots heard inside schoolGunshots heard and students evacuate in videos filmed at Austrian schoolPolice said they began an operation at 10:00 local time (09:00 BST) after gunshots were heard from inside the school. A specialist Cobra tactical unit - which handles attacks and hostage situations - was deployed to the school, police said.Authorities evacuated all pupils and teachers from the building. Police confirmed the school had been secured and there was no further danger posed to members of the public. \"Locally, we have seen people crying on the streets, talking to friends that have been at the school when the shooting happened, who have maybe lost a friend,\" said Fanny Gasser, a journalist for the Austrian daily newspaper Kronen Zeitung.She told BBC News \"everybody knows somebody\" at the school because Graz - despite being the second-largest city in Austria - is \"not that big\".She said the school was likely unprepared for the possibility of an attack. \"We are not living in America, we are living in Austria, which seems like a very safe space.\"Local mayor Elke Kahr called the incident a \"terrible tragedy\".European Commission Vice-President Kaja Kallas said she was \"deeply shocked\" by the news. \"Every child should feel safe at school and be able to learn free from fear and violence,\" she posted on X. Witnesses heard gunshotsAstrid, a woman living with her husband Franz in the ground floor flat of the residential building next to the school, told the BBC she had just finished hanging out the washing when she heard gunfire. She said: \"I heard shots. Lots of them, one after the other. 'Poof... poof... poof…. poof… poof…' again and again. I went into the flat to my husband and I told him: 'Someone is shooting!' \"He thought it was maybe something else, but we heard I reckon 30 to 40 shots. Then my husband rang the police.\"\"We saw one pupil at the window - it looked like he was getting ready to jump out... but then he went back inside,\" Franz said, adding they also saw a teacher.The pair later saw the students had \"got out of the school on the ground floor, from the other side\" where they \"gathered on the street\", Franz said.Queues to give bloodBy Tuesday afternoon, long queues had formed outside a blood donation centre in Graz.\"Today is a hard day for all of us in Graz. I'm here to [donate] my blood to help other people who need it,\" 25-year-old Stephanie Koenig told Reuters news agency.\"Today I'm here because I wanted to do something. I felt helpless with the news,\" Johanna, 30, said.Another person standing in line told Reuters giving blood felt like the \"only way possible to help\".",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/37f4/live/368dc3c0-4625-11f0-84b6-6bf0f66205f1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cp data-component=\"headline-block\"\u003e\u003ch2\u003eVigil held in Graz, Austria as school shooting death toll rises to 11 \u003c/h2\u003e\u003c/p\u003e\u003cdiv data-testid=\"byline-new\" data-component=\"byline-block\"\u003e\u003cp\u003e\u003cspan\u003eNick Thorpe\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eCentral Europe Correspondent\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eReporting from\u003csvg viewBox=\"0 0 32 32\" width=\"1em\" height=\"1em\" category=\"personalisation\" icon=\"location\"\u003e\u003cpath d=\"M12.3 11c0 2.1 1.7 3.7 3.7 3.7s3.7-1.7 3.7-3.7-1.6-3.7-3.7-3.7S12.3 9 12.3 11zm2.9 20c-3-4.4-5.6-8.5-7.3-12.1-1.5-3-2.1-5.6-2.1-7.9C5.7 5.5 10.1 1 16 1s10.3 4.6 10.3 10c0 2.3-.7 4.9-2.1 7.9-1.7 3.6-4.3 7.7-7.3 12.1h-1.7z\"\u003e\u003c/path\u003e\u003c/svg\u003eGraz, Austria\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eWatch: Tearful Graz residents light candles at Austrian school shooting vigil\u003c/figcaption\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eResidents of the Austrian city of Graz held a candlelight vigil on Tuesday night for victims of a school shooting in which 10 people were killed. The gun attack is the deadliest in the country\u0026#39;s recent history.\u003c/p\u003e\u003cp\u003ePolice said the 21-year-old gunman, a former student, took his own life in a school bathroom shortly after. \u003c/p\u003e\u003cp\u003eThe incident took place at Dreierschützengasse secondary school in the north-west of the city. \u003c/p\u003e\u003cp\u003eNine people were killed during the attack, said Interior Minister Gerhard Karner. A further 12 people were injured, some seriously, according to police.\u003c/p\u003e\u003cp\u003eLater on Tuesday, local media reported an injured female had died in hospital, bringing the number of victims killed to 10.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAt the vigil, Graz residents said they wanted to turn the city\u0026#39;s main square into a sea of candles, and that is what they did. \u003c/p\u003e\u003cp\u003eIn the whispering silence, thousands of mostly young people gathered over the course of the evening, alone or clutching the arms or shoulders of their friends. They lit candles, cried, or stood for a while in prayer or contemplation. \u003c/p\u003e\u003cp\u003eThen they slowly came forward to hand candles to volunteers who arranged them carefully on the steps of the fountain.\u003c/p\u003e\u003cp\u003eThe Archbishop Johann fountain is known as the heart of the old town of Graz, in front of the city hall. On Tuesday night it became a symbol of the grief, and solidarity, of the people of Austria.\u003c/p\u003e\u003cp\u003e\u0026#34;When you hear about it, you have so much sympathy for the people, maybe you could have known someone,\u0026#34; Felix Platzer, a passerby at the vigil, told the Reuters news agency. \u003c/p\u003e\u003cp\u003e\u0026#34;This is an example of solidarity and you grieve together and together it is easier to cope,\u0026#34; he added.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2\u003eThree days of mourning\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThree days of mourning have been declared in Austria, and a nationwide minute\u0026#39;s silence will be held on Wednesday at 10:00 local time in memory of the victims.\u003c/p\u003e\u003cp\u003eFlags on the Hofburg Palace in Vienna, where the President Alexander Van der Bellen has his office, will fly at half mast.\u003c/p\u003e\u003cp\u003eThe school where the attack took place will remain closed until further notice, according to Austria\u0026#39;s Education Minister Christoph Wiederkehr.\u003c/p\u003e\u003cp\u003eThe Austrian Chancellor Christian Stocker said Tuesday was a \u0026#34;dark day in [the] history of our country\u0026#34; and declared the shooting a \u0026#34;national tragedy\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;A school is more than just a place to learn - it is a space for trust, for feeling comfortable and for having a future,\u0026#34; he told the conference, adding this safe place had been \u0026#34;violated\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;In these difficult hours, being human is our strongest point,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eAustria\u0026#39;s APA news agency has reported that seven of those killed were pupils. \u003c/p\u003e\u003cp\u003eThe attack \u0026#34;strikes our country right at its heart\u0026#34;, Stocker said in the immediate aftermath.\u003c/p\u003e\u003cp\u003e\u0026#34;These were young people who had their whole lives ahead of them.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2\u003eGunman was former student\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe gunman, who has not yet been named, was a former Dreierschützengasse student who didn\u0026#39;t graduate from the school, Karner told a news conference on Tuesday afternoon.\u003c/p\u003e\u003cp\u003eSix females and three males were killed in the attack, and a fourth female died later in hospital. \u003c/p\u003e\u003cp\u003eThere has been a lot of speculation about the case, Karner noted, adding it is now the job of the criminal office to investigate.\u003c/p\u003e\u003cp\u003eIn the same conference, police said the gunman\u0026#39;s motive was still under investigation.\u003c/p\u003e\u003cp\u003eOfficers also\u003cb id=\"\"\u003e \u003c/b\u003econfirmed the gunman was not known to police before the attack. \u003c/p\u003e\u003cp\u003eCurrent information suggests the shooter legally owned the two guns used in the attack and had a firearms licence, police added. \u003c/p\u003e\u003cp\u003eLocal media outlets have reported the suspect used a pistol and a shotgun to carry out the shooting.\u003c/p\u003e\u003cp\u003eHe was an Austrian man from the wider Graz region who acted alone, police said.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2\u003eGunshots heard inside school\u003c/h2\u003e\u003c/p\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eGunshots heard and students evacuate in videos filmed at Austrian school\u003c/figcaption\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003ePolice said they began an operation at 10:00 local time (09:00 BST) after gunshots were heard from inside the school. \u003c/p\u003e\u003cp\u003eA specialist Cobra tactical unit - which handles attacks and hostage situations - was deployed to the school, police said.\u003c/p\u003e\u003cp\u003eAuthorities evacuated all pupils and teachers from the building. Police confirmed the school had been secured and there was no further danger posed to members of the public. \u003c/p\u003e\u003cp\u003e\u0026#34;Locally, we have seen people crying on the streets, talking to friends that have been at the school when the shooting happened, who have maybe lost a friend,\u0026#34; said Fanny Gasser, a journalist for the Austrian daily newspaper Kronen Zeitung.\u003c/p\u003e\u003cp\u003eShe told BBC News \u0026#34;everybody knows somebody\u0026#34; at the school because Graz - despite being the second-largest city in Austria - is \u0026#34;not that big\u0026#34;.\u003c/p\u003e\u003cp\u003eShe said the school was likely unprepared for the possibility of an attack. \u0026#34;We are not living in America, we are living in Austria, which seems like a very safe space.\u0026#34;\u003c/p\u003e\u003cp\u003eLocal mayor Elke Kahr called the incident a \u0026#34;terrible tragedy\u0026#34;.\u003c/p\u003e\u003cp\u003eEuropean Commission Vice-President Kaja Kallas said she was \u0026#34;deeply shocked\u0026#34; by the news. \u0026#34;Every child should feel safe at school and be able to learn free from fear and violence,\u0026#34; she posted on X. \u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2\u003eWitnesses heard gunshots\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAstrid, a woman living with her husband Franz in the ground floor flat of the residential building next to the school, told the BBC she had just finished hanging out the washing when she heard gunfire. \u003c/p\u003e\u003cp\u003eShe said: \u0026#34;I heard shots. Lots of them, one after the other. \u0026#39;Poof... poof... poof…. poof… poof…\u0026#39; again and again. I went into the flat to my husband and I told him: \u0026#39;Someone is shooting!\u0026#39; \u003c/p\u003e\u003cp\u003e\u0026#34;He thought it was maybe something else, but we heard I reckon 30 to 40 shots. Then my husband rang the police.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;We saw one pupil at the window - it looked like he was getting ready to jump out... but then he went back inside,\u0026#34; Franz said, adding they also saw a teacher.\u003c/p\u003e\u003cp\u003eThe pair later saw the students had \u0026#34;got out of the school on the ground floor, from the other side\u0026#34; where they \u0026#34;gathered on the street\u0026#34;, Franz said.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250529-103858-de9d27ef1-web-2.22.3-1/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/1a62/live/62fc71d0-45f9-11f0-835b-310c7b938e84.png.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/1a62/live/62fc71d0-45f9-11f0-835b-310c7b938e84.png.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/1a62/live/62fc71d0-45f9-11f0-835b-310c7b938e84.png.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/1a62/live/62fc71d0-45f9-11f0-835b-310c7b938e84.png.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/1a62/live/62fc71d0-45f9-11f0-835b-310c7b938e84.png.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/1a62/live/62fc71d0-45f9-11f0-835b-310c7b938e84.png.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/1a62/live/62fc71d0-45f9-11f0-835b-310c7b938e84.png.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/1a62/live/62fc71d0-45f9-11f0-835b-310c7b938e84.png.webp\" loading=\"eager\" alt=\"Map showing the location of the school \"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2\u003eQueues to give blood\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eBy Tuesday afternoon, long queues had formed outside a blood donation centre in Graz.\u003c/p\u003e\u003cp\u003e\u0026#34;Today is a hard day for all of us in Graz. I\u0026#39;m here to [donate] my blood to help other people who need it,\u0026#34; 25-year-old Stephanie Koenig told Reuters news agency.\u003c/p\u003e\u003cp\u003e\u0026#34;Today I\u0026#39;m here because I wanted to do something. I felt helpless with the news,\u0026#34; Johanna, 30, said.\u003c/p\u003e\u003cp\u003eAnother person standing in line told Reuters giving blood felt like the \u0026#34;only way possible to help\u0026#34;.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-06-10T11:34:15.876Z",
  "modifiedTime": "2025-06-11T01:06:42.756Z"
}
