{
  "id": "0ee4ced0-fe66-4dc9-a9f5-a18ba6ebb20b",
  "title": "North Korea's Kim Accuses US Of Escalating Tensions, Warns Of Nuclear War",
  "link": "https://www.ndtv.com/world-news/north-koreas-kim-accuses-us-of-escalating-tensions-warns-of-nuclear-war-7075865",
  "description": "North Korean leader Kim Jong Un has accused the United States of ramping up tension and provocations, saying the Korean peninsula has never faced such risks of nuclear war as now, state media KCNA said on Friday.",
  "author": "",
  "published": "Fri, 22 Nov 2024 04:39:59 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "Reuters",
  "length": 2393,
  "excerpt": "North Korean leader Kim Jong Un has accused the United States of ramping up tension and provocations, saying the Korean peninsula has never faced such risks of nuclear war as now, state media KCNA said on Friday.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Seoul: North Korean leader Kim Jong Un has accused the United States of ramping up tension and provocations, saying the Korean peninsula has never faced such risks of nuclear war as now, state media KCNA said on Friday.In a speech at a military exhibition on Thursday in Pyongyang, Kim said his previous experience of negotiations with Washington only highlighted its \"aggressive and hostile\" policy against Pyongyang, KCNA said.\"Never before have the warring parties on the Korean peninsula faced such a dangerous and acute confrontation that it could escalate into the most destructive thermonuclear war,\" Kim said, according to KCNA.\"We have already gone as far as we can on negotiating with the United States, but what we became certain of from the result is not the superpower's willingness to coexist, but its thorough stance of power and aggressive and hostile policy toward us that can never change.\"During US President-elect Donald Trump's first term, he and Kim held three unprecedented meetings in Singapore, Hanoi, and at the Korean border in 2018 and 2019.But their diplomacy failed to achieve any concrete outcome due to differences between US calls for North Korea to abandon its nuclear weapons and Kim's demands for sanctions relief.Trump has long touted his ties with Kim, saying last month that the two countries \"would've had a nuclear war with millions of people killed\" but he stopped it thanks to their relationship.North Korean state media has not yet publicly mentioned Trump's reelection.Kim, in the speech, called for developing and upgrading weaponry into \"ultra-modern ones\" and vowed to continue advancing defence capabilities to bolster the country's strategic position, KCNA said.The event, called the Defence Development Exhibition, featured strategic and tactical weapons.Kim's latest speech came amid international criticism over increasingly deepening military cooperation between Pyongyang and Moscow, with North Korea having sent more than 10,000 troops to Russia to support its war against Ukraine.Last week, Kim urged the country's military to improve capabilities for fighting a war, blaming the United States and its allies for stoking tension to \"the worst phase in history\" and calling the Korean peninsula \"the world's biggest hotspot.\"(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
  "image": "https://c.ndtvimg.com/2024-11/9oi94g6g_kim-jong-un_625x300_22_November_24.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                \u003cp\u003e\u003cb\u003eSeoul: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eNorth Korean leader Kim Jong Un has accused the United States of ramping up tension and provocations, saying the Korean peninsula has never faced such risks of nuclear war as now, state media KCNA said on Friday.\u003c/p\u003e\u003cp\u003eIn a speech at a military exhibition on Thursday in Pyongyang, Kim said his previous experience of negotiations with Washington only highlighted its \u0026#34;aggressive and hostile\u0026#34; policy against Pyongyang, KCNA said.\u003c/p\u003e\u003cp\u003e\u0026#34;Never before have the warring parties on the Korean peninsula faced such a dangerous and acute confrontation that it could escalate into the most destructive thermonuclear war,\u0026#34; Kim said, according to KCNA.\u003c/p\u003e\u003cp\u003e\u0026#34;We have already gone as far as we can on negotiating with the United States, but what we became certain of from the result is not the superpower\u0026#39;s willingness to coexist, but its thorough stance of power and aggressive and hostile policy toward us that can never change.\u0026#34;\u003c/p\u003e\u003cp\u003eDuring US President-elect Donald Trump\u0026#39;s first term, he and Kim held three unprecedented meetings in Singapore, Hanoi, and at the Korean border in 2018 and 2019.\u003c/p\u003e\u003cp\u003eBut their diplomacy failed to achieve any concrete outcome due to differences between US calls for North Korea to abandon its nuclear weapons and Kim\u0026#39;s demands for sanctions relief.\u003c/p\u003e\u003cp\u003eTrump has long touted his ties with Kim, saying last month that the two countries \u0026#34;would\u0026#39;ve had a nuclear war with millions of people killed\u0026#34; but he stopped it thanks to their relationship.\u003c/p\u003e\u003cp\u003eNorth Korean state media has not yet publicly mentioned Trump\u0026#39;s reelection.\u003c/p\u003e\u003cp\u003eKim, in the speech, called for developing and upgrading weaponry into \u0026#34;ultra-modern ones\u0026#34; and vowed to continue advancing defence capabilities to bolster the country\u0026#39;s strategic position, KCNA said.\u003c/p\u003e\u003cp\u003eThe event, called the Defence Development Exhibition, featured strategic and tactical weapons.\u003c/p\u003e\u003cp\u003eKim\u0026#39;s latest speech came amid international criticism over increasingly deepening military cooperation between Pyongyang and Moscow, with North Korea having sent more than 10,000 troops to Russia to support its war against Ukraine.\u003c/p\u003e\u003cp\u003eLast week, Kim urged the country\u0026#39;s military to improve capabilities for fighting a war, blaming the United States and its allies for stoking tension to \u0026#34;the worst phase in history\u0026#34; and calling the Korean peninsula \u0026#34;the world\u0026#39;s biggest hotspot.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                        \n                                        \n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-22T04:39:59+05:30",
  "modifiedTime": null
}
