{
  "id": "149e1f54-d821-4fc5-8a72-736f7d9a6c23",
  "title": "In Carts and on Foot, Gazans Make the Long Trek Home",
  "link": "https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza",
  "description": "Tens of thousands of Palestinians began arriving in northern Gaza, months after Israel ordered them out. The Israel-Hamas cease-fire was holding after faltering over the weekend.",
  "author": "The New York Times",
  "published": "Mon, 27 Jan 2025 21:57:22 +0000",
  "source": "https://rss.nytimes.com/services/xml/rss/nyt/World.xml",
  "categories": null,
  "byline": "Patrick Kingsley, Bilal Shbair, Mike Ives, Abu Bakr Bashir, Johnatan Reiss, Jeanna Smialek and Erika Solomon, Matthew Mpoke Bigg, Fatima AbdulKarim, Euan Ward, Maggie Haberman, Rawan Sheikh Ahmad, Hiba Yazbek, Maud Bodoukian, Isabel Kershner and Myra Noveck, Aaron Boxerman, Adam Rasgon, Nader Ibrahim, Isabel Kershner",
  "length": 40851,
  "excerpt": "Tens of thousands of Palestinians began arriving in northern Gaza, months after Israel ordered them out. The Israel-Hamas cease-fire was holding after faltering over the weekend.",
  "siteName": "The New York Times",
  "favicon": "https://www.nytimes.com/vi-assets/static-assets/ios-ipad-144x144-28865b72953380a40aa43318108876cb.png",
  "text": "Here’s the latest.Tens of thousands of displaced Palestinians were walking for hours toward their homes in northern Gaza on Monday, nearly 16 months after they had been ordered to move at the start of Israel’s military offensive. More than 300,000 Gazans had returned by Monday night from the southern and central parts of the enclave, the Hamas-run government media office said.The cease-fire between Israel and Hamas remained in place after it faltered over the weekend, but it was unclear what awaited Gazans once they returned home. As they began arriving in Gaza City, in the north of the territory, they confronted a wasteland of rubble, after the Israeli military destroyed whole neighborhoods and Hamas booby-trapped many buildings.A column of people stretching for miles marched north along Gaza’s coastal road, many carrying their few possessions on their heads, on makeshift carts and in plastic bags slung over their backs. Some used bikes, wheelchairs and trolleys to carry their belongings. One man attached wheels to a plastic box, turning it into a makeshift stroller for a baby.Many of those returning had spent the war sheltering in tents in other parts of the narrow territory, after Israel ordered roughly a million people to flee northern Gaza in October 2023 ahead of its military invasion and then prevented their return.On Monday, the militant group Palestinian Islamic Jihad published a video of Arbel Yehud, an Israeli hostage whose release was delayed though she was supposed to be among the first two groups of abductees freed on Jan. 19 and Jan. 25 during the first phase of the provisional cease-fire agreement between Israel and Hamas. The delay had been at the center of one of the most significant disputes between the two sides.Last weekend, Hamas released four female Israeli soldiers who were taken hostage on Oct. 7, 2023. Israel, in turn, handed over 200 Palestinian prisoners. But on Sunday, their week-old truce appeared to waver. Israel said it would delay the return of displaced people to northern Gaza, as required by the cease-fire agreement, partly because Hamas had reneged on the plan to release Ms. Yehud.After hours of tense negotiations, the sides reached an agreement late Sunday under which Hamas would hand over Ms. Yehud, along with other hostages, by the end of the week. In exchange, Israeli forces began allowing displaced Palestinians to move north on Monday morning.Here’s what else to know:Violence in Lebanon: Israeli forces opened fire for a second straight day as residents of southern Lebanon sought to return to their homes along the border, Lebanese officials said. At least two people were injured, officials said, after at least two dozen people were killed and scores injured in Israeli fire on Sunday. Israeli forces, who have warned against returning to border areas without their approval, have remained in southern Lebanon as a 60-day truce with the Lebanese militia Hezbollah was extended on Sunday until Feb. 18.Fragile truces: Though Israel’s cease-fires in Gaza and Lebanon were tested over the weekend, analysts said that all sides wanted to avoid full-scale fighting for now.Displaced Palestinians: President Trump told reporters that he would like Jordan and Egypt to take in more displaced Palestinians as part of an effort to “clean out” Gaza. Egypt and Jordan rejected the suggestion, saying the only way forward was Palestinian statehood.More than 300,000 Palestinians have returned to northern Gaza after being displaced to central and southern parts of the enclave, the Hamas-run government media office said on Monday. The figures were released hours after Israel began allowing Gazans to return. The Israeli military forced many thousands of Gazans from their homes in northern Gaza months ago.ImageCredit...Jehad Alshrafi/Associated PressPalestinian militant group releases video of civilian hostage held in Gaza.ImageA poster in Rishon LeZion, Israel, showing the portraits of Arbel Yehud, her brother, Dolev Yehud, and her partner, Ariel Cunio.Credit...Marco Longari/Agence France-Presse — Getty ImagesThe Palestinian Islamic Jihad on Monday released a video of the Israeli hostage Arbel Yehud, whose delayed release had been at the center of one of the most significant disputes between Israel and Hamas since a cease-fire took effect a week ago.Ms. Yehud is believed to be one of the last remaining female civilians held in Gaza since about 250 people were abducted during the Hamas-led attacks on Israel of Oct. 7, 2023.In the video footage, which an analysis by The New York Times dates to Jan. 25, she says, “My family, I’m OK. I miss you endlessly and I hope to return to you soon, like the girls who had been released.”Rights groups and international law experts have noted that, by definition, such hostage videos are made under duress, and that the statements in them are usually coerced.Or Moshe, a spokeswoman for the Hostage Families Forum, an umbrella organization representing the families of captives in Gaza, confirmed the footage was of Ms. Yehud, and said it was the first video of the hostage since she was taken from Nir Oz, a kibbutz in Israel, in 2023.Ms. Yehud was to be among the first two groups of hostages released on Jan. 19 and Jan. 25 during the first phase of the provisional cease-fire agreement, according to the Israeli authorities. Israel had demanded that its female civilians be released before captive female soldiers.Hamas released Karina Ariev, 20; Daniella Gilboa, 20; Naama Levy, 20; and Liri Albag, 19. All four were abducted from the military base near Gaza where they served. In exchange, Israel released hundreds of Palestinian prisoners. But not Ms. Yehud.The delay had stalled Israel’s expected withdrawal eastward along the Netzarim Corridor, an occupation zone in the Gaza Strip that Israel set up at the onset of the war. And the Israeli prime minister’s office had said Israel would not allow Gazans to pass to the north of the strip until plans were set for the release of Ms. Yehud.Ms. Yehud was seized from her home in Nir Oz, in southern Israel, near the border with Gaza, during the Hamas-led attack. At the time, she was 28. She was kidnapped along with her partner, Ariel Cunio, who is believed to still be held captive in Gaza.Ms. Yehud’s brother, Dolev Yehud, who was missing for months and assumed to have been kidnapped, too, was declared dead by the Israeli authorities in June, after his remains were identified in Nir Oz. The communal village had a population of about 400 people before the 2023 attack, during which more than a quarter of its population were killed or kidnapped.The video of Ms. Yehud was shared on Monday on a Telegram channel belonging to the Al-Quds Brigades, the armed wing of the Palestinian Islamic Jihad.In the footage, she is shown wearing a thick gray undershirt and a dark hoodie. Facing the camera, she states her date of birth and identification number, and addresses her family.Israeli officials had said they believed she was not being held by Hamas, and had suggested that another militant group was responsible for the holdup.An official with the Palestinian Islamic Jihad told The Times on Sunday that Ms. Yehud would be released before next Saturday. Israel eventually began allowing displaced Palestinians to move north on Monday morning. Thousands took the opportunity to make the long trek home.The next hostage-for-prisoner swap is expected later this week.Arijeta Lajka and Isabel Kershner contributed reporting.VideoLarge numbers of Palestinians headed to the north of the Gaza Strip for the first time in months after Israel withdrew part of its troops from the Netzarim corridor as part of a cease-fire agreement.CreditCredit...Nader IbrahimJeanna Smialek and Erika SolomonEuropean Union foreign ministers agreed on Monday to gradually lift some financial sanctions on Syria to give the new government some economic flexibility after more than a decade of stiff restrictions. The bloc’s top diplomat said the first ones to be eased would help with rebuilding the devastated country after years of civil war. New Gaza checkpoint provides clues to the cease-fire security arrangements.ImagePalestinians making their way through a checkpoint on Monday as they tried to return to their homes in northern Gaza.Credit...Haitham Imad/EPA, via ShutterstockA vehicle checkpoint on a road in Gaza that is newly opened to Palestinians heading north on Monday holds clues to the security arrangements that Israel and Hamas agreed to during their cease-fire deal.Palestinians say that U.S., Egyptian and Qatari security officials are screening vehicles for weapons and other military equipment at the point in central Gaza where Salah al-Din Road, which runs roughly north to south, intersects with the Netzarim corridor, a lateral road constructed by Israeli security forces during the war as a security measure.Vehicles have to let out their passengers just south of the checkpoint and then proceed below an arch that apparently scans them under the oversight of men in uniform, the witnesses say. The passengers walk around the barrier on a dirt track before rejoining the vehicles once they have passed through, they say.“The car inspection and crossing take no more than a minute or two,” said Khader Alia, a businessman, who had passed through the checkpoint heading north. He said on Monday that American security personnel dressed in dark fatigues had inspected the vehicles, while Arab soldiers who spoke an Egyptian dialect organized movement on both lanes.“They asked me to open the trunk and hood, and then wished me safe travels,” he said.Mr. Alia said the American security personnel appeared to be searching primarily for weapons. “My wife and children crossed on foot while I stayed in the car, drove it forward, met them on the other side, and together we headed to Gaza,” he added.The checkpoint was established under the terms of the 42-day cease-fire, which began on Jan. 19. Under the agreement, Israeli troops have partly withdrawn and allowed Palestinians in Gaza to head north.Prime Minister Benjamin Netanyahu of Israel has said repeatedly that Israel would not allow armed fighters to return to Gaza. It was not clear, however, how that prohibition could be enforced, since tens of thousands of people walked without inspection along a separate coast road north on Monday.A spokesman for Israel’s military, Avichay Adraee, warned on social media that “the transfer of militants or weapons via these routes to the northern Gaza Strip will be considered a breach of the agreement.” His post showed that Israel had withdrawn its forces to territory that enclosed the enclave to the north, south and east, as well as a block of territory in north-central Gaza.One of the contractors assigned to the corridor is Safe Reach Solutions, a company that conducts logistics and planning, according to a company spokesperson.Safe Reach Solutions will oversee operational management of the crossings, said a second person familiar with its operations, while two other firms — one American, one Egyptian — will handle the inspections. It is not yet clear who is financing the contractors’ deployment.Hezbollah’s leader, Naim Qassem, said in a speech on Monday that the group did not accept the extension until Feb. 18 of the cease-fire agreement with Israel beyond the initial 60-day period. However, the Lebanese government had already approved the extension, and Hezbollah is not a signatory to the deal. The extension was an apparent attempt to buy time and stave off violence after Israeli forces did not withdraw from Lebanon as stipulated under the terms of the deal.ImageCredit...Al Manar, via ReutersQassem stopped short of delivering a direct threat to Israel if it failed to withdraw but said his group reserved “the right to act as it sees fit.” He called on Lebanon’s new leaders to take action, and held the international community responsible for “any consequences arising from the delay.”After an airstrike earlier today in Tulkarm, in the occupied West Bank, killed two people and wounded three others, according to the Palestinian health ministry, the Israeli military said in a statement that its security forces had initiated a “counterterrorism operation” there. The military identified the target as Ihab Abu Atiwi, whom it described as the head of the city’s Hamas operation.Steve Witkoff, President Trump’s Middle East envoy, is expected to make a trip to Israel later this week, according to a person with knowledge of the plans.David Mencer, a spokesman for the Israeli government, confirmed that Israel had received a list from Hamas informing it that of the 33 hostages slated for release in the cease-fire agreement’s initial phase, 25 were alive. Seven of the 33 hostages have already been released.Mencer declined to comment on whether the list named the eight hostages who have died. But in a news briefing on Monday, Mencer said the list shared by Hamas “matches Israel’s intelligence,” and that the families of hostages had been “informed of the status of their loved ones.”Despite anxieties, ‘There’s no moment more joyful than returning home.’ImageA car loaded with mattresses and blankets crossing the Netzarim corridor from southern Gaza into northern Gaza.Credit...Eyad Baba/Agence France-Presse — Getty ImagesThey marched for hours in flip-flops and sandals, bags of clothes dangling from the crooks of their elbows. They trudged for miles with toddlers in their arms, mattresses slung from their shoulders. Old men hobbled on crutches, children pushed wheelchairs and one young boy dragged his earthly possessions on a sled.For nearly 16 months, hundreds of thousands of Palestinians from northern Gaza have lived in tents, barred by Israel from returning to their homes after being forced to flee south at the start of its military offensive against Hamas.On Monday, shortly after sunrise, many thousands of them began the painful trek back. After disagreements between Israel and Hamas delayed their return over the weekend, the Israeli military finally withdrew from Gaza’s coastal road by 7 a.m., allowing displaced people to move north on foot. Car owners were later allowed to drive north along an inland road, subject to inspections.The pedestrians soon formed a human column that stretched as far as the eye could see — miles in length and some 20 people abreast. Rarely has such an uncomfortable journey felt like such relief.“We’re so overjoyed,” said Malak al-Haj Ahmed, 17, a high-school student who was taking selfies with her family beside the coastal road. “There’s no moment more joyful than returning home.”To mark the moment, some people distributed sweets. Some flashed victory signs at passing photographers. A group of small boys led a celebratory chant. “Right or left, north is best,” they sang. “To the north we go!”For Palestinians, it was a moment steeped in symbolism. Since the foundation of Israel in 1948, when hundreds of thousands of Palestinians were expelled or fled from their homes in what is known in Arabic as the Nakba, Palestinians have been defined by repeated displacement and exile.Most Gazans are the descendants of refugees forced to flee in 1948 and many had regarded their displacement from northern Gaza in 2023 as a second Nakba. That fear has been reinforced by repeated Israeli calls to settle northern Gaza with Israeli civilians, as well as President Trump’s suggestion over the weekend that Gazans should move to other parts of the Arab world.To walk back home against that backdrop, through land from which Israeli soldiers had just retreated, felt to some Palestinians like a dare against their own history.“We flipped the table on its head,” said Ahmed Shehada, 34, a textile manufacturer who trekked roughly 15 miles in six hours to Gaza City. Unlike many who returned on Monday, he found his home still standing.“They wanted to expel us from Gaza,” Mr. Shehada said by phone. Instead, he added, “I’m sitting on the couch in my home, and I can’t believe it.”ImageDisplaced Palestinians carrying their pet and belongings.Credit...Abed Hajjar/Associated PressIn the central city of Deir al Balah, a hub for displaced Gazans, there were so many people trying to head north that it became hard to walk through the city center. Family after family was taking down tents and packing belongings into plastic bags. Some people heaved gas tanks onto their backs. One man fixed wheels to a plastic box, turning it into a makeshift stroller for his baby.As they walked, they envisaged the jubilation of being reunited with relatives who had ignored the Israeli evacuation orders and stayed north at the start of the war.“The first thing I’ll do is hug my mother at her shelter,” said Anwar Abu Hindi, 41, a housewife heading north with several children. “Our emotions are all over the place.”As people reached the Netzarim corridor — a chunk of land that Israeli troops had occupied until only a few hours earlier, firing on Palestinians who tried to cross it — there were tear-drenched reunions between those trekking north and relatives who had headed south to meet them.But amid the euphoria, there were frequent notes of caution, frustration and sometimes horror. The roads were lined with ruins. Israeli drones still buzzed overhead for much of the day. Gazan critics of Hamas were disheartened to find that the group’s officers were still policing the pedestrian route.Along the inland route for cars, drivers encountered long traffic jams; foreign security contractors were authorized by Israel to screen northbound vehicles for weapons, slowing cars to a crawl.The contractors included Egyptians who work, officials say, for private companies. Their presence offered a vision for Gaza’s future in which outsiders continue to decide the fate of its residents; Israeli leaders see the contractors as a trial balloon for a larger international force that would oversee the enclave instead of a Palestinian leadership.After passing the checkpoint, Palestinians finally witnessed with their own eyes the devastation that they had only seen in videos from social media.ImageA Palestinian being helped on a bicycle.Credit...Mahmoud Issa/ReutersNorthern Gaza has become a wasteland, following intense Israeli airstrikes and the military’s demolition of scores of buildings, many of which had been rigged with traps and explosives by Hamas. In recent months, fierce fighting between Israel and Hamas, which continued until the start of the cease-fire, caused particularly widespread damage north of Gaza City.“The destruction that we walked through was worse than the apocalypse,” said Mr. Shehada, the textile manufacturer. “I was afraid I was walking over corpses buried beneath the rubble.”After reaching his house in Gaza City, Mr. Shehada was amazed to find that it had suffered only minor damage.But others returned to ruins, and to neighborhoods that they no longer recognized.Where was the local gas station? The neighbor’s house? The nearby roundabout?In many cases, these local landmarks had simply vanished.“Thank God we survived this war,” said Shorouq al-Qur, 27, a law graduate who returned to Gaza City. But, she said, “no matter where we find shelter, whether here or there, it’s still a life in tents, surrounded by destruction and sadness.”Adam Rasgon and Aaron Boxerman contributed reporting from Jerusalem.Bilal ShbairOn the coastal road of GazaIt’s afternoon in Gaza and displaced Palestinians continue to trek north on foot through Wadi Gaza, a strip of wetlands that curves across the Gaza Strip and is seen as a dividing line between north and south.VideoCreditCredit...Bilal ShbairThe opening of roads connecting northern and southern Gaza has enabled some families to reunite. Many families have been separated for months, unable to pass the checkpoints that Israeli forces opened on Monday.VideoCreditCredit...ReutersFadi Zaanin, a nurse who remained in northern Gaza throughout the war, says he’s eagerly awaiting his brother’s return from the south after 16 months apart. But he is worried about where his brother will sleep. Their home was destroyed and Zaanin, who sleeps at the hospital where he works, has nowhere to house his returning relatives.Lebanon’s health ministry says at least one person has been killed and seven others injured by Israeli fire in southern Lebanon, amid renewed attempts by Lebanese residents on Monday to reach southern border towns still controlled by the Israeli military.ImageCredit...Rabih Daher/Agence France-Presse — Getty ImagesDiplomats had hoped that an extension on Sunday of the 60-day cease-fire agreement in Lebanon would stave off the violence, but it appears to have done little to prevent displaced Lebanese from trying to go home despite Israeli warnings to keep away.As the cease-fire in Gaza holds, the Israeli military was pressing on with raids in parts of the occupied West Bank. In Tulkarm, an Israeli strike killed two people and wounded three others, according to the Palestinian health ministry. The Israeli military said that its air force had carried out an attack in Tulkarm, without providing details about the target.ImageCredit...Alaa Badarneh/EPA, via ShutterstockImageCredit...Jaafar Ashtiyeh/Agence France-Presse — Getty ImagesGazans head north on crutches, in wheelchairs and piled into strollers.Displaced Palestinians walking towards the north of GazaCredit...Dawoud Abu Alkas/Reuters; Ramadan Abed/Reuters; Abdel Kareem Hana/Associated Press; Dawoud Abu Alkas/ReutersTens of thousands of people trekked back to northern Gaza on Monday, carrying the few belongings they could. Those making the journey included a teenager who walked on crutches with metal pins protruding from his legs. One man pushed a stroller with three children loaded into it, one holding a water bottle and a piece of bread. Behind him, women and children smiled and waved. Elsewhere among the column of people that stretched for miles along Gaza’s coastal road, one woman in a wheelchair waited to make the journey back.It was unclear what the displaced Gazans would be returning to, as much of northern Gaza has been reduced to rubble during the Israeli military campaign against Hamas. Yet many of those walking on Monday had smiles on their faces, photos showed. The joyous mood belied the suffering of 15 months of war. More than 46,000 people were killed and 100,000 people injured in Gaza, according to health officials in the enclave. The war has displaced the majority of Gaza’s 2.2 million people, many of them multiple times, and hundreds of thousands of people have been living in makeshift shelters. As they returned north, many people brought household goods and a few other essentials. One teenager carried a large bowl on his head that had been piled high with cooking utensils including pots and pans. To make the load easier to carry, he had balanced the bowl on a pillow.Isabel Kershner and Myra NoveckCol. Avi Benov, a physcian who is deputy chief of the Israeli military’s medical corps, has just briefed reporters about the return of hostages from Gaza. He said that several of the Israeli women who were released from captivity in recent days had spent the past eight months underground in Hamas tunnels without seeing sunlight.Isabel Kershner and Myra NoveckThe hostages who have been returned so far — three civilians and four soldiers, all women — were all suffering effects of “mild starvation” and low vitamin levels, Benov said. Some still have shrapnel in their bodies from the Hamas-led assault on Oct. 7, 2023, when they were abducted to Gaza, he added.Among the household possessions that people carried north were expensive staples including water jugs. Israeli attacks have destroyed basic services in Gaza and much of its infrastructure.ImageCredit...Hatem Khaled/ReutersIsraeli forces again open fire as civilians try to return home in southern Lebanon, officials say.ImageA Lebanese soldier, left, filming as Israeli soldiers block a road in the southern Lebanese village of Aitaroun, on Monday. Credit...Bilal Hussein/Associated PressIsraeli forces fired toward residents of southern Lebanon for a second consecutive day on Monday as people pressed on with attempts to return to their homes along the border, a day after at least two dozen people were killed and scores injured in Israeli attacks, Lebanese officials said.The Israeli fire on Sunday was the deadliest eruption of violence in Lebanon since the war between Israel and Hezbollah, the Lebanese militia, ended with a truce in November. In the renewed violence on Monday, at least two people were killed and 17 others injured, according to Lebanon’s health ministry.The Israeli military said in a statement that it had fired “warning shots in order to eliminate threats,” without providing further details about the nature of those threats.Wire agency photos showed Israeli forces gathered behind makeshift roadblocks, with flattened southern Lebanese villages visible on the rolling hillsides behind them. Some detained men stood crouched alongside a dirt road, blindfolded and with their hands bound as Israeli soldiers stood watch.The images showed Hezbollah flags on full display and crowds of men and women, in addition to the U.N. peacekeepers and Lebanese soldiers attempting to protect them.Television screens, however, have been flooded with the images of the dead.ImageResidents of the southern Lebanese village of Khiam driving past a portrait of slain Hezbollah leader Hassan Nasrallah as they returned to their village on Monday. Credit...Rabih Daher/Agence France-Presse — Getty ImagesImageLebanese paramedics rushed a man who was reportedly shot by Israeli soldiers as he tried to make his way with other residents toward the southern Lebanese village of Kfar Kila, on Monday. Credit...Rabih Daher/Agence France-Presse — Getty ImagesThe Israeli military said on Monday that it had redeployed in areas of southern Lebanon and repeated calls for Lebanese residents to wait for their approval before returning home. The Lebanese military had sent reinforcements to parts of southern Lebanon earlier in the day, preparing to enter some towns and safeguard civilians, Lebanon’s state-run news agency reported.Israeli forces killed at least 24 people and injured over 134 others on Sunday, Lebanese officials said, after thousands of Lebanese marched to southern towns and villages. Those areas remain occupied by Israel past a 60-day deadline for its withdrawal under the November cease-fire agreement, which called for both Israel and Hezbollah forces to leave southern Lebanon and for the Lebanese Army and U.N. peacekeepers to deploy in force there.The Israeli military said in a statement on Sunday that it had fired “warning shots” to disperse what it called “rioters.” Last week, Israel had indicated that it would remain in southern Lebanon despite the deadline, amid doubts about the Lebanese Army’s ability to stymie Hezbollah’s resurgence.Negotiators had hoped that the U.S.-brokered cease-fire by now would have given way for a more permanent settlement. But as the 60-day deadline elapsed on Sunday, the White House issued a statement stating that the initial agreement would be extended until Feb. 18.Hezbollah’s leader, Naim Qassem, said in a speech on Monday that the group did not accept the extension of the cease-fire agreement and called on Israeli forces to withdraw from Lebanon. However, Hezbollah is not a signatory to the deal, and the Lebanese government had already approved the extension after discussions with U.S. officials.The flurry of diplomatic activity appeared designed to buy time and stave off further bouts of violence.ImageWomen carrying portraits of fighters walking past the rubble of a mosque that was destroyed during the Israeli offensive in the southern Lebanese village of Aita al-Shaab. Credit...Mahmoud Zayyat/Agence France-Presse — Getty ImagesImageIsraeli soldiers near Lebanese detainees at the Israeli-Lebanese border, as seen from northern Israel, on Monday. Credit...Ronen Zvulun/ReutersMr. Qassem said his group reserved “the right to act as it sees fit” if Israel failed to withdraw from the country, but stopped short of delivering a direct threat during his speech on Monday.Battered by the deadliest war with Israel in decades, the group has little impetus to reignite a conflict that would only weaken the group further as it attempts to recover, experts say. Instead, Mr. Qassem called on Lebanon’s new leaders to act, and said the international community would be responsible for “any consequences arising from the delay.”During a meeting with U.S. officials on Monday, Lebanon’s caretaker prime minister, Najib Mikati, stressed that the extension did “not give Israel any excuse not to withdraw,” according to a statement from his office. He accused Israeli forces of “procrastinating” and said pressure was needed to stop their “repeated violations” of the truce deal.The bloodshed on Sunday prompted urgent calls for restraint by the United Nations amid growing fears of a sustained Israeli occupation and renewed hostilities between Israel and Hezbollah.ImageResidents of Kfar Kila gathered at a Lebanese army checkpoint in Burj al-Muluk, on the outskirts of their village.Credit...Rabih Daher/Agence France-Presse — Getty ImagesEven as the cease-fire held, albeit precariously, in Lebanon, the Israeli military said it had “initiated a counterterrorism operation” in the city of Tulkarm in the Israeli-occupied West Bank.The military said its aircraft had killed Ihab Abu Atiwi, who was described as the head of the local branch of Hamas, and circulated images of a car being blown up. The Palestinian health ministry said an airstrike had killed two people and wounded three others.Myra Noveck, Johnatan Reiss, Sarah Chaito and Thomas Fuller contributed reporting.Bilal ShbairOn the coastal road of Gaza“We’re so overjoyed,” said Malak al-Haj Ahmed, 17, a high-school student taking selfies with her family beside the coastal road in Gaza. “There’s no moment more joyful than returning home.”As residents began returning to northern Gaza, Israeli forces have reportedly opened fire for a second day on Lebanese attempting to return to their homes in southern Lebanon in defiance of Israeli warnings, according to Lebanon’s state-run news agency. Lebanon's health ministry said two people were injured, including a child.The Israeli military did not immediately respond to a request for comment. The Lebanese military sent reinforcements to parts of southern Lebanon earlier in the day, preparing to enter some towns and safeguard civilians attempting to return home, the agency reported.Awad Abid, a former taxi driver from northern Gaza, said he was waiting a few days to see if he could hitch a ride for his young children, who could not return to the north on foot. Abid is currently living in a tent camp near the southern city of Khan Younis that many people have left over the past several hours.He said that given the choice, he would prefer to leave Gaza and build a new life. “There are a lot of issues — people whose homes were destroyed and are living in other houses, disputes over property, problems between families that began during their time in Khan Younis,” he said. “This war tore apart our social fabric.”The Gazan government press office said in a statement that 135,000 tents and caravans were “immediately and urgently” needed in Gaza City and northern Gaza to accommodate the thousands of displaced people who were returning to an area where 90 percent of the buildings and infrastructure had been destroyed by Israeli bombardment.The Gazan Health Ministry said in a statement that it had set up 19 emergency medical points along the route that thousands of displaced Palestinians were taking on their journey back to northern Gaza. After territory's healthcare system was crippled by 15 months of Israeli bombardment, these medical points were set up “to provide urgent health care to citizens returning to their areas,” the statement said.As thousands trek north, many other displaced Palestinians have decided to wait until later this week to return to northern Gaza when they hope the roads will be less crowded. “I’m so happy — I’ve been waiting to return home for more than a year,” said Khalil el-Halabi, 70, a displaced person originally from Gaza City. “But I’ll have to wait another day because there’s an endless human chain on the road.”Having walked miles from the southern regions of Gaza, thousands of Palestinians are arriving in Gaza City, in the north of the territory, according to video footage. Some of them are carrying very few, if any, belongings. Many will be returning to homes badly damaged or destroyed by the war.VideoCreditCredit...ReutersSince Palestinians still can’t drive along the coastal road to Gaza City, some are using bikes, wheelchairs and trolleys to carry their belongings. One man has attached wheels to a plastic box, turning it into a makeshift stroller for his baby.News AnalysisThe Gaza and Lebanon truces are fragile, but all sides want them to hold, analysts say.ImageAn Israeli army vehicle in southern Lebanon on Sunday.Credit...Amir Levy/Getty ImagesThe cease-fires in Gaza and Lebanon will most likely hold for now, despite being tested to their limits over the weekend, because all sides want to avoid full-scale fighting at least for a few weeks, analysts said.In southern Lebanon, Israeli troops remained in position past the deadline on Sunday for their withdrawal, amid Israeli claims that Hezbollah had broken its own pledge to leave the area. In Gaza, Hamas failed to release a female hostage who Israel had hoped would be freed on Saturday, prompting Israel to delay the agreed return of displaced Palestinians to their homes in northern Gaza.But even as each side accused the other of reneging on their deals, analysts said, both Israel and its opponents had reasons to remain flexible and temporarily overlook the other’s transgressions.Hezbollah, though angry at Israel for keeping troops in southern Lebanon, would risk a devastating Israeli counterattack if it renews its rocket strikes on Israeli cities. Hamas wants to retain power in Gaza and risks losing it if war returns. And Israel needs to maintain the current arrangement in Gaza long enough to free at least two dozen more hostages. Israeli leaders have also appeared eager to placate President Trump, who campaigned on a promise to keep peace in the Middle East.Illustrating their desire to prolong the Gaza truce, Israel and Hamas seemed to resolve the weekend’s crisis close to midnight on Sunday. The government of Qatar, a mediator between the sides, said that the female hostage, Arbel Yehud, would be freed this week along with two others who would be released ahead of schedule. In return, Israel said that it would allow displaced Palestinians to return to northern Gaza on Monday morning. By Monday night, more than 300,000 Gazans had returned, the Hamas-run government media office said.As for Lebanon, the White House announced that the truce there would be extended until Feb. 18, though there was no immediate comment from Israel or Hezbollah. The Lebanese prime minister’s office confirmed the extension.ImageHezbollah flags at a barricade in southern Lebanon on Sunday.Credit...Rabih Daher/Agence France-Presse — Getty ImagesAaron David Miller, a former U.S. negotiator in Middle East peace talks, said, “They’re going to get through the next few weeks — beyond that is anyone’s guess.”“These are not agreements between the United States and Switzerland. They’re agreements that depend on each side giving the other a certain discretion and margin for maneuver,” he added. “That is their weakness, but also their strength.”That wriggle room ultimately allowed both truces to survive the weekend, even as Israeli troops shot and killed people in both Lebanon and Gaza who were trying to return to areas still controlled by Israel.The Lebanese Health Ministry said that 22 people had been killed by Israeli fire in southern Lebanon, and the Palestinian Authority’s news agency said that one person had been killed in Gaza as large crowds in both places gathered near Israeli troops, demanding to go home.But by Monday morning, the standoff in Gaza appeared set to ease. In Lebanon, Hezbollah issued a statement praising the residents attempting to return and calling on foreign powers to force Israel to withdraw. But Hezbollah did not resume its rocket fire.Analysts say that Hezbollah is unlikely to risk further losses while its leadership is decimated and its benefactor, Iran, is weakened. Also, the group’s main arms supply route, through Syria, was blocked in December when the Syrian president, Bashar al-Assad, an ally of Hezbollah, was ousted by rebels.ImageDisplaced Palestinians heading north in Gaza on Monday.Credit...Abdel Kareem Hana/Associated PressHezbollah’s commanders do “still have some rockets, they have some guns, they can do something,” said Hanin Ghaddar, a Lebanese analyst at the Washington Institute for Near East Policy, a foreign affairs research group.“But it’s suicidal if they do this, because they know that any kind of attack by Hezbollah in Israel means that Israel will take the opportunity to come back full blast and annihilate whatever is left of them,” Ms. Ghaddar added.Hezbollah is also probably wary of losing support among its Shiite Muslim base, particularly in next year’s parliamentary elections, Ms. Ghaddar said. Lebanon’s Shiite community paid the largest price for Hezbollah’s decision to go to war with Israel in October 2023 in solidarity with its ally Hamas. Shiite villages and towns in southern Lebanon bore the brunt of Israel’s ensuing air campaign and ground invasion.“If the Shia do not vote for them, this is the end of Hezbollah,” said Ms. Ghaddar, the author of a book about Hezbollah’s relationship with its base. “They cannot really do anything if they don’t know 100 percent that the Shia community is going to support it.”Because Hezbollah is less likely to resume fighting, the Gaza cease-fire is considered the frailest of the two truces.But its biggest stress test is not expected until the beginning of March, when Hamas and Israel must decide whether to extend the arrangement beyond an initial 42-day truce.ImageHeading north in Gaza on Monday. Israel and Hamas seemed to resolve the weekend’s crisis close to midnight on Sunday, illustrating both sides’ desire to prolong the truce.Credit...Mohammad Abu Samra/Associated PressFor now, Israel has signaled it wants to maintain the cease-fire to sustain the flow of hostage releases. But an extension would require both sides to agree to a permanent end to the war — a bridge that Prime Minister Benjamin Netanyahu of Israel has appeared unwilling to cross. Mr. Netanyahu’s coalition government relies on far-right lawmakers who seek permanent Israeli control of Gaza, and his administration could collapse if the war ends with Hamas still in charge.The terms of the agreement allow for some flexibility. The truce can continue beyond the 42-day mark as long as both sides remain negotiating about whether to make the arrangement permanent.But Israeli officials say they will not remain locked in endlessly fruitless negotiations, especially if Hamas stops releasing hostages. And Hamas is unlikely to keep freeing the hostages, its main bargaining chip, without an Israeli promise to cease hostilities permanently.“Hamas wants a cease-fire but not at all costs,” said Mkhaimar Abusada, a Palestinian political scientist from Gaza. “They want a cease-fire that ends the war.”Much could depend on President Trump’s willingness to cajole Mr. Netanyahu toward a more lasting truce. Mr. Trump’s private messages to the Israeli prime minister were crucial to the forging of the initial phase, but it remains to be seen whether the American president will maintain that position beyond a few weeks.“If Netanyahu succeeds in convincing Trump of the need to renew the war, there’ll probably be a renewal of the war,” Mr. Abusada said. “If Trump keeps his promise that he doesn’t want any wars and he wants more peace — whether it’s in Gaza, Ukraine or all over the world — that’s a different thing.”Bilal ShbairOn the coastal road of GazaThe people on the road are carrying bags, mattresses, duvets — whatever possessions they can carry on their backs. Many are walking on foot, but some are waiting for buses to take them closer to the Netzarim corridor.Bilal ShbairOn the coastal road of GazaAs I walked through the town of Deir al Balah to reach the coast, it was hard to move because there were so many displaced people packing up their belongings. People were taking down their tents and loading donkeys with their possessions.",
  "image": "https://static01.nyt.com/images/2025/01/27/multimedia/27mideast-crisis-promo-4pm/27mideast-crisis-live48-mlbw-facebookJumbo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection role=\"region\" aria-label=\"Live feed\" id=\"live-feed-items\"\u003e\u003cdiv data-testid=\"live-blog-post\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#heres-the-latest-on-the-cease-fire\" data-source-id=\"100000009950937\" role=\"article\" aria-posinset=\"39\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlLzdiN2Q5ODkzLTdmNjEtNTQ5MC05ZDM0LWZhYjNmYTAxMTM1OA==\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003cspan\u003e\u003cimg alt=\"\" src=\"https://static01.nyt.com/images/icons/t_logo_291_black.png\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2 id=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlLzdiN2Q5ODkzLTdmNjEtNTQ5MC05ZDM0LWZhYjNmYTAxMTM1OA==\"\u003e\u003ca href=\"#heres-the-latest-on-the-cease-fire\"\u003eHere’s the latest.\u003c/a\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003eTens of thousands of displaced Palestinians were walking for hours toward their homes in northern Gaza on Monday, nearly 16 months after they had been ordered to move at the start of Israel’s military offensive. More than 300,000 Gazans had returned by Monday night from the southern and central parts of the enclave, the Hamas-run government media office said.\u003c/p\u003e\u003cp\u003eThe cease-fire between Israel and Hamas remained in place after it \u003ca href=\"https://www.nytimes.com/live/2025/01/26/world/lebanon-israel-hezbollah\" title=\"\"\u003efaltered over the weekend,\u003c/a\u003e but it was unclear what awaited Gazans once they returned home. As they began arriving in Gaza City, in the north of the territory, they confronted a wasteland of rubble, after the Israeli military destroyed whole neighborhoods and Hamas booby-trapped many buildings.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eA column of people stretching for miles marched north along Gaza’s coastal road, many carrying their few possessions on their heads, on makeshift carts and in plastic bags slung over their backs. Some used bikes, wheelchairs and trolleys to carry their belongings. One man attached wheels to a plastic box, turning it into a makeshift stroller for a baby.\u003c/p\u003e\u003cp\u003eMany of those returning had spent the war sheltering in tents in other parts of the narrow territory, after Israel ordered roughly a million people to flee northern Gaza in October 2023 ahead of its military invasion and then prevented their return.\u003c/p\u003e\u003cp\u003eOn Monday, the militant group Palestinian Islamic Jihad published a video of Arbel Yehud, an Israeli hostage whose release was delayed though she was supposed to be among the first two groups of abductees freed on Jan. 19 and Jan. 25 during the first phase of the provisional cease-fire agreement between Israel and Hamas. The delay had been at the center of one of the most significant disputes between the two sides.\u003c/p\u003e\u003cp\u003eLast weekend, Hamas released \u003ca href=\"https://www.nytimes.com/2025/01/25/world/middleeast/israel-gaza-hostages.html?smid=url-share\" title=\"\"\u003efour female Israeli soldiers\u003c/a\u003e who were taken hostage on Oct. 7, 2023. Israel, in turn, handed over 200 Palestinian prisoners. But on Sunday, their week-old truce appeared to waver. Israel said it would \u003ca href=\"https://www.nytimes.com/2025/01/26/world/middleeast/israel-gaza-cease-fire.html?smid=url-share\" title=\"\"\u003edelay the return of displaced people\u003c/a\u003e to northern Gaza, as required by the cease-fire agreement, partly because Hamas had reneged on the plan to release \u003ca href=\"#arbel-yehud-israel-hostage-hamas\" title=\"\"\u003eMs. Yehud\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eAfter hours of tense negotiations, the sides reached an agreement late Sunday under which Hamas would hand over Ms. Yehud, along with other hostages, by the end of the week. In exchange, Israeli forces began allowing displaced Palestinians to move north on Monday morning.\u003c/p\u003e\u003cp\u003eHere’s what else to know:\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003e\u003cstrong\u003eViolence in Lebanon:\u003c/strong\u003e \u003ca href=\"#israel-lebanon-hezbollah-strikes-ceasefire\" title=\"\"\u003eIsraeli forces opened fire for a second straight day\u003c/a\u003e as residents of southern Lebanon sought to return to their homes along the border, Lebanese officials said. At least two people were injured, officials said, after at least two dozen people were killed and scores injured in Israeli fire on Sunday. Israeli forces, who have warned against returning to border areas without their approval, have remained in southern Lebanon as a 60-day truce with the Lebanese militia Hezbollah was extended on Sunday until Feb. 18.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cstrong\u003eFragile truces:\u003c/strong\u003e Though Israel’s cease-fires in Gaza and Lebanon were tested over the weekend, analysts said that \u003ca href=\"#gaza-lebanon-israel-ceasefire\" title=\"\"\u003eall sides wanted to avoid full-scale fighting\u003c/a\u003e for now.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cstrong\u003eDisplaced Palestinians: \u003c/strong\u003ePresident Trump told reporters that he would like Jordan and Egypt to take in more displaced Palestinians as part of an effort to “clean out” Gaza. Egypt and Jordan \u003ca href=\"https://www.nytimes.com/2025/01/26/world/middleeast/trump-gaza-jordan-egypt.html\" title=\"\"\u003erejected the suggestion\u003c/a\u003e, saying the only way forward was Palestinian statehood.\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"0e7cf7c2-9961-50c4-b419-4ec93e727f07\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#0e7cf7c2-9961-50c4-b419-4ec93e727f07\" role=\"article\" aria-posinset=\"38\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvMGU3Y2Y3YzItOTk2MS01MGM0LWI0MTktNGVjOTNlNzI3ZjA3\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003cspan\u003e\u003cimg alt=\"Abu Bakr Bashir\" src=\"https://static01.nyt.com/images/icons/t_logo_291_black.png?quality=75\u0026amp;auto=webp\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eMore than 300,000 Palestinians have returned to northern Gaza after being displaced to central and southern parts of the enclave, the Hamas-run government media office said on Monday. The figures were released hours after Israel began allowing Gazans to return. The Israeli military forced many thousands of Gazans from their homes in northern Gaza months ago.\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eJehad Alshrafi/Associated Press\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv data-testid=\"live-blog-post\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#arbel-yehud-civilian-hostage-gaza\" data-source-id=\"100000009952197\" role=\"article\" aria-posinset=\"37\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlLzk1MjE0OTUzLTc4NWMtNTA3OC05NDBmLTI0ZWYzNzBiYjdkMQ==\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/johnatan-reiss\"\u003e\u003cimg alt=\"Johnatan Reiss\" src=\"https://static01.nyt.com/images/2024/09/17/reader-center/author-johnatan-reiss/author-johnatan-reiss-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2024/09/17/reader-center/author-johnatan-reiss/author-johnatan-reiss-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2024/09/17/reader-center/author-johnatan-reiss/author-johnatan-reiss-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2 id=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlLzk1MjE0OTUzLTc4NWMtNTA3OC05NDBmLTI0ZWYzNzBiYjdkMQ==\"\u003e\u003ca href=\"#arbel-yehud-civilian-hostage-gaza\"\u003ePalestinian militant group releases video of civilian hostage held in Gaza.\u003c/a\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eA poster in Rishon LeZion, Israel, showing the portraits of Arbel Yehud, her brother, Dolev Yehud, and her partner, Ariel Cunio.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eMarco Longari/Agence France-Presse — Getty Images\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eThe Palestinian Islamic Jihad on Monday released a video of the Israeli hostage Arbel Yehud, whose delayed release had been at the center of one of the most significant disputes between Israel and Hamas since a cease-fire took effect a week ago.\u003c/p\u003e\u003cp\u003eMs. Yehud is believed to be one of the last remaining female civilians held in Gaza since about 250 people were abducted during the Hamas-led attacks on Israel of Oct. 7, 2023.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eIn the video footage, which an analysis by The New York Times dates to Jan. 25, she says, “My family, I’m OK. I miss you endlessly and I hope to return to you soon, like the girls who had been released.”\u003c/p\u003e\u003cp\u003eRights groups and international law experts have noted that, by definition, such hostage videos are made under duress, and that the statements in them are usually coerced.\u003c/p\u003e\u003cp\u003eOr Moshe, a spokeswoman for the Hostage Families Forum, an umbrella organization representing the families of captives in Gaza, confirmed the footage was of Ms. Yehud, and said it was the first video of the hostage since she was taken from Nir Oz, a kibbutz in Israel, in 2023.\u003c/p\u003e\u003cp\u003eMs. Yehud was to be among the first two groups of hostages released on Jan. 19 and Jan. 25 during the first phase of the provisional cease-fire agreement, according to the Israeli authorities. Israel had demanded that its female civilians be released before captive female soldiers.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/2025/01/24/world/middleeast/israel-hamas-hostage-cease-fire-deal.html?searchResultPosition=1\" title=\"\"\u003eHamas released\u003c/a\u003e Karina Ariev, 20; Daniella Gilboa, 20; Naama Levy, 20; and Liri Albag, 19. All four were abducted from the military base near Gaza where they served. In exchange, Israel \u003ca href=\"https://www.nytimes.com/2025/01/25/world/middleeast/palestinian-prisoners-released-second-exchange.html?searchResultPosition=8\" title=\"\"\u003ereleased hundreds of Palestinian prisoners\u003c/a\u003e. But not Ms. Yehud.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/2025/01/25/world/middleeast/israel-hamas-gaza-hostage-yehud.html?searchResultPosition=2\" title=\"\"\u003eThe delay\u003c/a\u003e had stalled Israel’s expected withdrawal eastward along the Netzarim Corridor, an occupation zone in the Gaza Strip that Israel set up at the onset of the war. And the Israeli prime minister’s office had said Israel would not allow Gazans to pass to the north of the strip until plans were set for the release of Ms. Yehud.\u003c/p\u003e\u003cp\u003e\u003ca href=\"#arbel-yehud-israel-hostage-hamas\" title=\"\"\u003eMs. Yehud was seized from her home in Nir Oz\u003c/a\u003e, in southern Israel, near the border with Gaza, during the Hamas-led attack. At the time, she was 28. She was kidnapped along with her partner, Ariel Cunio, who is believed to still be held captive in Gaza.\u003c/p\u003e\u003cp\u003eMs. Yehud’s brother, Dolev Yehud, who was missing for months and assumed to have been kidnapped, too, was declared dead by the Israeli authorities in June, after his remains were identified in Nir Oz. The communal village had a population of about 400 people before the 2023 attack, during which more than a quarter of its population were killed or kidnapped.\u003c/p\u003e\u003cp\u003eThe video of Ms. Yehud was shared on Monday on a Telegram channel belonging to the Al-Quds Brigades, the armed wing of the Palestinian Islamic Jihad.\u003c/p\u003e\u003cp\u003eIn the footage, she is shown wearing a thick gray undershirt and a dark hoodie. Facing the camera, she states her date of birth and identification number, and addresses her family.\u003c/p\u003e\u003cp\u003eIsraeli officials had said they believed she was not being held by Hamas, and had suggested that another militant group was responsible for the holdup.\u003c/p\u003e\u003cp\u003eAn official with the Palestinian Islamic Jihad told The Times on Sunday that Ms. Yehud would be released before next Saturday. Israel eventually began allowing displaced Palestinians to move north on Monday morning. Thousands took the opportunity to make \u003ca href=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza\" title=\"\"\u003ethe long trek home\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe next hostage-for-prisoner swap is expected later this week.\u003c/p\u003e\u003cp\u003eArijeta Lajka and Isabel Kershner contributed reporting.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv role=\"article\" aria-posinset=\"36\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-Capsule3\"\u003e\u003chr/\u003e\u003cfigure aria-label=\"media\" role=\"group\" data-testid=\"VideoBlock\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eVideo\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://static01.nyt.com/images/2025/01/27/world/middleeast/Reuters-sss/Reuters-sss-threeByTwoMediumAt2X.jpg\" alt=\"Video player loading\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003cspan data-testid=\"video-summary\"\u003eLarge numbers of Palestinians headed to the north of the Gaza Strip for the first time in months after Israel withdrew part of its troops from the Netzarim corridor as part of a cease-fire agreement.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003eNader Ibrahim\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv id=\"eef61dfe-6a03-5404-928e-2d90b87c748e\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#eef61dfe-6a03-5404-928e-2d90b87c748e\" role=\"article\" aria-posinset=\"35\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvZWVmNjFkZmUtNmEwMy01NDA0LTkyOGUtMmQ5MGI4N2M3NDhl\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003cspan\u003e\u003cimg alt=\"Jeanna Smialek and Erika Solomon\" src=\"https://static01.nyt.com/images/icons/t_logo_291_black.png?quality=75\u0026amp;auto=webp\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan itemprop=\"name\"\u003eJeanna Smialek and Erika Solomon\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eEuropean Union foreign ministers agreed on Monday to \u003ca href=\"https://www.nytimes.com/2025/01/27/world/europe/eu-syria-sanctions.html\" title=\"\"\u003egradually lift some financial sanctions on Syria\u003c/a\u003e to give the new government some economic flexibility after more than a decade of stiff restrictions. The bloc’s top diplomat said the first ones to be eased would help with rebuilding the devastated country after years of civil war.\u003cspan\u003e  \u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"live-blog-post\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#new-gaza-checkpoint-provides-clues-to-the-cease-fire-security-arrangements\" data-source-id=\"100000009951856\" role=\"article\" aria-posinset=\"34\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlLzAwMmE1YThiLWJiMTYtNTQwZS1hYmM0LWIwNTJkYTQ1Yzk5OA==\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/matthew-mpoke-bigg\"\u003e\u003cimg alt=\"Matthew Mpoke Bigg\" src=\"https://static01.nyt.com/images/2022/03/01/reader-center/author-matthew-bigg/author-matthew-bigg-thumbLarge-v2.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2022/03/01/reader-center/author-matthew-bigg/author-matthew-bigg-thumbStandard-v2.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2022/03/01/reader-center/author-matthew-bigg/author-matthew-bigg-thumbLarge-v2.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003ca href=\"https://www.nytimes.com/by/fatima-abdulkarim\"\u003e\u003cimg alt=\"Fatima AbdulKarim\" src=\"https://static01.nyt.com/images/icons/t_logo_291_black.png?quality=75\u0026amp;auto=webp\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2 id=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlLzAwMmE1YThiLWJiMTYtNTQwZS1hYmM0LWIwNTJkYTQ1Yzk5OA==\"\u003e\u003ca href=\"#new-gaza-checkpoint-provides-clues-to-the-cease-fire-security-arrangements\"\u003eNew Gaza checkpoint provides clues to the cease-fire security arrangements.\u003c/a\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003ePalestinians making their way through a checkpoint on Monday as they tried to return to their homes in northern Gaza.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eHaitham Imad/EPA, via Shutterstock\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eA vehicle checkpoint on a road in Gaza that is newly opened to Palestinians heading north on Monday holds clues to the security arrangements that Israel and Hamas agreed to during their cease-fire deal.\u003c/p\u003e\u003cp\u003ePalestinians say that U.S., Egyptian and Qatari security officials are screening vehicles for weapons and other military equipment at the point in central Gaza where Salah al-Din Road, which runs roughly north to south, intersects with the Netzarim corridor, a lateral road constructed by Israeli security forces during the war as a security measure.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eVehicles have to let out their passengers just south of the checkpoint and then proceed below an arch that apparently scans them under the oversight of men in uniform, the witnesses say. The passengers walk around the barrier on a dirt track before rejoining the vehicles once they have passed through, they say.\u003c/p\u003e\u003cp\u003e“The car inspection and crossing take no more than a minute or two,” said Khader Alia, a businessman, who had passed through the checkpoint heading north. He said on Monday that American security personnel dressed in dark fatigues had inspected the vehicles, while Arab soldiers who spoke an Egyptian dialect organized movement on both lanes.\u003c/p\u003e\u003cp\u003e“They asked me to open the trunk and hood, and then wished me safe travels,” he said.\u003c/p\u003e\u003cp\u003eMr. Alia said the American security personnel appeared to be searching primarily for weapons. “My wife and children crossed on foot while I stayed in the car, drove it forward, met them on the other side, and together we headed to Gaza,” he added.\u003c/p\u003e\u003cp\u003eThe checkpoint was established under the terms of the 42-day cease-fire, which began on Jan. 19. Under the agreement, Israeli troops have partly withdrawn and allowed Palestinians in Gaza to head north.\u003c/p\u003e\u003cp\u003ePrime Minister Benjamin Netanyahu of Israel has said repeatedly that Israel would not allow armed fighters to return to Gaza. It was not clear, however, how that prohibition could be enforced, since tens of thousands of people walked without inspection along a separate coast road north on Monday.\u003c/p\u003e\u003cp\u003eA spokesman for Israel’s military, Avichay Adraee, warned on social media that “the transfer of militants or weapons via these routes to the northern Gaza Strip will be considered a breach of the agreement.” His post showed that Israel had withdrawn its forces to territory that enclosed the enclave to the north, south and east, as well as a \u003ca href=\"https://x.com/AvichayAdraee/status/1883644796968841334\" title=\"\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eblock of territory\u003c/a\u003e in north-central Gaza.\u003c/p\u003e\u003cp\u003eOne of the contractors assigned to the corridor is Safe Reach Solutions, a company that conducts \u003ca href=\"https://www.nytimes.com/2025/01/23/world/middleeast/gaza-us-contractors.html\" title=\"\"\u003elogistics and planning\u003c/a\u003e, according to a company spokesperson.\u003c/p\u003e\u003cp\u003eSafe Reach Solutions will oversee operational management of the crossings, said a second person familiar with its operations, while two other firms — one American, one Egyptian — will handle the inspections. It is not yet clear who is financing the contractors’ deployment.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv role=\"article\" aria-posinset=\"33\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvMjA3MTFiMzMtNjViMi01YTM0LTk0ZDAtNTA4OGIxYWZhYjU1\"\u003e\u003cdiv id=\"20711b33-65b2-5a34-94d0-5088b1afab55\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#20711b33-65b2-5a34-94d0-5088b1afab55\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/euan-ward\"\u003e\u003cimg alt=\"Euan Ward\" src=\"https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eHezbollah’s leader, Naim Qassem, said in a speech on Monday that the group did not accept the extension until Feb. 18 of the cease-fire agreement with Israel beyond the initial 60-day period. However, the Lebanese government had already approved the extension, and Hezbollah is not a signatory to the deal. The extension was an apparent attempt to buy time and stave off violence after Israeli forces did not withdraw from Lebanon as stipulated under the terms of the deal.\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eAl Manar, via Reuters\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"\" data-testid=\"reporter-update\" data-url=\"\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/euan-ward\"\u003e\u003cimg alt=\"Euan Ward\" src=\"https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eQassem stopped short of delivering a direct threat to Israel if it failed to withdraw but said his group reserved “the right to act as it sees fit.” He called on \u003ca href=\"https://www.nytimes.com/2025/01/09/world/middleeast/lebanon-politics-president-parliament-vote.html\" title=\"\"\u003eLebanon’s new leaders\u003c/a\u003e to take action, and held the international community responsible for “any consequences arising from the delay.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"fd68a942-60c6-592e-b9cb-e63fac7a1374\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#fd68a942-60c6-592e-b9cb-e63fac7a1374\" role=\"article\" aria-posinset=\"32\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvZmQ2OGE5NDItNjBjNi01OTJlLWI5Y2ItZTYzZmFjN2ExMzc0\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003cspan\u003e\u003cimg alt=\"Johnatan Reiss\" src=\"https://static01.nyt.com/images/2024/09/17/reader-center/author-johnatan-reiss/author-johnatan-reiss-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2024/09/17/reader-center/author-johnatan-reiss/author-johnatan-reiss-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2024/09/17/reader-center/author-johnatan-reiss/author-johnatan-reiss-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAfter an airstrike earlier today in Tulkarm, in the occupied West Bank, killed two people and wounded three others, according to the Palestinian health ministry, the Israeli military said in a statement that its security forces had initiated a “counterterrorism operation” there. The military identified the target as Ihab Abu Atiwi, whom it described as the head of the city’s Hamas operation.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"35655d92-6cc8-5d0a-942f-b7f873aacba2\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#35655d92-6cc8-5d0a-942f-b7f873aacba2\" role=\"article\" aria-posinset=\"31\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvMzU2NTVkOTItNmNjOC01ZDBhLTk0MmYtYjdmODczYWFjYmEy\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/maggie-haberman\"\u003e\u003cimg alt=\"Maggie Haberman\" src=\"https://static01.nyt.com/images/2018/07/12/multimedia/author-maggie-haberman/author-maggie-haberman-thumbLarge-v2.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2018/07/12/multimedia/author-maggie-haberman/author-maggie-haberman-thumbStandard-v4.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2018/07/12/multimedia/author-maggie-haberman/author-maggie-haberman-thumbLarge-v2.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eSteve Witkoff, President Trump’s Middle East envoy, is expected to make a trip to Israel later this week, according to a person with knowledge of the plans.\u003c/p\u003e\u003c/div\u003e\u003cdiv role=\"article\" aria-posinset=\"30\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvYTU1YjhkNmYtMjAwZi01ODIxLWE5YTUtZjVkYTllN2RlYTBi\"\u003e\u003cdiv id=\"a55b8d6f-200f-5821-a9a5-f5da9e7dea0b\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#a55b8d6f-200f-5821-a9a5-f5da9e7dea0b\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003cspan\u003e\u003cimg alt=\"Johnatan Reiss\" src=\"https://static01.nyt.com/images/2024/09/17/reader-center/author-johnatan-reiss/author-johnatan-reiss-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2024/09/17/reader-center/author-johnatan-reiss/author-johnatan-reiss-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2024/09/17/reader-center/author-johnatan-reiss/author-johnatan-reiss-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eDavid Mencer, a spokesman for the Israeli government, confirmed that Israel had received a list from Hamas informing it that of the 33 hostages slated for release in the cease-fire agreement’s initial phase, 25 were alive. Seven of the 33 hostages have already been released.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"\" data-testid=\"reporter-update\" data-url=\"\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003cspan\u003e\u003cimg alt=\"Johnatan Reiss\" src=\"https://static01.nyt.com/images/2024/09/17/reader-center/author-johnatan-reiss/author-johnatan-reiss-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2024/09/17/reader-center/author-johnatan-reiss/author-johnatan-reiss-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2024/09/17/reader-center/author-johnatan-reiss/author-johnatan-reiss-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eMencer declined to comment on whether the list named the eight hostages who have died. But in a news briefing on Monday, Mencer said the list shared by Hamas “matches Israel’s intelligence,” and that the families of hostages had been “informed of the status of their loved ones.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv data-testid=\"live-blog-post\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#northern-gaza-palestinians-return\" data-source-id=\"100000009951223\" role=\"article\" aria-posinset=\"29\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlLzEwNmM5NDM2LTI2YWMtNTllOC1hMTdlLTVlMjg4NjhiZTQ1Zg==\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/patrick-kingsley\"\u003e\u003cimg alt=\"Patrick Kingsley\" src=\"https://static01.nyt.com/images/2018/10/15/multimedia/author-patrick-kingsley/author-patrick-kingsley-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2018/10/15/multimedia/author-patrick-kingsley/author-patrick-kingsley-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2018/10/15/multimedia/author-patrick-kingsley/author-patrick-kingsley-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003ca href=\"https://www.nytimes.com/by/bilal-shbair\"\u003e\u003cimg alt=\"Bilal Shbair\" src=\"https://static01.nyt.com/images/icons/t_logo_291_black.png?quality=75\u0026amp;auto=webp\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2 id=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlLzEwNmM5NDM2LTI2YWMtNTllOC1hMTdlLTVlMjg4NjhiZTQ1Zg==\"\u003e\u003ca href=\"#northern-gaza-palestinians-return\"\u003eDespite anxieties, ‘There’s no moment more joyful than returning home.’\u003c/a\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eA car loaded with mattresses and blankets crossing the Netzarim corridor from southern Gaza into northern Gaza.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eEyad Baba/Agence France-Presse — Getty Images\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eThey marched for hours in flip-flops and sandals, bags of clothes dangling from the crooks of their elbows. They trudged for miles with toddlers in their arms, mattresses slung from their shoulders. Old men hobbled on crutches, children pushed wheelchairs and one young boy dragged his earthly possessions on a sled.\u003c/p\u003e\u003cp\u003eFor nearly 16 months, hundreds of thousands of Palestinians from northern Gaza have lived in tents, barred by Israel from returning to their homes after being forced to flee south at the start of its military offensive against Hamas.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eOn Monday, shortly after sunrise, many thousands of them began the painful trek back. After disagreements between Israel and Hamas delayed their return over the weekend, the Israeli military finally withdrew from Gaza’s coastal road by 7 a.m., allowing displaced people to move north on foot. Car owners were later allowed to drive north along an inland road, subject to inspections.\u003c/p\u003e\u003cp\u003eThe pedestrians soon formed a human column that stretched as far as the eye could see — miles in length and some 20 people abreast. Rarely has such an uncomfortable journey felt like such relief.\u003c/p\u003e\u003cp\u003e“We’re so overjoyed,” said Malak al-Haj Ahmed, 17, a high-school student who was taking selfies with her family beside the coastal road. “There’s no moment more joyful than returning home.”\u003c/p\u003e\u003cp\u003eTo mark the moment, some people distributed sweets. Some flashed victory signs at passing photographers. A group of small boys led a celebratory chant. “Right or left, north is best,” they sang. “To the north we go!”\u003c/p\u003e\u003cp\u003eFor Palestinians, it was a moment steeped in symbolism. Since the foundation of Israel in 1948, when hundreds of thousands of Palestinians were expelled or fled from their homes in what is known in Arabic as the Nakba, Palestinians have been defined by repeated displacement and exile.\u003c/p\u003e\u003cp\u003eMost Gazans are the descendants of refugees forced to flee in 1948 and many had regarded their displacement from northern Gaza in 2023 as a second Nakba. That fear has been reinforced by repeated Israeli calls to settle northern Gaza with Israeli civilians, as well as President Trump’s suggestion over the weekend that Gazans should move to other parts of the Arab world.\u003c/p\u003e\u003cp\u003eTo walk back home against that backdrop, through land from which Israeli soldiers had just retreated, felt to some Palestinians like a dare against their own history.\u003c/p\u003e\u003cp\u003e“We flipped the table on its head,” said Ahmed Shehada, 34, a textile manufacturer who trekked roughly 15 miles in six hours to Gaza City. Unlike many who returned on Monday, he found his home still standing.\u003c/p\u003e\u003cp\u003e“They wanted to expel us from Gaza,” Mr. Shehada said by phone. Instead, he added, “I’m sitting on the couch in my home, and I can’t believe it.”\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eDisplaced Palestinians carrying their pet and belongings.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eAbed Hajjar/Associated Press\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eIn the central city of Deir al Balah, a hub for displaced Gazans, there were so many people trying to head north that it became hard to walk through the city center. Family after family was taking down tents and packing belongings into plastic bags. Some people heaved gas tanks onto their backs. One man fixed wheels to a plastic box, turning it into a makeshift stroller for his baby.\u003c/p\u003e\u003cp\u003eAs they walked, they envisaged the jubilation of being reunited with relatives who had ignored the Israeli evacuation orders and stayed north at the start of the war.\u003c/p\u003e\u003cp\u003e“The first thing I’ll do is hug my mother at her shelter,” said Anwar Abu Hindi, 41, a housewife heading north with several children. “Our emotions are all over the place.”\u003c/p\u003e\u003cp\u003eAs people reached the Netzarim corridor — a chunk of land that Israeli troops had occupied until only a few hours earlier, firing on Palestinians who tried to cross it — there were tear-drenched reunions between those trekking north and relatives who had headed south to meet them.\u003c/p\u003e\u003cp\u003eBut amid the euphoria, there were frequent notes of caution, frustration and sometimes horror. The roads were lined with ruins. Israeli drones still buzzed overhead for much of the day. Gazan critics of Hamas were disheartened to find that the group’s officers were still policing the pedestrian route.\u003c/p\u003e\u003cp\u003eAlong the inland route for cars, drivers encountered long traffic jams; foreign security contractors were authorized by Israel to screen northbound vehicles for weapons, slowing cars to a crawl.\u003c/p\u003e\u003cp\u003eThe contractors included Egyptians who work, officials say, for private companies. Their presence offered a vision for Gaza’s future in which outsiders continue to decide the fate of its residents; Israeli leaders see the contractors as a trial balloon for a larger international force that would oversee the enclave instead of a Palestinian leadership.\u003c/p\u003e\u003cp\u003eAfter passing the checkpoint, Palestinians finally witnessed with their own eyes the devastation that they had only seen in videos from social media.\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eA Palestinian being helped on a bicycle.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eMahmoud Issa/Reuters\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eNorthern Gaza has become a wasteland, following intense Israeli airstrikes and the military’s demolition of scores of buildings, many of which had been rigged with traps and explosives by Hamas. In recent months, fierce fighting between Israel and Hamas, which continued until the start of the cease-fire, caused particularly widespread damage north of Gaza City.\u003c/p\u003e\u003cp\u003e“The destruction that we walked through was worse than the apocalypse,” said Mr. Shehada, the textile manufacturer. “I was afraid I was walking over corpses buried beneath the rubble.”\u003c/p\u003e\u003cp\u003eAfter reaching his house in Gaza City, Mr. Shehada was amazed to find that it had suffered only minor damage.\u003c/p\u003e\u003cp\u003eBut others returned to ruins, and to neighborhoods that they no longer recognized.\u003c/p\u003e\u003cp\u003eWhere was the local gas station? The neighbor’s house? The nearby roundabout?\u003c/p\u003e\u003cp\u003eIn many cases, these local landmarks had simply vanished.\u003c/p\u003e\u003cp\u003e“Thank God we survived this war,” said Shorouq al-Qur, 27, a law graduate who returned to Gaza City. But, she said, “no matter where we find shelter, whether here or there, it’s still a life in tents, surrounded by destruction and sadness.”\u003c/p\u003e\u003cp\u003eAdam Rasgon and Aaron Boxerman contributed reporting from Jerusalem.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"928a93e9-b311-5017-abd2-eb0a1f021824\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#928a93e9-b311-5017-abd2-eb0a1f021824\" role=\"article\" aria-posinset=\"28\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvOTI4YTkzZTktYjMxMS01MDE3LWFiZDItZWIwYTFmMDIxODI0\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003cspan\u003e\u003cimg alt=\"Bilal Shbair\" src=\"https://static01.nyt.com/images/icons/t_logo_291_black.png?quality=75\u0026amp;auto=webp\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan itemprop=\"name\"\u003eBilal Shbair\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-testid=\"lb-byline-tagline\"\u003eOn the coastal road of Gaza\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eIt’s afternoon in Gaza and displaced Palestinians continue to trek north on foot through Wadi Gaza, a strip of wetlands that curves across the Gaza Strip and is seen as a dividing line between north and south.\u003c/p\u003e\u003cdiv\u003e\u003cfigure aria-label=\"media\" role=\"group\" data-testid=\"VideoBlock\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eVideo\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://static01.nyt.com/images/2025/01/27/27vid-bilal-reporter-update-11967-cover/27vid-bilal-reporter-update-11967-cover-superJumbo.jpg\" alt=\"Video player loading\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003cspan\u003e\u003cspan\u003eCredit\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003eBilal Shbair\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"c1fce68d-19e9-5858-9088-a3d56d7f0e81\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#c1fce68d-19e9-5858-9088-a3d56d7f0e81\" role=\"article\" aria-posinset=\"27\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvYzFmY2U2OGQtMTllOS01ODU4LTkwODgtYTNkNTZkN2YwZTgx\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/matthew-mpoke-bigg\"\u003e\u003cimg alt=\"Matthew Mpoke Bigg\" src=\"https://static01.nyt.com/images/2022/03/01/reader-center/author-matthew-bigg/author-matthew-bigg-thumbLarge-v2.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2022/03/01/reader-center/author-matthew-bigg/author-matthew-bigg-thumbStandard-v2.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2022/03/01/reader-center/author-matthew-bigg/author-matthew-bigg-thumbLarge-v2.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe opening of roads connecting northern and southern Gaza has enabled some families to reunite. Many families have been separated for months, unable to pass the checkpoints that Israeli forces opened on Monday.\u003c/p\u003e\u003cdiv\u003e\u003cfigure aria-label=\"media\" role=\"group\" data-testid=\"VideoBlock\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eVideo\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://static01.nyt.com/images/2025/01/27/27visualUploader-17760-cover/27visualUploader-17760-cover-threeByTwoLargeAt2X.jpg\" alt=\"Video player loading\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003cspan\u003e\u003cspan\u003eCredit\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003eReuters\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"07e3da36-c986-52f5-940e-6dd0caef12d3\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#07e3da36-c986-52f5-940e-6dd0caef12d3\" role=\"article\" aria-posinset=\"26\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvMDdlM2RhMzYtYzk4Ni01MmY1LTk0MGUtNmRkMGNhZWYxMmQz\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003cspan\u003e\u003cimg alt=\"Rawan Sheikh Ahmad\" src=\"https://static01.nyt.com/images/icons/t_logo_291_black.png?quality=75\u0026amp;auto=webp\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eFadi Zaanin, a nurse who remained in northern Gaza throughout the war, says he’s eagerly awaiting his brother’s return from the south after 16 months apart. But he is worried about where his brother will sleep. Their home was destroyed and Zaanin, who sleeps at the hospital where he works, has nowhere to house his returning relatives.\u003c/p\u003e\u003c/div\u003e\u003cdiv role=\"article\" aria-posinset=\"25\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvNjUzMDk2ODUtOGJjMS01YmRhLWE0YWYtMTgzYzg4ZWFmYWUy\"\u003e\u003cdiv id=\"65309685-8bc1-5bda-a4af-183c88eafae2\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#65309685-8bc1-5bda-a4af-183c88eafae2\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/euan-ward\"\u003e\u003cimg alt=\"Euan Ward\" src=\"https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eLebanon’s health ministry says at least one person has been killed and seven others injured by Israeli fire in southern Lebanon, amid renewed attempts by Lebanese residents on Monday to reach southern border towns still controlled by the Israeli military.\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eRabih Daher/Agence France-Presse — Getty Images\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"\" data-testid=\"reporter-update\" data-url=\"\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/euan-ward\"\u003e\u003cimg alt=\"Euan Ward\" src=\"https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eDiplomats had hoped that an extension on Sunday of the 60-day cease-fire agreement in Lebanon would stave off the violence, but it appears to have done little to prevent displaced Lebanese from trying to go home despite Israeli warnings to keep away.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"c6c901f0-83d7-53dd-8d5f-0d1652607875\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#c6c901f0-83d7-53dd-8d5f-0d1652607875\" role=\"article\" aria-posinset=\"24\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvYzZjOTAxZjAtODNkNy01M2RkLThkNWYtMGQxNjUyNjA3ODc1\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/hiba-yazbek\"\u003e\u003cimg alt=\"Hiba Yazbek\" src=\"https://static01.nyt.com/images/2023/10/09/reader-center/author-hiba-yazbek/author-hiba-yazbek-thumbLarge-v2.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2023/10/09/reader-center/author-hiba-yazbek/author-hiba-yazbek-thumbStandard-v2.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2023/10/09/reader-center/author-hiba-yazbek/author-hiba-yazbek-thumbLarge-v2.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAs the cease-fire in Gaza holds, the Israeli military was pressing on with \u003ca href=\"https://www.nytimes.com/2025/01/22/world/middleeast/israel-west-bank-jenin-raids.html\" title=\"\"\u003eraids\u003c/a\u003e in parts of the occupied West Bank. In Tulkarm, an Israeli strike killed two people and wounded three others, according to the Palestinian health ministry. The Israeli military said that its air force had carried out an attack in Tulkarm, without providing details about the target.\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eAlaa Badarneh/EPA, via Shutterstock\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eJaafar Ashtiyeh/Agence France-Presse — Getty Images\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv data-testid=\"live-blog-post\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#gazans-head-north-on-crutches-in-wheelchairs-and-piled-into-strollers\" data-source-id=\"100000009951274\" role=\"article\" aria-posinset=\"23\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlLzI4NTE4ZDI5LWE5YTctNWVmNC1iM2EyLWZiNWM3NjRhYjc0MA==\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/matthew-mpoke-bigg\"\u003e\u003cimg alt=\"Matthew Mpoke Bigg\" src=\"https://static01.nyt.com/images/2022/03/01/reader-center/author-matthew-bigg/author-matthew-bigg-thumbLarge-v2.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2022/03/01/reader-center/author-matthew-bigg/author-matthew-bigg-thumbStandard-v2.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2022/03/01/reader-center/author-matthew-bigg/author-matthew-bigg-thumbLarge-v2.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003ca href=\"https://www.nytimes.com/by/maud-bodoukian\"\u003e\u003cimg alt=\"Maud Bodoukian\" src=\"https://static01.nyt.com/images/icons/t_logo_291_black.png?quality=75\u0026amp;auto=webp\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2 id=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlLzI4NTE4ZDI5LWE5YTctNWVmNC1iM2EyLWZiNWM3NjRhYjc0MA==\"\u003e\u003ca href=\"#gazans-head-north-on-crutches-in-wheelchairs-and-piled-into-strollers\"\u003eGazans head north on crutches, in wheelchairs and piled into strollers.\u003c/a\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv\u003e\u003cfigcaption\u003e\u003cspan\u003eDisplaced Palestinians walking towards the north of Gaza\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003eDawoud Abu Alkas/Reuters; Ramadan Abed/Reuters; Abdel Kareem Hana/Associated Press; Dawoud Abu Alkas/Reuters\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/div\u003e\u003cp\u003eTens of thousands of people trekked back to northern Gaza on Monday, carrying the few belongings they could. Those making the journey included a teenager who walked on crutches with metal pins protruding from his legs. \u003c/p\u003e\u003cp\u003eOne man pushed a stroller with three children loaded into it, one holding a water bottle and a piece of bread. Behind him, women and children smiled and waved. Elsewhere among the column of people that stretched for miles along Gaza’s coastal road, one woman in a wheelchair waited to make the journey back.\u003c/p\u003e\u003cp\u003eIt was unclear what the displaced Gazans would be returning to, as much of northern Gaza has been reduced to rubble during the Israeli military campaign against Hamas. Yet many of those walking on Monday had smiles on their faces, photos showed. \u003c/p\u003e\u003cdiv\u003e\u003cp\u003eThe joyous mood belied the suffering of 15 months of war. More than 46,000 people were killed and 100,000 people injured in Gaza, according to health officials in the enclave. The war has displaced the majority of Gaza’s 2.2 million people, many of them multiple times, and hundreds of thousands of people have been living in makeshift shelters. \u003c/p\u003e\u003cp\u003eAs they returned north, many people brought household goods and a few other essentials. One teenager carried a large bowl on his head that had been piled high with cooking utensils including pots and pans. To make the load easier to carry, he had balanced the bowl on a pillow.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv role=\"article\" aria-posinset=\"22\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvODhjMzBjZGQtN2NhNy01NTdmLTlmZGUtNjY3ZmEzNjc3YWZl\"\u003e\u003cdiv id=\"88c30cdd-7ca7-557f-9fde-667fa3677afe\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#88c30cdd-7ca7-557f-9fde-667fa3677afe\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003cspan\u003e\u003cimg alt=\"Isabel Kershner and Myra Noveck\" src=\"https://static01.nyt.com/images/icons/t_logo_291_black.png?quality=75\u0026amp;auto=webp\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan itemprop=\"name\"\u003eIsabel Kershner and Myra Noveck\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eCol. Avi Benov, a physcian who is deputy chief of the Israeli military’s medical corps, has just briefed reporters about the return of hostages from Gaza. He said that several of the Israeli women who were released from captivity in recent days had spent the past eight months underground in Hamas tunnels without seeing sunlight.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"\" data-testid=\"reporter-update\" data-url=\"\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003cspan\u003e\u003cimg alt=\"Isabel Kershner and Myra Noveck\" src=\"https://static01.nyt.com/images/icons/t_logo_291_black.png?quality=75\u0026amp;auto=webp\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan itemprop=\"name\"\u003eIsabel Kershner and Myra Noveck\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eThe hostages who have been returned so far — three civilians and four soldiers, all women — were all suffering effects of “mild starvation” and low vitamin levels, Benov said. Some still have shrapnel in their bodies from the Hamas-led assault on Oct. 7, 2023, when they were abducted to Gaza, he added.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"5d6ea256-9084-5b2b-b2d2-8b3a778eab33\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#5d6ea256-9084-5b2b-b2d2-8b3a778eab33\" role=\"article\" aria-posinset=\"21\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvNWQ2ZWEyNTYtOTA4NC01YjJiLWIyZDItOGIzYTc3OGVhYjMz\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/matthew-mpoke-bigg\"\u003e\u003cimg alt=\"Matthew Mpoke Bigg\" src=\"https://static01.nyt.com/images/2022/03/01/reader-center/author-matthew-bigg/author-matthew-bigg-thumbLarge-v2.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2022/03/01/reader-center/author-matthew-bigg/author-matthew-bigg-thumbStandard-v2.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2022/03/01/reader-center/author-matthew-bigg/author-matthew-bigg-thumbLarge-v2.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAmong the household possessions that people carried north were expensive staples including water jugs. Israeli attacks have destroyed basic services in Gaza and much of its infrastructure.\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eHatem Khaled/Reuters\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv data-testid=\"live-blog-post\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#israel-lebanon-hezbollah-strikes-ceasefire\" data-source-id=\"100000009951107\" role=\"article\" aria-posinset=\"20\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlL2FiYmNiZGY4LWIwYzgtNWE1ZS05ZDBkLWExNjAzNjcxNmIwMw==\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/euan-ward\"\u003e\u003cimg alt=\"Euan Ward\" src=\"https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2 id=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlL2FiYmNiZGY4LWIwYzgtNWE1ZS05ZDBkLWExNjAzNjcxNmIwMw==\"\u003e\u003ca href=\"#israel-lebanon-hezbollah-strikes-ceasefire\"\u003eIsraeli forces again open fire as civilians try to return home in southern Lebanon, officials say.\u003c/a\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eA Lebanese soldier, left, filming as Israeli soldiers block a road in the southern Lebanese village of Aitaroun, on Monday. \u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eBilal Hussein/Associated Press\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eIsraeli forces fired toward residents of southern Lebanon for a second consecutive day on Monday as people pressed on with attempts to return to their homes along the border, a day after at least two dozen people were killed and scores injured in Israeli attacks, Lebanese officials said.\u003c/p\u003e\u003cp\u003eThe Israeli fire on Sunday was the deadliest eruption of violence in Lebanon since the war between Israel and Hezbollah, the Lebanese militia, ended with a truce in November. In the renewed violence on Monday, at least two people were killed and 17 others injured, according to Lebanon’s health ministry.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eThe Israeli military said in a statement that it had fired “warning shots in order to eliminate threats,” without providing further details about the nature of those threats.\u003c/p\u003e\u003cp\u003eWire agency photos showed Israeli forces gathered behind makeshift roadblocks, with flattened southern Lebanese villages visible on the rolling hillsides behind them. Some detained men stood crouched alongside a dirt road, blindfolded and with their hands bound as Israeli soldiers stood watch.\u003c/p\u003e\u003cp\u003eThe images showed Hezbollah flags on full display and crowds of men and women, in addition to the U.N. peacekeepers and Lebanese soldiers attempting to protect them.\u003c/p\u003e\u003cp\u003eTelevision screens, however, have been flooded with the images of the dead.\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eResidents of the southern Lebanese village of Khiam driving past a portrait of slain Hezbollah leader Hassan Nasrallah as they returned to their village on Monday. \u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eRabih Daher/Agence France-Presse — Getty Images\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eLebanese paramedics rushed a man who was reportedly shot by Israeli soldiers as he tried to make his way with other residents toward the southern Lebanese village of Kfar Kila, on Monday. \u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eRabih Daher/Agence France-Presse — Getty Images\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eThe Israeli military said on Monday that it had redeployed in areas of southern Lebanon and repeated calls for Lebanese residents to wait for their approval before returning home. The Lebanese military had sent reinforcements to parts of southern Lebanon earlier in the day, preparing to enter some towns and safeguard civilians, Lebanon’s state-run news agency reported.\u003c/p\u003e\u003cp\u003eIsraeli forces killed at least 24 people and injured over 134 others on Sunday, Lebanese officials said, after thousands of Lebanese marched to southern towns and villages. Those areas remain occupied by Israel past a 60-day deadline for its withdrawal under the November cease-fire agreement, which called for both Israel and Hezbollah forces to leave southern Lebanon and for the Lebanese Army and U.N. peacekeepers to deploy in force there.\u003c/p\u003e\u003cp\u003eThe Israeli military said in a statement on Sunday that it had fired “warning shots” to disperse what it called “rioters.” Last week, Israel had indicated that it would remain in southern Lebanon despite the deadline, amid \u003ca href=\"https://www.nytimes.com/2024/11/30/world/middleeast/lebanon-army-ceasefire-israel-hezbollah.html\" title=\"\"\u003edoubts about the Lebanese Army’s ability to stymie Hezbollah’s resurgence\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eNegotiators had hoped that the U.S.-brokered cease-fire by now would have given way for a more permanent settlement. But as the 60-day deadline elapsed on Sunday, the White House issued a statement stating that the initial agreement would be extended until Feb. 18.\u003c/p\u003e\u003cp\u003eHezbollah’s leader, Naim Qassem, said in a speech on Monday that the group did not accept the extension of the cease-fire agreement and called on Israeli forces to withdraw from Lebanon. However, Hezbollah is not a signatory to the deal, and the Lebanese government had already approved the extension after discussions with U.S. officials.\u003c/p\u003e\u003cp\u003eThe flurry of diplomatic activity appeared designed to buy time and stave off further bouts of violence.\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eWomen carrying portraits of fighters walking past the rubble of a mosque that was destroyed during the Israeli offensive in the southern Lebanese village of Aita al-Shaab. \u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eMahmoud Zayyat/Agence France-Presse — Getty Images\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eIsraeli soldiers near Lebanese detainees at the Israeli-Lebanese border, as seen from northern Israel, on Monday. \u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eRonen Zvulun/Reuters\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eMr. Qassem said his group reserved “the right to act as it sees fit” if Israel failed to withdraw from the country, but stopped short of delivering a direct threat during his speech on Monday.\u003c/p\u003e\u003cp\u003eBattered by the deadliest war with Israel in decades, the group has little impetus to reignite a conflict that would only weaken the group further as it attempts to recover, experts say. Instead, Mr. Qassem called on Lebanon’s new leaders to act, and said the international community would be responsible for “any consequences arising from the delay.”\u003c/p\u003e\u003cp\u003eDuring a meeting with U.S. officials on Monday, Lebanon’s caretaker prime minister, Najib Mikati, stressed that the extension did “not give Israel any excuse not to withdraw,” according to a statement from his office. He accused Israeli forces of “procrastinating” and said pressure was needed to stop their “repeated violations” of the truce deal.\u003c/p\u003e\u003cp\u003eThe bloodshed on Sunday prompted urgent calls for restraint by the United Nations amid growing fears of a sustained Israeli occupation and renewed hostilities between Israel and Hezbollah.\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eResidents of Kfar Kila gathered at a Lebanese army checkpoint in Burj al-Muluk, on the outskirts of their village.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eRabih Daher/Agence France-Presse — Getty Images\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eEven as the cease-fire held, albeit precariously, in Lebanon, the Israeli military said it had “initiated a counterterrorism operation” in the city of Tulkarm in the Israeli-occupied West Bank.\u003c/p\u003e\u003cp\u003eThe military said its aircraft had killed Ihab Abu Atiwi, who was described as the head of the local branch of Hamas, and circulated images of a car being blown up. The Palestinian health ministry said an airstrike had killed two people and wounded three others.\u003c/p\u003e\u003cp\u003eMyra Noveck, Johnatan Reiss, Sarah Chaito and Thomas Fuller contributed reporting.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"8e1999f9-6c0f-591d-aa82-c37dbd25b09a\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#8e1999f9-6c0f-591d-aa82-c37dbd25b09a\" role=\"article\" aria-posinset=\"19\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvOGUxOTk5ZjktNmMwZi01OTFkLWFhODItYzM3ZGJkMjViMDlh\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003cspan\u003e\u003cimg alt=\"Bilal Shbair\" src=\"https://static01.nyt.com/images/icons/t_logo_291_black.png?quality=75\u0026amp;auto=webp\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan itemprop=\"name\"\u003eBilal Shbair\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-testid=\"lb-byline-tagline\"\u003eOn the coastal road of Gaza\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003e“We’re so overjoyed,” said Malak al-Haj Ahmed, 17, a high-school student taking selfies with her family beside the coastal road in Gaza. “There’s no moment more joyful than returning home.”\u003c/p\u003e\u003c/div\u003e\u003cdiv role=\"article\" aria-posinset=\"18\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvY2ZjN2VhNmUtNzU1Zi01NDg5LTg1NmQtODFmMTU1NWUxZmJj\"\u003e\u003cdiv id=\"cfc7ea6e-755f-5489-856d-81f1555e1fbc\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#cfc7ea6e-755f-5489-856d-81f1555e1fbc\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/euan-ward\"\u003e\u003cimg alt=\"Euan Ward\" src=\"https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAs residents began returning to northern Gaza, Israeli forces have reportedly opened fire \u003ca href=\"https://www.nytimes.com/2025/01/26/world/middleeast/lebanon-gaza-cease-fires.html\" title=\"\"\u003efor a second day\u003c/a\u003e on Lebanese attempting to return to their homes in southern Lebanon in defiance of Israeli warnings, according to Lebanon’s state-run news agency. Lebanon\u0026#39;s health ministry said two people were injured, including a child.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"\" data-testid=\"reporter-update\" data-url=\"\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/euan-ward\"\u003e\u003cimg alt=\"Euan Ward\" src=\"https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe Israeli military did not immediately respond to a request for comment. The Lebanese military sent reinforcements to parts of southern Lebanon earlier in the day, preparing to enter some towns and safeguard civilians attempting to return home, the agency reported.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv role=\"article\" aria-posinset=\"17\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvNTZhM2RiNDItNTQ4Mi01NDlhLWJjYTEtZTMzM2IxNDU0YmQ3\"\u003e\u003cdiv id=\"56a3db42-5482-549a-bca1-e333b1454bd7\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#56a3db42-5482-549a-bca1-e333b1454bd7\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/aaron-boxerman\"\u003e\u003cimg alt=\"Aaron Boxerman\" src=\"https://static01.nyt.com/images/2023/09/22/reader-center/author-aaron-boxerman/author-aaron-boxerman-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2023/09/22/reader-center/author-aaron-boxerman/author-aaron-boxerman-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2023/09/22/reader-center/author-aaron-boxerman/author-aaron-boxerman-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAwad Abid, a former taxi driver from northern Gaza, said he was waiting a few days to see if he could hitch a ride for his young children, who could not return to the north on foot. Abid is currently living in a tent camp near the southern city of Khan Younis that many people have left over the past several hours.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"\" data-testid=\"reporter-update\" data-url=\"\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/aaron-boxerman\"\u003e\u003cimg alt=\"Aaron Boxerman\" src=\"https://static01.nyt.com/images/2023/09/22/reader-center/author-aaron-boxerman/author-aaron-boxerman-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2023/09/22/reader-center/author-aaron-boxerman/author-aaron-boxerman-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2023/09/22/reader-center/author-aaron-boxerman/author-aaron-boxerman-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eHe said that given the choice, he would prefer to leave Gaza and build a new life. “There are a lot of issues — people whose homes were destroyed and are living in other houses, disputes over property, problems between families that began during their time in Khan Younis,” he said. “This war tore apart our social fabric.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"5252825e-3146-5c74-a1e3-32fde194e479\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#5252825e-3146-5c74-a1e3-32fde194e479\" role=\"article\" aria-posinset=\"16\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvNTI1MjgyNWUtMzE0Ni01Yzc0LWExZTMtMzJmZGUxOTRlNDc5\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/hiba-yazbek\"\u003e\u003cimg alt=\"Hiba Yazbek\" src=\"https://static01.nyt.com/images/2023/10/09/reader-center/author-hiba-yazbek/author-hiba-yazbek-thumbLarge-v2.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2023/10/09/reader-center/author-hiba-yazbek/author-hiba-yazbek-thumbStandard-v2.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2023/10/09/reader-center/author-hiba-yazbek/author-hiba-yazbek-thumbLarge-v2.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe Gazan government press office said in a statement that 135,000 tents and caravans were “immediately and urgently” needed in Gaza City and northern Gaza to accommodate the thousands of displaced people who were returning to an area where 90 percent of the buildings and infrastructure had been destroyed by Israeli bombardment.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"bb18ad35-5ebe-59e1-9b01-c33a9497ed46\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#bb18ad35-5ebe-59e1-9b01-c33a9497ed46\" role=\"article\" aria-posinset=\"15\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvYmIxOGFkMzUtNWViZS01OWUxLTliMDEtYzMzYTk0OTdlZDQ2\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/hiba-yazbek\"\u003e\u003cimg alt=\"Hiba Yazbek\" src=\"https://static01.nyt.com/images/2023/10/09/reader-center/author-hiba-yazbek/author-hiba-yazbek-thumbLarge-v2.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2023/10/09/reader-center/author-hiba-yazbek/author-hiba-yazbek-thumbStandard-v2.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2023/10/09/reader-center/author-hiba-yazbek/author-hiba-yazbek-thumbLarge-v2.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe Gazan Health Ministry said in a statement that it had set up 19 emergency medical points along the route that thousands of displaced Palestinians were taking on their journey back to northern Gaza. After territory\u0026#39;s healthcare system was crippled by 15 months of Israeli bombardment, these medical points were set up “to provide urgent health care to citizens returning to their areas,” the statement said.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"b496a5c2-e074-5bf2-8958-c96872b4d373\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#b496a5c2-e074-5bf2-8958-c96872b4d373\" role=\"article\" aria-posinset=\"14\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvYjQ5NmE1YzItZTA3NC01YmYyLTg5NTgtYzk2ODcyYjRkMzcz\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/adam-rasgon\"\u003e\u003cimg alt=\"Adam Rasgon\" src=\"https://static01.nyt.com/images/2024/05/14/reader-center/author-adam-rasgon/author-adam-rasgon-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2024/05/14/reader-center/author-adam-rasgon/author-adam-rasgon-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2024/05/14/reader-center/author-adam-rasgon/author-adam-rasgon-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAs thousands trek north, many other displaced Palestinians have decided to wait until later this week to return to northern Gaza when they hope the roads will be less crowded. “I’m so happy — I’ve been waiting to return home for more than a year,” said Khalil el-Halabi, 70, a displaced person originally from Gaza City. “But I’ll have to wait another day because there’s an endless human chain on the road.”\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"84f5c8e5-88e6-5423-a657-72786ae27c55\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#84f5c8e5-88e6-5423-a657-72786ae27c55\" role=\"article\" aria-posinset=\"13\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvODRmNWM4ZTUtODhlNi01NDIzLWE2NTctNzI3ODZhZTI3YzU1\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/nader-ibrahim\"\u003e\u003cimg alt=\"Nader Ibrahim\" src=\"https://static01.nyt.com/images/2023/11/11/reader-center/author-nader-ibrahim/author-nader-ibrahim-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2023/11/11/reader-center/author-nader-ibrahim/author-nader-ibrahim-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2023/11/11/reader-center/author-nader-ibrahim/author-nader-ibrahim-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eHaving walked miles from the southern regions of Gaza, thousands of Palestinians are arriving in Gaza City, in the north of the territory, according to video footage. Some of them are carrying very few, if any, belongings. Many will be returning to homes badly damaged or destroyed by the war.\u003c/p\u003e\u003cdiv\u003e\u003cfigure aria-label=\"media\" role=\"group\" data-testid=\"VideoBlock\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eVideo\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://static01.nyt.com/images/2025/01/27/27visualUploader-59011-cover/27visualUploader-59011-cover-threeByTwoLargeAt2X.jpg\" alt=\"Video player loading\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003cspan\u003e\u003cspan\u003eCredit\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003eReuters\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"70633d5a-22b1-56f1-b305-fa912a8a1250\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#70633d5a-22b1-56f1-b305-fa912a8a1250\" role=\"article\" aria-posinset=\"12\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvNzA2MzNkNWEtMjJiMS01NmYxLWIzMDUtZmE5MTJhOGExMjUw\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/patrick-kingsley\"\u003e\u003cimg alt=\"Patrick Kingsley\" src=\"https://static01.nyt.com/images/2018/10/15/multimedia/author-patrick-kingsley/author-patrick-kingsley-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2018/10/15/multimedia/author-patrick-kingsley/author-patrick-kingsley-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2018/10/15/multimedia/author-patrick-kingsley/author-patrick-kingsley-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eSince Palestinians still can’t drive along the coastal road to Gaza City, some are using bikes, wheelchairs and trolleys to carry their belongings. One man has attached wheels to a plastic box, turning it into a makeshift stroller for his baby.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"live-blog-post\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#gaza-lebanon-israel-ceasefire\" data-source-id=\"100000009951020\" role=\"article\" aria-posinset=\"11\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlL2I5YzllYTVmLTdjZjQtNTlmOC1iZTE1LTMzZWJjODBmZmViZg==\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/patrick-kingsley\"\u003e\u003cimg alt=\"Patrick Kingsley\" src=\"https://static01.nyt.com/images/2018/10/15/multimedia/author-patrick-kingsley/author-patrick-kingsley-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2018/10/15/multimedia/author-patrick-kingsley/author-patrick-kingsley-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2018/10/15/multimedia/author-patrick-kingsley/author-patrick-kingsley-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eNews Analysis\u003c/p\u003e\u003cp\u003e\u003ch2 id=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlL2I5YzllYTVmLTdjZjQtNTlmOC1iZTE1LTMzZWJjODBmZmViZg==\"\u003e\u003ca href=\"#gaza-lebanon-israel-ceasefire\"\u003eThe Gaza and Lebanon truces are fragile, but all sides want them to hold, analysts say.\u003c/a\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eAn Israeli army vehicle in southern Lebanon on Sunday.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eAmir Levy/Getty Images\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eThe cease-fires in Gaza and Lebanon will most likely hold for now, despite being tested to their limits over the weekend, because all sides want to avoid full-scale fighting at least for a few weeks, analysts said.\u003c/p\u003e\u003cp\u003eIn southern Lebanon, Israeli troops \u003ca href=\"https://www.nytimes.com/2025/01/24/world/middleeast/israel-lebanon-hezbollah-withdrawal-deadline.html\" title=\"\"\u003eremained in position\u003c/a\u003e past the deadline on Sunday for their withdrawal, amid Israeli claims that Hezbollah had broken its own pledge to leave the area. In Gaza, Hamas failed to release a female hostage who Israel had hoped would be freed on Saturday, prompting Israel to \u003ca href=\"https://www.nytimes.com/2025/01/25/world/middleeast/israel-gaza-hostage-prisoner-swap.html\" title=\"\"\u003edelay the agreed return\u003c/a\u003e of displaced Palestinians to their homes in northern Gaza.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eBut even as each side accused the other of reneging on their deals, analysts said, both Israel and its opponents had reasons to remain flexible and temporarily overlook the other’s transgressions.\u003c/p\u003e\u003cp\u003eHezbollah, though angry at Israel for keeping troops in southern Lebanon, would risk a devastating Israeli counterattack if it renews its rocket strikes on Israeli cities. Hamas wants to retain power in Gaza and risks losing it if war returns. And Israel needs to maintain the current arrangement in Gaza long enough to free at least two dozen more hostages. Israeli leaders have also appeared eager to placate President Trump, who campaigned on \u003ca href=\"https://www.nytimes.com/interactive/2025/01/19/us/politics/trump-president-promises.html\" title=\"\"\u003ea promise to keep peace\u003c/a\u003e in the Middle East.\u003c/p\u003e\u003cp\u003eIllustrating their desire to prolong the Gaza truce, Israel and Hamas seemed to resolve the weekend’s crisis close to midnight on Sunday. The government of Qatar, a mediator between the sides, said that \u003ca href=\"#arbel-yehud-israel-hostage-hamas\" title=\"\"\u003ethe female hostage, Arbel Yehud\u003c/a\u003e, would be freed this week along with two others who would be released ahead of schedule. In return, Israel said that it would allow displaced Palestinians to \u003ca href=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza\" title=\"\"\u003ereturn to northern Gaza\u003c/a\u003e on Monday morning. By Monday night, \u003ca href=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza\" title=\"\"\u003emore than 300,000 Gazans had returned\u003c/a\u003e, the Hamas-run government media office said.\u003c/p\u003e\u003cp\u003eAs for Lebanon, \u003ca href=\"https://www.whitehouse.gov/briefings-statements/2025/01/white-house-statement-on-agreement-extension-between-lebanon-and-israel/\" title=\"\" rel=\"noopener noreferrer\" target=\"_blank\"\u003ethe White House announced\u003c/a\u003e that the truce there would be extended until Feb. 18, though there was no immediate comment from Israel or Hezbollah. The Lebanese prime minister’s office confirmed the extension.\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eHezbollah flags at a barricade in southern Lebanon on Sunday.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eRabih Daher/Agence France-Presse — Getty Images\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eAaron David Miller, a former U.S. negotiator in Middle East peace talks, said, “They’re going to get through the next few weeks — beyond that is anyone’s guess.”\u003c/p\u003e\u003cp\u003e“These are not agreements between the United States and Switzerland. They’re agreements that depend on each side giving the other a certain discretion and margin for maneuver,” he added. “That is their weakness, but also their strength.”\u003c/p\u003e\u003cp\u003eThat wriggle room ultimately allowed both truces to survive the weekend, even as Israeli troops shot and \u003ca href=\"https://www.nytimes.com/2025/01/26/world/middleeast/lebanon-gaza-cease-fires.html\" title=\"\"\u003ekilled people in both Lebanon and Gaza\u003c/a\u003e who were trying to return to areas still controlled by Israel.\u003c/p\u003e\u003cp\u003eThe Lebanese Health Ministry said that 22 people had been killed by Israeli fire in southern Lebanon, and the Palestinian Authority’s news agency said that one person had been killed in Gaza as large crowds in both places gathered near Israeli troops, demanding to go home.\u003c/p\u003e\u003cp\u003eBut by Monday morning, the standoff in Gaza appeared set to ease. In Lebanon, Hezbollah issued a statement praising the residents attempting to return and calling on foreign powers to force Israel to withdraw. But Hezbollah did not resume its rocket fire.\u003c/p\u003e\u003cp\u003eAnalysts say that Hezbollah is unlikely to risk further losses while its leadership is decimated and its benefactor, Iran, is weakened. Also, the group’s main arms supply route, through Syria, was blocked in December when the Syrian president, Bashar al-Assad, an ally of Hezbollah, was \u003ca href=\"https://www.nytimes.com/2024/12/21/world/middleeast/assad-regime-syria-final-days.html\" title=\"\"\u003eousted by rebels\u003c/a\u003e.\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eDisplaced Palestinians heading north in Gaza on Monday.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eAbdel Kareem Hana/Associated Press\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eHezbollah’s commanders do “still have some rockets, they have some guns, they can do something,” said Hanin Ghaddar, a Lebanese analyst at the Washington Institute for Near East Policy, a foreign affairs research group.\u003c/p\u003e\u003cp\u003e“But it’s suicidal if they do this, because they know that any kind of attack by Hezbollah in Israel means that Israel will take the opportunity to come back full blast and annihilate whatever is left of them,” Ms. Ghaddar added.\u003c/p\u003e\u003cp\u003eHezbollah is also probably wary of losing support among its Shiite Muslim base, particularly in next year’s parliamentary elections, Ms. Ghaddar said. Lebanon’s Shiite community paid the largest price for Hezbollah’s decision to go to \u003ca href=\"https://www.nytimes.com/news-event/israel-hamas-gaza\" title=\"\"\u003ewar with Israel\u003c/a\u003e in October 2023 in solidarity with its ally Hamas. Shiite villages and towns in southern Lebanon \u003ca href=\"https://www.nytimes.com/interactive/2024/10/09/world/middleeast/lebanon-destruction.html\" title=\"\"\u003ebore the brunt\u003c/a\u003e of Israel’s ensuing air campaign and ground invasion.\u003c/p\u003e\u003cp\u003e“If the Shia do not vote for them, this is the end of Hezbollah,” said Ms. Ghaddar, the author of a book about Hezbollah’s relationship with its base. “They cannot really do anything if they don’t know 100 percent that the Shia community is going to support it.”\u003c/p\u003e\u003cp\u003eBecause Hezbollah is less likely to resume fighting, the Gaza cease-fire is considered the frailest of the two truces.\u003c/p\u003e\u003cp\u003eBut its biggest stress test is not expected until the beginning of March, when Hamas and Israel must decide whether to extend the arrangement beyond an initial 42-day truce.\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eHeading north in Gaza on Monday. Israel and Hamas seemed to resolve the weekend’s crisis close to midnight on Sunday, illustrating both sides’ desire to prolong the truce.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eMohammad Abu Samra/Associated Press\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eFor now, Israel has signaled it wants to maintain the cease-fire to sustain the flow of hostage releases. But an extension would require both sides to agree to a permanent end to the war — a bridge that Prime Minister Benjamin Netanyahu of Israel has appeared unwilling to cross. Mr. Netanyahu’s coalition government relies on far-right lawmakers who seek permanent Israeli control of Gaza, and his administration could collapse if the war ends with Hamas still in charge.\u003c/p\u003e\u003cp\u003eThe terms of the agreement allow for some flexibility. The truce can continue beyond the 42-day mark as long as both sides remain negotiating about whether to make the arrangement permanent.\u003c/p\u003e\u003cp\u003eBut Israeli officials say they will not remain locked in endlessly fruitless negotiations, especially if Hamas stops releasing hostages. And Hamas is unlikely to keep freeing the hostages, its main bargaining chip, without an Israeli promise to cease hostilities permanently.\u003c/p\u003e\u003cp\u003e“Hamas wants a cease-fire but not at all costs,” said Mkhaimar Abusada, a Palestinian political scientist from Gaza. “They want a cease-fire that ends the war.”\u003c/p\u003e\u003cp\u003eMuch could depend on President Trump’s willingness to cajole Mr. Netanyahu toward a more lasting truce. Mr. Trump’s private messages to the Israeli prime minister were crucial to the forging of the initial phase, but it remains to be seen whether the American president will maintain that position beyond a few weeks.\u003c/p\u003e\u003cp\u003e“If Netanyahu succeeds in convincing Trump of the need to renew the war, there’ll probably be a renewal of the war,” Mr. Abusada said. “If Trump keeps his promise that he doesn’t want any wars and he wants more peace — whether it’s in Gaza, Ukraine or all over the world — that’s a different thing.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv role=\"article\" aria-posinset=\"10\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvNjczMzVmMTItNmQyNC01ZTJjLTg2OTEtYjJkMTllNTc3NzU5\"\u003e\u003cdiv id=\"67335f12-6d24-5e2c-8691-b2d19e577759\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/01/27/world/israel-hamas-lebanon-gaza#67335f12-6d24-5e2c-8691-b2d19e577759\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003cspan\u003e\u003cimg alt=\"Bilal Shbair\" src=\"https://static01.nyt.com/images/icons/t_logo_291_black.png?quality=75\u0026amp;auto=webp\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan itemprop=\"name\"\u003eBilal Shbair\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-testid=\"lb-byline-tagline\"\u003eOn the coastal road of Gaza\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eThe people on the road are carrying bags, mattresses, duvets — whatever possessions they can carry on their backs. Many are walking on foot, but some are waiting for buses to take them closer to the Netzarim corridor.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"\" data-testid=\"reporter-update\" data-url=\"\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003cspan\u003e\u003cimg alt=\"Bilal Shbair\" src=\"https://static01.nyt.com/images/icons/t_logo_291_black.png?quality=75\u0026amp;auto=webp\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan itemprop=\"name\"\u003eBilal Shbair\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-testid=\"lb-byline-tagline\"\u003eOn the coastal road of Gaza\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eAs I walked through the town of Deir al Balah to reach the coast, it was hard to move because there were so many displaced people packing up their belongings. People were taking down their tents and loading donkeys with their possessions.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "43 min read",
  "publishedTime": "2025-01-27T05:01:32Z",
  "modifiedTime": "2025-01-27T21:57:20.217Z"
}
