{
  "id": "21c07e41-5d6b-424a-941d-c8bc4dc2de9d",
  "title": "Many States Show Interest In BRICS, Says Russian President Putin",
  "link": "https://www.ndtv.com/world-news/many-states-show-interest-in-brics-says-russian-president-vladimir-putin-7289833",
  "description": "Answering a question from a journalist from Tatarstan about BRICS, the Russian head of state emphasised that the association works for the interests of the member states, as per TV BRICS.",
  "author": "",
  "published": "Fri, 20 Dec 2024 05:12:26 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "Asian News International",
  "length": 3014,
  "excerpt": "Answering a question from a journalist from Tatarstan about BRICS, the Russian head of state emphasised that the association works for the interests of the member states, as per TV BRICS.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Moscow: The BRICS countries continue to create new tools to ensure economic growth and transform the structure of the world economy so that in the long term it will contribute to the progress of humanity and strengthen the position of the group's countries as the leader of the global movement forward. This was stated by Russian President Vladimir Putin during the \"Results of the Year\" on December 19, TV BRICS reported.Answering a question from a journalist from Tatarstan about BRICS, the Russian head of state emphasised that the association works for the interests of the member states, as per TV BRICS.\"The association is developing rapidly. Many states show interest in BRICS because this work is built solely on the basis of reciprocity and respect for each other and each other's interests. All issues are adopted by consensus, and this is very important. There are no small and big states, more developed and less developed; there is an association of interests, and there is only one interest - development,\" TV BRICS quoted Vladimir Putin as saying.The Russian leader also noted that the BRICS summit in Kazan attracted a significant number of world leaders. According to him, the capital of Tatarstan has made a significant leap in development in recent years and is now one of the best cities in Europe.In addition, Putin answered a question asked by a journalist from Xinhua News Agency, a partner of TV BRICS, about the prospects of relations between Russia and China. He emphasised that they have reached an unprecedented high level in the last decade, as they are based on mutual trust.Speaking about economic cooperation, the Russian President noted that the trade turnover between the countries, according to various estimates, ranges from USD 220 to USD 240 billion. In addition, the states are implementing more than 600 joint investment projects, TV BRICS reported.\"Finally, a very important component, in my opinion, is the humanitarian part. We constantly hold cross years - the year of culture, the year of youth exchanges. This is all very important for people; it is a base for the development of economic ties and political interaction,\" Putin added.\"Latin America is represented here, as always, because Cuba, Venezuela, and the rest of the region have always had good, friendly relations with Russia,\" Prensa Latina journalist Hansell Pavel Oro Oro noted in a conversation with the international media network.The programme \"Results of the Year with Vladimir Putin\" was held in the format of a direct line combined with a press conference. The head of state answered questions from citizens and representatives of Russian and foreign media on topics ranging from domestic policy and social agenda to international relations and foreign economic activity. The direct line received almost 2.5 million appeals, and 76 questions were asked during the event, as per TV BRICS.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
  "image": "https://c.ndtvimg.com/2024-12/bg0a0d7g_putin_625x300_19_December_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                \u003cp\u003e\u003cb\u003eMoscow: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe BRICS countries continue to create new tools to ensure economic growth and transform the structure of the world economy so that in the long term it will contribute to the progress of humanity and strengthen the position of the group\u0026#39;s countries as the leader of the global movement forward. This was stated by Russian President Vladimir Putin during the \u0026#34;Results of the Year\u0026#34; on December 19, TV BRICS reported.\u003c/p\u003e\u003cp\u003eAnswering a question from a journalist from Tatarstan about BRICS, the Russian head of state emphasised that the association works for the interests of the member states, as per TV BRICS.\u003c/p\u003e\u003cp\u003e\u0026#34;The association is developing rapidly. Many states show interest in BRICS because this work is built solely on the basis of reciprocity and respect for each other and each other\u0026#39;s interests. All issues are adopted by consensus, and this is very important. There are no small and big states, more developed and less developed; there is an association of interests, and there is only one interest - development,\u0026#34; TV BRICS quoted Vladimir Putin as saying.\u003c/p\u003e\u003cp\u003eThe Russian leader also noted that the BRICS summit in Kazan attracted a significant number of world leaders. According to him, the capital of Tatarstan has made a significant leap in development in recent years and is now one of the best cities in Europe.\u003c/p\u003e\u003cp\u003eIn addition, Putin answered a question asked by a journalist from Xinhua News Agency, a partner of TV BRICS, about the prospects of relations between Russia and China. He emphasised that they have reached an unprecedented high level in the last decade, as they are based on mutual trust.\u003c/p\u003e\u003cp\u003eSpeaking about economic cooperation, the Russian President noted that the trade turnover between the countries, according to various estimates, ranges from USD 220 to USD 240 billion. In addition, the states are implementing more than 600 joint investment projects, TV BRICS reported.\u003c/p\u003e\u003cp\u003e\u0026#34;Finally, a very important component, in my opinion, is the humanitarian part. We constantly hold cross years - the year of culture, the year of youth exchanges. This is all very important for people; it is a base for the development of economic ties and political interaction,\u0026#34; Putin added.\u003c/p\u003e\u003cp\u003e\u0026#34;Latin America is represented here, as always, because Cuba, Venezuela, and the rest of the region have always had good, friendly relations with Russia,\u0026#34; Prensa Latina journalist Hansell Pavel Oro Oro noted in a conversation with the international media network.\u003c/p\u003e\u003cp\u003eThe programme \u0026#34;Results of the Year with Vladimir Putin\u0026#34; was held in the format of a direct line combined with a press conference. The head of state answered questions from citizens and representatives of Russian and foreign media on topics ranging from domestic policy and social agenda to international relations and foreign economic activity. The direct line received almost 2.5 million appeals, and 76 questions were asked during the event, as per TV BRICS.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                        \n                                        \n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-20T05:12:26+05:30",
  "modifiedTime": null
}
