{
  "id": "227b3561-3c76-4b01-a2f3-7917920dce93",
  "title": "Syria conflict: 'Cautious calm' returns to Sweida; Druze-Bedouin fighting killed over 1,100",
  "link": "https://timesofindia.indiatimes.com/world/middle-east/syria-conflict-cautious-calm-returns-to-sweida-druze-bedouin-fighting-killed-over-1100/articleshow/122804162.cms",
  "description": "A fragile calm has settled over Sweida, Southern Syria, after a week of intense sectarian violence that claimed over 1,100 lives. A ceasefire, brokered after multiple failed attempts, is holding between Druze factions and Sunni Bedouin rivals. Government forces have secured parts of the province, and humanitarian aid has begun to arrive.",
  "author": "TOI World Desk",
  "published": "2025-07-21T06:42:16+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 3604,
  "excerpt": "Middle East News: A fragile calm has settled over Sweida, Southern Syria, after a week of intense sectarian violence that claimed over 1,100 lives. A ceasefire, brokere",
  "siteName": "The Times Of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "Southern Syria’s Sweida province witnessed a fragile calm on Sunday after a week of intense sectarian violence that claimed over 1,100 lives. The silence came after a ceasefire, announced on Saturday, began to take hold, succeeding where earlier attempts had failed. The fighting, largely between Druze factions and Sunni Bedouin rivals, quickly escalated into a wider conflict involving the Syrian government, Israeli military strikes, and armed tribal groups from across the country. Government forces have since moved in to secure parts of the province, and no fresh clashes erupted on Sunday morning, AFP reported. In a sign of easing tensions, a humanitarian aid convoy managed to enter the city for the first time, according to Red Crescent official Omar al-Malki. He said the operation was coordinated with government agencies and local Druze authorities.However, the Syrian government claimed that a separate convoy it dispatched was blocked by Druze fighters at the city’s entrance. The Britain-based Syrian Observatory for Human Rights said that \"Sweida has been experiencing a cautious calm\" since midnight, with security forces sealing off roads leading to the province in an effort to keep out additional tribal fighters. Late Sunday, the Observatory released an updated death toll, reporting that 1,120 people have been killed since the violence broke out a week ago. The dead include 427 Druze fighters, 298 Druze civilians, 354 government personnel, and 21 Sunni Bedouin. Local witnesses and Druze groups have accused government forces of siding with the Bedouin and carrying out summary executions when they entered the city earlier in the week. Hanadi Obeid, a 39-year-old doctor, told AFP, “The city hasn’t seen calm like this in a week.” A medic still working inside Sweida confirmed the relative peace, saying, “We aren’t hearing clashes.” The Syrian interior ministry announced that all tribal fighters had left Sweida city overnight and that intra-city clashes had come to a halt. The Observatory said Druze groups had regained control of the city by Saturday evening. Saturday’s ceasefire was announced by interim President Ahmed al-Sharaa, who also refirmed his commitment to protecting Syria’s religious and ethnic minorities. This latest round of bloodshed follows the ousting of former president Bashar al-Assad by Islamist forces last December. A spokesperson for Syria’s tribal and clan council told Al Jazeera that fighters had agreed to withdraw from the city in line with the presidency’s ceasefire terms. Sweida’s population of around 150,000 has been largely confined to their homes over the past week without electricity, clean water, or food. The UN migration agency estimates that more than 128,000 people across the province have been displaced by the violence. US Special Envoy to Syria, Tom Barrack, said the country had reached “a critical juncture” and urged all factions to end the fighting. “peace and dialogue must prevail -- and prevail now,” he posted on X.\"All factions must immediately lay down their arms, cease hostilities, and abandon cycles of tribal vengeance,\" he said, adding \"brutal acts by warring factions on the ground undermine the government's authority and disrupt any semblance of order\". The ceasefire came just hours after the US announced it had brokered a deal between the Syrian government and Israel, following Israeli airstrikes on Damascus and Sweida earlier in the week. Israel, which has a Druze population of its own, said the action was aimed at protecting the community and pushing for full demilitarisation of southern Syria.",
  "image": "https://static.toiimg.com/thumb/msid-122804218,width-1070,height-580,imgsize-218070,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-122804218,imgsize-218070,width-400,resizemode-4/122804218.jpg\" alt=\"Syria conflict: \u0026#39;Cautious calm\u0026#39; returns to Sweida; Druze-Bedouin fighting killed over 1,100\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eSouthern Syria’s Sweida province witnessed a fragile calm on Sunday after a week of intense sectarian violence that claimed over 1,100 lives. \u003cspan data-pos=\"1\"\u003e\u003c/span\u003eThe silence came after a ceasefire, announced on Saturday, began to take hold, succeeding where earlier attempts had failed.\u003cspan data-pos=\"4\"\u003e\u003c/span\u003e The fighting, largely between Druze factions and Sunni Bedouin rivals, quickly escalated into a wider conflict involving the Syrian government, Israeli military strikes, and armed tribal groups from across the country. \u003cspan data-pos=\"6\"\u003e\u003c/span\u003eGovernment forces have since moved in to secure parts of the province, and no fresh clashes erupted on Sunday morning, AFP reported.\u003cspan data-pos=\"8\"\u003e\u003c/span\u003e In a sign of easing tensions, a humanitarian aid convoy managed to enter the city for the first time, according to Red Crescent official Omar al-Malki. He said the operation was coordinated with government agencies and local Druze authorities.\u003cspan data-pos=\"12\"\u003e\u003c/span\u003eHowever, the Syrian government claimed that a separate convoy it dispatched was blocked by Druze fighters at the city’s entrance.\u003cspan data-pos=\"14\"\u003e\u003c/span\u003e The Britain-based Syrian Observatory for Human Rights said that \u0026#34;Sweida has been experiencing a cautious calm\u0026#34; since midnight, with security forces sealing off roads leading to the province in an effort to keep out additional tribal fighters.\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"17\"\u003e\u003c/span\u003e Late Sunday, the Observatory released an updated death toll, reporting that 1,120 people have been killed since the violence broke out a week ago. The dead include 427 Druze fighters, 298 Druze civilians, 354 government personnel, and 21 Sunni Bedouin. Local witnesses and Druze groups have accused government forces of siding with the Bedouin and carrying out summary executions when they entered the city earlier in the week.\u003cspan data-pos=\"20\"\u003e\u003c/span\u003e Hanadi Obeid, a 39-year-old doctor, told AFP, “The city hasn’t seen calm like this in a week.” \u003cspan data-pos=\"22\"\u003e\u003c/span\u003eA medic still working inside Sweida confirmed the relative peace, saying, “We aren’t hearing clashes.”\u003cspan data-pos=\"24\"\u003e\u003c/span\u003e The Syrian interior ministry announced that all tribal fighters had left Sweida city overnight and that intra-city clashes had come to a halt. The Observatory said Druze groups had regained control of the city by Saturday evening.\u003cspan data-pos=\"27\"\u003e\u003c/span\u003e Saturday’s ceasefire was announced by interim President Ahmed al-Sharaa, who also refirmed his commitment to protecting Syria’s religious and ethnic minorities. This latest round of bloodshed follows the ousting of former president Bashar al-Assad by Islamist forces last December.\u003cspan data-pos=\"29\"\u003e\u003c/span\u003e A spokesperson for Syria’s tribal and clan council told Al Jazeera that fighters had agreed to withdraw from the city in line with the presidency’s ceasefire terms.\u003cspan data-pos=\"32\"\u003e\u003c/span\u003e Sweida’s population of around 150,000 has been largely confined to their homes over the past week without electricity, clean water, or food. The UN migration agency estimates that more than 128,000 people across the province have been displaced by the violence.\u003cspan data-pos=\"34\"\u003e\u003c/span\u003e US Special Envoy to Syria, Tom Barrack, said the country had reached “a critical juncture” and urged all factions to end the fighting. “peace and dialogue must prevail -- and prevail now,” he posted on X.\u003cspan data-pos=\"37\"\u003e\u003c/span\u003e\u0026#34;All factions must immediately lay down their arms, cease hostilities, and abandon cycles of tribal vengeance,\u0026#34; he said, adding \u0026#34;brutal acts by warring factions on the ground undermine the government\u0026#39;s authority and disrupt any semblance of order\u0026#34;.\u003cspan data-pos=\"39\"\u003e\u003c/span\u003e The ceasefire came just hours after the US announced it had brokered a deal between the Syrian government and Israel, following Israeli airstrikes on Damascus and Sweida earlier in the week. Israel, which has a Druze population of its own, said the action was aimed at protecting the community and pushing for full demilitarisation of southern Syria.\u003cspan data-pos=\"41\"\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-07-21T06:42:00+05:30",
  "modifiedTime": null
}
