{
  "id": "29d904ac-839f-4047-9021-f504b566e60f",
  "title": "Trump win leaves Russia jubilant and Europe putting on a brave face",
  "link": "https://www.washingtonpost.com/world/2024/11/06/us-elections-global-reaction-trump-win/",
  "description": "Israel’s and Ukraine’s leaders were among the first to congratulate Donald Trump. His victory is resonating across the globe.",
  "author": "Washington Post staff",
  "published": "Thu, 07 Nov 2024 00:11:35 +0000",
  "source": "http://feeds.washingtonpost.com/rss/world",
  "categories": null,
  "byline": "Washington Post staff",
  "length": 16976,
  "excerpt": "Israel’s and Ukraine’s leaders were among the first to congratulate Donald Trump. His victory is resonating across the globe.",
  "siteName": "The Washington Post",
  "favicon": "https://www.washingtonpost.com/touch-icon-iphone-retina.png",
  "text": "The world on Wednesday grappled with the return of Donald Trump to the White House, a stunning result after a campaign that trafficked in xenophobia and vows of retribution, and that made promises that would upend global trade and undermine an international order that the United States helped build.The president-elect will inherit no shortage of foreign policy challenges, including Russia’s war in Ukraine, a conflict in the Middle East that some fear could escalate into an all-out regional war, and rising Chinese aggression in the South China Sea. He has offered few specifics on his foreign policy, but has pledged the revival of the isolationist and protectionist “America First” approach that marked his first term.U.S. allies, which had signaled a preference for continuity under Vice President Kamala Harris, put on a brave face. Through gritted teeth Wednesday, they offered Trump their congratulations, saying they were ready to work with him, even as he has vowed to impose punishing tariffs on their goods and admonished them as freeloaders.“We are being taken advantage of by every country all over the world, including our allies,” Trump said at a campaign rally in Warren, Michigan, last week. “And in many cases, our allies are worse than our co-called enemies.”Some U.S. adversaries rejoiced. Russian officials appeared almost giddy at the news of a Trump victory. He has promised to end the war in Ukraine in 24 hours, without elaborating, a pledge that has led many in Russia to conclude that the war could end in a manner favorable to Russian President Vladimir Putin.“Kamala is finished,” former Russian president Dmitry Medvedev wrote on X. “Let her keep cackling infectiously.”Media outlets in allied countries were less sanguine than their leaders. An article in the German newspaper Die Zeit was headlined with a four-letter word: “F---.” A column in the Globe and Mail, Canada’s national newspaper, called Trump’s election “a crisis like no other in our lifetimes” and said the damage that Trump and his allies could do the United States and its allies was “incalculable.”“We are living in the time of Nero,” it said.RussiaReturn to menuRussian officials had sought to feign indifference ahead of the U.S. elections, even as the Kremlin directed multiple disinformation campaigns targeting Harris. But on Wednesday morning, many of them could not contain their glee, hailing the prospects for a reset in U.S.-Russia relations and an end to the war in Ukraine — on Moscow’s terms.“Kamala Harris was right when she quoted Psalm 30:5: ‘Weeping may remain in the night, but joy comes in the morning,’” Russian Foreign Ministry spokeswoman Maria Zakharova wrote on Telegram. “Hallelujah, I would add for myself.”Kremlin spokesman Dmitry Peskov struck a more cautious note, saying that the Kremlin was awaiting “concrete actions” and that he didn’t know whether Putin would call Trump to congratulate him. The United States, he added, “is an unfriendly country that directly and indirectly is involved in a war against our state.”Trump has often spoken with admiration of Putin, once siding with the Russian president over his own intelligence agencies on the issue of Russia’s interference in the 2016 election. And he has criticized U.S. assistance to Ukraine, prompting hope within the Russian establishment that under a Trump presidency, Russia would be able to achieve a deal on its terms.Leonid Slutsky, head of the Russian parliament’s foreign affairs committee, said Trump’s victory could lead to the collapse of Ukrainian President Volodymyr Zelensky’s government and an end to Western aid for Ukraine. “Judging by the pre-election rhetoric,” he said, “the Republican team is not going to send more and more American taxpayer money into the furnace of the proxy war against Russia.”UkraineReturn to menuIn one of the first congratulatory messages from a world leader, Zelensky reminded Trump of a “great meeting” that the two men had in the United States in September, when they discussed “ways to put an end to Russian aggression against Ukraine.”Writing on X, Zelensky said he appreciated “President Trump’s commitment to the ‘peace through strength’ approach in global affairs,” which he called “exactly the principle that can practically bring just peace in Ukraine closer.”Zelensky’s take masked an often fraught relationship between the two leaders, dating to 2019, when a phone call between Zelensky and Trump led to Trump’s first impeachment.In the run-up to Election Day, despite Ukrainian officials’ stated intention to remain neutral, Zelensky also managed to alienate Trump’s running mate, JD Vance, calling him “too radical” over his call for Ukraine to concede territory to Russia.Some Ukrainian officials have expressed hope that a change in Washington could work to Kyiv’s advantage, criticizing the slow pace with which the Biden administration has released weapons and the restrictions it has put on long-range strikes within Russian territory.“Trump’s arrival means that certain new opportunities are opening up for us,” said Oleksandr Merezhko, chairman of the Ukrainian parliament’s foreign affairs committee, was quoted in Ukrainian media on Wednesday as saying.IsraelReturn to menuAmong the first to hail Trump’s comeback was Israeli President Benjamin Netanyahu, who in a morning post on X said the win was “a new beginning for America and a powerful recommitment to the great alliance between Israel and America.”Netanyahu has clashed with President Joe Biden over his handling of the war in Gaza and has accused his administration of attempting to tie Israel’s hands and preventing the “total victory” that the Israeli leader has vowed to achieve for more than a year. He hopes that with Trump’s unconditional support, he will be able to more freely prosecute Israel’s wars with Iran’s regional proxies, as well as deliver on a long-promised normalization deal with Saudi Arabia.But the impact of a new Trump presidency is also unclear, with the president-elect vowing to “finish” wars, not start them, and to align more closely with Saudi Arabia, which wants a swift resolution to the numerous conflicts in the region.Israel Ganz, head of the Yesha Council, which represents Jewish settlers across the occupied West Bank, hailed Trump’s victory, saying it took a two-state solution “off the table.”The Palestinian faction Hamas, which Israel is fighting in the Gaza Strip, said in a statement that it would reserve judgment on the U.S. administration until it saw the president-elect’s “practical behavior toward our Palestinian people, their legitimate rights and their just cause.”NATOReturn to menuNATO Secretary General Mark Rutte said he looked forward to working with Trump in a congratulatory statement that made no mention of Ukraine. Rutte cited challenges including “a more aggressive Russia,” competition with China, and the roles of North Korea and Iran — and he said Trump demonstrated “strong U.S. leadership” at NATO during his first term.Many European policymakers, however, have fretted for months about the prospect of a second Trump presidency upending U.S. support for Ukraine and American security guarantees in Europe. European leaders on Wednesday highlighted transatlantic relations as they pledged to work with Trump, who has boasted that he would encourage Russia to attack NATO allies that don’t pull their weight.Anxious about a possible U.S. policy shift on Ukraine, European officials had raced to push through aid packages before the November election. A new NATO command began taking over some key U.S. responsibilities in coordinating military aid to Kyiv, but European officials acknowledge that diminished U.S. support for Kyiv could deal a big blow.The Trump victory triggered a new chorus of calls from European officials to spend more on defense and strengthen the European role in the Western military alliance.French President Emmanuel Macron and Trump had a 25-minute call on Wednesday, according to information shared by the French Embassy in Washington, that touched on Russia’s war in Ukraine and the conflict in the Middle East. It was “a very warm conversation, building on their strong existing relationship,” the embassy said.U.K. Prime Minister Keir Starmer also spoke with Trump Wednesday. The two discussed the situation in the Middle East and “the importance of regional stability,” as well as Trump’s “close connections and affinity to the United Kingdom,” according to a Downing Street readout of the call.In Australia, which is not a member of NATO but is recognized as a “partner” of the alliance, Prime Minister Anthony Albanese congratulated Trump on his victory, calling the United States and Australia “great friends and true allies.” The message was undercut by the reemergence of a 2017 video showing Albanese, the leader of the center-left Labor Party, saying Trump “scares the s--- out of me.”European UnionReturn to menuIt was no secret that many Europeans are wary of a Trump return. At European Union headquarters, a task force gathered in recent months to prepare for his return, strategizing on Ukraine aid and on responses to a possible trade war if Trump imposes promised tariffs.Bronwen Maddox, director of Chatham House, a London-based think tank, said that Trump’s victory was “a bit of a shock” and that in Europe there would be some “pretty rapid recalculation,” with leaders assessing what a Trump presidency will mean for the wars in Ukraine and the Middle East, as well as potential tariffs and corporate taxes.Europe is not a uniform bloc, but many countries would have opted for Harris over Trump if they had to pick, according to Gallup International. But, Maddox said, Trump’s concerns on migration “does resonate in Europe, and many politicians will look at that and think, we also need to pay that a lot of attention.”A longtime admirer of Trump, Hungarian Prime Minister Viktor Orban, was effusive, calling Trump’s win “a much needed victory for the World!” The Moscow-friendly leader, who made a habit of holding up E.U. aid for Ukraine, increasingly sought to position himself as a Trump whisperer in Europe ahead of the election.Some analysts and diplomats had warned that a Trump win could embolden far-right currents and populist figures in Europe that have gained sway since his last presidency. Alice Weidel, co-leader of the far-right Alternative for Germany (AfD) party, tweeted her congratulations: “It was not woke Hollywood that decided this election, but the working American people.”IndiaReturn to menuMany media outlets and supporters of Prime Minister Narendra Modi’s government cheered as Trump claimed victory. On Wednesday, the Indian leader posted a photo of himself clasping hands with Trump at a Houston rally four years ago and offered his “friend” his “heartiest congratulations” on returning to power.Leaders in Modi’s Bharatiya Janata Party have for years spoken of their preference for Trump, even as the Biden administration prioritized cultivating ties with India and supporting India as a counterweight to China.Now, whatever frictions that existed in the bilateral relationship — including Biden officials’ anger over an alleged Indian intelligence operation to assassinate a Sikh American separatist in New York, their concerns about Modi’s human rights record and their uneasiness about his friendliness with Putin — could all become moot.Southeast AsiaReturn to menuFerdinand Marcos Jr., president of the Philippines, a U.S. treaty ally, congratulated Trump and said he had faith that this “unshakeable alliance, tested in war and peace, will be a force for good, blazing a path of prosperity and amity in the region and on both sides of the Pacific.”The Philippines, which has faced rising aggression from China in the South China Sea, has deepened security ties with the United States under the Biden administration. In private, some Philippine officials have worried that under Trump, there could be a retreat from its defense commitments, said a top Philippine defense official, speaking on the condition of anonymity because he had not been authorized to discuss the issue. “We realize there are no guarantees,” the official said.The Philippines is key to the U.S. goal of containing Chinese expansionism in the Indo-Pacific, said the official, adding, “We’re counting on his advisers to make him see things as they are.”The Philippines and other countries in Southeast Asia have spent the past four years attempting to “Trump-proof” ties with the United States, such as by signing binding security agreements and expanding economic cooperation. But these countries also recognize that “it’s impossible to truly Trump-proof anything,” said Huong Le Thu, deputy program director of the Asia program at the Crisis Group.In major exporting countries such as Malaysia and Vietnam, which maintain a trade surplus with the United States, some leaders said they were bracing for higher tariffs.ChinaReturn to menuChina’s Foreign Ministry issued a brief statement Wednesday saying the Chinese side respected the choice of the American people: “We congratulate Mr. Trump on his election as president.”China’s government has taken pains to remain outwardly neutral throughout the campaign period, but just days before the election it was revealed that Chinese state-linked hackers had attempted to hack phones used by both Trump and JD Vance, as well as people in the Harris campaign.Trump imposed tariffs on over $300 billion in Chinese goods during his last term, setting off a spiraling trade war between the two countries. Trump will now oversee a critical period in Sino-U.S. relations, as President Xi Jinping has said he wants the Chinese army to be militarily ready to invade Taiwan in 2027.Taiwanese President Lai Ching-te also issued congratulations to president-elect Trump on Wednesday morning in a posting on X. “I’m confident that the longstanding #Taiwan-#US partnership, built on shared values \u0026 interests, will continue to serve as a cornerstone for regional stability \u0026 lead to greater prosperity for us all,” he said.Trump’s position on Taiwan has been ambiguous throughout his campaign, but in an interview earlier this year he made comments that cast doubt on whether he would defend the self-governed island if China were to invade, and said Taiwan had stolen U.S. chip business.On Weibo, China’s version of Twitter, the election was trending, with Chinese media emphasizing political divisions. In the Global Times, a nationalist state tabloid, a headline declared, “U.S. Election Day voting begins amid fears of violence, unrest” over a photo of a boarded-up storefront near the White House.U.S. neighborsReturn to menuIn Canada and Mexico, officials sought to offer reassurance that their countries — heavily dependent on trade with the United States — wouldn’t suffer from Trump’s victory.The Republican has pledged to impose “automatic” tariffs of 10 percent on all countries and threatened tariffs as high as 100 percent on Mexico if it doesn’t stop drug trafficking and migration. He has pledged to carry out mass deportations of migrants, including many Mexicans. A review of the U.S.-Mexico-Canada agreement, which governs trade between the three countries, comes up for review in 2026, and officials fear the protectionist leader could use it to erect more trade barriers.Canadian officials this year revived a massive lobbying effort that saw high-level officials fan out across the United States in a bid to stave off protectionist policies that could imperil Canadian interests.“I know that a lot of Canadians are anxious,” Chrystia Freeland, Canada’s deputy prime minister, told reporters Wednesday in Ottawa, “and I want to say with utter sincerity and conviction to Canadians that Canada will be absolutely fine.” Mexico’s new president, Claudia Sheinbaum, sought to sound a similar note, saying in a morning news conference that “there is no need to worry.”Nonetheless, the peso dipped about 3 percent in early trading to its lowest level in two years, at 20.8 to the dollar, continuing a slide that started when Sheinbaum’s leftist Morena party won a resounding victory in June.Martha Barcena, a former Mexican ambassador to Washington, tweeted Wednesday that the country was in for a difficult period. She noted Trump’s threat to shut the border on the first day of his presidency. “Let’s remember that our level of trade is $3 million a minute, through 57 border crossings,” she wrote on X.William Booth, Catherine Belton and Karla Adam in London; Amanda Coletta in Toronto; David L. Stern and Serhiy Morgunov in Kyiv; Francesca Ebel in Moscow; Shira Rubin in Tel Aviv; Claire Parker in Cairo; Kathrina Northrop in Taipei, Taiwan; Ellen Francis in Brussels; Gerry Shih in New Delhi; Mary Beth Sheridan in Virginia; Samantha Schmidt in Bogotá; Terrence McCoy in Rio de Janeiro; Cate Cadell in Washington; and Rebecca Tan in Singapore contributed to this report.",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/H3OVNAJEXTNP37RNMN657QT7UM_size-normalized.jpg\u0026w=1440",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"5CWBQPOXK5HNPLYM6SIXBISLLM\" data-el=\"text\" dir=\"null\"\u003eThe world on Wednesday grappled with the return of \u003ca href=\"https://www.washingtonpost.com/donald-trump/?itid=lk_inline_manual_2\" target=\"_blank\"\u003eDonald Trump\u003c/a\u003e to the White House, a stunning result after a campaign that trafficked in xenophobia and vows of retribution, and that made promises that would upend global trade and undermine an international order that the United States helped build.\u003c/p\u003e\u003c/div\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"URQCMVAACFFKXNSZBM4UYCHHLE\" data-el=\"text\" dir=\"null\"\u003eThe president-elect will inherit no shortage of foreign policy challenges, including Russia’s war in Ukraine, a conflict in the Middle East that some fear could escalate into an all-out regional war, and rising Chinese aggression in the South China Sea. He has offered few specifics on his foreign policy, but has pledged the revival of the isolationist and protectionist “America First” approach that marked his first term.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"HWUVAC4VWVDPVCXVGIRTPHPUBM\" data-el=\"text\" dir=\"null\"\u003eU.S. allies, which had signaled a preference for continuity under Vice President \u003ca href=\"https://www.washingtonpost.com/kamala-harris/?itid=lk_inline_manual_5\" target=\"_blank\"\u003eKamala Harris\u003c/a\u003e, put on a brave face. Through gritted teeth Wednesday, they offered Trump their congratulations, saying they were ready to work with him, even as he has vowed to impose punishing tariffs on their goods and admonished them as freeloaders.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"RXLB642ORRHNHAKSNZZ3AFWVRQ\" data-el=\"text\" dir=\"null\"\u003e“We are being taken advantage of by every country all over the world, including our allies,” Trump said at a campaign rally in Warren, Michigan, last week. “And in many cases, our allies are worse than our co-called enemies.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"65SPU5CPPVC35GZ45BMB3LEKL4\" data-el=\"text\" dir=\"null\"\u003eSome U.S. adversaries rejoiced. Russian officials appeared almost giddy at the news of a Trump victory. He has promised to end the war in Ukraine in 24 hours, without elaborating, a pledge that has led many in Russia to conclude that the war could end in a manner favorable to Russian President Vladimir Putin.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"2V5RG6I5JBERTJENAIB3T3OXFE\" data-el=\"text\" dir=\"null\"\u003e“Kamala is finished,” former Russian president Dmitry Medvedev wrote on X. “Let her keep cackling infectiously.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"J4GP7LUQHJHIPM7CAH3MD7CNEQ\" data-el=\"text\" dir=\"null\"\u003eMedia outlets in allied countries were less sanguine than their leaders. An article in the German newspaper Die Zeit was headlined with a four-letter word: “F---.” A column in the Globe and Mail, Canada’s national newspaper, called Trump’s election “a crisis like no other in our lifetimes” and said the damage that Trump and his allies could do the United States and its allies was “incalculable.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"QM3EXZRUUREAPIPAIGJM5GVOLU\" data-el=\"text\" dir=\"null\"\u003e“We are living in the time of Nero,” it said.\u003c/p\u003e\u003cdiv id=\"listicle-card-KW2RQ7QTP5DULAIIIZVAFMRFP4-0\" data-qa=\"article-body\"\u003e\u003cdiv id=\"list-headline-KW2RQ7QTP5DULAIIIZVAFMRFP4-0\" tabindex=\"0\"\u003e\u003ch3 data-qa=\"list-headline\"\u003eRussia\u003c/h3\u003e\u003c/div\u003e\u003cp\u003e\u003ca href=\"#secondary-nav\"\u003eReturn to menu\u003c/a\u003e\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"VYADY2JKERC7BOQ4KEBXF634NU\" data-el=\"text\" dir=\"null\"\u003eRussian officials had sought to feign indifference ahead of the U.S. elections, even as the Kremlin \u003ca href=\"https://www.washingtonpost.com/world/2024/10/23/dougan-russian-disinformation-harris/?itid=lk_inline_manual_17\" target=\"_blank\"\u003edirected multiple disinformation campaigns targeting Harris\u003c/a\u003e. But on Wednesday morning, many of them\u003cb\u003e \u003c/b\u003ecould not contain their glee, hailing the prospects for a reset in U.S.-Russia relations and an end to the war in Ukraine\u003cb\u003e \u003c/b\u003e— on\u003cb\u003e \u003c/b\u003eMoscow’s terms.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"GM6OGOKYBNF5ZNWLJTTQPFLEWA\" data-el=\"text\" dir=\"null\"\u003e“Kamala Harris was right when she quoted Psalm 30:5: ‘Weeping may remain in the night, but joy comes in the morning,’” Russian Foreign Ministry spokeswoman Maria Zakharova wrote on Telegram. “Hallelujah, I would add for myself.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"Y3FCBQCWNRCLJBK72MUILWNIFY\" data-el=\"text\" dir=\"null\"\u003eKremlin spokesman Dmitry Peskov struck a more\u003cb\u003e \u003c/b\u003ecautious note, saying that\u003cb\u003e \u003c/b\u003ethe Kremlin was awaiting “concrete actions” and that he didn’t know whether Putin would call Trump to congratulate him. The United States, he added,\u003cb\u003e \u003c/b\u003e“is an unfriendly country that directly and indirectly is involved in a war against our state.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"PKWCOR57GRFZXEJQLYQEGYOIPI\" data-el=\"text\" dir=\"null\"\u003eTrump has often spoken with admiration of Putin,\u003cb\u003e \u003c/b\u003eonce \u003ca href=\"https://www.washingtonpost.com/politics/ahead-of-putin-summit-trump-faults-us-stupidity-for-poor-relations-with-russia/2018/07/16/297f671c-88c0-11e8-a345-a1bf7847b375_story.html?itid=lk_inline_manual_54\u0026amp;itid=lk_inline_manual_23\" target=\"_blank\"\u003esiding with the Russian president\u003c/a\u003e over his own intelligence agencies on the issue of Russia’s interference in the 2016 election. And he has\u003cb\u003e \u003c/b\u003ecriticized U.S. assistance to Ukraine, prompting hope within the Russian establishment that under a Trump presidency, Russia would be able to achieve a deal on its terms.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"6RKELJATHNHVBAZKSFVGMG4G5Y\" data-el=\"text\" dir=\"null\"\u003eLeonid Slutsky, head of the Russian parliament’s foreign affairs committee, said Trump’s victory could lead to the collapse of Ukrainian President Volodymyr Zelensky’s government and an end to Western aid for Ukraine. “Judging by the pre-election rhetoric,” he said, “the Republican team is not going to send more and more American taxpayer money into the furnace of the proxy war against Russia.”\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"listicle-card-HM3AZBNBCVCHREYW2UTL7D5MDU-1\" data-qa=\"article-body\"\u003e\u003cdiv id=\"list-headline-HM3AZBNBCVCHREYW2UTL7D5MDU-1\" tabindex=\"0\"\u003e\u003ch3 data-qa=\"list-headline\"\u003eUkraine\u003c/h3\u003e\u003c/div\u003e\u003cp\u003e\u003ca href=\"#secondary-nav\"\u003eReturn to menu\u003c/a\u003e\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"IWMG6SWFCFBEDBFX564E5EKH7Y\" data-el=\"text\" dir=\"null\"\u003eIn one of the first congratulatory messages from a world leader, Zelensky reminded Trump of a \u003ca href=\"https://www.washingtonpost.com/politics/2024/09/27/trump-zelensky-ukraine-war-harris/?itid=lk_inline_manual_26\" target=\"_blank\"\u003e“great meeting” that the two men had\u003c/a\u003e in the United States in September, when they discussed “ways to put an end to Russian aggression against Ukraine.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"JUZCNBH6HFFHPJDERS54GQG2MA\" data-el=\"text\" dir=\"null\"\u003eWriting on X, Zelensky said he appreciated “President Trump’s commitment to the ‘peace through strength’ approach in global affairs,” which he called “exactly the principle that can practically bring just peace in Ukraine closer.”\u003c/p\u003e\u003cdiv data-qa=\"article-body\"\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"VYNAIASOKRA43D6HCEHOU3XFFU\" data-el=\"text\" dir=\"null\"\u003eZelensky’s take masked an often fraught relationship between the two leaders, dating to 2019, when a phone call between Zelensky and Trump led to Trump’s first impeachment.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"BMGDCMVW6JCVXPESV4IF5YVCBA\" data-el=\"text\" dir=\"null\"\u003eIn the run-up to Election Day, despite Ukrainian officials’ stated intention to remain neutral, Zelensky also managed to alienate Trump’s running mate, \u003ca href=\"https://www.washingtonpost.com/jd-vance/?itid=lk_inline_manual_32\" target=\"_blank\"\u003eJD Vance\u003c/a\u003e, calling him “too radical” over his call for Ukraine to concede territory to Russia.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"4OZRXIIUFFA4BDKL3YJEOFFPGQ\" data-el=\"text\" dir=\"null\"\u003eSome Ukrainian officials have expressed hope that a change in Washington could work to Kyiv’s advantage, criticizing\u003cb\u003e \u003c/b\u003ethe slow pace with which the Biden administration has released weapons and the restrictions it has put on long-range strikes within Russian territory.\u003c/p\u003e\u003c/div\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"POQDVKKTWNGEJETYR4DV7Q5MMM\" data-el=\"text\" dir=\"null\"\u003e“Trump’s arrival means that certain new opportunities are opening up for us,” said Oleksandr Merezhko, chairman of the Ukrainian parliament’s foreign affairs committee, was quoted in Ukrainian media on Wednesday as saying.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"listicle-card-XBGF2RPPL5B3PETN27AE74XVYE-2\" data-qa=\"article-body\"\u003e\u003cdiv id=\"list-headline-XBGF2RPPL5B3PETN27AE74XVYE-2\" tabindex=\"0\"\u003e\u003ch3 data-qa=\"list-headline\"\u003eIsrael\u003c/h3\u003e\u003c/div\u003e\u003cp\u003e\u003ca href=\"#secondary-nav\"\u003eReturn to menu\u003c/a\u003e\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"FB524FAFFZCDRLTKIJ5YMCLSXY\" data-el=\"text\" dir=\"null\"\u003eAmong the first to hail Trump’s comeback was Israeli President Benjamin Netanyahu, who in a morning post on X said the win was “a new beginning for America and a powerful recommitment to the great alliance between Israel and America.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"QVVZVWAA2JA7JIJUJU27J72PVA\" data-el=\"text\" dir=\"null\"\u003eNetanyahu has clashed with President Joe Biden over his handling of the \u003ca href=\"https://www.washingtonpost.com/israel-hamas-war/?itid=lk_inline_manual_40\" target=\"_blank\"\u003ewar in Gaza\u003c/a\u003e and has accused his administration of attempting to tie Israel’s hands and preventing the “total victory” that the Israeli leader has vowed to achieve for more than a year. He hopes that with Trump’s unconditional support, he will be able to more freely prosecute Israel’s wars with Iran’s regional proxies, as well as deliver on a long-promised normalization deal with Saudi Arabia.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"FBPNEYCT7ZHHVOD24FR7YHOKRY\" data-el=\"text\" dir=\"null\"\u003eBut the impact of a new Trump presidency is also unclear, with the president-elect vowing to “finish” wars, not start them, and to align more closely with Saudi Arabia, which wants a swift resolution to the numerous conflicts in the region.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"F27DI3LSRFE4JCNEPV7TQLGQ2E\" data-el=\"text\" dir=\"null\"\u003eIsrael Ganz, head of the Yesha Council, which represents\u003cb\u003e \u003c/b\u003eJewish settlers across the occupied West Bank, hailed Trump’s victory, saying it took a two-state solution “off the table.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"YH3L26NEM5EQDFBOB4EGN4HMI4\" data-el=\"text\" dir=\"null\"\u003eThe Palestinian faction Hamas, which Israel is fighting in the \u003ca href=\"https://www.washingtonpost.com/world/2023/10/09/gaza-strip-israel-hamas-explained/?itid=lk_inline_manual_45\" target=\"_blank\"\u003eGaza Strip\u003c/a\u003e, said in a statement that it would reserve judgment on the U.S. administration until it saw the president-elect’s “practical behavior toward our Palestinian people, their legitimate rights and their just cause.”\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"listicle-card-NM2E6LA5YRC5NHA2U23XKLB36M-3\" data-qa=\"article-body\"\u003e\u003cdiv id=\"list-headline-NM2E6LA5YRC5NHA2U23XKLB36M-3\" tabindex=\"0\"\u003e\u003ch3 data-qa=\"list-headline\"\u003eNATO\u003c/h3\u003e\u003c/div\u003e\u003cp\u003e\u003ca href=\"#secondary-nav\"\u003eReturn to menu\u003c/a\u003e\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"IEOCG3ZHT5DSPNO5KCSYRNIZ2Y\" data-el=\"text\" dir=\"null\"\u003eNATO Secretary General Mark Rutte said he looked forward to working with Trump in a congratulatory statement that made no mention of Ukraine. Rutte cited challenges including “a more aggressive Russia,” competition with China, and the roles of North Korea and Iran — and he said Trump demonstrated “strong U.S. leadership” at NATO during his first term.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"E66ESEOJJRBRPJ25XUXDW6YEFI\" data-el=\"text\" dir=\"null\"\u003eMany European policymakers, however, have \u003ca href=\"https://www.washingtonpost.com/world/2024/10/27/trump-ukraine-nato-europe-election/?itid=lk_inline_manual_51\"\u003efretted\u003c/a\u003e for months about the prospect of a second Trump presidency upending U.S. support for Ukraine and American security guarantees in Europe. European leaders on Wednesday highlighted transatlantic relations as they pledged to work with Trump, who has \u003ca href=\"https://www.washingtonpost.com/politics/2024/02/10/trump-nato-allies-russia/?itid=lk_inline_manual_51\" target=\"_blank\"\u003eboasted\u003c/a\u003e that he would encourage Russia to attack NATO allies that don’t pull their weight.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"CARGDVTMBRGK7JQ6M75HQSFRTI\" data-el=\"text\" dir=\"null\"\u003eAnxious about a possible U.S. policy shift on Ukraine, European officials had raced to push through aid packages before the November election. A new NATO command began taking over some key U.S. responsibilities in coordinating military aid to Kyiv, but European officials acknowledge that diminished U.S. support for Kyiv could deal a big blow.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"ZGFBJ5V2ANEIXCL3FWRGWSW6PY\" data-el=\"text\" dir=\"null\"\u003eThe Trump victory triggered a new chorus of calls from European officials to spend more on defense and strengthen the European role in the Western military alliance.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"MAXXZWGWEFD3FDOZZ2EPFWXSRU\" data-el=\"text\" dir=\"null\"\u003eFrench President Emmanuel Macron and Trump had a 25-minute call on Wednesday, according to information shared by the French Embassy in Washington, that touched on Russia’s war in Ukraine and the conflict in the Middle East. It was “a very warm conversation, building on their strong existing relationship,” the embassy said.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"YGUKJRPZ35GP5F3INTUGUJHCLQ\" data-el=\"text\" dir=\"null\"\u003eU.K. Prime Minister Keir Starmer also spoke with Trump Wednesday. The two discussed the situation in the Middle East and “the importance of regional stability,” as well as Trump’s “close connections and affinity to the United Kingdom,” according to a Downing Street readout of the call.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"U2G4ACY56JE43B7NXR63WAURRQ\" data-el=\"text\" dir=\"null\"\u003eIn Australia, which is not a member of NATO but is recognized as a “partner” of the alliance, Prime Minister Anthony Albanese congratulated Trump on his victory, calling the United States and Australia “great friends and true allies.” The message was undercut by the reemergence of a 2017 video showing Albanese, the leader of the center-left Labor Party, saying Trump “scares the s--- out of me.”\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"listicle-card-QBT6HD7SVRGAJJ73AYF7VCDR5Y-4\" data-qa=\"article-body\"\u003e\u003cdiv id=\"list-headline-QBT6HD7SVRGAJJ73AYF7VCDR5Y-4\" tabindex=\"0\"\u003e\u003ch3 data-qa=\"list-headline\"\u003eEuropean Union\u003c/h3\u003e\u003c/div\u003e\u003cp\u003e\u003ca href=\"#secondary-nav\"\u003eReturn to menu\u003c/a\u003e\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"NTUGRMGGAFHONGPQCDGQAWL2EM\" data-el=\"text\" dir=\"null\"\u003eIt was no secret that many Europeans are wary of a Trump return. At European Union headquarters, a task force gathered in recent months to \u003ca href=\"https://www.washingtonpost.com/world/2024/11/02/trump-europe-trade-war-nato-ukraine/?itid=lk_inline_manual_60\" target=\"_blank\"\u003eprepare for his return\u003c/a\u003e, strategizing on Ukraine aid and on responses to a possible trade war if Trump imposes \u003ca href=\"https://www.washingtonpost.com/business/2024/10/16/trump-tariffs-impact-economy/?itid=lk_inline_manual_60\" target=\"_blank\"\u003epromised tariffs\u003c/a\u003e.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"F3OC6CF6GVCFNBM7RCBS65DKLY\" data-el=\"text\" dir=\"null\"\u003eBronwen Maddox, director of Chatham House, a London-based think tank, said that Trump’s victory was “a bit of a shock” and that in Europe there would be some “pretty rapid recalculation,” with leaders assessing what a Trump presidency will mean for the wars in Ukraine and the Middle East, as well as potential tariffs and corporate taxes.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"RY5FSOJWWBGVTK4T3Y46AEY6EI\" data-el=\"text\" dir=\"null\"\u003eEurope is not a uniform bloc, but many countries would have opted for Harris over Trump if they had to pick, according to \u003ca href=\"https://www.gallup-international.com/survey-results-and-news/survey-result/president-kamala-harris-to-bring-global-stability-and-improve-americas-standing-in-the-world\" target=\"_blank\"\u003eGallup International\u003c/a\u003e. But, Maddox said, Trump’s concerns on migration “does resonate in Europe, and many politicians will look at that and think, we also need to pay that a lot of attention.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"TRW2HOFXIZBODAJTT2N6JPG7NE\" data-el=\"text\" dir=\"null\"\u003eA longtime admirer of Trump, Hungarian Prime Minister Viktor Orban, was effusive, calling Trump’s win “a much needed victory for the World!” The Moscow-friendly leader, who made a habit of holding up E.U. aid for Ukraine, increasingly \u003ca href=\"https://www.washingtonpost.com/world/2024/10/09/hungary-viktor-orban-donald-trump-europe-ally/?itid=lk_inline_manual_63\"\u003esought\u003c/a\u003e to position himself as a Trump whisperer in Europe ahead of the election.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"TSYN62RI5FD4ZATBH5LG6G7REQ\" data-el=\"text\" dir=\"null\"\u003eSome analysts and diplomats had warned that a Trump win could embolden far-right currents and populist figures in Europe that have gained sway since his last presidency. Alice Weidel, co-leader of the far-right Alternative for Germany (AfD) party, tweeted her congratulations: “It was not woke Hollywood that decided this election, but the working American people.”\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"listicle-card-GEPGWO3RDVB5FM5SZUZ3VC34HE-5\" data-qa=\"article-body\"\u003e\u003cdiv id=\"list-headline-GEPGWO3RDVB5FM5SZUZ3VC34HE-5\" tabindex=\"0\"\u003e\u003ch3 data-qa=\"list-headline\"\u003eIndia\u003c/h3\u003e\u003c/div\u003e\u003cp\u003e\u003ca href=\"#secondary-nav\"\u003eReturn to menu\u003c/a\u003e\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"4OU7B5ZRFJGYTGF73YVOIUN65Q\" data-el=\"text\" dir=\"null\"\u003eMany media outlets and supporters of Prime Minister Narendra Modi’s government cheered as Trump claimed victory. On Wednesday, the Indian leader posted a photo of himself clasping hands with Trump at a Houston rally four years ago and offered his “friend” his “heartiest congratulations” on returning to power.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"ZVBHQSOUSREETFKIP452W2S2JY\" data-el=\"text\" dir=\"null\"\u003eLeaders in Modi’s Bharatiya Janata Party have for years spoken of their preference for Trump, even as the Biden administration prioritized cultivating ties with India and supporting India as a counterweight to China.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"ROZR3UJWKRFSLCPTUGH7FKO7FQ\" data-el=\"text\" dir=\"null\"\u003eNow, whatever frictions that existed in the bilateral relationship — including Biden officials’ anger over an alleged Indian intelligence operation to \u003ca href=\"https://www.washingtonpost.com/national-security/2024/10/17/india-assassination-plot-doj-charges/?itid=lk_inline_manual_69\" target=\"_blank\"\u003eassassinate a Sikh American separatist\u003c/a\u003e in New York, their concerns about Modi’s human rights record and their uneasiness about his friendliness with Putin — could all become moot.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"listicle-card-5TZCX2THBRG7FLB7F4JFUTJQ6M-6\" data-qa=\"article-body\"\u003e\u003cdiv id=\"list-headline-5TZCX2THBRG7FLB7F4JFUTJQ6M-6\" tabindex=\"0\"\u003e\u003ch3 data-qa=\"list-headline\"\u003eSoutheast Asia\u003c/h3\u003e\u003c/div\u003e\u003cp\u003e\u003ca href=\"#secondary-nav\"\u003eReturn to menu\u003c/a\u003e\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"BNLZUPZAENFAHLBWO425SNBR7Y\" data-el=\"text\" dir=\"null\"\u003eFerdinand Marcos Jr., president of the Philippines, a U.S. treaty ally, congratulated Trump and said he had faith that this “unshakeable alliance, tested in war and peace, will be a force for good, blazing a path of prosperity and amity in the region and on both sides of the Pacific.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"62PWZE5YEZCVDMDBDUX57QEMLY\" data-el=\"text\" dir=\"null\"\u003eThe Philippines, which has faced rising aggression from China in the South China Sea, has deepened security ties with the United States under the Biden administration. In private, some Philippine officials have worried that under Trump, there could be a retreat from its defense commitments, said a top Philippine defense official, speaking on the condition of anonymity because he had not been authorized to discuss the issue. “We realize there are no guarantees,” the official said.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"LMO5OB42ORDELCNNN26E7C5U2A\" data-el=\"text\" dir=\"null\"\u003eThe Philippines is key to the U.S. goal of containing Chinese expansionism in the Indo-Pacific, said the official, adding, “We’re counting on his advisers to make him see things as they are.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"WSDGI3ARLVAITAMIMU7FGUZPTA\" data-el=\"text\" dir=\"null\"\u003eThe Philippines and other countries in Southeast Asia have spent the past four years attempting to “Trump-proof” ties with the United States, such as by signing binding security agreements and expanding economic cooperation. But these countries also recognize that “it’s impossible to truly Trump-proof anything,” said Huong Le Thu, deputy program director of the Asia program at the Crisis Group.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"V27MK6QWLVB53JB55TF2QY2PZU\" data-el=\"text\" dir=\"null\"\u003eIn major exporting countries such as Malaysia and Vietnam, which maintain a trade surplus with the United States, some leaders said they were bracing for higher tariffs.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"listicle-card-KM4RGDAFXZAGPGDQSZTTL6LHTE-7\" data-qa=\"article-body\"\u003e\u003cdiv id=\"list-headline-KM4RGDAFXZAGPGDQSZTTL6LHTE-7\" tabindex=\"0\"\u003e\u003ch3 data-qa=\"list-headline\"\u003eChina\u003c/h3\u003e\u003c/div\u003e\u003cp\u003e\u003ca href=\"#secondary-nav\"\u003eReturn to menu\u003c/a\u003e\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"DF3UBO7O7BAIBPAW4YTGLJMOOI\" data-el=\"text\" dir=\"null\"\u003eChina’s Foreign Ministry issued a brief statement Wednesday saying the Chinese side respected the choice of the American people: “We congratulate Mr. Trump on his election as president.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"FYO2MFR4WJDCRJ43PK2V2V3ZHI\" data-el=\"text\" dir=\"null\"\u003eChina’s government has taken pains to remain outwardly neutral throughout the campaign period, but just days before the election it was revealed that Chinese state-linked hackers had \u003ca href=\"https://www.washingtonpost.com/national-security/2024/10/25/trump-vance-phone-hack-china/?itid=lk_inline_manual_78\" target=\"_blank\"\u003eattempted to hack phones\u003c/a\u003e used by both Trump and JD Vance, as well as people in the Harris campaign.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"YWJSTT2Y4ZHCVF6V4H2TBAIFSE\" data-el=\"text\" dir=\"null\"\u003eTrump imposed tariffs on over $300 billion in Chinese goods during his last term, setting off a spiraling trade war between the two countries. Trump will now oversee a critical period in Sino-U.S. relations, as President Xi Jinping has said he wants the Chinese army to be militarily ready to invade Taiwan in 2027.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"RRCBE7TQRRHOJEKNAE5RLSXWJQ\" data-el=\"text\" dir=\"null\"\u003eTaiwanese President Lai Ching-te also issued congratulations to president-elect Trump on Wednesday morning in a posting on X. “I’m confident that the longstanding #Taiwan-#US partnership, built on shared values \u0026amp; interests, will continue to serve as a cornerstone for regional stability \u0026amp; lead to greater prosperity for us all,” he said.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"D54USULZ3VA7PBEJ253YDOC4TA\" data-el=\"text\" dir=\"null\"\u003eTrump’s position on Taiwan has been ambiguous throughout his campaign, but in an interview earlier this year he made comments that cast doubt on whether he would defend the self-governed island if China were to invade, and said Taiwan had stolen U.S. chip business.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"MHGPQ2RMAVFJ5FTUM26MRKMUY4\" data-el=\"text\" dir=\"null\"\u003eOn Weibo, China’s version of Twitter, the election was trending, with Chinese media emphasizing political divisions. In the Global Times, a nationalist state tabloid, a \u003ca href=\"https://www.globaltimes.cn/page/202411/1322513.shtml\" target=\"_blank\"\u003eheadline\u003c/a\u003e declared, “U.S. Election Day voting begins amid fears of violence, unrest” over a photo of a boarded-up storefront near the White House.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"listicle-card-VPPCJEI7T5DJ5GQADCYDILCOVE-8\" data-qa=\"article-body\"\u003e\u003cdiv id=\"list-headline-VPPCJEI7T5DJ5GQADCYDILCOVE-8\" tabindex=\"0\"\u003e\u003ch3 data-qa=\"list-headline\"\u003eU.S. neighbors\u003c/h3\u003e\u003c/div\u003e\u003cp\u003e\u003ca href=\"#secondary-nav\"\u003eReturn to menu\u003c/a\u003e\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"2X6FL22OIJA63FXWFRTTGD4IRU\" data-el=\"text\" dir=\"null\"\u003eIn Canada and Mexico, officials sought to offer reassurance that their countries — heavily \u003ca href=\"https://www.washingtonpost.com/world/2024/10/31/canada-election-trudeau-trump-harris/?itid=lk_inline_manual_85\" target=\"_blank\"\u003edependent\u003c/a\u003e on trade with the United States — wouldn’t suffer from Trump’s victory.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"2M63AAP7DJDVFOOEGHVEGML3FA\" data-el=\"text\" dir=\"null\"\u003eThe Republican has pledged to impose “automatic” tariffs of 10 percent on all countries and threatened \u003ca href=\"https://www.washingtonpost.com/business/2024/11/04/trump-mexico-tariff-trade/?itid=lk_inline_manual_86\" target=\"_blank\"\u003etariffs as high as 100 percent on Mexico\u003c/a\u003e if it doesn’t stop drug trafficking and migration. He has pledged to carry out mass deportations of migrants, including many Mexicans. A review of the U.S.-Mexico-Canada agreement, which governs trade between the three countries, comes up for review in 2026, and officials fear the protectionist leader could use it to erect more trade barriers.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"UZNZ5QCDQRCPBKMRRYQU3EHB7Y\" data-el=\"text\" dir=\"null\"\u003eCanadian officials this year revived a massive lobbying effort that saw high-level officials fan out across the United States in a bid to stave off protectionist policies that could imperil Canadian interests.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"VNNJMHCXYZGILBOSVOE3HZ62U4\" data-el=\"text\" dir=\"null\"\u003e“I know that a lot of Canadians are anxious,” Chrystia Freeland, Canada’s deputy prime minister, told reporters Wednesday in Ottawa, “and I want to say with utter sincerity and conviction to Canadians that Canada will be absolutely fine.” Mexico’s new president, Claudia Sheinbaum, sought to sound a similar note, saying in a morning news conference that “there is no need to worry.”\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"HQQYUQFD6FAYRM35ATH4PKANA4\" data-el=\"text\" dir=\"null\"\u003eNonetheless, the peso dipped about 3 percent in early trading to its lowest level in two years, at 20.8 to the dollar, continuing a slide that started when Sheinbaum’s leftist Morena party won a resounding victory in June.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"GOBQ6O3CRFCMNNX3W6XLTWP3KI\" data-el=\"text\" dir=\"null\"\u003eMartha Barcena, a former Mexican ambassador to Washington, tweeted Wednesday that \u003ca href=\"https://x.com/Martha_Barcena/status/1854174867714867257\" target=\"_blank\"\u003ethe country was in for a difficult period\u003c/a\u003e. She noted Trump’s threat to \u003ca href=\"https://www.washingtonpost.com/politics/2023/12/06/trump-dictator-day-one-hannity/?itid=lk_inline_manual_90\" target=\"_blank\"\u003eshut the border on the first day\u003c/a\u003e of his presidency. “Let’s remember that our level of trade is $3 million a minute, through 57 border crossings,” she wrote on X.\u003c/p\u003e\u003cp data-testid=\"drop-cap-letter\" data-apitype=\"text\" data-contentid=\"YVENNDJ4TVA6NN44DR2WZC7LHE\" data-el=\"text\" dir=\"null\"\u003e\u003ci\u003eWilliam Booth, Catherine Belton and Karla Adam in London; Amanda Coletta in Toronto; David L. Stern and Serhiy Morgunov in Kyiv; Francesca Ebel in Moscow; Shira Rubin in Tel Aviv; Claire Parker in Cairo; Kathrina Northrop in Taipei, Taiwan; Ellen Francis in Brussels; Gerry Shih in New Delhi; Mary Beth Sheridan in Virginia; Samantha Schmidt in Bogotá; Terrence McCoy in Rio de Janeiro; Cate Cadell in Washington;\u003c/i\u003e \u003ci\u003eand Rebecca Tan in Singapore contributed to this report.\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "18 min read",
  "publishedTime": "2024-11-06T12:19:54.774Z",
  "modifiedTime": "2024-11-07T00:12:09.784Z"
}
