{
  "id": "33578fe2-0630-4e10-8c03-5e2004ad9006",
  "title": "Prison work assignments used to lure and rape female inmates. Guards sometimes walk free",
  "link": "https://www.yahoo.com/news/prison-assignments-used-lure-rape-030443578.html",
  "description": "",
  "author": "",
  "published": "2024-11-01T03:04:43Z",
  "source": "https://www.yahoo.com/news/rss",
  "categories": null,
  "byline": "MARGIE MASON and ROBIN McDOWELL",
  "length": 20652,
  "excerpt": "When she got downstairs, she said Widen offered to save her some money by opening “the cage,” a little room with free washers and dryers reserved for new...",
  "siteName": "Yahoo News",
  "favicon": "",
  "text": "HUNTINGTON, W.Va. (AP) — It was after midnight when she crept down the narrow, dimly lit stairs carrying a bag of dirty laundry. She crossed under a patchwork of pipes and ducts to the far back corner of the basement, as she had done many times before. That, she said, is where correctional officer James Widen was waiting for her.He had just called her name over the intercom, telling her to report to the work release center’s laundry room. So April Youst rose from her bunk, careful not to wake the other incarcerated women sleeping in the dorm.When she got downstairs, she said Widen offered to save her some money by opening “the cage,” a little room with free washers and dryers reserved for new prisoners who hadn’t yet started their jobs.She gratefully stepped inside. And then, she said, everything changed.“He’s rubbing himself,” she said, while reminding her of all the little favors he’d done for her. “He was like … ‘It’s time to pay.’”Her account of that night to The Associated Press mirrors, almost word for word, the complaint she filed with police eight years ago. Widen was charged two years later and pleaded not guilty, but the case continues to crawl through the criminal court system. He vehemently denied the allegations to the AP, contending he was set up.Youst is part of the fastest-growing population behind bars — women, most of whom are locked up for nonviolent crimes that often are drug-related. Though female prisoners long have been victims of sexual violence, the number of reports against correctional staff has exploded nationwide in recent years. Many complaints follow a similar pattern: Accusers are retaliated against, while those accused face little or no punishment.In all 50 states, the AP found cases where staff allegedly used inmate work assignments to lure women to isolated spots, out of view of security cameras. The prisoners said they were attacked while doing jobs like kitchen or laundry duty inside correctional facilities or in work-release programs that placed them at private businesses like national fast-food restaurants and hotel chains.“The only thing you’re thinking about when you’re coming into intake is, ‘How am I going to stay safe?’” said Johanna Mills of Just Detention International, a nonprofit organization working to end sexual violence behind bars. When she was incarcerated, she said her boss smashed her in the head and raped her after bringing her to an empty gym one night to do electrical work. “It never occurred to me to watch my back from the supervisor,” she said.As part of a two-year investigation that has exposed everything from multinational companies benefiting from prison labor to incarcerated workers’ lack of rights and protections, AP reporters spoke to more than 100 current and former prisoners nationwide, including women who said they were sexually abused by correctional staff.The AP also scoured thousands of pages of court filings, police reports, audits and other documents that detailed graphic stories of systemic sexual violence and cover-ups from New York to Florida to California.Those cases prompted a bipartisan Senate investigation two years ago that found prisoners were sexually abused by wardens, guards, chaplains or other staff in at least two-thirds of all women’s federal prisons over the past decade. But a backlog of thousands of cases has impeded the Bureau of Prison’s ability to hold employees accountable, government investigators said.The Prison Rape Elimination Act, passed more than 20 years ago, created a channel for filing reports that resulted in a threefold increase in the number of allegations of staff sexual misconduct involving male, female and transgender inmates from 2010 to 2020 at jails and prisons nationwide.Just over a month ago, U.S. lawmakers held a hearing to discuss how to better safeguard inmates. One woman, Bonnie Hernandez, testified that she was raped repeatedly and violently by officer Lenton Hatten in a Florida federal prison after he made her clean the recreation area as part of her work detail.“It got to the point where I feared for my life and had no choice but to report him, even though I was terrified to do so,” she said. In response, she said she was sent to isolation, then transferred to a facility with greater restrictions and no access to video calls with her daughters. Still, it was one of the rare cases that led to prosecution, boosted by DNA evidence. Hatten faced a maximum sentence of 15 years in prison. He received only three months last year after pleading guilty to sexual abuse of a ward.“What you allow is what will continue,” Sen. John Kennedy, a Republican from Louisiana, said after her testimony. “Three months for rape is absurd. … That’s not justice.”Sometimes, even a confession isn’t enough to lead to punishment. At another federal facility in Florida, a guard who had sex with women on landscape duty was among at least six men who were not prosecuted even though they admitted to the misconduct during an internal investigation, according to the Senate report. That was in part because, by law, government employees cannot be criminally charged if they are compelled to make statements.Internationally, prison rape is recognized as a form of torture. While it is illegal in the U.S, correctional officers have argued in some states that – despite the clear power imbalance – inmates gave their consent. Laws vary widely. For example, sexual abuse of an inmate can be a misdemeanor in Kentucky with a maximum sentence of 12 months, but prison rape is a felony in Pennsylvania, carrying up to seven years behind bars.Correctional staff often quit or retire before internal investigations are complete, sometimes retaining pensions and other benefits, experts say. With no paper trail and severe staff shortages, some are simply transferred or hired at other facilities or they land positions overseeing vulnerable populations like juveniles, the AP found.Officer Widen took a job in West Virginia after resigning from a women’s prison in neighboring Ohio. According to an internal investigation submitted as part of civil court filings, he had delivered a ring from an inmate to a former prisoner. He told the AP there was no sexual contact and that he quit after upsetting prison officials by launching his own investigation into heroin smuggling at the facility, transporting the ring in exchange for information from the inmate.Youst said she had no concerns about Widen when she first arrived at the Huntington Work Release Center. In fact, she said he was a favorite among many of the men and women living there, sometimes sneaking them cigarettes or warning them about shakedowns. She said he also helped make a write-up against her go away after she was caught with a contraband cellphone – an incident that could have gotten her sent back to prison and farther away from her young daughter, who was living just down the street.As a guard, Widen held incredible power over the women. They had earned their places at the program, allowing them to dip a toe back into the free world. Though work assignments inside prisons may pay only pennies an hour, outside opportunities — which easily can be taken away — allow women to earn a little more money before their release.Youst had been in and out of the system for years for crimes stemming from her addiction. She was working days at a local mattress company when she was called down to the laundry room that night in early 2016. She told police — and the AP — that Widen started touching himself over his pants. Then, she said, he told her the cameras couldn’t see what he was about to do.“He’s already pulling his pants down,” she said. “You can hear his belt.”She said she desperately tried to reason with him, stressing that someone could walk in on them and that the women upstairs in the dorm might miss her if she was gone too long.And then, echoing the account she gave police, she said, “He just pretty much bent me over the washing machine.”Youst said she is baffled by how the case has dragged on.Widen has been free since posting bond after his arrest in 2018. He told the AP that all allegations of sexual misconduct at the work release center are untrue, labeled Youst “a career criminal” and said the police were unjustly after him.“My rights have been violated every which way,” he said. “I’ve got nothing to hide. I didn’t do anything I was accused of. West Virginia is crooked.”‘We’re all women’West Virginia, a rugged swath of Appalachia that has been home to the country’s highest overdose death rate for a decade, has experienced one of America’s sharpest spikes in female incarceration rates, with a more than 200 percent increase in state prisons between 2000 and 2016 — which is precisely when lawyers started fielding sexual abuse complaints.AP reporters met with current and former prisoners inside correctional facilities and at their homes in mountain communities, some of whom said staff members often started out being nice — bringing them fast food or makeup — and then raped them, peeped at them in showers or forced them to strip and perform sex acts on other prisoners while the guards watched.Most female victims locked up nationwide were abused before being incarcerated, research shows. They rarely report assaults, fearing they won’t be believed or will be punished, ranging from losing their jobs to being placed in solitary confinement or denied contact with their children. And many on work release have only a short time left to serve and are wary of doing anything that could send them back to prison or add time to their sentences.In most cases nationwide, internal investigations determine that allegations are “unsubstantiated.” And in the cases that have enough evidence to wind their way through the legal system, only 6% of the nearly 1,000 staff who reportedly engaged in sexual misconduct with male and female inmates in 2019 and 2020 were convicted, according to the latest Department of Justice figures. Without prosecution, perpetrators also can avoid placement on sex offender registries.In West Virginia, Amanda McGrew, the state’s compliance director for the Prison Rape Elimination Act, said some prisoners use the act to file complaints unrelated to sexual abuse because they know it will trigger the removal of an officer until an investigation is completed. Police are alerted when accusations are substantiated and it’s up to prosecutors to take a case forward, she said. And even when staff resign, she added, investigations continue.But there is another route: Huntington-based attorney Michael Woelfel has sought restitution through a stream of civil suits.Woelfel, who also is a Democratic state senator, said he has settled 127 cases in which women accused guards of abuse in the past 15 years, forcing the state’s insurance carrier to pay out millions of dollars.He said he first started receiving calls from women jailed for crimes linked to their addiction after judges took a hard line, locking them up to try to straighten them out. He had known some of them since they were girls, appearing before him when he oversaw preliminary juvenile delinquency cases that sometimes involved sexual or physical abuse at home.Most lawyers wouldn’t touch their prison rape claims, and not just because they are hard to win due to qualified immunity — a high bar that helps protects people in law enforcement from liability resulting from misconduct.“There is a certain element of people that think if you go to prison, you sort of get whatever you get in there,” Woelfel said, adding that while he is still contacted by women alleging sexual misconduct, the slew of lawsuits has helped pressure the state to crack down. “That taboo of rape or sexual assault … it’s so commonplace that people still joke about that.”Women have been targeted from their days on slave plantations, when they were raped by their owners, to the decades-long period that followed emancipation and involved leasing convicts out to private companies. Widespread reports of abuse eventually led to the creation of reformatories, where women no longer were overseen by men.That began to change in the 1970s after anti-discrimination laws opened the door for cross-gender supervision, just as the number of women being locked up started to rise. Though they now represent only about 10 percent of the nation’s overall prison population, female incarceration rates have jumped from about 26,000 in 1980 to nearly 200,000 today.Some guards believe women with substance abuse issues are accustomed to using sex as a commodity on the streets, seeing them as partly responsible for their own victimization, said Brenda Smith, a law professor at American University and one of the country’s top experts on prison rape.“They’re viewed as sort of the lowest of the low,” she said. “They’re not really women — they’re just other things.”Youst said her case appears to bear that out. She’s out of prison and said she’s working to stay clean, holding down a busy job while building a new life.Even before the languishing criminal case, Youst and three others from the Huntington work release center came forward to file civil suits against Widen. The cases were settled by the state’s insurance carrier for $240,000 in 2019, with no admission of any wrongdoing, Woelfel said. The AP interviewed three of the women. The fourth died of an overdose before the agreement was reached.Widen contended the women were driven by a payday and plotted together, saying, “Me, too! Me, too! Me, too!”But Alesha Canfield, who was among the four women filing suit, said she talked to no one about Widen at the center.She said she was worn out from working morning and afternoon shifts at two major restaurant chains, but still struggled to sleep at night, worried that Widen would tap her on the shoulder in the dorm and summon her to the center’s basement.“I was terrified. I did what I was told,” she said to the AP, noting that she waited to file a rape report until after leaving the facility because she feared retaliation.“I’m the criminal,” she said. “He’s the cop. So why are they going to believe me anyway?”Canfield, who related the same story in civil court filings, said it’s hard to understand why abuse behind bars isn’t taken more seriously.“We’re all women,” she said. “Just because we made a mistake and got caught once in our lives doesn’t mean that we should be treated any different than any other woman in this world.”‘Culture of abuse’A recent spike in scandals, cover-ups and lawsuits linked to women’s facilities nationwide has prompted congressional investigations and scathing Department of Justice reports that cited a “culture of abuse.” Experts say powerful unions sometimes work to shield staff from allegations of misconduct. And in some cases, correctional officers who speak out are retaliated against.Things were so bad at FCI Dublin in California that prisoners and staff named it “the rape club,” a 2022 AP investigation found. At least two men who pleaded guilty to sexual abuse were work supervisors: Nakie Nunley targeted at least five female prisoners who worked at the federal government’s call center, where inmates are employed by companies to do jobs like telemarketing and customer service. And Andrew Jones abused women who worked for him in the kitchen. The correctional facility was recently shut down; Nunley and Jones have been imprisoned along with at least five others, with another case still pending.Brandy Moore White, who heads the union representing nearly 30,000 correctional staff in federal prisons, condemned sexual abuse inside facilities and pointed to a need for more resources amid “catastrophic” staffing shortages.“The most eﬃcient way to provide security and oversight is not cameras and technology, it is staﬃng,” she told lawmakers during a recent Senate subcommittee hearing, noting that employees also face sexual violence and harassment from inmates. “If you have 10 staff supervising 500 inmates, there is time for people who have ill intentions to do things that they shouldn’t do.”Many accusations note that guards took special care to avoid surveillance video. A civil lawsuit filed in September said that officer Jose Figueroa-Lizarraga moved cameras in an Arizona state facility and raped a prisoner who was on a job assignment, forcing her inside the guard’s control room. After reporting the incident, the woman was attacked again, the suit said — alleging that the second time, even her request for emergency contraception was ignored. She became pregnant and nearly died after hemorrhaging during childbirth.Figueroa-Lizarraga also was prosecuted on criminal charges and pleaded guilty to a lesser crime of attempting to commit unlawful sexual conduct by a custodian. He was sentenced to two years probation in August.In some cases, the allegations of abuse extend beyond prison walls.Correctional officer Anthony Martin kept his job at New York City’s Rikers Island jail even after several female inmates alleged he sexually abused them by creating special work assignments. Then in March, while off-duty in Queens, he was arrested for allegedly raping a woman in the community. In that case, the district attorney moved swiftly. Martin was indicted by a grand jury in August for first-degree rape and faces up to 25 years if convicted.“This disparity sends a chilling message - that the dignity and rights of the incarcerated are worth less than those on the outside,” said attorney Anna Kull, who is representing a woman who alleges Martin abused her while she was locked up.Other correctional officers accused of abuse sometimes transition into working with even more vulnerable populations. Youst said it was Widen possibly taking a new job that ultimately spurred her to act.“I heard him say something about juveniles — you know, working in a juvenile facility. That’s when I knew I had to say something,” she said.Youst believed she had something that might stop him from going anywhere else. She told police that Widen didn’t use a condom that night and pulled a handful of napkins out of his coat pocket when he was done.“He gave them to me and stood in front of me and made me wipe myself off,” she said to the AP, as she previously had told police. “I threw them in the trash can, and he’s like, ‘No, give them back to me.’”As soon as he stepped aside, she said she raced back upstairs to her dorm, pulled off her fleece pajamas and black T-shirt and hid them. She tried to avoid being alone with Widen again, but said the abuse continued.One winter morning, she said she stuffed a plastic bag containing the clothes from that night into her coat and left the work release center for her job. She called the one person she had heard could help – attorney Michael Woelfel.He met her at the mattress factory and took the bag to the police, handing it over for DNA testing in a state where prisoners cannot legally consent regardless of circumstances. Though questions were raised at the lab about the chain of custody, it was a match for Widen.Widen was working in West Virginia’s juvenile services department when he was charged with two counts of felony sex acts against a prisoner — Youst. His bail was set at $25,000, and he was released on bond six years ago.He told the AP that his DNA could have come from somewhere else in the center — or even from his disgruntled ex-wife.Since being charged, Widen has been assigned three defense lawyers by the state. The original judge retired. And a new prosecuting attorney, whose office declined comment, is now on the case.Widen has attended multiple hearings at the Cabell County courthouse and is expected to appear again this month. A trial date has not been set.Just down the street sits the building that once housed the work release center. It was shut down seven years ago due to disrepair, and today operates as an addiction wellness center.Nothing looks the same from Youst’s time there — except the laundry room and the cage in the basement corner.___The AP typically does not use the names of sexual assault victims, but the women making accusations in this story wanted their identities known to encourage others to come forward.___The Associated Press receives support from the Public Welfare Foundation for reporting focused on criminal justice. This story also was supported by Columbia University’s Ira A. Lipman Center for Journalism and Civil and Human Rights in conjunction with Arnold Ventures. The AP is solely responsible for all content.___Contact AP’s global investigative team at Investigative@ap.org or https://www.ap.org/tips/",
  "image": "https://s.yimg.com/ny/api/res/1.2/b14ZkCQnuPoL7rDcMTISPw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/ap.org/a0ec725566fdea82534aa0be4b8508b5",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-article-body=\"true\"\u003e\u003cp\u003eHUNTINGTON, W.Va. (AP) — It was after midnight when she crept down the narrow, dimly lit stairs carrying a bag of dirty laundry. She crossed under a patchwork of pipes and ducts to the far back corner of the basement, as she had done many times before. That, she said, is where correctional officer James Widen was waiting for her.\u003c/p\u003e\u003cp\u003eHe had just called her name over the intercom, telling her to report to the work release center’s laundry room. So April Youst rose from her bunk, careful not to wake the other incarcerated women sleeping in the dorm.\u003c/p\u003e\u003cp\u003eWhen she got downstairs, she said Widen offered to save her some money by opening “the cage,” a little room with free washers and dryers reserved for new prisoners who hadn’t yet started their jobs.\u003c/p\u003e\u003cp\u003eShe gratefully stepped inside. And then, she said, everything changed.\u003c/p\u003e\u003cp\u003e“He’s rubbing himself,” she said, while reminding her of all the little favors he’d done for her. “He was like … ‘It’s time to pay.’”\u003c/p\u003e\u003cp\u003eHer account of that night to The Associated Press mirrors, almost word for word, the complaint she filed with police eight years ago. Widen was charged two years later and pleaded not guilty, but the case continues to crawl through the criminal court system. He vehemently denied the allegations to the AP, contending he was set up.\u003c/p\u003e\u003cp\u003eYoust is part of the fastest-growing population behind bars — women, most of whom are locked up for nonviolent crimes that often are drug-related. Though female prisoners long have been victims of sexual violence, the number of reports against correctional staff has exploded nationwide in recent years. Many complaints follow a similar pattern: Accusers are retaliated against, while those accused face little or no punishment.\u003c/p\u003e\u003cp\u003eIn all 50 states, \u003ca data-i13n=\"cpos:1;pos:1\" href=\"https://apnews.com/article/prison-rape-women-inmates-guards-takeaways-f253a2f2b2ae08d8c40036f9720da238\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:the AP found cases;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003ethe AP found cases\u003c/a\u003e where staff allegedly used inmate work assignments to lure women to isolated spots, out of view of security cameras. The prisoners said they were attacked while doing jobs like kitchen or laundry duty inside correctional facilities or in work-release programs that placed them at private businesses like national fast-food restaurants and hotel chains.\u003c/p\u003e\u003cp\u003e“The only thing you’re thinking about when you’re coming into intake is, ‘How am I going to stay safe?’” said Johanna Mills of Just Detention International, a nonprofit organization working to end sexual violence behind bars. When she was incarcerated, she said her boss smashed her in the head and raped her after bringing her to an empty gym one night to do electrical work. “It never occurred to me to watch my back from the supervisor,” she said.\u003c/p\u003e\u003cp\u003eAs part of a \u003ca data-i13n=\"cpos:2;pos:1\" href=\"https://apnews.com/article/prison-to-plate-inmate-labor-investigation-c6f0eb4747963283316e494eadf08c4e\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:two-year investigation;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003etwo-year investigation\u003c/a\u003e that has exposed everything from multinational companies benefiting from prison labor to incarcerated workers’ lack of rights and protections, AP reporters spoke to more than 100 current and former prisoners nationwide, including women who said they were sexually abused by correctional staff.\u003c/p\u003e\u003cp\u003eThe AP also scoured thousands of pages of court filings, police reports, audits and other documents that detailed graphic stories of systemic sexual violence and cover-ups from New York to Florida to California.\u003c/p\u003e\u003cp\u003eThose cases prompted a \u003ca data-i13n=\"cpos:3;pos:1\" href=\"https://www.hsgac.senate.gov/wp-content/uploads/imo/media/doc/2022-12-13%20PSI%20Staff%20Report%20-%20Sexual%20Abuse%20of%20Female%20Inmates%20in%20Federal%20Prisons.pdf\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:bipartisan Senate investigation;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003ebipartisan Senate investigation\u003c/a\u003e two years ago that found prisoners were sexually abused by wardens, guards, chaplains or other staff in at least two-thirds of all women’s federal prisons over the past decade. But a backlog of thousands of cases has impeded the Bureau of Prison’s ability to hold employees accountable, government investigators said.\u003c/p\u003e\u003cp\u003eThe Prison Rape Elimination Act, passed more than 20 years ago, created a channel for filing reports that resulted in a threefold increase in the number of allegations of staff sexual misconduct involving male, female and transgender inmates from 2010 to 2020 at jails and prisons nationwide.\u003c/p\u003e\u003cp\u003eJust over a month ago, U.S. lawmakers held a hearing to discuss how to better safeguard inmates. One woman, Bonnie Hernandez, testified that she was raped repeatedly and violently by officer Lenton Hatten in a Florida federal prison after he made her clean the recreation area as part of her work detail.\u003c/p\u003e\u003cp\u003e“It got to the point where I feared for my life and had no choice but to report him, even though I was terrified to do so,” she said. In response, she said she was sent to isolation, then transferred to a facility with greater restrictions and no access to video calls with her daughters. Still, it was one of the rare cases that led to prosecution, boosted by DNA evidence. Hatten faced a maximum sentence of 15 years in prison. He received only three months \u003ca data-i13n=\"cpos:4;pos:1\" href=\"https://www.justice.gov/usao-ndfl/pr/former-federal-correctional-officer-sentenced-prison-sexual-abuse-inmate#:~:text=Northern%20District%20of%20Florida%20%7C%20Former,United%20States%20Department%20of%20Justice\u0026amp;text=A%20lock%20(%20Locked%20padlock%20)%20or,only%20on%20official%2C%20secure%20websites.\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:last year after pleading guilty;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003elast year after pleading guilty\u003c/a\u003e to sexual abuse of a ward.\u003c/p\u003e\u003cp\u003e“What you allow is what will continue,” Sen. John Kennedy, a Republican from Louisiana, said after her testimony. “Three months for rape is absurd. … That’s not justice.”\u003c/p\u003e\u003cp\u003eSometimes, even a confession isn’t enough to lead to punishment. At another federal facility in Florida, a guard who had sex with women on landscape duty was among at least six men who were not prosecuted even though they admitted to the misconduct during an internal investigation, according to the Senate \u003ca data-i13n=\"cpos:5;pos:1\" href=\"https://www.hsgac.senate.gov/wp-content/uploads/imo/media/doc/2022-12-13%20PSI%20Staff%20Report%20-%20Sexual%20Abuse%20of%20Female%20Inmates%20in%20Federal%20Prisons.pdf\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:report;cpos:5;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003ereport\u003c/a\u003e. That was in part because, by law, government employees cannot be criminally charged if they are compelled to make statements.\u003c/p\u003e\u003cp\u003eInternationally, prison rape is recognized as a form of torture. While it is illegal in the U.S, correctional officers have argued in some states that – despite the clear power imbalance – inmates gave their consent. Laws vary widely. For example, sexual abuse of an inmate can be a misdemeanor in Kentucky with a maximum sentence of 12 months, but prison rape is a felony in Pennsylvania, carrying up to seven years behind bars.\u003c/p\u003e\u003cp\u003eCorrectional staff often quit or retire before internal investigations are complete, sometimes retaining pensions and other benefits, experts say. With no paper trail and severe staff shortages, some are simply transferred or hired at other facilities or they land positions overseeing vulnerable populations like juveniles, the AP found.\u003c/p\u003e\u003cp\u003eOfficer Widen took a job in West Virginia after resigning from a women’s prison in neighboring Ohio. According to an internal investigation submitted as part of civil court filings, he had delivered a ring from an inmate to a former prisoner. He told the AP there was no sexual contact and that he quit after upsetting prison officials by launching his own investigation into heroin smuggling at the facility, transporting the ring in exchange for information from the inmate.\u003c/p\u003e\u003cp\u003eYoust said she had no concerns about Widen when she first arrived at the Huntington Work Release Center. In fact, she said he was a favorite among many of the men and women living there, sometimes sneaking them cigarettes or warning them about shakedowns. She said he also helped make a write-up against her go away after she was caught with a contraband cellphone – an incident that could have gotten her sent back to prison and farther away from her young daughter, who was living just down the street.\u003c/p\u003e\u003cp\u003eAs a guard, Widen held incredible power over the women. They had earned their places at the program, allowing them to dip a toe back into the free world. Though work assignments inside prisons may pay only pennies an hour, outside opportunities — which easily can be taken away — allow women to earn a little more money before their release.\u003c/p\u003e\u003cp\u003eYoust had been in and out of the system for years for crimes stemming from her addiction. She was working days at a local mattress company when she was called down to the laundry room that night in early 2016. She told police — and the AP — that Widen started touching himself over his pants. Then, she said, he told her the cameras couldn’t see what he was about to do.\u003c/p\u003e\u003cp\u003e“He’s already pulling his pants down,” she said. “You can hear his belt.”\u003c/p\u003e\u003cp\u003eShe said she desperately tried to reason with him, stressing that someone could walk in on them and that the women upstairs in the dorm might miss her if she was gone too long.\u003c/p\u003e\u003cp\u003eAnd then, echoing the account she gave police, she said, “He just pretty much bent me over the washing machine.”\u003c/p\u003e\u003cp\u003eYoust said she is baffled by how the case has dragged on.\u003c/p\u003e\u003cp\u003eWiden has been free since posting bond after his arrest in 2018. He told the AP that all allegations of sexual misconduct at the work release center are untrue, labeled Youst “a career criminal” and said the police were unjustly after him.\u003c/p\u003e\u003cp\u003e“My rights have been violated every which way,” he said. “I’ve got nothing to hide. I didn’t do anything I was accused of. West Virginia is crooked.”\u003c/p\u003e\u003cp\u003e‘We’re all women’\u003c/p\u003e\u003cp\u003eWest Virginia, a rugged swath of Appalachia that has been home to the country’s highest overdose death rate for a decade, has experienced one of America’s sharpest spikes in female incarceration rates, with a more than 200 percent increase in state prisons between 2000 and 2016 — which is precisely when lawyers started fielding sexual abuse complaints.\u003c/p\u003e\u003cp\u003eAP reporters met with current and former prisoners inside correctional facilities and at their homes in mountain communities, some of whom said staff members often started out being nice — bringing them fast food or makeup — and then raped them, peeped at them in showers or forced them to strip and perform sex acts on other prisoners while the guards watched.\u003c/p\u003e\u003cp\u003eMost female victims locked up nationwide were abused before being incarcerated, research shows. They rarely report assaults, fearing they won’t be believed or will be punished, ranging from losing their jobs to being placed in solitary confinement or denied contact with their children. And many on work release have only a short time left to serve and are wary of doing anything that could send them back to prison or add time to their sentences.\u003c/p\u003e\u003cp\u003eIn most cases nationwide, internal investigations determine that allegations are “unsubstantiated.” And in the cases that have enough evidence to wind their way through the legal system, only 6% of the nearly 1,000 staff who reportedly engaged in sexual misconduct with male and female inmates in 2019 and 2020 were convicted, according to the latest Department of Justice figures. Without prosecution, perpetrators also can avoid placement on sex offender registries.\u003c/p\u003e\u003cp\u003eIn West Virginia, Amanda McGrew, the state’s compliance director for the Prison Rape Elimination Act, said some prisoners use the act to file complaints unrelated to sexual abuse because they know it will trigger the removal of an officer until an investigation is completed. Police are alerted when accusations are substantiated and it’s up to prosecutors to take a case forward, she said. And even when staff resign, she added, investigations continue.\u003c/p\u003e\u003cp\u003eBut there is another route: Huntington-based attorney Michael Woelfel has sought restitution through a stream of civil suits.\u003c/p\u003e\u003cp\u003eWoelfel, who also is a Democratic state senator, said he has settled 127 cases in which women accused guards of abuse in the past 15 years, forcing the state’s insurance carrier to pay out millions of dollars.\u003c/p\u003e\u003cp\u003eHe said he first started receiving calls from women jailed for crimes linked to their addiction after judges took a hard line, locking them up to try to straighten them out. He had known some of them since they were girls, appearing before him when he oversaw preliminary juvenile delinquency cases that sometimes involved sexual or physical abuse at home.\u003c/p\u003e\u003cp\u003eMost lawyers wouldn’t touch their prison rape claims, and not just because they are hard to win due to qualified immunity — a high bar that helps protects people in law enforcement from liability resulting from misconduct.\u003c/p\u003e\u003cp\u003e“There is a certain element of people that think if you go to prison, you sort of get whatever you get in there,” Woelfel said, adding that while he is still contacted by women alleging sexual misconduct, the slew of lawsuits has helped pressure the state to crack down. “That taboo of rape or sexual assault … it’s so commonplace that people still joke about that.”\u003c/p\u003e\u003cp\u003eWomen have been targeted from their days on slave plantations, when they were raped by their owners, to the decades-long period that followed emancipation and involved leasing convicts out to private companies. Widespread reports of abuse eventually led to the creation of reformatories, where women no longer were overseen by men.\u003c/p\u003e\u003cp\u003eThat began to change in the 1970s after anti-discrimination laws opened the door for cross-gender supervision, just as the number of women being locked up started to rise. Though they now represent only about 10 percent of the nation’s overall prison population, female incarceration rates have jumped from about 26,000 in 1980 to nearly 200,000 today.\u003c/p\u003e\u003cp\u003eSome guards believe women with substance abuse issues are accustomed to using sex as a commodity on the streets, seeing them as partly responsible for their own victimization, said Brenda Smith, a law professor at American University and one of the country’s top experts on prison rape.\u003c/p\u003e\u003cp\u003e“They’re viewed as sort of the lowest of the low,” she said. “They’re not really women — they’re just other things.”\u003c/p\u003e\u003cp\u003eYoust said her case appears to bear that out. She’s out of prison and said she’s working to stay clean, holding down a busy job while building a new life.\u003c/p\u003e\u003cp\u003eEven before the languishing criminal case, Youst and three others from the Huntington work release center came forward to file civil suits against Widen. The cases were settled by the state’s insurance carrier for $240,000 in 2019, with no admission of any wrongdoing, Woelfel said. The AP interviewed three of the women. The fourth died of an overdose before the agreement was reached.\u003c/p\u003e\u003cp\u003eWiden contended the women were driven by a payday and plotted together, saying, “Me, too! Me, too! Me, too!”\u003c/p\u003e\u003cp\u003eBut Alesha Canfield, who was among the four women filing suit, said she talked to no one about Widen at the center.\u003c/p\u003e\u003cp\u003eShe said she was worn out from working morning and afternoon shifts at two major restaurant chains, but still struggled to sleep at night, worried that Widen would tap her on the shoulder in the dorm and summon her to the center’s basement.\u003c/p\u003e\u003cp\u003e“I was terrified. I did what I was told,” she said to the AP, noting that she waited to file a rape report until after leaving the facility because she feared retaliation.\u003c/p\u003e\u003cp\u003e“I’m the criminal,” she said. “He’s the cop. So why are they going to believe me anyway?”\u003c/p\u003e\u003cp\u003eCanfield, who related the same story in civil court filings, said it’s hard to understand why abuse behind bars isn’t taken more seriously.\u003c/p\u003e\u003cp\u003e“We’re all women,” she said. “Just because we made a mistake and got caught once in our lives doesn’t mean that we should be treated any different than any other woman in this world.”\u003c/p\u003e\u003cp\u003e‘Culture of abuse’\u003c/p\u003e\u003cp\u003eA recent spike in scandals, cover-ups and lawsuits linked to women’s facilities nationwide has prompted congressional investigations and scathing Department of Justice reports that cited a “culture of abuse.” Experts say powerful unions sometimes work to shield staff from allegations of misconduct. And in some cases, correctional officers who speak out are retaliated against.\u003c/p\u003e\u003cp\u003eThings were so bad at FCI Dublin in California that prisoners and staff named it “the rape club,” a \u003ca data-i13n=\"cpos:6;pos:1\" href=\"https://apnews.com/article/prisons-california-united-states-sexual-abuse-only-on-ap-d321ae51fe93dfd9d6e5754383a95801\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:2022 AP investigation found;cpos:6;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e2022 AP investigation found\u003c/a\u003e. At least two men who pleaded guilty to sexual abuse were work supervisors: Nakie Nunley targeted at least five female prisoners who worked at the federal government’s call center, where inmates are employed by companies to do jobs like telemarketing and customer service. And Andrew Jones abused women who worked for him in the kitchen. The correctional facility was recently shut down; Nunley and Jones have been imprisoned along with at least five others, with another case still pending.\u003c/p\u003e\u003cp\u003eBrandy Moore White, who heads the union representing nearly 30,000 correctional staff in federal prisons, condemned sexual abuse inside facilities and pointed to a need for more resources amid “catastrophic” staffing shortages.\u003c/p\u003e\u003cp\u003e“The most eﬃcient way to provide security and oversight is not cameras and technology, it is staﬃng,” she told lawmakers during a recent Senate subcommittee hearing, noting that employees also face sexual violence and harassment from inmates. “If you have 10 staff supervising 500 inmates, there is time for people who have ill intentions to do things that they shouldn’t do.”\u003c/p\u003e\u003cp\u003eMany accusations note that guards took special care to avoid surveillance video. A civil lawsuit filed in September said that officer Jose Figueroa-Lizarraga moved cameras in an Arizona state facility and raped a prisoner who was on a job assignment, forcing her inside the guard’s control room. After reporting the incident, the woman was attacked again, the suit said — alleging that the second time, even her request for emergency contraception was ignored. She became pregnant and nearly died after hemorrhaging during childbirth.\u003c/p\u003e\u003cp\u003eFigueroa-Lizarraga also was prosecuted on criminal charges and pleaded guilty to a lesser crime of attempting to commit unlawful sexual conduct by a custodian. He was sentenced to two years probation in August.\u003c/p\u003e\u003cp\u003eIn some cases, the allegations of abuse extend beyond prison walls.\u003c/p\u003e\u003cp\u003eCorrectional officer Anthony Martin kept his job at New York City’s Rikers Island jail even after several female inmates alleged he sexually abused them by creating special work assignments. Then in March, while off-duty in Queens, he was arrested for allegedly raping a woman in the community. In that case, the district attorney moved swiftly. Martin was indicted by a grand jury in August for first-degree rape and faces up to 25 years if convicted.\u003c/p\u003e\u003cp\u003e“This disparity sends a chilling message - that the dignity and rights of the incarcerated are worth less than those on the outside,” said attorney Anna Kull, who is representing a woman who alleges Martin abused her while she was locked up.\u003c/p\u003e\u003cp\u003eOther correctional officers accused of abuse sometimes transition into working with even more vulnerable populations. Youst said it was Widen possibly taking a new job that ultimately spurred her to act.\u003c/p\u003e\u003cp\u003e“I heard him say something about juveniles — you know, working in a juvenile facility. That’s when I knew I had to say something,” she said.\u003c/p\u003e\u003cp\u003eYoust believed she had something that might stop him from going anywhere else. She told police that Widen didn’t use a condom that night and pulled a handful of napkins out of his coat pocket when he was done.\u003c/p\u003e\u003cp\u003e“He gave them to me and stood in front of me and made me wipe myself off,” she said to the AP, as she previously had told police. “I threw them in the trash can, and he’s like, ‘No, give them back to me.’”\u003c/p\u003e\u003cp\u003eAs soon as he stepped aside, she said she raced back upstairs to her dorm, pulled off her fleece pajamas and black T-shirt and hid them. She tried to avoid being alone with Widen again, but said the abuse continued.\u003c/p\u003e\u003cp\u003eOne winter morning, she said she stuffed a plastic bag containing the clothes from that night into her coat and left the work release center for her job. She called the one person she had heard could help – attorney Michael Woelfel.\u003c/p\u003e\u003cp\u003eHe met her at the mattress factory and took the bag to the police, handing it over for DNA testing in a state where prisoners cannot legally consent regardless of circumstances. Though questions were raised at the lab about the chain of custody, it was a match for Widen.\u003c/p\u003e\u003cp\u003eWiden was working in West Virginia’s juvenile services department when he was charged with two counts of felony sex acts against a prisoner — Youst. His bail was set at $25,000, and he was released on bond six years ago.\u003c/p\u003e\u003cp\u003eHe told the AP that his DNA could have come from somewhere else in the center — or even from his disgruntled ex-wife.\u003c/p\u003e\u003cp\u003eSince being charged, Widen has been assigned three defense lawyers by the state. The original judge retired. And a new prosecuting attorney, whose office declined comment, is now on the case.\u003c/p\u003e\u003cp\u003eWiden has attended multiple hearings at the Cabell County courthouse and is expected to appear again this month. A trial date has not been set.\u003c/p\u003e\u003cp\u003eJust down the street sits the building that once housed the work release center. It was shut down seven years ago due to disrepair, and today operates as an addiction wellness center.\u003c/p\u003e\u003cp\u003eNothing looks the same from Youst’s time there — except the laundry room and the cage in the basement corner.\u003c/p\u003e\u003cp\u003e___\u003c/p\u003e\u003cp\u003eThe AP typically does not use the names of sexual assault victims, but the women making accusations in this story wanted their identities known to encourage others to come forward.\u003c/p\u003e\u003cp\u003e___\u003c/p\u003e\u003cp\u003eThe Associated Press receives support from the Public Welfare Foundation for reporting focused on criminal justice. This story also was supported by Columbia University’s Ira A. Lipman Center for Journalism and Civil and Human Rights in conjunction with Arnold Ventures. The AP is solely responsible for all content.\u003c/p\u003e\u003cp\u003e___\u003c/p\u003e\u003cp\u003eContact AP’s global investigative team at Investigative@ap.org or \u003ca data-i13n=\"cpos:7;pos:1\" href=\"https://www.ap.org/tips/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:https://www.ap.org/tips/;cpos:7;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003ehttps://www.ap.org/tips/\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "22 min read",
  "publishedTime": "2024-11-01T03:04:43Z",
  "modifiedTime": null
}
