{
  "id": "348ff3db-22e2-4b03-b81e-5f55359fe4dc",
  "title": "One in five children in Gaza City is malnourished, UN aid agency says",
  "link": "https://www.bbc.com/news/articles/cwyxy5k70rzo",
  "description": "The UN agency for Palestinians says it has thousands of truckloads of supplies near Gaza which it wants to deliver.",
  "author": "",
  "published": "Fri, 25 Jul 2025 01:06:52 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Aoife Walsh and Paulin Kola",
  "length": 5077,
  "excerpt": "The UN agency for Palestinians says it has thousands of truckloads of supplies near Gaza which it wants to deliver.",
  "siteName": "BBC News",
  "favicon": "https://static.files.bbci.co.uk/bbcdotcom/web/20250711-084946-a521911844-web-2.25.0-9/apple-touch-icon.png",
  "text": "Aoife Walsh and Paulin KolaBBC NewsBBCThe UN says the hunger crisis in Gaza 'has never been so dire'One in five children in Gaza City is malnourished and cases are increasing every day, the UN's Palestinian refugee agency (Unrwa) says.In a statement issued on Thursday, Unrwa Commissioner-General Philippe Lazzarini cited a colleague telling him: \"People in Gaza are neither dead nor alive, they are walking corpses.\"More than 100 international aid organisations and human rights groups have also warned of mass starvation - pressing for governments to take action.Israel, which controls the entry of all supplies into Gaza, says there is no siege and blames Hamas for any cases of malnutrition.The UN, however, has warned that the level of aid getting into Gaza is \"a trickle\" and the hunger crisis in the territory \"has never been so dire\".In his statement on Thursday, Lazzarini said \"more than 100 people, the vast majority of them children, have reportedly died of hunger\".\"Most children our teams are seeing are emaciated, weak and at high risk of dying if they don't get the treatment they urgently need,\" he said, pleading for Israel to \"allow humanitarian partners to bring unrestricted and uninterrupted humanitarian assistance to Gaza\".Unrwa workers are \"increasingly fainting from hunger while at work\", according to Lazzarini, who added: \"When caretakers cannot find enough to eat, the entire humanitarian system is collapsing\". On Wednesday, the World Health Organisation (WHO) said a large proportion of the population of Gaza was \"starving\".\"I don't know what you would call it other than mass starvation - and it's man-made,\" the head of the WHO, Tedros Adhanom Ghebreyesus, said. Listen: The story behind the harrowing photograph of a starving Gaza babyIn northern Gaza, Hanaa Almadhoun, 40, said local markets are often without food and other supplies. \"If they do exist then they come at exorbitant prices that no ordinary person can afford,\" she told the BBC over WhatsApp. She said flour was expensive and difficult to secure, and that people have sold \"gold and personal belongings\" to afford it. The mother-of-three said \"every new day brings a new challenge\" as people search for \"something edible\". \"With my own eyes, I've seen children rummaging through the garbage in search of food scraps,\" she added. During a visit to Israeli troops in Gaza on Wednesday, Israel's President Isaac Herzog insisted his country was providing humanitarian aid \"according to international law\".But Tahani Shehada, an aid worker in Gaza, said people \"are just trying to survive hour-by-hour\".\"Even simple things like cooking [and] taking a shower have become luxuries,\" she said. \"I have a baby. He's eight months old. He doesn't know what fresh fruit tastes like,\" she added. Tahani ShehadaTahani Shehada, an aid worker, said her baby has never eaten fresh fruitIsrael stopped aid deliveries to Gaza in early March following a two-month ceasefire. The blockade was partially eased after nearly two months, but food, fuel and medicine shortages worsened.Israel, with the US, established a new aid system run by the Gaza Humanitarian Foundation (GHF). According to the UN human rights office, more than 1,000 Palestinians have been killed by the Israeli military while trying to get food aid over the past two months.It says at least 766 of them have been killed in the vicinity of one of the GHF's four distribution centres, which are operated by US private security contractors and are located inside Israeli military zones.Another 288 people have been reported killed near UN and other aid convoys.Israel has accused Hamas of instigating the chaos near the aid sites. It says its troops have only fired warning shots and that they do not intentionally shoot civilians.The GHF says the UN is using \"false\" figures from Gaza's Hamas-run health ministry.Najah, a 19-year-old who is sheltering in a hospital in Gaza, said she fears travelling to an aid distribution site Najah, a 19-year-old widow sheltering in a hospital in Gaza, said she fears she would \"get shot\" if she travelled to aid distribution site.\"I hope they bring us something to eat and drink. We die of hunger with nothing to eat or drink. We live in tents. We are finished off,\" Najah told the BBC. A doctor working in Gaza with a UK medical charity, Dr Aseel, said Gaza was not close to famine, but already \"living it\". \"My husband went once [to an aid distribution point] and twice and then got shot and that was it,\" she said. \"If we are to die from hunger, let it be. The path to aid is the path to death.\"Abu Alaa, a market seller in Gaza, said he and his children \"go to bed hungry every night\". \"We are not alive. We are dead. We are pleading with the whole world to intervene and save us,\" he added. Walaa Fathi, who is eight months pregnant with her third child, said Gazans are \"experiencing a catastrophe and a famine that no one could have imagined\". \"I hope that my baby stays in my womb and I don't have to give birth in these difficult circumstances,\" she told the BBC from Deir al-Balah.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5430/live/a6566580-68b3-11f0-a7a7-2fa09728ca14.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cdiv data-testid=\"byline-new\" data-component=\"byline-block\"\u003e\u003cp\u003e\u003cspan\u003eAoife Walsh and Paulin Kola\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBBC News\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250711-084946-a521911844-web-2.25.0-9/grey-placeholder.png\" aria-label=\"image unavailable\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/5430/live/a6566580-68b3-11f0-a7a7-2fa09728ca14.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/5430/live/a6566580-68b3-11f0-a7a7-2fa09728ca14.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/5430/live/a6566580-68b3-11f0-a7a7-2fa09728ca14.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/5430/live/a6566580-68b3-11f0-a7a7-2fa09728ca14.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/5430/live/a6566580-68b3-11f0-a7a7-2fa09728ca14.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/5430/live/a6566580-68b3-11f0-a7a7-2fa09728ca14.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/5430/live/a6566580-68b3-11f0-a7a7-2fa09728ca14.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/5430/live/a6566580-68b3-11f0-a7a7-2fa09728ca14.jpg.webp\" loading=\"eager\" alt=\"BBC Woman holding an apparently malnourished child as another one lies in a bed\"/\u003e\u003cspan\u003eBBC\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eThe UN says the hunger crisis in Gaza \u0026#39;has never been so dire\u0026#39;\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eOne in five children in Gaza City is malnourished and cases are increasing every day, the UN\u0026#39;s Palestinian refugee agency (Unrwa) says.\u003c/p\u003e\u003cp\u003eIn a statement issued on Thursday, Unrwa Commissioner-General Philippe Lazzarini cited a colleague telling him: \u0026#34;People in Gaza are neither dead nor alive, they are walking corpses.\u0026#34;\u003c/p\u003e\u003cp\u003eMore than 100 international aid organisations and human rights groups have also warned of mass starvation - pressing for governments to take action.\u003c/p\u003e\u003cp\u003eIsrael, which controls the entry of all supplies into Gaza, says there is no siege and blames Hamas for any cases of malnutrition.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe UN, however, has warned that the level of aid getting into Gaza is \u0026#34;a trickle\u0026#34; and the hunger crisis in the territory \u0026#34;has never been so dire\u0026#34;.\u003c/p\u003e\u003cp\u003eIn his statement on Thursday, Lazzarini said \u0026#34;more than 100 people, the vast majority of them children, have reportedly died of hunger\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;Most children our teams are seeing are emaciated, weak and at high risk of dying if they don\u0026#39;t get the treatment they urgently need,\u0026#34; he said, pleading for Israel to \u0026#34;allow humanitarian partners to bring unrestricted and uninterrupted humanitarian assistance to Gaza\u0026#34;.\u003c/p\u003e\u003cp\u003eUnrwa workers are \u0026#34;increasingly fainting from hunger while at work\u0026#34;, according to Lazzarini, who added: \u0026#34;When caretakers cannot find enough to eat, the entire humanitarian system is collapsing\u0026#34;. \u003c/p\u003e\u003cp\u003eOn Wednesday, the World Health Organisation (WHO) said a large proportion of the population of Gaza was \u0026#34;starving\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;I don\u0026#39;t know what you would call it other than mass starvation - and it\u0026#39;s man-made,\u0026#34; the head of the WHO, Tedros Adhanom Ghebreyesus, said. \u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eListen: The story behind the harrowing photograph of a starving Gaza baby\u003c/figcaption\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eIn northern Gaza, Hanaa Almadhoun, 40, said local markets are often without food and other supplies. \u003c/p\u003e\u003cp\u003e\u0026#34;If they do exist then they come at exorbitant prices that no ordinary person can afford,\u0026#34; she told the BBC over WhatsApp. \u003c/p\u003e\u003cp\u003eShe said flour was expensive and difficult to secure, and that people have sold \u0026#34;gold and personal belongings\u0026#34; to afford it. \u003c/p\u003e\u003cp\u003eThe mother-of-three said \u0026#34;every new day brings a new challenge\u0026#34; as people search for \u0026#34;something edible\u0026#34;. \u003c/p\u003e\u003cp\u003e\u0026#34;With my own eyes, I\u0026#39;ve seen children rummaging through the garbage in search of food scraps,\u0026#34; she added. \u003c/p\u003e\u003cp\u003eDuring a visit to Israeli troops in Gaza on Wednesday, Israel\u0026#39;s President Isaac Herzog insisted his country was providing humanitarian aid \u0026#34;according to international law\u0026#34;.\u003c/p\u003e\u003cp\u003eBut Tahani Shehada, an aid worker in Gaza, said people \u0026#34;are just trying to survive hour-by-hour\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;Even simple things like cooking [and] taking a shower have become luxuries,\u0026#34; she said. \u003c/p\u003e\u003cp\u003e\u0026#34;I have a baby. He\u0026#39;s eight months old. He doesn\u0026#39;t know what fresh fruit tastes like,\u0026#34; she added. \u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250711-084946-a521911844-web-2.25.0-9/grey-placeholder.png\" aria-label=\"image unavailable\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/3026/live/fc39dd90-6892-11f0-8dbd-f3d32ebd3327.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/3026/live/fc39dd90-6892-11f0-8dbd-f3d32ebd3327.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/3026/live/fc39dd90-6892-11f0-8dbd-f3d32ebd3327.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/3026/live/fc39dd90-6892-11f0-8dbd-f3d32ebd3327.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/3026/live/fc39dd90-6892-11f0-8dbd-f3d32ebd3327.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/3026/live/fc39dd90-6892-11f0-8dbd-f3d32ebd3327.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/3026/live/fc39dd90-6892-11f0-8dbd-f3d32ebd3327.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/3026/live/fc39dd90-6892-11f0-8dbd-f3d32ebd3327.jpg.webp\" loading=\"lazy\" alt=\"Tahani Shehada An image of Tahani Shehada\u0026#39;s eight-month-old baby sitting on an armchair while holding a toy shovel. \"/\u003e\u003cspan\u003eTahani Shehada\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eTahani Shehada, an aid worker, said her baby has never eaten fresh fruit\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eIsrael stopped aid deliveries to Gaza in early March following a two-month ceasefire. The blockade was partially eased after nearly two months, but food, fuel and medicine shortages worsened.\u003c/p\u003e\u003cp\u003eIsrael, with the US, established a new aid system run by the Gaza Humanitarian Foundation (GHF). \u003c/p\u003e\u003cp\u003eAccording to the UN human rights office, more than 1,000 Palestinians have been killed by the Israeli military while trying to get food aid over the past two months.\u003c/p\u003e\u003cp\u003eIt says at least 766 of them have been killed in the vicinity of one of the GHF\u0026#39;s four distribution centres, which are operated by US private security contractors and are located inside Israeli military zones.\u003c/p\u003e\u003cp\u003eAnother 288 people have been reported killed near UN and other aid convoys.\u003c/p\u003e\u003cp\u003eIsrael has accused Hamas of instigating the chaos near the aid sites. It says its troops have only fired warning shots and that they do not intentionally shoot civilians.\u003c/p\u003e\u003cp\u003eThe GHF says the UN is using \u0026#34;false\u0026#34; figures from Gaza\u0026#39;s Hamas-run health ministry.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250711-084946-a521911844-web-2.25.0-9/grey-placeholder.png\" aria-label=\"image unavailable\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/a3c8/live/3119c5b0-688f-11f0-89ea-4d6f9851f623.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/a3c8/live/3119c5b0-688f-11f0-89ea-4d6f9851f623.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/a3c8/live/3119c5b0-688f-11f0-89ea-4d6f9851f623.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/a3c8/live/3119c5b0-688f-11f0-89ea-4d6f9851f623.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/a3c8/live/3119c5b0-688f-11f0-89ea-4d6f9851f623.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/a3c8/live/3119c5b0-688f-11f0-89ea-4d6f9851f623.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/a3c8/live/3119c5b0-688f-11f0-89ea-4d6f9851f623.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/a3c8/live/3119c5b0-688f-11f0-89ea-4d6f9851f623.jpg.webp\" loading=\"lazy\" alt=\"An image of Najah, a 19-year-old woman, holding a baby in her arms. \"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eNajah, a 19-year-old who is sheltering in a hospital in Gaza, said she fears travelling to an aid distribution site \u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eNajah, a 19-year-old widow sheltering in a hospital in Gaza, said she fears she would \u0026#34;get shot\u0026#34; if she travelled to aid distribution site.\u003c/p\u003e\u003cp\u003e\u0026#34;I hope they bring us something to eat and drink. We die of hunger with nothing to eat or drink. We live in tents. We are finished off,\u0026#34; Najah told the BBC. \u003c/p\u003e\u003cp\u003eA doctor working in Gaza with a UK medical charity, Dr Aseel, said Gaza was not close to famine, but already \u0026#34;living it\u0026#34;. \u003c/p\u003e\u003cp\u003e\u0026#34;My husband went once [to an aid distribution point] and twice and then got shot and that was it,\u0026#34; she said. \u003c/p\u003e\u003cp\u003e\u0026#34;If we are to die from hunger, let it be. The path to aid is the path to death.\u0026#34;\u003c/p\u003e\u003cp\u003eAbu Alaa, a market seller in Gaza, said he and his children \u0026#34;go to bed hungry every night\u0026#34;. \u003c/p\u003e\u003cp\u003e\u0026#34;We are not alive. We are dead. We are pleading with the whole world to intervene and save us,\u0026#34; he added. \u003c/p\u003e\u003cp\u003eWalaa Fathi, who is eight months pregnant with her third child, said Gazans are \u0026#34;experiencing a catastrophe and a famine that no one could have imagined\u0026#34;. \u003c/p\u003e\u003cp\u003e\u0026#34;I hope that my baby stays in my womb and I don\u0026#39;t have to give birth in these difficult circumstances,\u0026#34; she told the BBC from Deir al-Balah.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-24T17:07:04.894Z",
  "modifiedTime": "2025-07-25T01:06:52.69Z"
}
