{
  "id": "3e583f9c-3c5b-4250-8195-cdb7b2be5eec",
  "title": "HTS leader not only player in Syria's fast-changing future",
  "link": "https://www.bbc.com/news/articles/c0kv582lpnro",
  "description": "Bashar al-Assad's regime is gone, but it remains unclear what Syria's new order will eventually look like, writes Lyse Doucet.",
  "author": "",
  "published": "Sun, 08 Dec 2024 15:04:22 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Lyse Doucet",
  "length": 5924,
  "excerpt": "Bashar al-Assad's regime is gone, but it remains unclear what Syria's new order will eventually look like, writes Lyse Doucet.",
  "siteName": "BBC News",
  "favicon": "https://www.bbc.com/bbcx/apple-touch-icon.png",
  "text": "EPA\"They arrived here worried about the Islamists,\" is how one source described the mood of Arab foreign ministers who flew into Doha on Saturday evening for urgent talks aimed at averting a collapse into chaos and bloodshed in Damascus.Within hours, the powerful Islamist group driving the rebels' rise to power reported they had reached the centre of the Syrian capital.The leader of Hayat Tahrir-al Shams, Abu Mohammad al-Jowlani, triumphantly announced \"the capture of Damascus\". Now he's using his real name, Ahmed al-Sharaa, rather than his nom de guerre as a sign of his sudden rise to a much greater national role.He's certain to play a decisive part in defining Syria's new order after this sudden stunning end to a half century of repressive rule by the Assad family. But the leader of an organisation proscribed by the UN as well as western governments is not the only pivotal player on Syria's fast shifting scene.Live updates: Syrian rebels capture Damascus, saying Assad has fledWatch: BBC reports from inside DamascusWhat just happened in Syria?\"The story is not written yet,\" cautions Marie Forestier, senior Syria advisor for the European Institute of Peace. She, and other informed observers who happened to be attending the annual Doha Forum, point out that it was another rebel group, recently named as the Southern Operations room, working with people living in the city, who surged into the capital. The ranks of this force are dominated by fighters from the former Free Syrian Army (FSA), who worked closely with western powers at the start of Syria's 2011 uprising,\"The game starts now,\" is how Ms Forestier describes the start of this momentous new chapter marked by an explosion of celebration in the streets, but also critical questions about what emerges next.As the Islamist Hayat Tahrir-al Shams (HTS) pushed forward with astonishing speed, facing scant resistance, it sparked a rush by rebel forces in other regions of Syria as well as a surge of armed local groups keen to play a part in their own areas.\"Fighting the Assad regime was the glue that kept this de facto coalition together\", says Thomas Juneau, Middle East expert at the University of Ottawa's Graduate School of Public and International Affairs, who is also in Doha.\"Now that Assad has fled, continued unity among the groups that toppled him will be a challenge,\" he says.The groups include an umbrella alliance of Turkish-backed militias known as the Syrian National Army who, like the HTS, dominated a corner of northwest Syria. In the northeast, the mainly Kurdish Syrian Democratic Forces (SDF) groups have also gained ground and will be determined to hold on to their gains.But HTS's ambitious high-profile leader has seized the spotlight. His rhetoric and record are now under scrutiny by Syrians, as well as in neighbouring capitals, and far beyond. The commander whose militia first emerged as an Al-Qaeda affiliate broke ranks with the jihadist group in 2016 and has been trying to polish his image since then. For years, he's sent conciliatory messages abroad; now he is reassuring Syria's many minority communities they have nothing to worry about.ReutersHTS leader al-Jawlani has been polishing his image since breaking ranks with Al-Qaeda in 2016\"There is a cautious welcome to his messages,\" maintains Ms Forestier. \"But we cannot forget the past eight years of his authoritarian rule and his background.\" The rule of HTS, both a political and paramilitary organisation, in the conservative province of Idlib was marked by the establishment of a working administration called the Salvation Government, which included limited freedom of religion, but was also marked by repressive measures.In Syria's second city of Aleppo, the first urban area seized by HTS in its lightning advance, its fighters have been trying to prove they are fit to rule.The group has also been sending reassuring messages to countries like Iraq that the war would not spill across their borders. Other neighbours, including Jordan, worry that Islamist successes next door could galvanise disgruntled militant groups within their borders. Turkey, certain to play a key role, has its own worries. It regards the SDF as a terrorist group linked to Turkey's proscribed PKK Kurdish group and will not hesitate to intervene militarily and politically, as its done for years, if its own interests are threatened.EPAIn the hours after the regime fell, the mood on Damascus streets was jubilantRussia's foreign minister, Sergei Lavrov, had told the Doha Forum on Saturday that it was \"inadmissible\" that a group he called terrorists, a clear reference to HTS, could take control in Syria.By the evening, the UN's Special Envoy for Syria, Geir Pederson, told me there was a \"new understanding of a new reality.\"Regional foreign ministers, including President Assad's former staunch allies Iran and Russia, left wrong-footed by this spectacular turn of events, are still calling for efforts to forge an inclusive political process. That's echoed by Mr Pedersen.\"This dark chapter has left deep scars, but today we look forward with cautious hope to the opening of a new one—one of peace, reconciliation, dignity, and inclusion for all Syrians\", he said after his meetings here in Doha, where halls packed with senior diplomats, scholars, and officials from the world over are buzzing with the latest news from Syria.Many observers here seem reluctant to draw quick conclusions about what kind of rule will emerge in a country known for its diversity of Christian and Muslim sects. \"I don't want to go down that line of thinking yet,\" said one Western diplomat asked about any concerns regarding a harsh Islamist-dominated order. \"We're just getting started with HTS, who have led a bloodless coup.\"Juneau agrees. \"For now, it is good to simply appreciate the truly historical collapse of one of the most brutal regimes of the past decades,\" he said.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/337b/live/e891f960-b570-11ef-b56a-4bc4425f0200.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/337b/live/e891f960-b570-11ef-b56a-4bc4425f0200.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/337b/live/e891f960-b570-11ef-b56a-4bc4425f0200.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/337b/live/e891f960-b570-11ef-b56a-4bc4425f0200.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/337b/live/e891f960-b570-11ef-b56a-4bc4425f0200.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/337b/live/e891f960-b570-11ef-b56a-4bc4425f0200.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/337b/live/e891f960-b570-11ef-b56a-4bc4425f0200.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/337b/live/e891f960-b570-11ef-b56a-4bc4425f0200.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/337b/live/e891f960-b570-11ef-b56a-4bc4425f0200.jpg.webp\" alt=\"EPA Crowds of people waving flags in Damascus after the fall of the Assad regime in Syria.\"/\u003e\u003cspan\u003eEPA\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u0026#34;They arrived here worried about the Islamists,\u0026#34; is how one source described the mood of Arab foreign ministers who flew into Doha on Saturday evening for urgent talks aimed at averting a collapse into chaos and bloodshed in Damascus.\u003c/p\u003e\u003cp\u003eWithin hours, the powerful Islamist group driving the rebels\u0026#39; rise to power \u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/videos/cdjgder83eeo\"\u003ereported they had reached the centre of the Syrian capital\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe leader of Hayat Tahrir-al Shams, Abu Mohammad al-Jowlani, triumphantly announced \u0026#34;the capture of Damascus\u0026#34;. Now he\u0026#39;s using his real name, Ahmed al-Sharaa, rather than his nom de guerre as a sign of his sudden rise to a much greater national role.\u003c/p\u003e\u003cp\u003eHe\u0026#39;s certain to play a decisive part in defining Syria\u0026#39;s new order after this sudden stunning end to a half century of repressive rule by the Assad family. But the leader of an organisation proscribed by the UN as well as western governments is not the only pivotal player on Syria\u0026#39;s fast shifting scene.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cul\u003e\u003cli\u003e\u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/live/cwy8xzxe0w7t\"\u003eLive updates: Syrian rebels capture Damascus, saying Assad has fled\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/videos/ce8xy02n4mjo\"\u003eWatch: BBC reports from inside Damascus\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/articles/c99x0l1d432o\"\u003eWhat just happened in Syria?\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u0026#34;The story is not written yet,\u0026#34; cautions Marie Forestier, senior Syria advisor for the European Institute of Peace. She, and other informed observers who happened to be attending the annual Doha Forum, point out that it was another rebel group, recently named as the Southern Operations room, working with people living in the city, who surged into the capital. The ranks of this force are dominated by fighters from the former Free Syrian Army (FSA), who worked closely with western powers at the start of Syria\u0026#39;s 2011 uprising,\u003c/p\u003e\u003cp\u003e\u0026#34;The game starts now,\u0026#34; is how Ms Forestier describes the start of this momentous new chapter marked by an explosion of celebration in the streets, but also critical questions about what emerges next.\u003c/p\u003e\u003cp\u003eAs the Islamist \u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/articles/ce313jn453zo\"\u003eHayat Tahrir-al Shams\u003c/a\u003e (HTS) pushed forward with astonishing speed, facing scant resistance, it sparked a rush by rebel forces in other regions of Syria as well as a surge of armed local groups keen to play a part in their own areas.\u003c/p\u003e\u003cp\u003e\u0026#34;Fighting the Assad regime was the glue that kept this de facto coalition together\u0026#34;, says Thomas Juneau, Middle East expert at the University of Ottawa\u0026#39;s Graduate School of Public and International Affairs, who is also in Doha.\u003c/p\u003e\u003cp\u003e\u0026#34;Now that Assad has fled, continued unity among the groups that toppled him will be a challenge,\u0026#34; he says.\u003c/p\u003e\u003cp\u003eThe groups include an umbrella alliance of Turkish-backed militias known as the Syrian National Army who, like the HTS, dominated a corner of northwest Syria. In the northeast, the mainly Kurdish Syrian Democratic Forces (SDF) groups have also gained ground and will be determined to hold on to their gains.\u003c/p\u003e\u003cp\u003eBut HTS\u0026#39;s ambitious high-profile leader has seized the spotlight. His rhetoric and record are now under scrutiny by Syrians, as well as in neighbouring capitals, and far beyond. The commander whose militia first emerged as an Al-Qaeda affiliate broke ranks with the jihadist group in 2016 and has been trying to polish his image since then. For years, he\u0026#39;s sent conciliatory messages abroad; now he is reassuring Syria\u0026#39;s many minority communities they have nothing to worry about.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/e8aa/live/ea9240c0-b571-11ef-b56a-4bc4425f0200.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/e8aa/live/ea9240c0-b571-11ef-b56a-4bc4425f0200.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/e8aa/live/ea9240c0-b571-11ef-b56a-4bc4425f0200.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/e8aa/live/ea9240c0-b571-11ef-b56a-4bc4425f0200.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/e8aa/live/ea9240c0-b571-11ef-b56a-4bc4425f0200.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/e8aa/live/ea9240c0-b571-11ef-b56a-4bc4425f0200.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/e8aa/live/ea9240c0-b571-11ef-b56a-4bc4425f0200.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/e8aa/live/ea9240c0-b571-11ef-b56a-4bc4425f0200.jpg.webp\" alt=\"Reuters Abu Mohammed al-Jawlani looks directly at the camera in this screenshot of a video. He\u0026#39;s dressed in a green military shirt and has a dark beard.\"/\u003e\u003cspan\u003eReuters\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eHTS leader al-Jawlani has been polishing his image since breaking ranks with  Al-Qaeda in 2016\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u0026#34;There is a cautious welcome to his messages,\u0026#34; maintains Ms Forestier. \u0026#34;But we cannot forget the past eight years of his authoritarian rule and his background.\u0026#34; The rule of HTS, both a political and paramilitary organisation, in the conservative province of Idlib was marked by the establishment of a working administration called the Salvation Government, which included limited freedom of religion, but was also marked by repressive measures.\u003c/p\u003e\u003cp\u003eIn Syria\u0026#39;s second city of Aleppo, \u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/articles/cvgreznl929o\"\u003ethe first urban area seized by HTS in its lightning advance\u003c/a\u003e, its fighters have been trying to prove they are fit to rule.\u003c/p\u003e\u003cp\u003eThe group has also been sending reassuring messages to countries like Iraq that the war would not spill across their borders. Other neighbours, including Jordan, worry that Islamist successes next door could galvanise disgruntled militant groups within their borders. Turkey, certain to play a key role, has its own worries. It regards the SDF as a terrorist group linked to Turkey\u0026#39;s proscribed PKK Kurdish group and will not hesitate to intervene militarily and politically, as its done for years, if its own interests are threatened.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/66ca/live/83aa9af0-b572-11ef-b56a-4bc4425f0200.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/66ca/live/83aa9af0-b572-11ef-b56a-4bc4425f0200.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/66ca/live/83aa9af0-b572-11ef-b56a-4bc4425f0200.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/66ca/live/83aa9af0-b572-11ef-b56a-4bc4425f0200.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/66ca/live/83aa9af0-b572-11ef-b56a-4bc4425f0200.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/66ca/live/83aa9af0-b572-11ef-b56a-4bc4425f0200.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/66ca/live/83aa9af0-b572-11ef-b56a-4bc4425f0200.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/66ca/live/83aa9af0-b572-11ef-b56a-4bc4425f0200.jpg.webp\" alt=\"EPA A smiling woman in a blue and white dress looks up to the sky. Behind her two other women cover their smiles with their hands.\"/\u003e\u003cspan\u003eEPA\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eIn the hours after the regime fell, the mood on Damascus streets was jubilant\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eRussia\u0026#39;s foreign minister, Sergei Lavrov, had told the Doha Forum on Saturday that it was \u0026#34;inadmissible\u0026#34; that a group he called terrorists, a clear reference to HTS, could take control in Syria.\u003c/p\u003e\u003cp\u003eBy the evening, the UN\u0026#39;s Special Envoy for Syria, Geir Pederson, told me there was a \u0026#34;new understanding of a new reality.\u0026#34;\u003c/p\u003e\u003cp\u003eRegional foreign ministers, including President Assad\u0026#39;s former staunch allies Iran and Russia, left wrong-footed by this spectacular turn of events, are still calling for efforts to forge an inclusive political process. That\u0026#39;s echoed by Mr Pedersen.\u003c/p\u003e\u003cp\u003e\u0026#34;This dark chapter has left deep scars, but today we look forward with cautious hope to the opening of a new one—one of peace, reconciliation, dignity, and inclusion for all Syrians\u0026#34;, he said after his meetings here in Doha, where halls packed with senior diplomats, scholars, and officials from the world over are buzzing with the latest news from Syria.\u003c/p\u003e\u003cp\u003eMany observers here seem reluctant to draw quick conclusions about what kind of rule will emerge in a country known for its diversity of Christian and Muslim sects. \u003c/p\u003e\u003cp\u003e\u0026#34;I don\u0026#39;t want to go down that line of thinking yet,\u0026#34; said one Western diplomat asked about any concerns regarding a harsh Islamist-dominated order. \u0026#34;We\u0026#39;re just getting started with HTS, who have led a bloodless coup.\u0026#34;\u003c/p\u003e\u003cp\u003eJuneau agrees. \u0026#34;For now, it is good to simply appreciate the truly historical collapse of one of the most brutal regimes of the past decades,\u0026#34; he said.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-12-08T15:04:22.739Z",
  "modifiedTime": null
}
