{
  "id": "3f3d7025-7089-4d9d-a637-1e47575fa42f",
  "title": "Three shot dead as medics, journalists and police attacked at Haiti hospital",
  "link": "https://www.bbc.com/news/articles/cx2vpdnd2jmo",
  "description": "Many others are injured when armed men fire at medical staff, police and reporters in Port-au-Prince.",
  "author": "",
  "published": "Tue, 24 Dec 2024 23:18:35 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Leonardo Rocha",
  "length": 1570,
  "excerpt": "Many others are injured when armed men fire at medical staff, police and reporters in Port-au-Prince.",
  "siteName": "BBC News",
  "favicon": "https://www.bbc.com/bbcx/apple-touch-icon.png",
  "text": "APTNAt least three people have been killed when armed men in Haiti opened fire at medical staff, police and journalists during a briefing to announce the reopening of the country's biggest public hospital.Many others injured were injured in Tuesday's attack in the General Hospital in the capital Port-au-Prince.Pictures posted online appear to show several people injured or dead inside the building. The site had been recaptured by Haiti's government in July, after being occupied and destroyed by violent gangs that control much of the city.Journalists were waiting for the arrival of the health minister when the shooting began.Reports say two journalists and a police officer were shot dead.In a video statement, the head of Haiti's presidential transitional council, Leslie Voltaire, said: \"We express our sympathy to all the victims' families, in particularly to the Haiti National Police and all the journalists' associations. \"We guarantee them that this act will not remain without consequences.\"The people of Haiti continue to suffer with unbearable levels of gang violence, despite the installation of a new transition government in April and the deployment of an international force led by Kenyan police officers six months ago.Haiti has been engulfed in a wave of gang violence since the assassination in 2021 of the then-president, Jovenel Moïse. An estimated 85% of Port-au-Prince is still under gang control. The UN says that as many as 5,000 people have been killed in violence in Haiti this year along, and the country is now on the verge of collapse.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dc51/live/96a45d10-c249-11ef-a2ca-e99d0c9a24e3.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main-content\"\u003e\u003carticle\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/dc51/live/96a45d10-c249-11ef-a2ca-e99d0c9a24e3.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/dc51/live/96a45d10-c249-11ef-a2ca-e99d0c9a24e3.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/dc51/live/96a45d10-c249-11ef-a2ca-e99d0c9a24e3.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/dc51/live/96a45d10-c249-11ef-a2ca-e99d0c9a24e3.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/dc51/live/96a45d10-c249-11ef-a2ca-e99d0c9a24e3.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/dc51/live/96a45d10-c249-11ef-a2ca-e99d0c9a24e3.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/dc51/live/96a45d10-c249-11ef-a2ca-e99d0c9a24e3.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/dc51/live/96a45d10-c249-11ef-a2ca-e99d0c9a24e3.jpg.webp\" alt=\"APTN A hospital sign, with visiting hours displayed underneath. \"/\u003e\u003cspan\u003eAPTN\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAt least three people have been killed when armed men in Haiti opened fire at medical staff, police and journalists during a briefing to announce the reopening of the country\u0026#39;s biggest public hospital.\u003c/p\u003e\u003cp\u003eMany others injured were injured in Tuesday\u0026#39;s attack in the General Hospital in the capital Port-au-Prince.\u003c/p\u003e\u003cp\u003ePictures posted online appear to show several people injured or dead inside the building. \u003c/p\u003e\u003cp\u003eThe site had been recaptured by Haiti\u0026#39;s government in July, after being occupied and destroyed by violent gangs that control much of the city.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eJournalists were waiting for the arrival of the health minister when the shooting began.\u003c/p\u003e\u003cp\u003eReports say two journalists and a police officer were shot dead.\u003c/p\u003e\u003cp\u003eIn a video statement, the head of Haiti\u0026#39;s presidential transitional council, Leslie Voltaire, said: \u0026#34;We express our sympathy to all the victims\u0026#39; families, in particularly to the Haiti National Police and all the journalists\u0026#39; associations. \u003c/p\u003e\u003cp\u003e\u0026#34;We guarantee them that this act will not remain without consequences.\u0026#34;\u003c/p\u003e\u003cp\u003eThe people of Haiti continue to suffer with unbearable levels of gang violence, despite the installation of a new transition government in April and the deployment of an international force led by Kenyan police officers six months ago.\u003c/p\u003e\u003cp\u003eHaiti has been engulfed in a wave of gang violence since the assassination in 2021 of the then-president, Jovenel Moïse. \u003c/p\u003e\u003cp\u003eAn estimated 85% of Port-au-Prince is still under gang control. \u003c/p\u003e\u003cp\u003eThe UN says that as many as 5,000 people have been killed in violence in Haiti this year along, and the country is now on the verge of collapse.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-12-24T22:55:21.138Z",
  "modifiedTime": null
}
