{
  "id": "3f7f8689-77b8-49b5-a8cc-8d86d14f70e7",
  "title": "Trump Vows To Impose 25% Tariff On Imports From Canada, 10% Tariffs On China",
  "link": "https://www.ndtv.com/world-news/donald-trump-vows-to-impose-25-tariff-on-all-imports-from-mexico-canada-7106212",
  "description": "Donald Trump vowed Monday to impose a 25 percent tariff on all imports from Mexico and Canada as one of his first actions upon becoming US president in January.",
  "author": "",
  "published": "Tue, 26 Nov 2024 06:01:13 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "Agence France-Presse",
  "length": 1661,
  "excerpt": "Donald Trump vowed Monday to impose a 25 percent tariff on all imports from Mexico and Canada as one of his first actions upon becoming US president in January.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Washington: US President-elect Donald Trump said Monday he intends to impose a 25 percent tariff on goods from Mexico and Canada, along with a 10 percent tariff on imports from China in response to the illegal drug trade and immigration.In a series of posts to his Truth Social social media account, Trump vowed to hit some of the United States' largest trading partners with sweeping tariffs on all goods entering the country. \"On January 20th, as one of my many first Executive Orders, I will sign all necessary documents to charge Mexico and Canada a 25% tariff on ALL products coming into the United States, and its ridiculous Open Borders,\" he wrote. In another post moments later, the past and future president said he would also be slapping China with a 10 percent tariff, \"above any additional Tariffs,\" on all of its products entering the US in response to its failure to tackle fentanyl smuggling.  Tariffs are a key part of Trump's economic agenda, with the Republican president-elect vowing wide-ranging duties on allies and adversaries alike while he was on the campaign trail ahead of his November 5 victory.Many economists have warned that tariffs would hurt growth and push up inflation, since they are primarily paid by importers bringing the goods into the US, who often pass those costs on to consumers.But those in Trump's inner circle have insisted that the tariffs are a useful bargaining chip for the US to use to push its trading partners to agree to more favorable terms, and to bring back manufacturing jobs from overseas. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
  "image": "https://c.ndtvimg.com/2024-11/3b2qqm0o_donald-trump-reuters_625x300_19_November_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                \u003cp\u003e\u003cb\u003eWashington: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eUS President-elect Donald Trump said Monday he intends to impose a 25 percent tariff on goods from Mexico and Canada, along with a 10 percent tariff on imports from China in response to the illegal drug trade and immigration.\u003c/p\u003e\u003cp\u003eIn a series of posts to his Truth Social social media account, Trump vowed to hit some of the United States\u0026#39; largest trading partners with sweeping tariffs on all goods entering the country. \u003c/p\u003e\u003cp\u003e\u0026#34;On January 20th, as one of my many first Executive Orders, I will sign all necessary documents to charge Mexico and Canada a 25% tariff on ALL products coming into the United States, and its ridiculous Open Borders,\u0026#34; he wrote. \u003c/p\u003e\u003cp\u003eIn another post moments later, the past and future president said he would also be slapping China with a 10 percent tariff, \u0026#34;above any additional Tariffs,\u0026#34; on all of its products entering the US in response to its failure to tackle fentanyl smuggling.  \u003c/p\u003e\u003cp\u003eTariffs are a key part of Trump\u0026#39;s economic agenda, with the Republican president-elect vowing wide-ranging duties on allies and adversaries alike while he was on the campaign trail ahead of his November 5 victory.\u003c/p\u003e\u003cp\u003eMany economists have warned that tariffs would hurt growth and push up inflation, since they are primarily paid by importers bringing the goods into the US, who often pass those costs on to consumers.\u003c/p\u003e\u003cp\u003eBut those in Trump\u0026#39;s inner circle have insisted that the tariffs are a useful bargaining chip for the US to use to push its trading partners to agree to more favorable terms, and to bring back manufacturing jobs from overseas. \u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                        \n                                        \n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-11-26T06:01:13+05:30",
  "modifiedTime": null
}
