{
  "id": "49ac29cb-478d-4c36-bfc1-9ec0b9dccc3d",
  "title": "\"Champion Of India-Israel Friendship\": Netanyahu Condoles Ratan Tata's Death",
  "link": "https://www.ndtv.com/world-news/champion-of-india-israel-friendship-israeli-pm-benjamin-netanyahu-condoles-ratan-tatas-death-6776238",
  "description": "Prime Minister of Israel Benjamin Netanyahu wrote to Narendra Modi today condoling the death of industrialist and global icon Ratan Tata. He said many people in his country are mourning Mr Tata's death.",
  "author": "",
  "published": "Sun, 13 Oct 2024 00:43:10 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "Abhishek Chakraborty",
  "length": 4281,
  "excerpt": "Prime Minister of Israel Benjamin Netanyahu wrote to Narendra Modi today condoling the death of industrialist and global icon Ratan Tata. He said many people in his country are mourning Mr Tata\u0026#039;s death.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "New Delhi: Prime Minister of Israel Benjamin Netanyahu wrote to Narendra Modi today condoling the death of industrialist and global icon Ratan Tata. He said many people in his country are mourning Mr Tata's death.Ratan Tata died on October 9 at Mumbai's Breach Candy Hospital, where he was admitted for a routine health check due to his age.With words of appreciation for Mr Tata's contribution in bridging India-Israel ties, Mr Netanyahu wrote, \"I and many in Israel mourn the loss of Ratan Naval Tata, a proud son of India and a champion of the friendship between our two countries.\"He also asked the prime minister to \"convey my condolences to Ratan's family.\"To my friend, Prime Minister @narendramodi.I and many in Israel mourn the loss of Ratan Naval Tata, a proud son of India and a champion of the friendship between our two countries. 🇮🇱🇮🇳Please convey my condolences to Ratan's family.In sympathy,Benjamin Netanyahu— Prime Minister of Israel (@IsraeliPM) October 12, 2024Mr Netanyahu joined several world leaders in paying a tribute to Mr Tata, who was one of the most respected industrial titans in India. He is credited for his philanthropic work and for expanding the Tata Group to more than 100 countries.\"India and the world have lost a giant with a giant heart,\" said Eric Garcetti, US Ambassador to India, in his condolence message. He went on to say \"When I was nominated to serve as ambassador, the first congratulations from India came from Ratan Tata.\"Mr Garcetti also mentioned how Mr Tata \"gave so much in service to my hometown, serving on the board of the University of Southern California. He saw a future of greater prosperity and equality for his country and did so much for our world,\" adding that \"May his memory be a blessing.\"Remembering Ratan Tata's \"visionary contribution\", French President Emmanuel Macron said, \"France has lost a dear friend from India. Ratan Tata's visionary helmsmanship contributed to boosting industries in Indiaand France, in the fields of innovation and manufacturing. Beyond this, his legacy will be marked by his humanist vision, immense philanthropic achievements and his humility.\"\"I convey my deepest condolences to his near and dear ones as well as to the people of India. We will remember your lifelong commitment to the betterment of society with admiration and respect,\" President Macron said in post on Facebook.Several prominent business leaders also sent their tributes, with Google CEO Sundar Pichai and Microsoft founder Bill Gates being among the first to do so.Mr Pichai recalled his last meeting with Mr Tata, saying \"My last meeting with Ratan Tata at Google, we talked about the progress of Waymo and his vision was inspiring to hear. He leaves an extraordinary business and philanthropic legacy and was instrumental in mentoring and developing the modern business leadership in India.\"He also said that Mr Tata \"deeply cared about making India better. Deep condolences to his loved ones and Rest in Peace Shri Ratan Tata Ji\".Bill Gates too expressed his condolences on the death of Ratan Tata, a \"visionary leader whose dedication to improving lives left an indelible mark on India - and the world\".In a LinkedIn Post, Bill Gates recalled meeting Mr Tata on multiple occasions and expressed his admiration for the business tycoon's commitment to improving lives. \"I was always moved by his strong sense of purpose and service to humanity,\" Mr Gates wrote in his post. He also recalled collaborating with Mr Tata on several initiatives and said that his legacy will inspire generations.\"Ratan Tata was a visionary leader whose dedication to improving lives left an indelible mark on India-and the world. I had the privilege of meeting him on several occasions, and I was always moved by his strong sense of purpose and service to humanity,\" Mr Gates wrote.\"Together, we partnered on numerous initiatives to help people lead healthier, more prosperous lives. His loss will be felt around the world for years to come, but I know the legacy he left and example he set will continue to inspire generations,\" he added.Mr Tata's death has drawn an outpouring of grief and tributes from across the world. Prime Minister Narendra Modi remembered Mr Tata as a visionary business leader and a compassionate soul.",
  "image": "https://c.ndtvimg.com/2024-10/d39lsmd8_ratan-tata_625x300_11_October_24.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                \u003cp\u003e\u003cb\u003eNew Delhi: \u003c/b\u003e\u003c/p\u003e\u003cp\u003ePrime Minister of Israel Benjamin Netanyahu wrote to Narendra Modi today condoling the death of industrialist and global icon Ratan Tata. He said many people in his country are mourning Mr Tata\u0026#39;s death.\u003c/p\u003e\u003cp\u003eRatan Tata died on October 9 at Mumbai\u0026#39;s Breach Candy Hospital, where he was admitted for a routine health check due to his age.\u003c/p\u003e\u003cp\u003eWith words of appreciation for Mr Tata\u0026#39;s contribution in bridging India-Israel ties, Mr Netanyahu wrote, \u0026#34;I and many in Israel mourn the loss of Ratan Naval Tata, a proud son of India and a champion of the friendship between our two countries.\u0026#34;\u003c/p\u003e\u003cp\u003eHe also asked the prime minister to \u0026#34;convey my condolences to Ratan\u0026#39;s family.\u0026#34;\u003c/p\u003e\u003cblockquote\u003e\u003cdiv dir=\"ltr\" lang=\"en\"\u003e\u003cp\u003eTo my friend, Prime Minister \u003ca href=\"https://twitter.com/narendramodi?ref_src=twsrc%5Etfw\"\u003e@narendramodi\u003c/a\u003e.\u003cbr/\u003eI and many in Israel mourn the loss of Ratan Naval Tata, a proud son of India and a champion of the friendship between our two countries. 🇮🇱🇮🇳\u003c/p\u003e\u003cp\u003ePlease convey my condolences to Ratan\u0026#39;s family.\u003c/p\u003e\u003cp\u003eIn sympathy,\u003cbr/\u003eBenjamin Netanyahu\u003c/p\u003e\u003c/div\u003e— Prime Minister of Israel (@IsraeliPM) \u003ca href=\"https://twitter.com/IsraeliPM/status/1845157094384660628?ref_src=twsrc%5Etfw\"\u003eOctober 12, 2024\u003c/a\u003e\u003c/blockquote\u003e\u003cp\u003eMr Netanyahu joined several world leaders in paying a tribute to Mr Tata, who was one of the most respected industrial titans in India. He is credited for his \u003cspan jsslot=\"\"\u003e\u003cspan\u003ephilanthropic \u003c/span\u003e\u003c/span\u003ework and for expanding the Tata Group to more than 100 countries.\u003c/p\u003e\u003cp\u003e\u0026#34;India and the world have lost a giant with a giant heart,\u0026#34; said Eric Garcetti, US Ambassador to India, in his condolence message. He went on to say \u0026#34;When I was nominated to serve as ambassador, the first congratulations from India came from Ratan Tata.\u0026#34;\u003c/p\u003e\u003cp\u003eMr Garcetti also mentioned how Mr Tata \u0026#34;gave so much in service to my hometown, serving on the board of the University of Southern California. He saw a future of greater prosperity and equality for his country and did so much for our world,\u0026#34; adding that \u0026#34;May his memory be a blessing.\u0026#34;\u003c/p\u003e\u003cp\u003eRemembering Ratan Tata\u0026#39;s \u0026#34;visionary contribution\u0026#34;, French President Emmanuel Macron said, \u0026#34;France has lost a dear friend from India. Ratan Tata\u0026#39;s visionary helmsmanship contributed to boosting industries in Indiaand France, in the fields of innovation and manufacturing. Beyond this, his legacy will be marked by his humanist vision, immense philanthropic achievements and his humility.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;I convey my deepest condolences to his near and dear ones as well as to the people of India. We will remember your lifelong commitment to the betterment of society with admiration and respect,\u0026#34; President Macron said in post on Facebook.\u003c/p\u003e\u003cp\u003eSeveral prominent business leaders also sent their tributes, with Google CEO Sundar Pichai and Microsoft founder Bill Gates being among the first to do so.\u003c/p\u003e\u003cp\u003eMr Pichai recalled his last meeting with Mr Tata, saying \u0026#34;My last meeting with Ratan Tata at Google, we talked about the progress of Waymo and his vision was inspiring to hear. He leaves an extraordinary business and philanthropic legacy and was instrumental in mentoring and developing the modern business leadership in India.\u0026#34;\u003c/p\u003e\u003cp\u003eHe also said that Mr Tata \u0026#34;deeply cared about making India better. Deep condolences to his loved ones and Rest in Peace Shri Ratan Tata Ji\u0026#34;.\u003c/p\u003e\u003cp\u003eBill Gates too expressed his condolences on the death of Ratan Tata, a \u0026#34;visionary leader whose dedication to improving lives left an indelible mark on India - and the world\u0026#34;.\u003c/p\u003e\u003cp\u003eIn a LinkedIn Post, Bill Gates recalled meeting Mr Tata on multiple occasions and expressed his admiration for the business tycoon\u0026#39;s commitment to improving lives. \u0026#34;I was always moved by his strong sense of purpose and service to humanity,\u0026#34; Mr Gates wrote in his post. He also recalled collaborating with Mr Tata on several initiatives and said that his legacy will inspire generations.\u003c/p\u003e\u003cp\u003e\u0026#34;Ratan Tata was a visionary leader whose dedication to improving lives left an indelible mark on India-and the world. I had the privilege of meeting him on several occasions, and I was always moved by his strong sense of purpose and service to humanity,\u0026#34; Mr Gates wrote.\u003c/p\u003e\u003cp\u003e\u0026#34;Together, we partnered on numerous initiatives to help people lead healthier, more prosperous lives. His loss will be felt around the world for years to come, but I know the legacy he left and example he set will continue to inspire generations,\u0026#34; he added.\u003c/p\u003e\u003cp\u003eMr Tata\u0026#39;s death has drawn an outpouring of grief and tributes from across the world. Prime Minister Narendra Modi remembered Mr Tata as a visionary business leader and a compassionate soul.\u003cbr/\u003e \u003c/p\u003e                                        \n                                        \n                                                                                \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-10-13T00:43:10+05:30",
  "modifiedTime": null
}
