{
  "id": "4f82531a-8804-426e-a9c0-8b81183485f7",
  "title": "Israeli strike hit four areas in notorious Tehran prison. Civilians among the dead.",
  "link": "https://www.washingtonpost.com/investigations/2025/07/06/israel-iran-evin-prison-attack/",
  "description": "A Post review of satellite imagery and videos revealed damage that pointed to multiple strikes, with structures nearly 2,000 feet apart in ruins.",
  "author": "Nilo Tabrizy, Imogen Piper, Cate Brown, Yeganeh Torbati, Jonathan Baran",
  "published": "Sun, 06 Jul 2025 12:30:58 +0000",
  "source": "http://feeds.washingtonpost.com/rss/world",
  "categories": null,
  "byline": "Nilo Tabrizy, Imogen Piper, Cate Brown, Yeganeh Torbati, Jonathan Baran",
  "length": 8886,
  "excerpt": "A Post review of satellite imagery and videos revealed damage that pointed to multiple strikes, with structures nearly 2,000 feet apart in ruins.",
  "siteName": "The Washington Post",
  "favicon": "https://www.washingtonpost.com/touch-icon-iphone-retina.png",
  "text": "The Israeli strike hit just before noon, a series of blasts that shook Tehran’s Evin Prison, a sprawling complex that holds thousands of prisoners and has been a symbol of the Iranian regime’s repression for more than four decades.A former prisoner who happened to be near the complex June 23 when the rockets fell said he ran toward the explosions. As an inmate, he dreamed that he might one day see the prison gates come crashing down, but what he found that day was nightmarish, he told The Washington Post.“Everything was rubble,” said the man, who like others interviewed for this article spoke on the condition of anonymity for fear of reprisals from authorities. “It was really like complete chaos and apocalypse.”After the strike, a spokesman for the Israel Defense Forces, Brig. Gen. Effie Defrin, said the prison complex was used for “intelligence operations against the State of Israel, including counterespionage” and the strike was “carried out in a precise manner to mitigate harm to civilians imprisoned within the prison to the greatest extent possible.” The operation in Evin was conducted one day before a ceasefire ended the 12-day conflict between the two nations.A Post review of satellite imagery and videos shared to social media revealed damage in four areas of the complex, with structures nearly 2,000 feet apart in ruins. Among the damaged locations were an administrative building, a visitation area for families, a medical center and a solitary confinement cell block, according to two former inmates who examined the images at The Post’s request.Iranian officials have said at least 71 people were killed. According to online death notices and internal prison records examined by The Post, along with interviews, the dead included 43 prison staff members and two conscripted soldiers who were stationed there. At least four other civilians who did not work at the prison were killed, two of them children, The Post found.Multiple high-ranking prison officials were among the dead, death notices show, including Ali Ghanaatkar, the top prosecutor at Evin. Ghanaatkar’s prosecutions of dissidents have drawn criticism from human rights groups.For more than 40 years, Evin Prison, which sits at the foot of the Alborz Mountains in an upscale residential area, has been one of the most visible symbols of the Islamic republic’s authoritarian rule. It is the Iranian security apparatus’s primary site for incarcerating dissidents, foreign journalists, academics and diplomats. Many of those inmates have been tortured and abused. Thousands of people are imprisoned within its walls, including at one point Nobel laureate Narges Mohammadi and Post journalist Jason Rezaian, who was held there for almost a year and a half.Military strikes on prisons can raise humanitarian and legal concerns, in part because of the vulnerability of inmates. The Washington-based organization Human Rights Activists in Iran said two prisoners were killed, which The Post could not independently confirm. Iranian officials have said that an unspecified number of prisoners were killed.The Post’s analysis of high-resolution imagery taken by Maxar Technologies on Monday identified at least 17 damaged or destroyed buildings across the prison grounds. The scattered locations probably indicate multiple strikes, experts in satellite imagery analysis said. The IDF declined to comment on The Post’s findings or answer questions about its intended targets.“Based on the locations [of the damage], it appears there must have been at least four separate munitions, as nothing that was hit would seem volatile enough to cause damage to spread elsewhere,” said Sean O’Connor, an imagery analyst at the defense intelligence firm Janes.William Goodhind, a geospatial analyst at Contested Ground, a research project that uses satellite imagery to track armed conflict, said the images indicate at least six strikes. Based on the damage locations, he said the strike appeared aimed at two outcomes: to target access points, such as the gates on the north and south sides of the complex, and to kill prison staff members who would have been in the central buildings. He noted that it looked as though a “lower yield munition was used [rather] than larger-scale airstrikes, where the intent is to level the building.”More than 60 acres of vegetation surrounding the prison were scorched in fires in the aftermath of the attack, the satellite images show. Some of the structural damage may been inflicted by the fires.In the center of the prison, a building that contains administrative offices was destroyed and a medical center was heavily damaged, the images show. Videos posted to social media, including ones shared by the Iranian government, show burned-out cars and tangled metal. An exterior wall on the medical center is blackened and bars on its windows are crumpled. Inside, medical equipment and beds are covered in shattered glass.Video released by Iran's Prisons Organization shows damage to the medical center at Evin Prison in Tehran. (Video: Prisons Organization of Iran)A doctor who worked at the medical center was also killed, as well as a prison social worker and her 5-year-old son, according to death notices reviewed by The Post.The attack appears to have also damaged another building across a courtyard from the medical center, which two former prisoners said was the solitary confinement block of Ward 209. The ward is run by the Ministry of Intelligence and often houses political and high-value detainees who are typically blindfolded while they are moved through the facility.One inmate who spoke to a friend by phone said he saw blindfolded prisoners walking around immediately after the strike with no guards in sight, the friend told The Post.Satellite images and videos show extensive damage to the visitor gate at the northern edge of the complex, where, according to the former prisoners and a family member of a detainee, Iranians come to visit detained relatives. The attack happened during established visiting hours, they said.A man who said he arrived at the gate shortly after the explosions described seeing burned cars and prisoners attempting to escape while guards shot at their feet.“I saw many dead bodies lying on the ground,” he said. “No one had come yet to cover them or to confirm if they were dead.”The man said he carried the bodies of five people who appeared to be dead and pulled others out of the rubble. The image that stays with him, he said, was one of a father and a daughter who had brought a document for the release of a family member.“For about two hours, her father was trying CPR,” he said. “Nothing happened, and she died.”The strike near the visitor gate shattered the windows of apartment buildings nearby and killed 61-year-old Mehrangiz Imanpour as she walked in the area, a family member said.The apartment building’s CCTV showed that Imanpour left her home around 11 a.m., less than one hour before the strike on the prison. She had gone to pay someone who had done work in her home, her family said. Two days later, authorities told the family her body had been found in a street near the visitor gate.Video from near Imanpour’s apartment shortly after the strike shows the street covered in earth and dust, and damaged vehicles lining the road. In the distance, the visitor gate is destroyed. A building facade is shattered.Videos from witnesses and officials catalogue the damage to Evin Prison in Tehran. (Video: Mamlekate/Prisons Organization of Iran)Imanpour’s family member said she was kind and self-made, a gifted artist and painter. “If you were to describe her, there aren’t enough positive things to say about Mehrangiz,” the person said.Large swaths of Evin are not functional, and family members of two prisoners told The Post that some inmates have been moved to facilities where crowding is rampant and conditions are grim.“They locked everyone up in a large hall that can hold a maximum of 30 or 40 people, but now they are keeping more than 120 people there,” said a family member of a male prisoner who was relocated to the Greater Tehran Penitentiary.Women prisoners remained in Evin the night of the strike before being moved to Qarchak Prison, according to a former Evin prisoner who has spoken with women detainees and a report by Human Rights Activists in Iran.“[Women prisoners] cleaned the place themselves. There were guards everywhere, pointing guns at their heads, and no water, no gas, no telephone access,” the person said. “Families were very worried.”Qarchak has been denounced by human rights organizations for its pest infestation, contaminated water and lack of basic social services.“In this situation, [prisoners] are the most vulnerable,” the former prisoner who ran toward the entrance said. “Who knows what is going to happen next.”Mikhail Klimentov contributed to this report.",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ANPMNYTVNFCRRH5S7ZAYVK2YW4.png\u0026w=1440",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp data-apitype=\"text\" data-contentid=\"PLESZBGZQFA53B47PLLQAFFKQU\" data-el=\"text\" dir=\"null\"\u003eThe Israeli strike hit just before noon, a series of blasts that shook Tehran’s Evin Prison, a sprawling complex that holds thousands of prisoners and has been a symbol of the Iranian regime’s repression for more than four decades.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"FU2C5DOETBG2TMO2AU4EHVZH2U\" data-el=\"text\" dir=\"null\"\u003eA former prisoner who happened to be near the complex\u003cb\u003e \u003c/b\u003eJune 23 when the rockets fell said he ran toward the explosions. As an inmate, he dreamed that he might one day see the prison gates come crashing down, but what he found that day was nightmarish, he told The Washington Post.\u003c/p\u003e\u003c/div\u003e\u003cp data-apitype=\"text\" data-contentid=\"PSD26QQOQZBNNKT6KSKFG7DL5U\" data-el=\"text\" dir=\"null\"\u003e“Everything was rubble,” said the man,\u003cb\u003e \u003c/b\u003ewho like others interviewed for this article spoke on the condition of anonymity for fear of reprisals from authorities.\u003cb\u003e \u003c/b\u003e“It was really like complete chaos and apocalypse.”\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"C5YH6FTF5FBGZG3HLSCUEHG3IA\" data-el=\"text\" dir=\"null\"\u003eAfter the strike, a spokesman for the Israel Defense Forces, Brig. Gen. Effie Defrin, said the prison complex was used for “intelligence operations against the State of Israel, including counterespionage” and the strike was “carried out in a precise manner to mitigate harm to civilians imprisoned within the prison to the greatest extent possible.” The operation in Evin was conducted one day before a ceasefire ended the 12-day conflict between the two nations.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"HIUP2LYCENCUVDJMT6R2ZOMS7M\" data-el=\"text\" dir=\"null\"\u003eA Post review of satellite imagery and videos shared to social media revealed damage in four areas of the complex, with structures nearly 2,000 feet apart in ruins. Among the damaged locations were an administrative building, a visitation area for families, a medical center and a solitary confinement cell block, according to two former inmates who examined the images at The Post’s request.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"YDBGTDI55ZFJBEDDQWH62GYPIE\" data-el=\"text\" dir=\"null\"\u003eIranian officials have \u003ca href=\"https://t.me/iribnews/285535\" target=\"_blank\"\u003esaid \u003c/a\u003eat least 71 people were killed. According to online death notices and internal prison records examined by The Post, along with interviews, the dead included 43 prison staff members and two conscripted soldiers who were stationed there. At least four other civilians who did not work at the prison were killed, two of them children, The Post found.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"KUT4DN3W55AULDIEQSHGJAIMEM\" data-el=\"text\" dir=\"null\"\u003eMultiple high-ranking prison officials were among the dead,\u003cb\u003e \u003c/b\u003edeath notices show, including Ali Ghanaatkar, the top prosecutor at Evin. Ghanaatkar’s prosecutions of dissidents have drawn criticism from human rights groups.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"D52SWKNESFBEJOJI3PXGYTQPRQ\" data-el=\"text\" dir=\"null\"\u003eFor more than 40 years, Evin Prison, which sits at the foot of the Alborz Mountains in an upscale residential area, has been one of the most visible symbols of the Islamic republic’s authoritarian rule. It is the Iranian security apparatus’s primary site\u003cb\u003e \u003c/b\u003efor incarcerating dissidents, foreign journalists, academics and diplomats. Many of those inmates have been \u003ca href=\"https://www.washingtonpost.com/opinions/2021/08/25/iran-evin-prison-leaked-footage-jason-rezaian/\" target=\"_blank\"\u003etortured and abused\u003c/a\u003e. Thousands of people are imprisoned within its walls, including at one point Nobel laureate Narges Mohammadi and Post journalist \u003ca href=\"https://www.washingtonpost.com/world/their-job-is-to-scare-me-jason-rezaian-describes-first-terrifying-hours-inside-iranian-prison/2019/01/11/e536fff6-0fa2-11e9-8f0c-6f878a26288a_story.html\" target=\"_blank\"\u003eJason Rezaian\u003c/a\u003e, who was held there for almost a year and a half.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"2HNLQTXIKRFTDPRRMT5RILYAP4\" data-el=\"text\" dir=\"null\"\u003eMilitary strikes on prisons can raise humanitarian and legal concerns, in part because of the vulnerability of inmates. The Washington-based organization Human Rights Activists in Iran said two prisoners were killed, which The Post could not independently confirm. Iranian officials have said that an unspecified number of prisoners were killed.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"DI4GJUORLBEFNAS7SCDRCVA7LA\" data-el=\"text\" dir=\"null\"\u003eThe Post’s analysis of high-resolution imagery taken by Maxar Technologies on Monday identified at least 17 damaged or destroyed buildings across the prison grounds. The scattered locations probably indicate multiple strikes, experts in satellite imagery analysis said. The IDF declined to comment on The Post’s findings or answer questions about its intended targets.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"IMLKATUTFFCNPOKUXVOOJHGEY4\" data-el=\"text\" dir=\"null\"\u003e“Based on the locations [of the damage], it appears there must have been at least four separate munitions, as nothing that was hit would seem volatile enough to cause damage to spread elsewhere,” said Sean O’Connor, an imagery analyst at the defense intelligence firm Janes.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"XQ23WSLXLRFWXBXWDPALGPJKVQ\" data-el=\"text\" dir=\"null\"\u003eWilliam Goodhind, a geospatial analyst at Contested Ground, a research project that uses satellite imagery to track armed conflict,\u003cb\u003e \u003c/b\u003esaid the images indicate at least six strikes. Based on the damage locations, he said the strike appeared aimed at two outcomes: to target access points, such as the gates on the north and south sides of the complex, and to kill prison staff members who would have been in the central buildings. He noted that it looked as though a “lower yield munition was used [rather] than larger-scale airstrikes, where the intent is to level the building.”\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"P653RXCTR5GVVATZ7Y565NGXZU\" data-el=\"text\" dir=\"null\"\u003eMore than 60 acres of vegetation surrounding the prison were scorched in fires in the aftermath of the attack, the satellite images show. Some of the structural damage may been inflicted by the fires.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"FDWH623S3ZCL7EVYIFOGUZJOAE\" data-el=\"text\" dir=\"null\"\u003eIn the center of the prison, a building that contains administrative offices was destroyed and a medical center was heavily damaged, the images show. Videos posted to social media, including ones shared by the Iranian government, show burned-out cars and tangled metal. An exterior wall on the medical center is blackened and bars on its windows are crumpled. Inside, medical equipment and beds are covered in shattered glass.\u003c/p\u003e\u003cdiv data-qa=\"article-body\" data-testid=\"article-video\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cp\u003eVideo released by Iran\u0026#39;s Prisons Organization shows damage to the medical center at Evin Prison in Tehran. (Video: Prisons Organization of Iran)\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp data-apitype=\"text\" data-contentid=\"5YIHGU6UFFDOJLICBXFLKM5FFY\" data-el=\"text\" dir=\"null\"\u003eA doctor who worked at the medical center was also killed, as well as a prison social worker and her 5-year-old son, according to death notices reviewed by The Post.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"5X6WV5N5TZF4JE7NSGAPFD6MZE\" data-el=\"text\" dir=\"null\"\u003eThe attack appears to have also damaged another building across a courtyard from the medical center, which two former prisoners said was the solitary confinement block of Ward 209. The ward is run by the Ministry of Intelligence and often houses political and high-value detainees who are typically blindfolded while they are moved through the facility.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"2XEDZRZA7BH5VOZKLWMV4DGQGQ\" data-el=\"text\" dir=\"null\"\u003eOne inmate who spoke to a friend by phone said he saw blindfolded prisoners walking around immediately after the strike with no guards in sight, the friend told The Post.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"LYJZJKZFUZCOVPES4HDYJBAWQ4\" data-el=\"text\" dir=\"null\"\u003eSatellite images and videos show extensive damage to the visitor gate at the northern edge of the complex, where, according to the former prisoners and a family member of a detainee, Iranians come to visit detained relatives. The attack happened during established visiting hours, they said.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"OQ4IWOY6ZZEBFHQA47EWPZYJHM\" data-el=\"text\" dir=\"null\"\u003eA man who said he arrived at the gate shortly after the explosions described seeing burned cars and prisoners attempting to escape while guards shot at their feet.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"5WLRD3KH3JC2LLRXRI27RHQRW4\" data-el=\"text\" dir=\"null\"\u003e“I saw many dead bodies lying on the ground,” he said. “No one had come yet to cover them or to confirm if they were dead.”\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"MWFYYMHSL5EN5JNVQSUSPGH3EI\" data-el=\"text\" dir=\"null\"\u003eThe man said he carried the bodies of five people who appeared to be dead and pulled\u003cb\u003e \u003c/b\u003eothers out of the rubble. The image that stays with him, he said, was one of a father and a daughter who had brought a document for the release of a family member.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"AEDSQ3SGPVA3XDF7SAQ5ILWRAY\" data-el=\"text\" dir=\"null\"\u003e“For about two hours, her father was trying CPR,” he said. “Nothing happened, and she died.”\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"JD7IQPMLIVHU7AI4CGBII2QVLM\" data-el=\"text\" dir=\"null\"\u003eThe strike near the visitor gate shattered the windows of apartment buildings nearby and killed 61-year-old Mehrangiz Imanpour as she walked in the area, a family member said.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"PK2I4ZX5F5GE7JYGQEIUMX3L54\" data-el=\"text\" dir=\"null\"\u003eThe apartment building’s CCTV showed that Imanpour left her home around 11 a.m., less than one hour before the strike on the prison. She had gone to pay someone who had done work in her home, her\u003cb\u003e \u003c/b\u003efamily said. Two days later, authorities told the family her body had been found in a street near the visitor gate.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"M2YVAZLUIBFVTE3WJL2QIFZPOI\" data-el=\"text\" dir=\"null\"\u003eVideo from near Imanpour’s apartment shortly after the strike shows the street covered in earth and dust, and damaged vehicles lining the road. In the distance, the visitor gate is destroyed. A building facade is shattered.\u003c/p\u003e\u003cdiv data-qa=\"article-body\" data-testid=\"article-video\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cp\u003eVideos from witnesses and officials catalogue the damage to Evin Prison in Tehran. (Video: Mamlekate/Prisons Organization of Iran)\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp data-apitype=\"text\" data-contentid=\"CPCPANMMABHTVPUHFMKJ7LG2YM\" data-el=\"text\" dir=\"null\"\u003eImanpour’s family member said she was kind and self-made, a gifted artist and painter. “If you were to describe her, there aren’t enough positive things to say about Mehrangiz,” the person said.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"2YJMQ7FZ3VBGFKTTBJTH2EYWAQ\" data-el=\"text\" dir=\"null\"\u003eLarge swaths of Evin are not functional, and family members of two prisoners told The Post that some inmates have been moved to facilities where crowding is rampant and conditions are grim.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"RGFZAMDJONAW3P4DEKHSUD3674\" data-el=\"text\" dir=\"null\"\u003e“They locked everyone up in a large hall that can hold a maximum of 30 or 40 people, but now they are keeping more than 120 people there,” said a family member of a male prisoner who was relocated to the Greater Tehran Penitentiary.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"SXZJXMUSGJHZZC6E5LDQJTKZTA\" data-el=\"text\" dir=\"null\"\u003eWomen prisoners remained in Evin the night of the strike before being moved to Qarchak Prison, according to a former Evin prisoner who has spoken with women detainees and a \u003ca href=\"https://www.en-hrana.org/evin-prison-evacuated-after-airstrikes-detainees-transferred-amid-inhumane-conditions-and-family-blackout/\" target=\"_blank\"\u003ereport\u003c/a\u003e by Human Rights Activists in Iran.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"7LRFBUSRCNAONI2GZC7H5SXNKU\" data-el=\"text\" dir=\"null\"\u003e“[Women prisoners] cleaned the place themselves. There were guards everywhere, pointing guns at their heads, and no water, no gas, no telephone access,” the person said. “Families were very worried.”\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"TQEHDYICFJBFFHC2XIRUIBJ2CQ\" data-el=\"text\" dir=\"null\"\u003eQarchak has \u003ca href=\"https://iranhr.net/en/articles/7185/\" target=\"_blank\"\u003ebeen denounced\u003c/a\u003e by human rights organizations for its pest infestation, contaminated water and lack of basic social services.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"RP4IRDLWHRACBHQ7FRF7SZTLDY\" data-el=\"text\" dir=\"null\"\u003e“In this situation, [prisoners] are the most vulnerable,” the former prisoner who ran toward the entrance said. “Who knows what is going to happen next.”\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"XLVX7CTTQVE6RIXCHFSURAADC4\" data-el=\"text\" dir=\"null\"\u003e\u003ci\u003eMikhail Klimentov contributed to this report.\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-07-06T12:30:58.473Z",
  "modifiedTime": "2025-07-07T00:23:29.461Z"
}
