{
  "id": "53c55059-c72e-4f15-b946-bddbe4539a43",
  "title": "Elton John, Paul McCartney Warn UK Government Over AI Copyright Threat",
  "link": "https://www.ndtv.com/world-news/elton-john-paul-mccartney-warn-uk-government-over-ai-copyright-threat-7565081",
  "description": "Two of Britain's leading music icons, Elton John and Paul McCartney, urged the UK government on Sunday to protect creative artists from AI, as ministers consult on changing copyright laws.",
  "author": "",
  "published": "Sun, 26 Jan 2025 20:48:55 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "Agence France-Presse",
  "length": 2972,
  "excerpt": "Two of Britain\u0026#039;s leading music icons, Elton John and Paul McCartney, urged the UK government on Sunday to protect creative artists from AI, as ministers consult on changing copyright laws.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "London: Two of Britain's leading music icons, Elton John and Paul McCartney, urged the UK government on Sunday to protect creative artists from AI, as ministers consult on changing copyright laws. Prime Minister Keir Starmer's government is considering overhauling the law to allow AI developers to use creators' content online to help develop their models, unless rights holders opt out.The mooted changes could see technology companies permitted to use material that is available online without respecting copyright if they are using it for text or data mining.But critics, including pop music legends John and McCartney, question how artists will opt out from all of the many different AI firms' generative programmes or monitor what has happened to their work online.The \"wheels are in motion to allow AI companies to ride roughshod over the traditional copyright laws that protect artists' livelihoods,\" John told The Sunday Times.\"This will allow global big tech companies to gain free and easy access to artists' work in order to train their artificial intelligence and create competing music.\"The 77-year-old behind hits including \"Rocket Man\" and \"Tiny Dancer\" warned this will \"dilute and threaten young artists' earnings\" and that \"the musician community rejects it wholeheartedly\".The government has said it will use its consultation running until February 25 to explore key points of the debate including how creators can license and be remunerated for the use of their material.'Loss of creativity'Starmer has previously said the government needs to \"get the balance right\" with copyright and AI while noting the tech represented \"a huge opportunity\".Asked about the plans in a BBC interview Sunday, finance minister Rachel Reeves insisted \"we want to support artists\". McCartney, 82 -- one of the two surviving members of The Beatles -- echoed fears that the plans could dampen the incentive for writers and artists to create new material and result in a \"loss of creativity\".In a rare interview, he told the BBC any new legislation regarding copyright must \"protect the creative thinkers, the creative artists\", warning \"you're not going to have them\" without that.\"You get young guys, girls, coming up, and they write a beautiful song, and they don't own it, and they don't have anything to do with it. And anyone who wants can just rip it off,\" he said.\"The truth is, the money's going somewhere... Somebody's getting paid, so why shouldn't it be the guy who sat down and wrote 'Yesterday'?\"In 2023, McCartney and Beatles drummer Ringo Starr used AI to extract John Lennon's vocals from an unfinished decades-old song and produce a new track called \"Now and Then\".\"I think AI is great, and it can do lots of great things,\" McCartney told the BBC in the rare interview, adding \"it has its uses.\"But it shouldn't rip creative people off. There's no sense in that.\"(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)",
  "image": "https://c.ndtvimg.com/2023-08/l5t0vqdo_elton-john_625x300_29_August_23.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                \u003cp\u003e\u003cb\u003eLondon: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eTwo of Britain\u0026#39;s leading music icons, Elton John and Paul McCartney, urged the UK government on Sunday to protect creative artists from AI, as ministers consult on changing copyright laws. \u003c/p\u003e\u003cp\u003ePrime Minister Keir Starmer\u0026#39;s government is considering overhauling the law to allow AI developers to use creators\u0026#39; content online to help develop their models, unless rights holders opt out.\u003c/p\u003e\u003cp\u003eThe mooted changes could see technology companies permitted to use material that is available online without respecting copyright if they are using it for text or data mining.\u003c/p\u003e\u003cp\u003eBut critics, including pop music legends John and McCartney, question how artists will opt out from all of the many different AI firms\u0026#39; generative programmes or monitor what has happened to their work online.\u003c/p\u003e\u003cp\u003eThe \u0026#34;wheels are in motion to allow AI companies to ride roughshod over the traditional copyright laws that protect artists\u0026#39; livelihoods,\u0026#34; John told The Sunday Times.\u003c/p\u003e\u003cp\u003e\u0026#34;This will allow global big tech companies to gain free and easy access to artists\u0026#39; work in order to train their artificial intelligence and create competing music.\u0026#34;\u003c/p\u003e\u003cp\u003eThe 77-year-old behind hits including \u0026#34;Rocket Man\u0026#34; and \u0026#34;Tiny Dancer\u0026#34; warned this will \u0026#34;dilute and threaten young artists\u0026#39; earnings\u0026#34; and that \u0026#34;the musician community rejects it wholeheartedly\u0026#34;.\u003c/p\u003e\u003cp\u003eThe government has said it will use its consultation running until February 25 to explore key points of the debate including how creators can license and be remunerated for the use of their material.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u0026#39;Loss of creativity\u0026#39;\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eStarmer has previously said the government needs to \u0026#34;get the balance right\u0026#34; with copyright and AI while noting the tech represented \u0026#34;a huge opportunity\u0026#34;.\u003c/p\u003e\u003cp\u003eAsked about the plans in a BBC interview Sunday, finance minister Rachel Reeves insisted \u0026#34;we want to support artists\u0026#34;. \u003c/p\u003e\u003cp\u003eMcCartney, 82 -- one of the two surviving members of The Beatles -- echoed fears that the plans could dampen the incentive for writers and artists to create new material and result in a \u0026#34;loss of creativity\u0026#34;.\u003c/p\u003e\u003cp\u003eIn a rare interview, he told the BBC any new legislation regarding copyright must \u0026#34;protect the creative thinkers, the creative artists\u0026#34;, warning \u0026#34;you\u0026#39;re not going to have them\u0026#34; without that.\u003c/p\u003e\u003cp\u003e\u0026#34;You get young guys, girls, coming up, and they write a beautiful song, and they don\u0026#39;t own it, and they don\u0026#39;t have anything to do with it. And anyone who wants can just rip it off,\u0026#34; he said.\u003c/p\u003e\u003cp\u003e\u0026#34;The truth is, the money\u0026#39;s going somewhere... Somebody\u0026#39;s getting paid, so why shouldn\u0026#39;t it be the guy who sat down and wrote \u0026#39;Yesterday\u0026#39;?\u0026#34;\u003c/p\u003e\u003cp\u003eIn 2023, McCartney and Beatles drummer Ringo Starr used AI to extract John Lennon\u0026#39;s vocals from an unfinished decades-old song and produce a new track called \u0026#34;Now and Then\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;I think AI is great, and it can do lots of great things,\u0026#34; McCartney told the BBC in the rare interview, adding \u0026#34;it has its uses.\u003c/p\u003e\u003cp\u003e\u0026#34;But it shouldn\u0026#39;t rip creative people off. There\u0026#39;s no sense in that.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003ci\u003e(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                        \n                                        \n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-01-26T20:48:55+05:30",
  "modifiedTime": null
}
