{
  "id": "55a04dea-6ff9-47eb-ab62-bdbd0a972962",
  "title": "Did Donald Trump salute too soon? US President-elect's gesture during Anthem at Army-Navy game sparks debate",
  "link": "https://timesofindia.indiatimes.com/world/us/did-donald-trump-salute-too-soon-us-president-elects-gesture-during-anthem-at-army-navy-game-sparks-debate/articleshow/116329255.cms",
  "description": "President-elect Donald Trump attended the 125th Army-Navy football game, saluting during the national anthem, a gesture that sparked both praise and criticism online. His presence, alongside key Republican figures, aimed to energize his base and project unity before his January 2025 inauguration.",
  "author": "TOI World Desk",
  "published": "2024-12-15T06:18:34+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 2490,
  "excerpt": "US News: President-elect Donald Trump attended the 125th Army-Navy football game, saluting during the national anthem, a gesture that sparked both praise and c",
  "siteName": "Times Of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "US President-elect Donald Trump sparked a heated debate online after saluting during the national anthem at the 125th Army-Navy football game at Northwest Stadium in Landover, Maryland, on Saturday. Attending the game with vice president-elect JD Vance, house speaker Mike Johnson, and defence secretary nominee Pete Hegseth, Trump’s gesture quickly went viral, with social media users questioning whether it was appropriate.A salute that divided opinionAs the anthem began, Trump raised a salute from the VIP box, while others around him, including Vance and Hegseth, placed their hands over their hearts. Military protocol dictates that saluting is typically reserved for those in uniform or active-duty personnel. As the President-elect, Trump remains a civilian until his inauguration on January 20, 2025. Critics argued that the gesture was out of place, while supporters hailed it as a sign of patriotism.One user on X (formerly Twitter) remarked, “All persons NOT in uniform should stand at attention, face the flag, and place their right hand over their heart. Trump isn’t in uniform. Read the flag code!” Another pointed out that President Joe Biden, the current Commander-in-Chief, is the one with authority to salute the military, adding that Trump’s action blurred the line between civilian and military roles.Supporters rally behind TrumpOn the other hand, Trump’s supporters flooded social media with praise. A video shared by a user read, “Donald Trump salutes during the national anthem. Joe Biden didn’t go for the past four years. Great to have the president back at Army-Navy.” Another user quipped, “I’m surprised Biden never went. According to his speeches, he probably claims he played for both Army and Navy in the same game!”Tradition of saluting at Army-NavyMilitary tradition holds that civilians should place their hand over their heart during the anthem, reserving salutes for those in uniform. While there is no legal prohibition against civilians saluting, it is considered unusual and, by some, disrespectful to military personnel.A symbolic moment for TrumpThe Army-Navy game has historically been a stage for presidents and public figures to honor the military. Trump, no stranger to using high-profile appearances to energize his base, appeared to frame the event as a symbolic nod to his upcoming presidency. His presence at the game, alongside Republican heavyweights, was part of a broader effort to project unity and strength ahead of his inauguration.",
  "image": "https://static.toiimg.com/thumb/msid-116329551,width-1070,height-580,imgsize-4241573,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-116329551,imgsize-4241573,width-400,resizemode-4/116329551.jpg\" alt=\"Did Donald Trump salute too soon? US President-elect\u0026#39;s gesture during Anthem at Army-Navy game sparks debate\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eUS President-elect \u003ca href=\"https://timesofindia.indiatimes.com/topic/donald-trump\" styleobj=\"[object Object]\" commonstate=\"[object Object]\" frmappuse=\"1\"\u003eDonald Trump\u003c/a\u003e sparked a heated debate online after saluting during the \u003ca href=\"https://timesofindia.indiatimes.com/topic/national-anthem\" styleobj=\"[object Object]\" commonstate=\"[object Object]\" frmappuse=\"1\"\u003enational anthem\u003c/a\u003e at the 125th Army-Navy football game at Northwest Stadium in Landover, Maryland, on Saturday. Attending the game with vice president-elect JD Vance, house speaker Mike Johnson, and defence secretary nominee Pete Hegseth, Trump’s gesture quickly went viral, with social media users questioning whether it was appropriate.\u003c/p\u003e\u003cp data-pos=\"8\"\u003e\u003ch2\u003eA salute that divided opinion\u003cbr/\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003eAs the anthem began, Trump raised a salute from the VIP box, while others around him, including Vance and Hegseth, placed their hands over their hearts. Military protocol dictates that saluting is typically reserved for those in uniform or active-duty personnel. As the President-elect, Trump remains a civilian until his inauguration on January 20, 2025. Critics argued that the gesture was out of place, while supporters hailed it as a sign of patriotism.\u003c/p\u003e\u003cp\u003eOne user on X (formerly Twitter) remarked, “All persons NOT in uniform should stand at attention, face the flag, and place their right hand over their heart. Trump isn’t in uniform. Read the flag code!” Another pointed out that President \u003ca href=\"https://timesofindia.indiatimes.com/topic/joe-biden\" styleobj=\"[object Object]\" commonstate=\"[object Object]\" frmappuse=\"1\"\u003eJoe Biden\u003c/a\u003e, the current Commander-in-Chief, is the one with authority to salute the military, adding that Trump’s action blurred the line between civilian and military roles.\u003c/p\u003e\u003cbr/\u003e\u003cp data-pos=\"24\"\u003e\u003ch2\u003eSupporters rally behind Trump\u003cbr/\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003eOn the other hand, Trump’s supporters flooded social media with praise. A video shared by a user read, “Donald \u003c/p\u003e\u003cp\u003eTrump salutes during the national anthem. Joe Biden didn’t go for the past four years. Great to have the president back at Army-Navy.” \u003c/p\u003e\u003cp\u003eAnother user quipped, “I’m surprised Biden never went. According to his speeches, he probably claims he played for both Army and Navy in the same game!”\u003c/p\u003e\u003cbr/\u003e\u003cp data-pos=\"39\"\u003e\u003ch2\u003eTradition of saluting at Army-Navy\u003cbr/\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003eMilitary tradition holds that civilians should place their hand over their heart during the anthem, reserving salutes for those in uniform. While there is no legal prohibition against civilians saluting, it is considered unusual and, by some, disrespectful to military personnel.\u003c/p\u003e\u003cp data-pos=\"43\"\u003e\u003ch2\u003eA symbolic moment for Trump\u003cbr/\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003eThe Army-Navy game has historically been a stage for presidents and public figures to honor the military. Trump, no stranger to using high-profile appearances to energize his base, appeared to frame the event as a symbolic nod to his upcoming presidency. His presence at the game, alongside Republican heavyweights, was part of a broader effort to project unity and strength ahead of his inauguration.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-12-15T06:18:00+05:30",
  "modifiedTime": null
}
