{
  "id": "55ba9deb-1b55-4086-8098-f0c167bbc2ed",
  "title": "Watch: Hugh Hewitt storms out of Washington Post live saying 'I'm done', resigns",
  "link": "https://timesofindia.indiatimes.com/world/us/watch-hugh-hewitt-storms-out-of-washington-post-live-saying-im-done-resigns/articleshow/114860580.cms",
  "description": "​When Hewitt's turn came to speak he said the news needed to be reported. “Bucks County was reversed by the court and instructed to open up extra days because they violated the law and told people to go home,” he said. ​​Capehart told Hewitt, “I don’t appreciate being lectured about reporting when, Hugh, many times you come here saying lots of things that aren’t based in fact.” “I won’t come back, Jonathan, I’m done,” he said. “You guys are working, that’s fine, I’m done.”",
  "author": "TOI World Desk",
  "published": "2024-11-02T00:54:46+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 2101,
  "excerpt": "US News: ​When Hewitt's turn came to speak he said the news needed to be reported. “Bucks County was reversed by the court and instructed to open up extra days",
  "siteName": "Times Of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "Hugh Lewitt (top right) walked out of the live show and said 'I'm done'Political pundit and conservative radio host Hugh Hewitt stormed out of a live talk show \"First Look\" where he fought with Jonathan Capehart and Ruth Marcus. \"I'm done. This is the most unfair election ad I've ever been part of,\" Lewitt said and then left his seat as it was being claimed on the live that Donald Trump was laying the groundwork to contest Tuesday's election if he lost. Hewitt then quit the Washington Post which has been in the news for not endorsing any presidential candidate this time. It was reported that the editorial board had an endorsement ready for Vice President Kamala Harris which was killed by owner Jeff Bezos. “I have in fact quit the Post but I was only writing a column for them every six weeks or so,” Hewitt later told Fox News Digital.The live panel was discussing a lawsuit filed by the Trump campaign in Pennsylvania where a judge agreed to a request to extend in-person voting in Bucks County. The Trump campaign said many people who were on line for mail ballots were turned away after 5pm. “Is it me or does it seem like Donald Trump is laying the groundwork for contesting the election,” Capehart asked Marcus.When Hewitt's turn came to speak he said the news needed to be reported. “Bucks County was reversed by the court and instructed to open up extra days because they violated the law and told people to go home,” he said.“We are news people, even though we have opinions, and we have to report the whole story if we bring up part of the story. So, yes, he’s upset about Bucks County, but he was right and he won in court. That’s the story,” Hewitt said.Capehart told Hewitt, “I don’t appreciate being lectured about reporting when, Hugh, many times you come here saying lots of things that aren’t based in fact.”“I won’t come back, Jonathan, I’m done,” he said. “You guys are working, that’s fine, I’m done.”Megyn Kelly praised Hewitt for standing up and wrote: \"BRAVO @hughhewitt! Factual, sober, brave and appropriately FED UP with these left-wing hacks posing as journalists.\"",
  "image": "https://static.toiimg.com/thumb/msid-114860559,width-1070,height-580,imgsize-780892,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003csection\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-114860559,imgsize-780892,width-400,resizemode-4/114860559.jpg\" alt=\"Watch: Hugh Hewitt storms out of Washington Post live saying \u0026#39;I\u0026#39;m done\u0026#39;, resigns\" title=\"Hugh Lewitt (top right) walked out of the live show and said \u0026#39;I\u0026#39;m done\u0026#39;\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan title=\"Hugh Lewitt (top right) walked out of the live show and said \u0026#39;I\u0026#39;m done\u0026#39;\"\u003eHugh Lewitt (top right) walked out of the live show and said \u0026#39;I\u0026#39;m done\u0026#39;\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003cp\u003ePolitical pundit and conservative radio host Hugh Hewitt stormed out of a live talk show \u0026#34;First Look\u0026#34; where he fought with Jonathan Capehart and Ruth Marcus. \u0026#34;I\u0026#39;m done. This is the most unfair election ad I\u0026#39;ve ever been part of,\u0026#34; Lewitt said and then left his seat as it was being claimed on the live that Donald Trump was laying the groundwork to contest Tuesday\u0026#39;s election if he lost. \u003cbr/\u003eHewitt then quit the Washington Post which has been in the news for not endorsing any presidential candidate this time. It was reported that the editorial board had an endorsement ready for Vice President Kamala Harris which was killed by owner Jeff Bezos. \u003cbr/\u003e“I have in fact quit the Post but I was only writing a column for them every six weeks or so,” Hewitt later told Fox News Digital.\u003cbr/\u003eThe live panel was discussing a lawsuit filed by the Trump campaign in Pennsylvania where a judge agreed to a request to extend in-person voting in Bucks County. The Trump campaign said many people who were on line for mail ballots were turned away after 5pm. \u003c/p\u003e\u003cp\u003e“Is it me or does it seem like Donald Trump is laying the groundwork for contesting the election,” Capehart asked Marcus.\u003cbr/\u003eWhen Hewitt\u0026#39;s turn came to speak he said the news needed to be reported. “Bucks County was reversed by the court and instructed to open up extra days because they violated the law and told people to go home,” he said.\u003cbr/\u003e“We are news people, even though we have opinions, and we have to report the whole story if we bring up part of the story. So, yes, he’s upset about Bucks County, but he was right and he won in court. That’s the story,” Hewitt said.\u003c/p\u003e\u003cp\u003eCapehart told Hewitt, “I don’t appreciate being lectured about reporting when, Hugh, many times you come here saying lots of things that aren’t based in fact.”\u003cbr/\u003e“I won’t come back, Jonathan, I’m done,” he said. “You guys are working, that’s fine, I’m done.”\u003cbr/\u003eMegyn Kelly praised Hewitt for standing up and wrote: \u0026#34;BRAVO @hughhewitt! Factual, sober, brave and appropriately FED UP with these left-wing hacks posing as journalists.\u0026#34;\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-02T00:54:00+05:30",
  "modifiedTime": null
}
