{
  "id": "566c58ec-cf6c-4f63-b24e-1ade4fe0e7da",
  "title": "Germany's government is on the brink of collapse — here’s what could happen now",
  "link": "https://www.cnbc.com/2024/11/04/germanys-government-is-on-the-brink-of-collapse-heres-what-could-be-ahead.html",
  "description": "Germany's ruling coalition has long been standing on shaky ground, but the situation has become critical in recent weeks, with a breakup more likely than ever.",
  "author": "",
  "published": "Mon, 04 Nov 2024 17:09:49 GMT",
  "source": "https://www.cnbc.com/id/100727362/device/rss/rss.html",
  "categories": null,
  "byline": "Sophie Kiderlin",
  "length": 5765,
  "excerpt": "Germany's ruling coalition has long been standing on shaky ground, but the situation has become critical in recent weeks, with a breakup more likely than ever.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "German Finance Minister Christian Lindner, Economy and Climate Action Minister Robert Habeck and Chancellor Olaf Scholz attend debates about the 2024 federal budget at the Bundestag on January 31, 2024 in Berlin, Germany.Sean Gallup | Getty Images News | Getty ImagesGermany's ruling coalition has long been on shaky ground, amid increasing divisions over economic and budget policies among its three member parties.The situation intensified in recent weeks, sparking concerns about the state of the 3-year-old union between Chancellor Olaf Scholz's Social Democratic Party (SPD), the Greens and the Free Democratic Party (FDP).Speculation is now rife about whether a breakup of the alliance could come as soon as this week, with media outlets reporting talks between various coalition representatives on Sunday night and early this week, ahead of a regular coalition meeting Wednesday.\"German politics seem to have become a train crash in slow motion. The German government has just entered a new stage of a slow burning political crisis that could be the last step before the eventual collapse of the governing coalition,\" Carsten Brzeski, global head of macro at ING, said in a note Monday.Holger Schmieding, chief economist at Berenberg, noted that the three coalition partners have been acting \"as if they were preparing to campaign against each other soon.\"For example, Scholz held a meeting with industry leaders last week but did not invite his party's coalition partners, which prompted the FDP to call its own separate gathering without the SPD.Separately, the Green party's Robert Habeck, who is Germany's economy minister, proposed a policy plan to stimulate business investment that was criticized by the FDP.The Lindner paperAnother escalation took place Friday, when Finance Minister Christian Lindner published a paper about reviving the struggling German economy.\"The paper reads like a serious attempt to analyze Germany's problems and propose solutions. However, it argues against fundamental SPD and Green positions and will therefore be hard for them to accept,\" Greg Fuzesi, euro area economist at JPMorgan, said in a note Monday.Brzeski meanwhile said that the content of the paper is not necessarily the issue, even if it goes against key policies from the SPD and Greens, but flagged that \"the tone of voice in the paper illustrates how cold the atmosphere between the coalition partners seems to have become.\"In a Sunday TV interview with ZDF, Lindner said the issues would be resolved, noting that this was primarily the responsibility of his governing partners. He eluded a question about whether he intended to leave the coalition if his suggestions for the nation's economic growth are not supported.A hotly contested budgetA recent key issue within the coalition has been Germany's budget for 2025 — a topic that also features heavily in Lindner's paper. The budget was initially presented earlier this year, but left unanswered several questions on a funding gap of several billion euros. Based on the currently operating timeline, the budget should be finalized by the middle of November.The coalition is now forced to make difficult decisions under time pressure, Fuzesi said, against the backdrop of differing economic visions and the hole that the constitutional court blew into Germany's finances last year, when it ruled that the government could not reallocate emergency funds raised during the Covid-19 pandemic to its budget.Berenberg's Schmieding meanwhile suggested that \"if the coalition cannot agree on fiscal and reform priorities for the 2025 budget, the government may fall apart.\"Possible coalition breakup?Besides a solution being found for the issues, several scenarios could now play out that would change the German government's makeup.One is that the FDP could exit the coalition, either by walking out itself or by irritating Scholz so much that he asks them to leave, Berenberg's Schmieding said.\"If so, a brief period of a SPD-Green minority government under Scholz would likely be followed by snap elections early next year,\" he said. However, the latest polls show that the FDP would only receive around 3% of votes in a federal election, below the 5% threshold it would need to cross to secure seats in the German Bundestag.Read more CNBC politics coverageArizona businesses worry immigration proposal on ballot would exacerbate worker shortageElon Musk and America PAC running 'scam,' and 'illegal' voter lottery, DA saysElection 2024 live updates: Harris' ad spending tops Trump by $300 million; DJT stock suddenly soarsTrump's closing campaign message is hampered by distractions, disconnectTrump says RFK Jr. plan to remove fluoride from public water 'sounds okay to me'The SPD and Greens would also suffer losses from the last federal election, while the current opposition party CDU would be the likeliest to secure the biggest share of votes.\"Snap elections are not yet the most likely scenario, but they are quite possible,\" Schmieding said.ING's Brzeski meanwhile noted that a minority government could also continue until the scheduled election date later in 2025 and pointed out that, even if the FDP left the coalition, this would not necessarily force a snap election.This is due to the German constitution, which dictates that snap elections can only be called by the federal president if the chancellor loses a vote of no confidence in parliament.But the outlook for the coalition appears weak, according to Brzeski.\"All in all, we think that the risk of the German government collapsing has never been higher than currently. Even potential geopolitical uncertainty stemming from the upcoming US elections no longer seems to be the guaranteed glue to keep the government together,\" he said.",
  "image": "https://image.cnbcfm.com/api/v1/image/108056886-1730723986824-gettyimages-1974983298-sg012245_seagir7v.jpeg?v=1730724107\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108056886\" data-test=\"InlineImage\"\u003e\u003cp\u003eGerman Finance Minister Christian Lindner, Economy and Climate Action Minister Robert Habeck and Chancellor Olaf Scholz attend debates about the 2024 federal budget at the Bundestag on January 31, 2024 in Berlin, Germany.\u003c/p\u003e\u003cp\u003eSean Gallup | Getty Images News | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eGermany\u0026#39;s ruling coalition has long been on shaky ground, amid increasing divisions over economic and budget policies among its three member parties.\u003c/p\u003e\u003cp\u003eThe situation intensified in recent weeks, sparking concerns about the state of the 3-year-old union between Chancellor Olaf Scholz\u0026#39;s Social Democratic Party (SPD), the Greens and the Free Democratic Party (FDP).\u003c/p\u003e\u003cp\u003eSpeculation is now rife about whether a breakup of the alliance could come as soon as this week, with media outlets reporting talks between various coalition representatives on Sunday night and early this week, ahead of a regular coalition meeting Wednesday.\u003c/p\u003e\u003cp\u003e\u0026#34;German politics seem to have become a train crash in slow motion. The German government has just entered a new stage of a slow burning political crisis that could be the last step before the eventual collapse of the governing coalition,\u0026#34; Carsten Brzeski, global head of macro at ING, said in a note Monday.\u003c/p\u003e\u003cp\u003eHolger Schmieding, chief economist at Berenberg, noted that the three coalition partners have been acting \u0026#34;as if they were preparing to campaign against each other soon.\u0026#34;\u003c/p\u003e\u003cp\u003eFor example, Scholz held a \u003ca href=\"https://www.reuters.com/world/europe/scholz-must-forge-new-policy-save-german-industry-2024-10-16/\" target=\"_blank\"\u003emeeting with industry leaders\u003c/a\u003e last week but did not invite his party\u0026#39;s coalition partners, which prompted the FDP to call its own \u003ca href=\"https://www.reuters.com/world/europe/germanys-fdp-host-its-own-economic-summit-same-day-scholz-2024-10-25/\" target=\"_blank\"\u003eseparate gathering\u003c/a\u003e without the SPD.\u003c/p\u003e\u003cp\u003eSeparately, the Green party\u0026#39;s Robert Habeck, who is Germany\u0026#39;s economy minister, proposed a \u003ca href=\"https://www.reuters.com/world/europe/germanys-habeck-lays-out-plan-boost-economy-calls-investment-fund-2024-10-23/\" target=\"_blank\"\u003epolicy plan\u003c/a\u003e to stimulate business investment that was criticized by the FDP.\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline0\"\u003e\u003c/a\u003eThe Lindner paper\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003eAnother escalation took place Friday, when Finance Minister Christian Lindner \u003ca href=\"https://www.reuters.com/world/europe/german-finance-minister-proposes-rival-economy-plan-document-shows-2024-11-01/\" target=\"_blank\"\u003epublished a paper\u003c/a\u003e about reviving the struggling German economy.\u003c/p\u003e\u003cp\u003e\u0026#34;The paper reads like a serious attempt to analyze Germany\u0026#39;s problems and propose solutions. However, it argues against fundamental SPD and Green positions and will therefore be hard for them to accept,\u0026#34; Greg Fuzesi, euro area economist at JPMorgan, said in a note Monday.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108053057\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000356005\" aria-labelledby=\"Placeholder-ArticleBody-Video-108053057\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108053086-1729873739619-lindner_imf_still.png?v=1729873815\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"Watch CNBC\u0026#39;s full interview with German Finance Minister Christian Lindner\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eBrzeski meanwhile said that the content of the paper is not necessarily the issue, even if it goes against key policies from the SPD and Greens, but flagged that \u0026#34;the tone of voice in the paper illustrates how cold the atmosphere between the coalition partners seems to have become.\u0026#34;\u003c/p\u003e\u003cp\u003eIn a Sunday TV interview with \u003ca href=\"https://www.zdf.de/nachrichten/politik/deutschland/fdp-christian-lindner-interview-zdf-ampel-aus-koalition-100.html\" target=\"_blank\"\u003eZDF\u003c/a\u003e, Lindner said the issues would be resolved, noting that this was primarily the responsibility of his governing partners. He eluded a question about whether he intended to leave the coalition if his suggestions for the nation\u0026#39;s economic growth are not supported.\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline1\"\u003e\u003c/a\u003eA hotly contested budget\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003eA recent key issue within the coalition has been Germany\u0026#39;s budget for 2025 — a topic that also features heavily in Lindner\u0026#39;s paper. The budget was \u003ca href=\"https://www.cnbc.com/2024/07/05/germany-seals-2025-budget-plan-after-tense-negotiations.html\"\u003einitially presented earlier this year\u003c/a\u003e, but left unanswered several questions on a funding gap of several billion euros. Based on the currently operating timeline, the budget should be finalized by the middle of November.\u003c/p\u003e\u003cp\u003eThe coalition is now forced to make difficult decisions under time pressure, Fuzesi said, against the backdrop of differing economic visions and the \u003ca href=\"https://www.cnbc.com/2023/11/23/germany-slides-deeper-into-budget-crisis-heres-what-you-need-to-know.html\"\u003ehole that the constitutional court blew\u003c/a\u003e into Germany\u0026#39;s finances last year, when it ruled that the government could not reallocate emergency funds raised during the Covid-19 pandemic to its budget.\u003c/p\u003e\u003cp\u003eBerenberg\u0026#39;s Schmieding meanwhile suggested that \u0026#34;if the coalition cannot agree on fiscal and reform priorities for the 2025 budget, the government may fall apart.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline2\"\u003e\u003c/a\u003ePossible coalition breakup?\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003eBesides a solution being found for the issues, several scenarios could now play out that would change the German government\u0026#39;s makeup.\u003c/p\u003e\u003cp\u003eOne is that the FDP could exit the coalition, either by walking out itself or by irritating Scholz so much that he asks them to leave, Berenberg\u0026#39;s Schmieding said.\u003c/p\u003e\u003cp\u003e\u0026#34;If so, a brief period of a SPD-Green minority government under Scholz would likely be followed by snap elections early next year,\u0026#34; he said. However, the \u003ca href=\"https://www.zdf.de/nachrichten/politik/politbarometer-eignung-bundeskanzler-100.html\" target=\"_blank\"\u003elatest polls\u003c/a\u003e show that the FDP would only receive around 3% of votes in a federal election, below the 5% threshold it would need to cross to secure seats in the German Bundestag.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"RegularArticle-RelatedContent-1\"\u003e\u003ch2\u003eRead more CNBC politics coverage\u003c/h2\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2024/11/04/arizona-businesses-immigration-plan-on-ballot-could-worsen-worker-shortage.html\"\u003eArizona businesses worry immigration proposal on ballot would exacerbate worker shortage\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2024/11/04/philadelphia-da-says-musk-pac-know-theyre-doing-illegal-lottery.html\"\u003eElon Musk and America PAC running \u0026#39;scam,\u0026#39; and \u0026#39;illegal\u0026#39; voter lottery, DA says\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2024/11/04/2024-presidential-election-live-updates-.html\"\u003eElection 2024 live updates: Harris\u0026#39; ad spending tops Trump by $300 million; DJT stock suddenly soars\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2024/11/03/trump-harris-2024-election-final-week-message.html\"\u003eTrump\u0026#39;s closing campaign message is hampered by distractions, disconnect\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2024/11/03/trump-rfk-plan-to-remove-fluoride-from-public-water-sounds-okay.html\"\u003eTrump says RFK Jr. plan to remove fluoride from public water \u0026#39;sounds okay to me\u0026#39;\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThe SPD and Greens would also suffer losses from the last federal election, while the current opposition party CDU would be the likeliest to secure the biggest share of votes.\u003c/p\u003e\u003cp\u003e\u0026#34;Snap elections are not yet the most likely scenario, but they are quite possible,\u0026#34; Schmieding said.\u003c/p\u003e\u003cp\u003eING\u0026#39;s Brzeski meanwhile noted that a minority government could also continue until the scheduled election date later in 2025 and pointed out that, even if the FDP left the coalition, this would not necessarily force a snap election.\u003c/p\u003e\u003cp\u003eThis is due to the German constitution, which dictates that snap elections can only be called by the federal president if the chancellor loses a vote of no confidence in parliament.\u003c/p\u003e\u003cp\u003eBut the outlook for the coalition appears weak, according to Brzeski.\u003c/p\u003e\u003cp\u003e\u0026#34;All in all, we think that the risk of the German government collapsing has never been higher than currently. Even potential geopolitical uncertainty stemming from the upcoming US elections no longer seems to be the guaranteed glue to keep the government together,\u0026#34; he said.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-11-04T14:03:42Z",
  "modifiedTime": "2024-11-04T17:09:49Z"
}
