{
  "id": "6455346f-ec01-49dd-a7fd-11a380272ce9",
  "title": "Hurricane Milton Leaves 10 Dead, Millions Without Power In Florida",
  "link": "https://www.ndtv.com/world-news/hurricane-milton-leaves-10-dead-millions-without-power-in-florida-6762576",
  "description": "Hurricane Milton plowed into the Atlantic Ocean on Thursday after cutting a destructive path across Florida that spawned tornados, killed at least 10 people and left millions without power.",
  "author": "",
  "published": "Thu, 10 Oct 2024 23:41:30 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "",
  "length": 6436,
  "excerpt": "Hurricane Milton plowed into the Atlantic Ocean on Thursday after cutting a destructive path across Florida that spawned tornados, killed at least 10 people and left millions without power.",
  "siteName": "www.ndtv.com",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Hurricane Milton plowed into the Atlantic Ocean on Thursday after cutting a destructive path across Florida that spawned tornados, killed at least 10 people and left millions without power, but the storm did not trigger the catastrophic surge of seawater that was feared.Governor Ron DeSantis said the state had avoided the \"worst-case scenario,\" though he cautioned the damage was still significant. The Tampa Bay area appeared to sidestep the storm surge that had prompted the most dire warnings.US Homeland Security Secretary Alejandro Mayorkas said at a White House briefing the government had reports of at least 10 deaths from Milton, adding it appeared they were caused by tornados.In St. Lucie County on Florida's east coast, a spate of tornados killed five people, including at least two in the senior-living Spanish Lakes Communities, county spokesperson Erick Gill said. Search-and-rescue teams there are combing through hard-hit areas, including a mobile-home park.There were 19 confirmed tornados in Florida as of 8 pm Wednesday, about the time Milton made landfall, DeSantis said. Some 45 tornados were reported throughout the day, mostly in the central and eastern parts of the state, the National Weather Service said.More than 3 million homes and businesses in Florida were without power on Thursday morning, according to PowerOutage.us. At least some had already been waiting days for power to be restored after Hurricane Helene hit the area two weeks ago.Milton shredded the fabric roof of Tropicana Field, the stadium of the Tampa Bay Rays baseball team in St. Petersburg, but there were no reported injuries. The ballpark was a staging area for responders, with thousands of cots set up on the field.In the Tampa area, the storm toppled trees, threw debris across roadways and downed power lines, video footage from local news showed. Some neighborhoods were flooded, but the extent of the damage will not be known until crews can assess the destruction, Tampa Mayor Jane Castor said at a morning news conference.Steven Cole Smith, 71, an automotive writer and editor who lives in Tampa about seven miles (11 km) from the Gulf Coast, rode out the storm with his wife. He said the wind shook the windows so hard he thought they would shatter.\"We really didn't have anywhere else to go,\" Smith said of their decision not to follow evacuation orders. He has a house in central Florida, but said the forecast for that area looked as bad as where he was staying.\"I spent yesterday scavenging for supplies, fuel for the generator, everything we'd need,\" he said. \"I have a chainsaw too.\"Luckily, he said, Tampa was spared a direct hit.Ken Wood, 58, a state ferryboat operator in Pinellas County, fled his Dunedin home on Florida's Gulf Coast with his 16-year-old cat Andy, after making the \"harrowing\" mistake of riding out Hurricane Helene two weeks ago in his mobile home.They heeded evacuation orders and headed north but only made it as far as a hotel about an hour's drive away when he decided it wasn't safe to stay on the roads.\"It was pretty loud, but Andy slept through it all,\" he told Reuters by telephone.He is worried about his home but was awaiting official word that roads are clear before returning. Helene destroyed about a third of his neighborhood, and the streets were still piled with rubble that could have become wind-driven projectiles.'INSTANTANEOUS'Emergency crews responded overnight to dozens of calls for help, including one in which 15 people were rescued after a tree fell on top of a house, Tampa Police Chief Lee Bercaw said.The winds toppled a large construction crane in St. Petersburg, sending it crashing onto a deserted street.The state was still in danger of river flooding after up to 18 inches (457 mm) of rain fell. Authorities were waiting for rivers to crest, but so far levels were at or below those after Hurricane Helene two weeks ago, Castor said on Thursday morning.Most of the severe damage reported so far stemmed from the tornados, according to Federal Emergency Management Agency head Deanne Criswell, who was in Tallahassee on Thursday.\"The evacuation orders saved lives,\" she said, noting that more than 90,000 residents went to shelters.In Fort Myers on the southwest coast, resident Connor Ferin surveyed the wreckage of his home, which had lost its roof and was full of debris and rainwater after a tornado hit.\"All this happened instantaneous, like these windows blew out,\" he said. \"I grabbed the two dogs and run under my bed and that was it. Probably one minute total.\"President Joe Biden, who postponed an overseas trip to monitor Milton, spoke to local leaders in Florida on Thursday and pledged the federal government's full support.The storm hit Florida's west coast on Wednesday night as a Category 3 hurricane on the five-step Saffir-Simpson scale, with top sustained winds of 120 mph (205 kph). While still a dangerous storm, Milton had weakened from the rare Category 5 status as it trekked over the Gulf of Mexico toward Florida.Milton tailed off further over land, dropping to a Category 1 hurricane with top sustained winds of 85 mph (145 kph) as it reached the peninsula's east coast, the National Hurricane Center said. By Thursday morning, the storm was moving away from the Florida Atlantic coast after lashing communities on the eastern shoreline.The eye of the storm made landfall in Siesta Key, a barrier island town of some 5,400 people off Sarasota about 60 miles (100 km) south of Tampa Bay.In a state already battered by Hurricane Helene, as many as 2 million people had been ordered to evacuate ahead of Milton's arrival, and millions more live in the storm's path. Both storms are expected to cause billions of dollars in damage.Florida airports remained closed on Thursday, including Tampa, Palm Beach and St. Pete-Clearwater, with exceptions for emergency aircraft, according to the Federal Aviation Administration.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Featured Video Of The Day NDTV On The Front Lines: A New Chapter In West Asia Tensions",
  "image": "https://c.ndtvimg.com/2024-10/1dds9o98_hurricane-milton-reuters_625x300_10_October_24.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                        \u003cp\u003eHurricane Milton plowed into the Atlantic Ocean on Thursday after cutting a destructive path across Florida that spawned tornados, killed at least 10 people and left millions without power, but the storm did not trigger the catastrophic surge of seawater that was feared.\u003c/p\u003e\u003cp\u003eGovernor Ron DeSantis said the state had avoided the \u0026#34;worst-case scenario,\u0026#34; though he cautioned the damage was still significant. The Tampa Bay area appeared to sidestep the storm surge that had prompted the most dire warnings.\u003c/p\u003e\u003cp\u003eUS Homeland Security Secretary Alejandro Mayorkas said at a White House briefing the government had reports of at least 10 deaths from Milton, adding it appeared they were caused by tornados.\u003c/p\u003e\u003cp\u003eIn St. Lucie County on Florida\u0026#39;s east coast, a spate of tornados killed five people, including at least two in the senior-living Spanish Lakes Communities, county spokesperson Erick Gill said. Search-and-rescue teams there are combing through hard-hit areas, including a mobile-home park.\u003c/p\u003e\u003cp\u003eThere were 19 confirmed tornados in Florida as of 8 pm Wednesday, about the time Milton made landfall, DeSantis said. Some 45 tornados were reported throughout the day, mostly in the central and eastern parts of the state, the National Weather Service said.\u003c/p\u003e\u003cp\u003eMore than 3 million homes and businesses in Florida were without power on Thursday morning, according to PowerOutage.us. At least some had already been waiting days for power to be restored after Hurricane Helene hit the area two weeks ago.\u003c/p\u003e\u003cp\u003eMilton shredded the fabric roof of Tropicana Field, the stadium of the Tampa Bay Rays baseball team in St. Petersburg, but there were no reported injuries. The ballpark was a staging area for responders, with thousands of cots set up on the field.\u003c/p\u003e\u003cp\u003eIn the Tampa area, the storm toppled trees, threw debris across roadways and downed power lines, video footage from local news showed. Some neighborhoods were flooded, but the extent of the damage will not be known until crews can assess the destruction, Tampa Mayor Jane Castor said at a morning news conference.\u003c/p\u003e\u003cp\u003eSteven Cole Smith, 71, an automotive writer and editor who lives in Tampa about seven miles (11 km) from the Gulf Coast, rode out the storm with his wife. He said the wind shook the windows so hard he thought they would shatter.\u003c/p\u003e\u003cp\u003e\u0026#34;We really didn\u0026#39;t have anywhere else to go,\u0026#34; Smith said of their decision not to follow evacuation orders. He has a house in central Florida, but said the forecast for that area looked as bad as where he was staying.\u003c/p\u003e\u003cp\u003e\u0026#34;I spent yesterday scavenging for supplies, fuel for the generator, everything we\u0026#39;d need,\u0026#34; he said. \u0026#34;I have a chainsaw too.\u0026#34;\u003c/p\u003e\u003cp\u003eLuckily, he said, Tampa was spared a direct hit.\u003c/p\u003e\u003cp\u003eKen Wood, 58, a state ferryboat operator in Pinellas County, fled his Dunedin home on Florida\u0026#39;s Gulf Coast with his 16-year-old cat Andy, after making the \u0026#34;harrowing\u0026#34; mistake of riding out Hurricane Helene two weeks ago in his mobile home.\u003c/p\u003e\u003cp\u003eThey heeded evacuation orders and headed north but only made it as far as a hotel about an hour\u0026#39;s drive away when he decided it wasn\u0026#39;t safe to stay on the roads.\u003c/p\u003e\u003cp\u003e\u0026#34;It was pretty loud, but Andy slept through it all,\u0026#34; he told Reuters by telephone.\u003c/p\u003e\u003cp\u003eHe is worried about his home but was awaiting official word that roads are clear before returning. Helene destroyed about a third of his neighborhood, and the streets were still piled with rubble that could have become wind-driven projectiles.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u0026#39;INSTANTANEOUS\u0026#39;\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEmergency crews responded overnight to dozens of calls for help, including one in which 15 people were rescued after a tree fell on top of a house, Tampa Police Chief Lee Bercaw said.\u003c/p\u003e\u003cp\u003eThe winds toppled a large construction crane in St. Petersburg, sending it crashing onto a deserted street.\u003c/p\u003e\u003cp\u003eThe state was still in danger of river flooding after up to 18 inches (457 mm) of rain fell. Authorities were waiting for rivers to crest, but so far levels were at or below those after Hurricane Helene two weeks ago, Castor said on Thursday morning.\u003c/p\u003e\u003cp\u003eMost of the severe damage reported so far stemmed from the tornados, according to Federal Emergency Management Agency head Deanne Criswell, who was in Tallahassee on Thursday.\u003c/p\u003e\u003cp\u003e\u0026#34;The evacuation orders saved lives,\u0026#34; she said, noting that more than 90,000 residents went to shelters.\u003c/p\u003e\u003cp\u003eIn Fort Myers on the southwest coast, resident Connor Ferin surveyed the wreckage of his home, which had lost its roof and was full of debris and rainwater after a tornado hit.\u003c/p\u003e\u003cp\u003e\u0026#34;All this happened instantaneous, like these windows blew out,\u0026#34; he said. \u0026#34;I grabbed the two dogs and run under my bed and that was it. Probably one minute total.\u0026#34;\u003c/p\u003e\u003cp\u003ePresident Joe Biden, who postponed an overseas trip to monitor Milton, spoke to local leaders in Florida on Thursday and pledged the federal government\u0026#39;s full support.\u003c/p\u003e\u003cp\u003eThe storm hit Florida\u0026#39;s west coast on Wednesday night as a Category 3 hurricane on the five-step Saffir-Simpson scale, with top sustained winds of 120 mph (205 kph). While still a dangerous storm, Milton had weakened from the rare Category 5 status as it trekked over the Gulf of Mexico toward Florida.\u003c/p\u003e\u003cp\u003eMilton tailed off further over land, dropping to a Category 1 hurricane with top sustained winds of 85 mph (145 kph) as it reached the peninsula\u0026#39;s east coast, the National Hurricane Center said. By Thursday morning, the storm was moving away from the Florida Atlantic coast after lashing communities on the eastern shoreline.\u003c/p\u003e\u003cp\u003eThe eye of the storm made landfall in Siesta Key, a barrier island town of some 5,400 people off Sarasota about 60 miles (100 km) south of Tampa Bay.\u003c/p\u003e\u003cp\u003eIn a state already battered by Hurricane Helene, as many as 2 million people had been ordered to evacuate ahead of Milton\u0026#39;s arrival, and millions more live in the storm\u0026#39;s path. Both storms are expected to cause billions of dollars in damage.\u003c/p\u003e\u003cp\u003eFlorida airports remained closed on Thursday, including Tampa, Palm Beach and St. Pete-Clearwater, with exceptions for emergency aircraft, according to the Federal Aviation Administration.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                        \n                                        \n                                                                                \u003cdiv\u003e\n                                                    \u003cp\u003eFeatured Video Of The Day\u003c/p\u003e\n                                                    \n                                                    \u003cp\u003eNDTV On The Front Lines: A New Chapter In West Asia Tensions\u003c/p\u003e\n\n                                                \u003c/div\u003e\n                                                                                \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": null,
  "modifiedTime": null
}
