{
  "id": "662fabd9-178e-4aee-ac69-cdbc009662e6",
  "title": "Gaza aid contractor tells BBC he saw colleagues fire on hungry Palestinians",
  "link": "https://www.bbc.com/news/articles/cnvmry71q5yo",
  "description": "The Israel- and US-backed Gaza Humanitarian Foundation has strongly denied the allegation.",
  "author": "",
  "published": "Thu, 03 Jul 2025 20:14:26 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Lucy Williamson",
  "length": 5089,
  "excerpt": "The Israel- and US-backed Gaza Humanitarian Foundation has strongly denied the allegation.",
  "siteName": "BBC News",
  "favicon": "https://static.files.bbci.co.uk/bbcdotcom/web/20250701-150711-e3d94715db-web-2.24.1-1/apple-touch-icon.png",
  "text": "Lucy WilliamsonBBC Middle East correspondentReporting fromJerusalemWatch footage shared with BBC from inside Gaza aid operationA former security contractor for Gaza's controversial new Israel- and US-backed aid distribution sites has told the BBC that he witnessed colleagues opening fire several times on hungry Palestinians who had posed no threat, including with machine guns.On one occasion, he said, a guard had opened fire from a watchtower with a machine gun because a group of women, children and elderly people was moving too slowly away from the site.When asked to respond the Gaza Humanitarian Foundation (GHF) said the allegations were categorically false.They referred us to a statement saying that no civilians ever came under fire at the GHF distribution sites.The GHF began its operations in Gaza at the end of May, distributing limited aid from several sites in southern and central Gaza. That followed an 11-week total blockade of Gaza by Israel during which no food entered the territory.The system has been widely criticised for forcing vast numbers of people to walk through active combat zones to a handful of sites. Since the GHF started up, Israeli forces have killed more than 400 Palestinians trying to retrieve food aid from its sites, the UN and local doctors say. Israel says the new distribution system stops aid going to Hamas.Continuing his description of the incident at one of the GHF sites - in which he said guards fired on a group of Palestinians - the former contractor said: \"As that happened, another contractor on location, standing on the berm overlooking the exit, opened up with 15 to 20 shots of repetitive weapons fire at the crowd.\"A Palestinian man dropped to the ground motionless. And then the other contractor who was standing there was like, 'damn, I think you got one'. And then they laughed about it.\"The contractor, who spoke to us on condition of anonymity, said GHF managers had brushed off his report as a coincidence, suggesting that the Palestinian man could have \"tripped\" or been \"tired and passed out\".The GHF claimed the man who made these allegations is a \"disgruntled former contractor\" who they had terminated for misconduct, which he denies. He showed us payslips suggesting that he continued to be paid for two weeks after leaving the post.SUPPLIEDSupplied footage showed long queues of aid seekers in a fenced corridorThe man we spoke to, who said he had worked at all four of the GHF distribution sites, described a culture of impunity with few rules or controls.He said contractors were given no clear rules of engagement or standard operating procedures, and were told by one team leader: \"if you feel threatened, shoot – shoot to kill and ask questions later\".The culture in the company, he said, felt like \"we're going into Gaza so it's no rules. Do what you want.\"\"If a Palestinian is walking away from the site and not demonstrating any hostile intent, and we're shooting warning shots at them regardless, we are wrong, we are criminally negligent,\" he told me.He told us that each site had CCTV monitoring the activity in the area, and GHF insistence that no one there had been hurt or shot at was \"an absolute bare-faced lie\".GHF said that gunfire heard in footage shared with the BBC was coming from Israeli forces.Team leaders referred to Gazans as \"zombie hordes\", the former contractor said, \"insinuating that these people have no value.\"The man also said Palestinians were coming to harm in other ways at GHF sites, for example by being hit by debris from stun grenades, being sprayed with mace or being pushed by the crowds into razor wire.He said he had witnessed several occasions in which Palestinians appeared to have been seriously hurt, including one man who had a full can of pepper spray in his face, and a woman who he said was hit with the metal part of a stun grenade, improperly fired into a crowd.\"This metal piece hit her directly in the head and she dropped to the ground, not moving,\" he said. \"I don't know if she was dead. I know for a fact she was unconscious and completely limp.\"ReutersThe GHF operation has been criticised for forcing people to walk through active combat zonesEarlier this week more than 170 charities and other NGOs called for the GHF to be shut down. The organisations, including Oxfam and Save the Children, say Israeli forces and armed groups \"routinely\" open fire on Palestinians seeking aid.Israel denies its soldiers deliberately shoot at aid recipients and says the GHF's system provides direct assistance to people who need it, bypassing Hamas interference.The GHF says it had delivered more than 52 million meals in five weeks and that other organisations \"stand by helplessly as their aid is looted\".The Israeli military launched a campaign in Gaza in response to Hamas's 7 October 2023 attack on Israel, in which about 1,200 people were killed and 251 others were taken hostage.At least 57,130 people have been killed in Gaza since then, according to the territory's Hamas-run health ministry.Additional reporting by Gidi Kleiman and Samantha Granville",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c8a4/live/f75edd30-5851-11f0-b5c5-012c5796682d.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cdiv data-testid=\"byline-new\" data-component=\"byline-block\"\u003e\u003cp\u003e\u003cspan\u003eLucy Williamson\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBBC Middle East correspondent\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eReporting from\u003csvg viewBox=\"0 0 32 32\" width=\"1em\" height=\"1em\" category=\"personalisation\" icon=\"location\"\u003e\u003cpath d=\"M12.3 11c0 2.1 1.7 3.7 3.7 3.7s3.7-1.7 3.7-3.7-1.6-3.7-3.7-3.7S12.3 9 12.3 11zm2.9 20c-3-4.4-5.6-8.5-7.3-12.1-1.5-3-2.1-5.6-2.1-7.9C5.7 5.5 10.1 1 16 1s10.3 4.6 10.3 10c0 2.3-.7 4.9-2.1 7.9-1.7 3.6-4.3 7.7-7.3 12.1h-1.7z\"\u003e\u003c/path\u003e\u003c/svg\u003eJerusalem\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eWatch footage shared with BBC from inside Gaza aid operation\u003c/figcaption\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eA former security contractor for Gaza\u0026#39;s controversial new Israel- and US-backed aid distribution sites has told the BBC that he witnessed colleagues opening fire several times on hungry Palestinians who had posed no threat, including with machine guns.\u003c/p\u003e\u003cp\u003eOn one occasion, he said, a guard had opened fire from a watchtower with a machine gun because a group of women, children and elderly people was moving too slowly away from the site.\u003c/p\u003e\u003cp\u003eWhen asked to respond the Gaza Humanitarian Foundation (GHF) said the allegations were categorically false.\u003c/p\u003e\u003cp\u003eThey referred us to a statement saying that no civilians ever came under fire at the GHF distribution sites.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe GHF began its operations in Gaza at the end of May, distributing limited aid from several sites in southern and central Gaza. That followed an 11-week total blockade of Gaza by Israel during which no food entered the territory.\u003c/p\u003e\u003cp\u003eThe system has been widely criticised for forcing vast numbers of people to walk through active combat zones to a handful of sites. Since the GHF started up, Israeli forces have killed more than 400 Palestinians trying to retrieve food aid from its sites, the UN and local doctors say. Israel says the new distribution system stops aid going to Hamas.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eContinuing his description of the incident at one of the GHF sites - in which he said guards fired on a group of Palestinians - the former contractor said: \u0026#34;As that happened, another contractor on location, standing on the berm overlooking the exit, opened up with 15 to 20 shots of repetitive weapons fire at the crowd.\u003c/p\u003e\u003cp\u003e\u0026#34;A Palestinian man dropped to the ground motionless. And then the other contractor who was standing there was like, \u0026#39;damn, I think you got one\u0026#39;.  And then they laughed about it.\u0026#34;\u003c/p\u003e\u003cp\u003eThe contractor, who spoke to us on condition of anonymity, said GHF managers had brushed off his report as a coincidence, suggesting that the Palestinian man could have \u0026#34;tripped\u0026#34; or been \u0026#34;tired and passed out\u0026#34;.\u003c/p\u003e\u003cp\u003eThe GHF claimed the man who made these allegations is a \u0026#34;disgruntled former contractor\u0026#34; who they had terminated for misconduct, which he denies. He showed us payslips suggesting that he continued to be paid for two weeks after leaving the post.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250701-150711-e3d94715db-web-2.24.1-1/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/d39c/live/5f33c2d0-5849-11f0-8a14-4bb888480cb3.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/d39c/live/5f33c2d0-5849-11f0-8a14-4bb888480cb3.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/d39c/live/5f33c2d0-5849-11f0-8a14-4bb888480cb3.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/d39c/live/5f33c2d0-5849-11f0-8a14-4bb888480cb3.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/d39c/live/5f33c2d0-5849-11f0-8a14-4bb888480cb3.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/d39c/live/5f33c2d0-5849-11f0-8a14-4bb888480cb3.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/d39c/live/5f33c2d0-5849-11f0-8a14-4bb888480cb3.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/d39c/live/5f33c2d0-5849-11f0-8a14-4bb888480cb3.jpg.webp\" loading=\"eager\" alt=\"SUPPLIED a congested queue of people in a fenced in corridor near a GHF site in Gaza\"/\u003e\u003cspan\u003eSUPPLIED\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eSupplied footage showed long queues of aid seekers in a fenced corridor\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe man we spoke to, who said he had worked at all four of the GHF distribution sites, described a culture of impunity with few rules or controls.\u003c/p\u003e\u003cp\u003eHe said contractors were given no clear rules of engagement or standard operating procedures, and were told by one team leader: \u0026#34;if you feel threatened, shoot – shoot to kill and ask questions later\u0026#34;.\u003c/p\u003e\u003cp\u003eThe culture in the company, he said, felt like \u0026#34;we\u0026#39;re going into Gaza so it\u0026#39;s no rules. Do what you want.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;If a Palestinian is walking away from the site and not demonstrating any hostile intent, and we\u0026#39;re shooting warning shots at them regardless, we are wrong, we are criminally negligent,\u0026#34; he told me.\u003c/p\u003e\u003cp\u003eHe told us that each site had CCTV monitoring the activity in the area, and GHF insistence that no one there had been hurt or shot at was \u0026#34;an absolute bare-faced lie\u0026#34;.\u003c/p\u003e\u003cp\u003eGHF said that gunfire heard in footage shared with the BBC was coming from Israeli forces.\u003c/p\u003e\u003cp\u003eTeam leaders referred to Gazans as \u0026#34;zombie hordes\u0026#34;, the former contractor said, \u0026#34;insinuating that these people have no value.\u0026#34;\u003c/p\u003e\u003cp\u003eThe man also said Palestinians were coming to harm in other ways at GHF sites, for example by being hit by debris from stun grenades, being sprayed with mace or being pushed by the crowds into razor wire.\u003c/p\u003e\u003cp\u003eHe said he had witnessed several occasions in which Palestinians appeared to have been seriously hurt, including one man who had a full can of pepper spray in his face, and a woman who he said was hit with the metal part of a stun grenade, improperly fired into a crowd.\u003c/p\u003e\u003cp\u003e\u0026#34;This metal piece hit her directly in the head and she dropped to the ground, not moving,\u0026#34; he said. \u0026#34;I don\u0026#39;t know if she was dead. I know for a fact she was unconscious and completely limp.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250701-150711-e3d94715db-web-2.24.1-1/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/a98c/live/4db21c20-5833-11f0-b5c5-012c5796682d.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/a98c/live/4db21c20-5833-11f0-b5c5-012c5796682d.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/a98c/live/4db21c20-5833-11f0-b5c5-012c5796682d.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/a98c/live/4db21c20-5833-11f0-b5c5-012c5796682d.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/a98c/live/4db21c20-5833-11f0-b5c5-012c5796682d.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/a98c/live/4db21c20-5833-11f0-b5c5-012c5796682d.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/a98c/live/4db21c20-5833-11f0-b5c5-012c5796682d.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/a98c/live/4db21c20-5833-11f0-b5c5-012c5796682d.jpg.webp\" loading=\"lazy\" alt=\"Reuters  Palestinians gather to collect what remains of relief supplies from the distribution center of the U.S.-backed Gaza Humanitarian Foundation, in Rafah, in the southern Gaza Strip. Empty cardboard boxes litter the arid ground. \"/\u003e\u003cspan\u003eReuters\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eThe GHF operation has been criticised for forcing people to walk through active combat zones\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eEarlier this week more than 170 charities and other NGOs \u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/articles/cn5kk1w00xyo\"\u003ecalled for the GHF to be shut down\u003c/a\u003e. The organisations, including Oxfam and Save the Children, say Israeli forces and armed groups \u0026#34;routinely\u0026#34; open fire on Palestinians seeking aid.\u003c/p\u003e\u003cp\u003eIsrael denies its soldiers deliberately shoot at aid recipients and says the GHF\u0026#39;s system provides direct assistance to people who need it, bypassing Hamas interference.\u003c/p\u003e\u003cp\u003eThe GHF says it had delivered more than 52 million meals in five weeks and that other organisations \u0026#34;stand by helplessly as their aid is looted\u0026#34;.\u003c/p\u003e\u003cp\u003eThe Israeli military launched a campaign in Gaza in response to Hamas\u0026#39;s 7 October 2023 attack on Israel, in which about 1,200 people were killed and 251 others were taken hostage.\u003c/p\u003e\u003cp\u003eAt least 57,130 people have been killed in Gaza since then, according to the territory\u0026#39;s Hamas-run health ministry.\u003c/p\u003e\u003cp\u003e\u003ci id=\"additional-reporting-by-gidi-kleiman-and-samantha-granville\"\u003eAdditional reporting by Gidi Kleiman and Samantha Granville\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-03T20:14:26.126Z",
  "modifiedTime": "2025-07-03T20:14:26.126Z"
}
