{
  "id": "66a843f1-9693-4df8-bafd-81f4c54a2d0d",
  "title": "China's monetary shift signals economic worries, but 'bazooka-style' stimulus is unlikely, experts say",
  "link": "https://www.cnbc.com/2024/12/11/chinas-policy-shift-signals-economic-worries-but-outsized-stimulus-is-unlikely.html",
  "description": "Despite a flurry of stimulus measures, recent economic indicators have showed the world's second-largest economy is still struggling with deflationary pressures.",
  "author": "",
  "published": "Wed, 11 Dec 2024 12:44:37 GMT",
  "source": "https://www.cnbc.com/id/100727362/device/rss/rss.html",
  "categories": null,
  "byline": "Anniek Bao",
  "length": 5940,
  "excerpt": "Despite a flurry of stimulus measures, recent economic indicators have showed the world's second-largest economy is still struggling with deflationary pressures.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "The People's Bank of China (PBOC) building in Beijing, China, on Tuesday, April 18, 2023. Bloomberg | Getty ImagesChinese top leadership surprised the market Monday by signaling a shift in its monetary policy stance after 14 years, indicating the economic challenges facing the country are quite entrenched, yet an outsized stimulus is unlikely, according to experts.China is looking to switch its policy stance next year to \"moderately loose\" from \"prudent\" — a phrase they haven't used since the depths of the global financial crisis in 2008, when they loosened the stance and stuck with it until 2010.This is the first time the current leadership has acknowledged that monetary policy should be loose, setting the stage for \"a new monetary easing cycle,\" said Larry Hu, chief economist at Macquarie.\"Such a tone suggests that policymakers are deeply concerned about the economic outlook, given the sluggish domestic demand and the threat of another trade war,\" Hu added.Despite a flurry of stimulus measures since late September, recent economic indicators have showed the world's second-largest economy is still struggling with deflationary pressures, amid tepid consumer demand and a prolonged housing downturn.\"Potential monetary easing leeway is much more limited than 15 years ago,\" said Tao Wang, head of Asia economics and chief China economist at UBS Investment Bank, who expects \"over 50 basis points policy rate cut\" over the course of next two years.Policy shiftChinese government had unleashed a \"historically large monetary stimulus in response to the global financial crisis,\" Gabriel Wildau, managing director of Teneo said.Beijing had announced a 4 trillion yuan ($586 billion) package in November 2008 — which was about 13% of China's GDP at the time — to sustain growth and wean off the impact of the worst global economic downturn in over 70 years.When the authorities adopted the \"moderately loose\" policy stance in 2008, the People's Bank of China cut its benchmark 1-year lending rate by a total of 156 basis points and the cash reserves ratio by 1.5 percentage points during the easing cycle, Ming Ming, a former official at the PBOC monetary policy department, told state-backed media Economic Observer.Last month, China unveiled a five-year stimulus package totaling 10 trillion yuan to tackle local government debt problems, while indicating more economic support would follow next year. That was just about 2.5% of China's annual GDP, Ting Lu, chief China economist at Nomura, said in October.The debt swap program needs to be significantly scaled up to offset the local government financial vehicle debt, which was nearly half of the size of country's GDP, economists at Morgan Stanley said.Morgan Stanley expects the central government fiscal deficit to widen by 1.4 percentage point next year, as the government borrows more to shore up the economy. China has kept its central government deficit target at 3% this year.PBOC constraintsThe PBOC has been cutting key interest rates since late September, after the U.S. Federal Reserve's started its easing cycle with a large 50-basis-point cut in mid-September.U.S. Fed rate cuts offered room for China to lower its domestic borrowing costs without prompting a sharp decline in Chinese yuan. However, the PBOC has held back from more aggressive rate cuts over concerns of potential capital flight, if the gap between Chinese rates and those elsewhere grows wider.Securing the growth momentum would have higher priority than stabilizing the exchange rate.Bruce PangChief economist, Greater China, JLLThe tone from Monday's Politburo meeting reinforced market's expectation that the PBOC will likely cut key interest rates by 40 to 50 basis points to close to 1%, towards the end of 2025, Ju Wang, head of Greater China FX \u0026 rates strategy at BNP Paribas said in a note on Tuesday.Bets on further rate cuts have fueled a prolonged rally in Chinese government bonds, pushing the 10-year benchmark yield to record lows on Tuesday.While monetary easing might put depreciation pressure on the Chinese yuan, \"securing the [economic] growth momentum would have higher priority than stabilizing the exchange rate,\" Bruce Pang, chief economist of Greater China at JLL told CNBC.Pang expects the central bank to cut the reserve requirement ratio, or RRR, a key lever to adjust liquidity, within a month.Not a 'bazooka'More details on Beijing's macro policy plans will be revealed at the annual economic work conference, that is reportedly underway and will end Thursday, UBS' Wang added.That said, most of the key policy targets and details of stimulus measures will only be announced at the National People's Congress next March, she added.Investors and economists are watching for any concrete policy follow-through, particularly on additional fiscal support and direct consumption incentives.The stronger language on Monday does not signal that \"bazooka-style stimulus will arrive immediately,\" Wildau said, who sees the top leaders to roll out new stimulus measures in an \"incremental, data-dependent fashion, while keeping some ammunition in reserve\" in response to potential U.S. tariffs next year.Reviving household consumption is a top priority for policymakers, Wang said, forecasting the government to more than double its trade-in program to over 300 billion yuan to incentivize domestic spending.China in July had announced allocation of 300 billion yuan ($41.5 billion) in ultra-long special government bonds to support the trade-in and equipment upgrade policy, in a bid to bolster consumer demand.Beyond the trade-in program, existing fiscal stimulus package has placed little emphasis on boosting consumption, which is key to reflating the economy, Sunny Liu, lead economist at Oxford Economics said in a note on Wednesday, stressing that China will continue to face deflationary pressures in the near term.CNBC's Evelyn Cheng contributed to this report.",
  "image": "https://image.cnbcfm.com/api/v1/image/108074243-1733898454302-gettyimages-1251968490-CHINA_PBOC.jpeg?v=1733898473\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108074243\" data-test=\"InlineImage\"\u003e\u003cp\u003eThe People\u0026#39;s Bank of China (PBOC) building in Beijing, China, on Tuesday, April 18, 2023. \u003c/p\u003e\u003cp\u003eBloomberg | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eChinese top leadership surprised the market Monday by signaling a shift in its monetary policy stance after 14 years, indicating the economic challenges facing the country are quite entrenched, yet an outsized stimulus is unlikely, according to experts.\u003c/p\u003e\u003cp\u003eChina is looking to switch its policy stance next year to \u0026#34;moderately loose\u0026#34; from \u0026#34;prudent\u0026#34; — a phrase they haven\u0026#39;t used \u003ca href=\"https://www.gov.cn/jrzg/2008-12/08/content_1171885.htm\" target=\"_blank\"\u003esince the depths of the global financial crisis in 2008\u003c/a\u003e, when they loosened the stance and stuck with it until 2010.\u003c/p\u003e\u003cp\u003eThis is the first time the current leadership has acknowledged that monetary policy should be loose, setting the stage for \u0026#34;a new monetary easing cycle,\u0026#34; said Larry Hu, chief economist at Macquarie.\u003c/p\u003e\u003cp\u003e\u0026#34;Such a tone suggests that policymakers are deeply concerned about the economic outlook, given the sluggish domestic demand and the threat of another trade war,\u0026#34; Hu added.\u003c/p\u003e\u003cp\u003eDespite a flurry of stimulus measures since late September, recent economic indicators have showed the world\u0026#39;s second-largest economy is still struggling with deflationary pressures, amid tepid consumer demand and a prolonged housing downturn.\u003c/p\u003e\u003cp\u003e\u0026#34;Potential monetary easing leeway is much more limited than 15 years ago,\u0026#34; said Tao Wang, head of Asia economics and chief China economist at UBS Investment Bank, who expects \u0026#34;over 50 basis points policy rate cut\u0026#34; over the course of next two years.\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline0\"\u003e\u003c/a\u003ePolicy shift\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003eChinese government had unleashed a \u0026#34;historically large monetary stimulus in response to the global financial crisis,\u0026#34; Gabriel Wildau, managing director of Teneo said.\u003c/p\u003e\u003cp\u003eBeijing had \u003ca href=\"https://www.cnbc.com/2008/11/10/china-unveils-nearly-600-billion-stimulus-plan.html\"\u003eannounced a 4 trillion yuan ($586 billion)\u003c/a\u003e package in November 2008 — which was about \u003ca href=\"https://www.reuters.com/world/china/eyeing-us-election-china-considers-over-14-trillion-extra-debt-over-next-few-2024-10-29/\" target=\"_blank\"\u003e13% of China\u0026#39;s GDP at the time\u003c/a\u003e — to sustain growth and wean off the impact of the \u003ca href=\"https://www.reuters.com/article/world/world-leaders-urge-fast-action-on-financial-crisis-idUSTRE4AD7AK/\" target=\"_blank\"\u003eworst global economic downturn in over 70 years\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eWhen the authorities adopted the \u0026#34;moderately loose\u0026#34; policy stance in 2008, the People\u0026#39;s Bank of China \u003ca href=\"https://www.cls.cn/detail/1883629\" target=\"_blank\"\u003ecut its benchmark 1-year lending rate by a total of 156 basis points\u003c/a\u003e and the cash reserves ratio by 1.5 percentage points during the easing cycle, Ming Ming, a former official at the PBOC monetary policy department, told \u003ca href=\"https://www.eeo.com.cn/2024/1209/701680.shtml\" target=\"_blank\"\u003estate-backed media Economic Observer\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eLast month, China unveiled a five-year stimulus package \u003ca href=\"https://www.cnbc.com/2024/11/08/china-expected-to-announce-highly-anticipated-fiscal-stimulus-package.html\"\u003etotaling 10 trillion yuan to\u003c/a\u003e tackle local government debt problems, while indicating more economic support would follow next year. That was just about 2.5% of China\u0026#39;s annual GDP, Ting Lu, chief China economist at Nomura, said in October.\u003c/p\u003e\u003cp\u003eThe debt swap program needs to be significantly scaled up to offset the local government financial vehicle debt, which was nearly half of the size of country\u0026#39;s GDP, economists at Morgan Stanley said.\u003c/p\u003e\u003cp\u003eMorgan Stanley expects the central government fiscal deficit to widen by 1.4 percentage point next year, as the government borrows more to shore up the economy. China has kept its central government deficit target at 3% this year.\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline1\"\u003e\u003c/a\u003ePBOC constraints\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003eThe PBOC \u003ca href=\"https://www.cnbc.com/2024/09/20/china-unexpectedly-leaves-benchmark-lending-rates-unchanged-after-feds-jumbo-cut.html\"\u003ehas been cutting\u003c/a\u003e key interest rates since late September, after the U.S. Federal Reserve\u0026#39;s started its easing cycle with a large 50-basis-point cut in mid-September.\u003c/p\u003e\u003cp\u003eU.S. Fed rate cuts offered room for China to \u003ca href=\"https://www.cnbc.com/2024/09/20/china-unexpectedly-leaves-benchmark-lending-rates-unchanged-after-feds-jumbo-cut.html\"\u003elower its domestic borrowing costs\u003c/a\u003e without prompting a sharp decline in Chinese yuan. However, the PBOC has held back from more aggressive rate cuts over concerns of potential capital flight, if the gap between Chinese rates and those elsewhere grows wider.\u003c/p\u003e\u003c/div\u003e\u003cblockquote data-test=\"Pullquote\"\u003e\u003cdiv\u003e\u003cp\u003eSecuring the growth momentum would have higher priority than stabilizing the exchange rate.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eBruce Pang\u003c/p\u003e\u003cp\u003eChief economist, Greater China, JLL\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/blockquote\u003e\u003cdiv\u003e\u003cp\u003eThe tone from Monday\u0026#39;s Politburo meeting reinforced market\u0026#39;s expectation that the PBOC will likely cut key interest rates by 40 to 50 basis points to close to 1%, towards the end of 2025, Ju Wang, head of Greater China FX \u0026amp; rates strategy at BNP Paribas said in a note on Tuesday.\u003c/p\u003e\u003cp\u003eBets on further rate cuts have \u003ca href=\"https://www.cnbc.com/2024/12/02/china-bonds-rally-with-10-year-yield-hitting-a-multi-decade-low-on-rate-cut-expectations.html\"\u003efueled a prolonged rally\u003c/a\u003e in Chinese government bonds, pushing the 10-year benchmark yield to record lows on Tuesday.\u003c/p\u003e\u003cp\u003eWhile monetary easing might put depreciation pressure on the Chinese yuan, \u0026#34;securing the [economic] growth momentum would have higher priority than stabilizing the exchange rate,\u0026#34; Bruce Pang, chief economist of Greater China at JLL told CNBC.\u003c/p\u003e\u003cp\u003ePang expects the central bank to cut the reserve requirement ratio, or RRR, a key lever to adjust liquidity, within a month.\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline2\"\u003e\u003c/a\u003eNot a \u0026#39;bazooka\u0026#39;\u003c/h2\u003e\u003cp\u003eMore details on Beijing\u0026#39;s macro policy plans will be revealed at the annual economic work conference, that is reportedly underway and will end Thursday, UBS\u0026#39; Wang added.\u003c/p\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108072995\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000360322\" aria-labelledby=\"Placeholder-ArticleBody-Video-108072995\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108072996-17337386521733738649-37476348553-1080pnbcnews.jpg?v=1733738651\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"Chinese monetary policy will be reactive to uncertainty caused by Trump, says Barclays\u0026#39; Keller\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThat said, most of the key policy targets and details of stimulus measures will only be announced at the National People\u0026#39;s Congress next March, she added.\u003c/p\u003e\u003cp\u003eInvestors and economists are watching for any concrete policy follow-through, particularly on additional fiscal support and direct consumption incentives.\u003c/p\u003e\u003cp\u003eThe stronger language on Monday does not signal that \u0026#34;bazooka-style stimulus will arrive immediately,\u0026#34; Wildau said, who sees the top leaders to roll out new stimulus measures in an \u0026#34;incremental, data-dependent fashion, while keeping some ammunition in reserve\u0026#34; in response to potential U.S. tariffs next year.\u003c/p\u003e\u003cp\u003eReviving household consumption is a top priority for policymakers, Wang said, forecasting the government to more than double its trade-in program to over 300 billion yuan to incentivize domestic spending.\u003c/p\u003e\u003cp\u003eChina in July had \u003ca href=\"https://www.cnbc.com/2024/07/25/china-to-use-ultra-long-bonds-for-consumption-as-retail-sales-slump.html\"\u003eannounced allocation of 300 billion yuan\u003c/a\u003e ($41.5 billion) in ultra-long special government bonds to support the trade-in and equipment upgrade policy, in a bid to bolster consumer demand.\u003c/p\u003e\u003cp\u003eBeyond the trade-in program, existing fiscal stimulus package has placed little emphasis on boosting consumption, which is key to reflating the economy, Sunny Liu, lead economist at Oxford Economics said in a note on Wednesday, stressing that China will continue to face deflationary pressures in the near term.\u003c/p\u003e\u003cp\u003e\u003cem\u003eCNBC\u0026#39;s Evelyn Cheng contributed to this report.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-12-11T06:09:10Z",
  "modifiedTime": "2024-12-11T12:44:37Z"
}
