{
  "id": "691a9b74-6e2f-4452-930d-5664f65c8fc4",
  "title": "Gold Prices In US Hit New High After Trump's Bombshell Tariff Announcement",
  "link": "https://www.ndtv.com/world-news/stocks-slump-gold-hits-new-high-as-markets-react-to-trumps-bombshell-tariffs-8073876",
  "description": "Stocks slumped, bonds surged, and gold hit a new high as markets braced for the impact of US President Donald Trump's sweeping reciprocal tariffs on Thursday.",
  "author": "",
  "published": "Thu, 03 Apr 2025 06:09:57 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "Sanstuti Nath",
  "length": 4353,
  "excerpt": "Stocks slumped, bonds surged, and gold hit a new high as markets braced for the impact of US President Donald Trump\u0026#039;s sweeping reciprocal tariffs on Thursday.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Washington: Stocks slumped, bonds surged, and gold hit a new high as markets braced for the impact of US President Donald Trump's sweeping reciprocal tariffs on Thursday. Trump announced a baseline 10 per cent tariff on all imports with far higher levies on some trading partners, particularly in Asia.US stock futures were under pressure late on Wednesday following Trump's announcement. Australian blue-chip stocks opened in the red on Thursday, as one of the first global markets reacted to the development. Asia's markets were also set to slide as the bigger-than-expected wall of taxes was imposed around the world's largest economy, upending trade and supply chains. Stocks Take A DiveNasdaq futures slipped 4 per cent, with tech on the front line after China, a significant manufacturing hub, was hit with a 34 per cent levy on top of a previous 20 per cent tariff. Apple shares were down nearly 7 per cent in after-hours trade.S\u0026P 500 futures tumbled 3.3 per cent and Nikkei futures dropped more than 4 per cent. The US dollar was, meanwhile, higher in rollercoaster currency trade, except against the safe-haven yen, which surged to 148.15 per dollar.Australian blue-chip stocks dipped nearly two percent. A benchmark index of the country's largest 200 listed companies dropped 1.96 percent 20 minutes after opening, as traders came to grips with 10 percent US tariffs on Australian exports.The energy and financial services sectors were among the hardest hit on the ASX200 index, shedding more than two percent.In a press conference announcing the global tariffs, Trump singled out Australia's beef industry. Tokyo's key Nikkei index fell more than three percent at the open on Thursday after Trump imposed 24 per cent tariffs on Japan. The benchmark Nikkei 225 index was down 3.42 percent, or 1,222.77 points, at 34,503.10 in early trade, while the broader Topix index was down 3.32 percent, or 87.93 points, at 2,562.36.Van Eck's Vietnam ETF also fell more than 8 per cent in after-hours trade.Gold Hits New RecordThe price of gold hit a new record after President Trump's announcement of sweeping new tariffs. Gold crossed the previous record at around 2300 GMT and then continued to climb above $3,150 an ounce, as traders piled into the safe haven asset amid a steep decline in stock market futures.Oil Prices FallOil prices fell to negative territory after rising by a dollar in post-settlement trade on Wednesday as Trump announced reciprocal tariffs on trading partners, stoking concerns that a global trade war may dampen demand for crude. Brent futures settled 46 cents higher, or 0.6 per cent, at $74.95 a barrel, while U.S. West Texas Intermediate crude futures gained 51 cents, or 0.7 per cent, to settle at $71.71. Trump's TariffsUS President Trump on Wednesday unveiled a raft of punishing tariffs targeting countries around the world, including some of its closest trading partners, in a move that risks sparking a ruinous trade war. He announced a baseline 10 per cent tariff on imports and reserved some of the heaviest blows for what he called the \"nations that treat us badly,\" including 34 percent on goods from superpower rival China, 20 percent on key ally the European Union and 24 percent on Japan.Besides China's 34 per cent tax, India got a 26 per cent, Vietnam 46  per cent and South Korea 25  per cent. The European Union was hit with a 20  per cent levy.Trump also shut a loophole used to ship low-value packages from China, which is likely to hurt China's giant online retailers.But the 78-year-old Republican -- who held up a chart with a list of levies -- said that he was \"very kind\" and so was only imposing half the amount that those countries taxed US exports.Trading partners are expected to respond with countermeasures of their own that could lead to dramatically higher prices.\"We would characterise this slate of tariffs as 'worse than the worst case scenario' the Street was fearing,\" said analysts at Wedbush, with the technology supply chain in Taiwan and China hit hard.U.S. interest rate futures leapt as investors priced in slowing US growth and a higher chance of rate cuts.\"The tariff rates unveiled this morning far exceed baseline expectations, and if they aren't negotiated down promptly, expectations for a recession in the US will rise dramatically,\" said IG market analyst Tony Sycamore.",
  "image": "https://c.ndtvimg.com/2025-04/sise8vl_market-trump-tariffs_625x300_03_April_25.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                \u003cp\u003e\u003cb\u003eWashington: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eStocks slumped, bonds surged, and gold hit a new high as markets braced for the impact of US President Donald Trump\u0026#39;s sweeping reciprocal tariffs on Thursday. Trump announced a baseline 10 per cent tariff on all imports with far higher levies on some trading partners, particularly in Asia.\u003c/p\u003e\u003cp\u003eUS stock futures were under pressure late on Wednesday following Trump\u0026#39;s announcement. Australian blue-chip stocks opened in the red on Thursday, as one of the first global markets reacted to the development. Asia\u0026#39;s markets were also set to slide as the bigger-than-expected wall of taxes was imposed around the world\u0026#39;s largest economy, upending trade and supply chains. \u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eStocks Take A Dive\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eNasdaq futures slipped 4 per cent, with tech on the front line after China, a significant manufacturing hub, was hit with a 34 per cent levy on top of a previous 20 per cent tariff. Apple shares were down nearly 7 per cent in after-hours trade.\u003c/p\u003e\u003cp\u003eS\u0026amp;P 500 futures tumbled 3.3 per cent and Nikkei futures dropped more than 4 per cent. The US dollar was, meanwhile, higher in rollercoaster currency trade, except against the safe-haven yen, which surged to 148.15 per dollar.\u003c/p\u003e\u003cp\u003eAustralian blue-chip stocks dipped nearly two percent. A benchmark index of the country\u0026#39;s largest 200 listed companies dropped 1.96 percent 20 minutes after opening, as traders came to grips with 10 percent US tariffs on Australian exports.\u003c/p\u003e\u003cp\u003eThe energy and financial services sectors were among the hardest hit on the ASX200 index, shedding more than two percent.\u003c/p\u003e\u003cp\u003eIn a press conference announcing the global tariffs, Trump singled out Australia\u0026#39;s beef industry. \u003c/p\u003e\u003cp\u003eTokyo\u0026#39;s key Nikkei index fell more than three percent at the open on Thursday after Trump imposed 24 per cent tariffs on Japan. The benchmark Nikkei 225 index was down 3.42 percent, or 1,222.77 points, at 34,503.10 in early trade, while the broader Topix index was down 3.32 percent, or 87.93 points, at 2,562.36.\u003c/p\u003e\u003cp\u003eVan Eck\u0026#39;s Vietnam ETF also fell more than 8 per cent in after-hours trade.\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eGold Hits New Record\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eThe price of gold hit a new record after President Trump\u0026#39;s announcement of sweeping new tariffs. Gold crossed the previous record at around 2300 GMT and then continued to climb above $3,150 an ounce, as traders piled into the safe haven asset amid a steep decline in stock market futures.\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eOil Prices Fall\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eOil prices fell to negative territory after rising by a dollar in post-settlement trade on Wednesday as Trump announced reciprocal tariffs on trading partners, stoking concerns that a global trade war may dampen demand for crude. Brent futures settled 46 cents higher, or 0.6 per cent, at $74.95 a barrel, while U.S. West Texas Intermediate crude futures gained 51 cents, or 0.7 per cent, to settle at $71.71. \u003c/p\u003e\u003ch3\u003e\u003cstrong\u003eTrump\u0026#39;s Tariffs\u003c/strong\u003e\u003c/h3\u003e\u003cp\u003eUS President Trump on Wednesday unveiled a raft of punishing tariffs targeting countries around the world, including some of its closest trading partners, in a move that risks sparking a ruinous trade war. He announced a baseline 10 per cent tariff on imports and reserved some of the heaviest blows for what he called the \u0026#34;nations that treat us badly,\u0026#34; including 34 percent on goods from superpower rival China, 20 percent on key ally the European Union and 24 percent on Japan.\u003c/p\u003e\u003cp\u003eBesides China\u0026#39;s 34 per cent tax, India got a 26 per cent, Vietnam 46  per cent and South Korea 25  per cent. The European Union was hit with a 20  per cent levy.\u003c/p\u003e\u003cp\u003eTrump also shut a loophole used to ship low-value packages from China, which is likely to hurt China\u0026#39;s giant online retailers.\u003c/p\u003e\u003cp\u003eBut the 78-year-old Republican -- who held up a chart with a list of levies -- said that he was \u0026#34;very kind\u0026#34; and so was only imposing half the amount that those countries taxed US exports.\u003c/p\u003e\u003cp\u003eTrading partners are expected to respond with countermeasures of their own that could lead to dramatically higher prices.\u003c/p\u003e\u003cp\u003e\u0026#34;We would characterise this slate of tariffs as \u0026#39;worse than the worst case scenario\u0026#39; the Street was fearing,\u0026#34; said analysts at Wedbush, with the technology supply chain in Taiwan and China hit hard.\u003c/p\u003e\u003cp\u003eU.S. interest rate futures leapt as investors priced in slowing US growth and a higher chance of rate cuts.\u003c/p\u003e\u003cp\u003e\u0026#34;The tariff rates unveiled this morning far exceed baseline expectations, and if they aren\u0026#39;t negotiated down promptly, expectations for a recession in the US will rise dramatically,\u0026#34; said IG market analyst Tony Sycamore.\u003cbr/\u003e \u003c/p\u003e                                        \n                                        \n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-03T06:09:57+05:30",
  "modifiedTime": null
}
