{
  "id": "6acad201-348d-4f0e-b331-75b0d41d44ed",
  "title": "US agencies told to fire diversity staff; gender-neutral 'X' passports stopped",
  "link": "https://timesofindia.indiatimes.com/world/us/us-agencies-told-to-fire-diversity-staff-gender-neutral-x-passports-stopped/articleshow/117567395.cms",
  "description": "The Trump administration has directed federal agencies to terminate diversity programme staff within 60 days. The move includes halting the issuance of gender-neutral 'X' passports and scaling back environmental justice roles. Kristi Noem has been confirmed as homeland security secretary, tasked with enhancing border security and immigration enforcement.",
  "author": "",
  "published": "2025-01-26T05:34:29+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "AFP",
  "length": 2015,
  "excerpt": "The Trump administration has directed federal agencies to terminate diversity programme staff within 60 days. The move includes halting the issuance o",
  "siteName": "Times Of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "The Trump administration on Friday directed federal agencies to start terminating staffers working in positions related to diversity programmes, after placing them on paid leave earlier this week. \"Each agency, department, or commission head shall take action to terminate, to the maximum extent allowed by law, all DEI, DEIA, and 'environmental justice' offices and positions within 60 days,\" said a memo from the US Office of Personnel Management, referring to jobs aimed at boosting \"diversity, inclusion and accessibility.\"Earlier this week Trump had ordered govt agency heads to submit a written plan for reducing employees in DEI offices by Friday. The reference to environmental justice is new, however.The state department said the US has ceased issuing passports with a gender-neutral 'X' option, following President Donald Trump's order limiting government recognition of transgender identity.The move rolls back the option first introduced under former president Joe Biden's administration and leaves an unknown number of people awaiting further guidance on the fate of their pending applications and already issued passports. Trump, shortly after taking office on Monday, signed an executive order requiring federal agencies to only give the option of male or female, as part of an array of actions aimed at quickly reversing policies enacted by his predecessor.On Saturday, the Senate confirmed Kristi Noem as homeland security secretary, putting the South Dakota governor in charge of a sprawling agency that is essential to national security and Trump's plans to clamp down on illegal immigration. Noem, a Trump ally who is in her second term as governor, received some support from Democrats on the Senate Homeland Security and Governmental Affairs Committee when it voted 13-2 to advance her nomination earlier in the week. Republicans, who already hold the votes necessary to confirm her, have also expressed confidence in her determination to lead border security and immigration enforcement. afp",
  "image": "https://static.toiimg.com/thumb/msid-117567399,width-1070,height-580,imgsize-709384,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-117567399,imgsize-709384,width-400,resizemode-4/117567399.jpg\" alt=\"US agencies told to fire diversity staff; gender-neutral \u0026#39;X\u0026#39; passports stopped\" title=\".\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe Trump administration on Friday directed federal agencies to start terminating staffers working in positions related to diversity programmes, after placing them on paid leave earlier this week. \u0026#34;Each agency, department, or commission head shall take action to terminate, to the maximum extent allowed by law, all DEI, DEIA, and \u0026#39;environmental justice\u0026#39; offices and positions within 60 days,\u0026#34; said a memo from the US Office of Personnel Management, referring to jobs aimed at boosting \u0026#34;diversity, inclusion and accessibility.\u0026#34;\u003cbr/\u003eEarlier this week Trump had ordered govt agency heads to submit a written plan for reducing employees in DEI offices by Friday. The reference to environmental justice is new, however.\u003c/p\u003e\u003cdiv data-pos=\"0\"\u003e\u003cp\u003e\u003cimg alt=\".\" msid=\"117567408\" width=\"600\" title=\"\" placeholdersrc=\"https://static.toiimg.com/photo/83033472.cms\" imgsize=\"23456\" resizemode=\"4\" offsetvertical=\"0\" placeholdermsid=\"\" type=\"thumb\" src=\"https://static.toiimg.com/photo/83033472.cms\" data-src=\"https://static.toiimg.com/thumb/imgsize-23456,msid-117567408,width-600,resizemode-4/117567408.jpg\" data-api-prerender=\"true\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe state department said the US has ceased issuing passports with a gender-neutral \u0026#39;X\u0026#39; option, following President Donald Trump\u0026#39;s order limiting government recognition of transgender identity.\u003c/p\u003e\u003cp\u003eThe move rolls back the option first introduced under former president Joe Biden\u0026#39;s administration and leaves an unknown number of people awaiting further guidance on the fate of their pending applications and already issued passports. Trump, shortly after taking office on Monday, signed an executive order requiring federal agencies to only give the option of male or female, as part of an array of actions aimed at quickly reversing policies enacted by his predecessor.\u003cbr/\u003eOn Saturday, the Senate confirmed Kristi Noem as homeland security secretary, putting the South Dakota governor in charge of a sprawling agency that is essential to national security and Trump\u0026#39;s plans to clamp down on illegal immigration. Noem, a Trump ally who is in her second term as governor, received some support from Democrats on the Senate Homeland Security and Governmental Affairs Committee when it voted 13-2 to advance her nomination earlier in the week. Republicans, who already hold the votes necessary to confirm her, have also expressed confidence in her determination to lead border security and immigration enforcement. afp\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-26T05:34:00+05:30",
  "modifiedTime": null
}
