{
  "id": "770e4cbe-eb1e-4c24-898f-cdbc566e7a3f",
  "title": "Trump Privately Approved Attack Plans For Iran Pending Final Order: Report",
  "link": "https://www.ndtv.com/world-news/donald-trump-privately-approved-attack-plans-for-iran-pending-final-order-report-8703965#publisher=newsstand",
  "description": "U.S. President Donald Trump told senior aides late Tuesday that he approved attack plans for Iran but has withheld a final order to see if Tehran would abandon its nuclear program, the Wall Street Journal reported on Wednesday.",
  "author": "",
  "published": "Thu, 19 Jun 2025 04:42:19 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "",
  "length": 7110,
  "excerpt": "US.President Donald Trump told senior aides late Tuesday that he approved attack plans for Iran but has withheld a final order to see if Tehran would abandon its nuclear program, the Wall Street Journal reported on Wednesday.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Washington: President Donald Trump kept the world guessing about whether the United States will join Israel's bombardment of Iranian nuclear sites as the Israel-Iran conflict entered its seventh day on Thursday.Speaking to reporters outside the White House, Trump declined to say if he had made any decision on whether to join Israel's campaign. \"I may do it. I may not do it. I mean, nobody knows what I'm going to do,\" he said.Trump in later remarks said Iranian officials wanted to come to Washington for a meeting and that \"we may do that.\" But he added, \"It's a little late\" for such talks.The foreign ministers of Germany, France and Britain plan to hold nuclear talks with their Iranian counterpart on Friday in Geneva aimed at persuading Iran to firmly guarantee that it will use its nuclear program solely for civilian purposes, a German diplomatic source told Reuters.But while diplomatic efforts continue, some residents of Tehran, a city of 10 million people, on Wednesday jammed highways out of the city as they sought sanctuary from intensified Israeli airstrikes.The Wall Street Journal said Trump had told senior aides he approved attack plans on Iran but was holding off on giving the final order to see if Tehran would abandon its nuclear program.Asked if he thought the Iranian government could fall as a result of the Israeli campaign, Trump said: \"Sure, anything could happen.\"Referring to the destruction or dismantling of Iran's Fordow nuclear enrichment center, Trump said: \"We're the only ones that have the capability to do it. But that doesn't mean I'm going to do it - at all.\"Military analysts believe that Israel might need U.S. military help to destroy Fordow, dug beneath a mountain near the city of Qom.Iranian Supreme Leader Ayatollah Ali Khamenei, 86, rebuked Trump in a recorded speech played on television, his first appearance since Friday.The Americans \"should know that any U.S. military intervention will undoubtedly be accompanied by irreparable damage,\" he said. \"The Iranian nation will not surrender.\"In its latest bombings, Israel said its air force destroyed Iran's police headquarters.Israel's military said sirens sounded in northern Israel just before 2 a.m. local time on Thursday (23:00 GMT on Wednesday) and that it had intercepted a drone launched from Iran. It said several minutes later that another drone was intercepted in the Jordan Valley area.The Iranian missile salvoes mark the first time in decades of shadow war and proxy conflict that a significant number of projectiles fired from Iran have penetrated defences, killing Israelis in their homes.Israeli Prime Minister Benjamin Netanyahu, in a video released by his office on Wednesday, said Israel was \"progressing step by step\" towards eliminating threats posed by Iran's nuclear sites and ballistic missile arsenal.\"We are hitting the nuclear sites, the missiles, the headquarters, the symbols of the regime,\" Netanyahu said.Israel, which is not a party to the international Non-Proliferation Treaty, is the only country in the Middle East believed to have nuclear weapons. Israel does not deny or confirm that.Netanyahu also thanked Trump, \"a great friend of the state of Israel\", for standing by its side in the conflict, saying the two were in continuous contact.Trump has veered from proposing a swift diplomatic end to the war to suggesting the United States might join it.In social media posts on Tuesday, he mused about killing Khamenei.Russian President Vladimir Putin, asked what his reaction would be if Israel did kill Iran's Supreme Leader with the assistance of the United States, said on Thursday: \"I do not even want to discuss this possibility. I do not want to.\"A source familiar with internal discussions said Trump and his team were considering options that included joining Israel in strikes against Iranian nuclear installations.Iran's mission to the United Nations mocked Trump in posts on X, describing him as \"a has-been warmonger clinging to relevance.\"Israel's military said scores of Israeli jets had struck targets in and around Tehran and in western Iran in the previous 24 hours in three waves, hitting sites producing raw materials, components and manufacturing systems for missiles.Fleeing TehranArezou, a 31-year-old Tehran resident, told Reuters by phone that she had made it out of the city to the nearby resort town of Lavasan.\"My friend's house in Tehran was attacked and her brother was injured. They are civilians,\" she said. \"Why are we paying the price for the regime's decision to pursue a nuclear programme?\"In Israel, sirens rang out anew at dusk on Wednesday warning of further incoming Iranian missiles. A motorist was injured by missile debris, Israeli medics said. The army later advised civilians they could leave protected areas, signalling the threat had passed.At Ramat Gan train station east of Tel Aviv, people were lying on city-supplied mattresses or sitting in the odd camping chair, with plastic water bottles strewn about.\"I feel scared, overwhelmed. Especially because I live in a densely populated area that Iran seems to be targeting, and our city has very old buildings, without shelters and safe spaces,\" said Tamar Weiss, clutching her four-month-old daughter.Iran has reported at least 224 deaths in Israeli attacks, mostly civilians, but has not updated that toll for days.Since Friday, Iran has fired around 400 missiles at Israel, some 40 of which have pierced air defences, killing 24 people, all of them civilians, according to Israeli authorities.LeverageIran has been exploring options for leverage, including veiled threats to hit the global oil market by restricting access to the Gulf through the Strait of Hormuz, the world's most important shipping artery for oil.Inside Iran, authorities are intent on preventing panic and shortages. Fewer images of destruction have been allowed to circulate than in the early days of the bombing, when state media showed pictures of explosions, fires and flattened apartments. A ban on filming by the public has been imposed.The communications ministry said on Wednesday that temporary restrictions on internet access would be imposed to help prevent \"the enemy from threatening citizens' lives and property\".Iran's ability to hit back hard at Israel through strikes by proxy militia close to Israeli borders has been limited by the devastating blows Israel has dealt to Tehran's regional allies - Hamas and Hezbollah - in conflicts in Gaza and Lebanon since 2023.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Featured Video Of The Day \"Biggest Error Would Be To...\": What Macron Said on Army Action Against Iran",
  "image": "https://c.ndtvimg.com/2025-06/3pa6c0lc_donald-trump-reuters_625x300_19_June_25.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                        \n                                                                                \u003cp\u003e\u003cb\u003eWashington: \u003c/b\u003e\u003c/p\u003e\u003cp\u003ePresident Donald Trump kept the world guessing about whether the United States will join Israel\u0026#39;s bombardment of Iranian nuclear sites as the Israel-Iran conflict entered its seventh day on Thursday.\u003c/p\u003e\u003cp\u003eSpeaking to reporters outside the White House, Trump declined to say if he had made any decision on whether to join Israel\u0026#39;s campaign. \u0026#34;I may do it. I may not do it. I mean, nobody knows what I\u0026#39;m going to do,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eTrump in later remarks said Iranian officials wanted to come to Washington for a meeting and that \u0026#34;we may do that.\u0026#34; But he added, \u0026#34;It\u0026#39;s a little late\u0026#34; for such talks.\u003c/p\u003e\u003cp\u003eThe foreign ministers of Germany, France and Britain plan to hold nuclear talks with their Iranian counterpart on Friday in Geneva aimed at persuading Iran to firmly guarantee that it will use its nuclear program solely for civilian purposes, a German diplomatic source told Reuters.\u003c/p\u003e\u003cp\u003eBut while diplomatic efforts continue, some residents of Tehran, a city of 10 million people, on Wednesday jammed highways out of the city as they sought sanctuary from intensified Israeli airstrikes.\u003c/p\u003e\u003cp\u003eThe Wall Street Journal said Trump had told senior aides he approved attack plans on Iran but was holding off on giving the final order to see if Tehran would abandon its nuclear program.\u003c/p\u003e\u003cp\u003eAsked if he thought the Iranian government could fall as a result of the Israeli campaign, Trump said: \u0026#34;Sure, anything could happen.\u0026#34;\u003c/p\u003e\u003cp\u003eReferring to the destruction or dismantling of Iran\u0026#39;s Fordow nuclear enrichment center, Trump said: \u0026#34;We\u0026#39;re the only ones that have the capability to do it. But that doesn\u0026#39;t mean I\u0026#39;m going to do it - at all.\u0026#34;\u003c/p\u003e\u003cp\u003eMilitary analysts believe that Israel might need U.S. military help to destroy Fordow, dug beneath a mountain near the city of Qom.\u003c/p\u003e\u003cp\u003eIranian Supreme Leader Ayatollah Ali Khamenei, 86, rebuked Trump in a recorded speech played on television, his first appearance since Friday.\u003c/p\u003e\u003cp\u003eThe Americans \u0026#34;should know that any U.S. military intervention will undoubtedly be accompanied by irreparable damage,\u0026#34; he said. \u0026#34;The Iranian nation will not surrender.\u0026#34;\u003c/p\u003e\u003cp\u003eIn its latest bombings, Israel said its air force destroyed Iran\u0026#39;s police headquarters.\u003c/p\u003e\u003cp\u003eIsrael\u0026#39;s military said sirens sounded in northern Israel just before 2 a.m. local time on Thursday (23:00 GMT on Wednesday) and that it had intercepted a drone launched from Iran. It said several minutes later that another drone was intercepted in the Jordan Valley area.\u003c/p\u003e\u003cp\u003eThe Iranian missile salvoes mark the first time in decades of shadow war and proxy conflict that a significant number of projectiles fired from Iran have penetrated defences, killing Israelis in their homes.\u003c/p\u003e\u003cp\u003eIsraeli Prime Minister Benjamin Netanyahu, in a video released by his office on Wednesday, said Israel was \u0026#34;progressing step by step\u0026#34; towards eliminating threats posed by Iran\u0026#39;s nuclear sites and ballistic missile arsenal.\u003c/p\u003e\u003cp\u003e\u0026#34;We are hitting the nuclear sites, the missiles, the headquarters, the symbols of the regime,\u0026#34; Netanyahu said.\u003c/p\u003e\u003cp\u003eIsrael, which is not a party to the international Non-Proliferation Treaty, is the only country in the Middle East believed to have nuclear weapons. Israel does not deny or confirm that.\u003c/p\u003e\u003cp\u003eNetanyahu also thanked Trump, \u0026#34;a great friend of the state of Israel\u0026#34;, for standing by its side in the conflict, saying the two were in continuous contact.\u003c/p\u003e\u003cp\u003eTrump has veered from proposing a swift diplomatic end to the war to suggesting the United States might join it.\u003c/p\u003e\u003cp\u003eIn social media posts on Tuesday, he mused about killing Khamenei.\u003c/p\u003e\u003cp\u003eRussian President Vladimir Putin, asked what his reaction would be if Israel did kill Iran\u0026#39;s Supreme Leader with the assistance of the United States, said on Thursday: \u0026#34;I do not even want to discuss this possibility. I do not want to.\u0026#34;\u003c/p\u003e\u003cp\u003eA source familiar with internal discussions said Trump and his team were considering options that included joining Israel in strikes against Iranian nuclear installations.\u003c/p\u003e\u003cp\u003eIran\u0026#39;s mission to the United Nations mocked Trump in posts on X, describing him as \u0026#34;a has-been warmonger clinging to relevance.\u0026#34;\u003c/p\u003e\u003cp\u003eIsrael\u0026#39;s military said scores of Israeli jets had struck targets in and around Tehran and in western Iran in the previous 24 hours in three waves, hitting sites producing raw materials, components and manufacturing systems for missiles.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFleeing Tehran\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eArezou, a 31-year-old Tehran resident, told Reuters by phone that she had made it out of the city to the nearby resort town of Lavasan.\u003c/p\u003e\u003cp\u003e\u0026#34;My friend\u0026#39;s house in Tehran was attacked and her brother was injured. They are civilians,\u0026#34; she said. \u0026#34;Why are we paying the price for the regime\u0026#39;s decision to pursue a nuclear programme?\u0026#34;\u003c/p\u003e\u003cp\u003eIn Israel, sirens rang out anew at dusk on Wednesday warning of further incoming Iranian missiles. A motorist was injured by missile debris, Israeli medics said. The army later advised civilians they could leave protected areas, signalling the threat had passed.\u003c/p\u003e\u003cp\u003eAt Ramat Gan train station east of Tel Aviv, people were lying on city-supplied mattresses or sitting in the odd camping chair, with plastic water bottles strewn about.\u003c/p\u003e\u003cp\u003e\u0026#34;I feel scared, overwhelmed. Especially because I live in a densely populated area that Iran seems to be targeting, and our city has very old buildings, without shelters and safe spaces,\u0026#34; said Tamar Weiss, clutching her four-month-old daughter.\u003c/p\u003e\u003cp\u003eIran has reported at least 224 deaths in Israeli attacks, mostly civilians, but has not updated that toll for days.\u003c/p\u003e\u003cp\u003eSince Friday, Iran has fired around 400 missiles at Israel, some 40 of which have pierced air defences, killing 24 people, all of them civilians, according to Israeli authorities.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eLeverage\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eIran has been exploring options for leverage, including veiled threats to hit the global oil market by restricting access to the Gulf through the Strait of Hormuz, the world\u0026#39;s most important shipping artery for oil.\u003c/p\u003e\u003cp\u003eInside Iran, authorities are intent on preventing panic and shortages. Fewer images of destruction have been allowed to circulate than in the early days of the bombing, when state media showed pictures of explosions, fires and flattened apartments. A ban on filming by the public has been imposed.\u003c/p\u003e\u003cp\u003eThe communications ministry said on Wednesday that temporary restrictions on internet access would be imposed to help prevent \u0026#34;the enemy from threatening citizens\u0026#39; lives and property\u0026#34;.\u003c/p\u003e\u003cp\u003eIran\u0026#39;s ability to hit back hard at Israel through strikes by proxy militia close to Israeli borders has been limited by the devastating blows Israel has dealt to Tehran\u0026#39;s regional allies - Hamas and Hezbollah - in conflicts in Gaza and Lebanon since 2023.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                                                                \n                                                                                \n                                                                                \u003cdiv\u003e\n                                                    \u003cp\u003eFeatured Video Of The Day\u003c/p\u003e\n                                                    \n                                                    \u003cp\u003e\u0026#34;Biggest Error Would Be To...\u0026#34;: What Macron Said on Army Action Against Iran\u003c/p\u003e\n\n                                                \u003c/div\u003e\n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": null,
  "modifiedTime": null
}
