{
  "id": "778297d3-0535-4020-ae77-b0a2eb1720a9",
  "title": "Trump-Musk feud: Democrats call for release of Epstein file; say 'kill the bill' after Tesla CEO’s allegation",
  "link": "https://timesofindia.indiatimes.com/world/us/trump-musk-feud-democrats-call-for-release-of-epstein-file-say-kill-the-bill-after-tesla-ceos-allegation/articleshow/121661193.cms",
  "description": "Elon Musk ignited a political firestorm by alleging Donald Trump's presence in the unreleased Epstein files, prompting Democrats to demand their release amidst a growing feud between Musk and Trump over government legislation. The files, linked to Jeffrey Epstein's activities, have already revealed Trump's past associations, including flights on Epstein's private plane.",
  "author": "TOI World Desk",
  "published": "2025-06-06T05:45:06+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 3447,
  "excerpt": "US News: Elon Musk ignited a political firestorm by alleging Donald Trump's presence in the unreleased Epstein files, prompting Democrats to demand their relea",
  "siteName": "Times of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "Democrats demanded the release of Jeffrey Epstein's file after Tesla CEO and Doge's former chief, Elon Musk, dropped the bomb, making a striking allegation against US President Donald Trump.In a post on X, the Democrats, taking advantage of the Trump-Musk feud, have demanded to kill the \"One Big Beautiful Bill\" and release the Epstein file.Musk drops bomb, says Trump name in Epstein filesElon Musk Thursday alleged that Trump's name is in the Epstein Files and that's the reason why the administration is not releasing the list.In a post on his own platform X, Musk wrote, “Time to drop the really big bomb: @realDonaldTrump is in the Epstein files. That is the real reason they have not been made public. Have a nice day, DJT!”\"Mark this post for the future. The truth will come out,\" he further added.In his post, Musk's 'big bomb' allegations is something different, not just casual or social association, though Tesla CEO did not provide any insight into his claim. It seems that he hints that more truths about Epstein and Trump's associations are in the unreleased files.What are the Epstein files?Epstein files encompass numerous court documents, particularly court records, connected to Jeffrey Epstein, a financial executive and convicted sex offender who passed away in 2019. These records, predominantly from Virginia Giuffre's 2015 defamation case against Ghislaine Maxwell, an Epstein associate, contain flight records, witness statements, contact directories and additional evidence linked to Epstein's conduct. The files identify several prominent individuals who maintained social, professional or other connections with Epstein.The presence of names in these documents does not automatically suggest misconduct, as numerous individuals encountered Epstein in casual social settings.The US Department of Justice, under Attorney General Pam Bondi, has disclosed these documents progressively, with substantial portions made public in January 2024 and February 2025.Is Trump's name there in Epstein files?This is not a hidden fact that Trump's name is in these documents, particularly within flight manifests of Epstein's private aircraft, the \"Lolita Express.\" Documentation shows Trump travelled on this aircraft seven times during 1993-1997, predominantly between Palm Beach, Florida, and New York City. These journeys included his former spouse Marla Maples, their daughter Tiffany, a nanny, whilst Jeffrey Epstein was listed amongst passengers on several occasions.Epstein accuser Johanna Sjoberg's statement references an occurrence in 2001 when Epstein's aircraft was redirected to Atlantic City, whereupon Epstein proposed visiting one of Trump's gambling establishments. Trump's details appear in Epstein's contact directory alongside other notable individuals including Ivana Trump and Mick Jagger. In a 2002 interview, Trump described Epstein as a 'terrific' guy, though he subsequently separated himself from association following the emergence of accusations against Epstein.Feud between Musk and TrumpTrump and Musk, once political allies, are now embroiled in a public feud sparked by disagreements over the government’s 'ne Big Beautiful' bill. Musk sharply criticised the legislation, calling it “a disgusting abomination” and urging Americans to “kill the bill.” In response, Trump expressed his disappointment, claiming he had cut Musk out of key EV policy decisions and stripped him of influence in Washington.",
  "image": "https://static.toiimg.com/thumb/msid-121661644,width-1070,height-580,imgsize-106672,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-121661644,imgsize-106672,width-400,resizemode-4/121661644.jpg\" alt=\"Trump-Musk feud: Democrats call for release of Epstein file; say \u0026#39;kill the bill\u0026#39; after Tesla CEO’s allegation\" title=\"Danny generated AI Image\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eDemocrats demanded the release of Jeffrey Epstein\u0026#39;s file after Tesla CEO and Doge\u0026#39;s former chief, Elon Musk, dropped the bomb, making a striking allegation against US President Donald Trump.\u003cspan data-pos=\"2\"\u003e\u003c/span\u003eIn a post on X, the Democrats, taking advantage of the Trump-Musk feud, have demanded to kill the \u0026#34;One Big Beautiful Bill\u0026#34; and release the Epstein file.\u003cspan data-pos=\"4\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp data-pos=\"7\"\u003e\u003ch3\u003eMusk drops bomb, says Trump name in Epstein files\u003cbr/\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"8\"\u003e\u003c/span\u003eElon Musk Thursday alleged that Trump\u0026#39;s name is in the Epstein Files and that\u0026#39;s the reason why the administration is not releasing the list.\u003cspan data-pos=\"10\"\u003e\u003c/span\u003eIn a post on his own platform X, Musk wrote, “Time to drop the really big bomb: @realDonaldTrump is in the Epstein files. That is the real reason they have not been made public. Have a nice day, DJT!”\u003cspan data-pos=\"12\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"14\"\u003e\u003c/span\u003e\u0026#34;Mark this post for the future. The truth will come out,\u0026#34; he further added.\u003cspan data-pos=\"18\"\u003e\u003c/span\u003eIn his post, Musk\u0026#39;s \u0026#39;big bomb\u0026#39; allegations is something different, not just casual or social association, though Tesla CEO did not provide any insight into his claim. It seems that he hints that more truths about Epstein and Trump\u0026#39;s associations are in the unreleased files.\u003cspan data-pos=\"20\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp data-pos=\"21\"\u003e\u003ch3\u003eWhat are the Epstein files?\u003cbr/\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003eEpstein files encompass numerous court documents, particularly court records, connected to Jeffrey Epstein, a financial executive and convicted sex offender who passed away in 2019. \u003c/p\u003e\u003cp\u003eThese records, predominantly from Virginia Giuffre\u0026#39;s 2015 defamation case against Ghislaine Maxwell, an Epstein associate, contain flight records, witness statements, contact directories and additional evidence linked to Epstein\u0026#39;s conduct. The files identify several prominent individuals who maintained social, professional or other connections with Epstein.\u003cspan data-pos=\"26\"\u003e\u003c/span\u003eThe presence of names in these documents does not automatically suggest misconduct, as numerous individuals encountered Epstein in casual social settings.\u003cspan data-pos=\"29\"\u003e\u003c/span\u003eThe US Department of Justice, under Attorney General Pam Bondi, has disclosed these documents progressively, with substantial portions made public in January 2024 and February 2025.\u003cspan data-pos=\"31\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp data-pos=\"32\"\u003e\u003ch3\u003eIs Trump\u0026#39;s name there in Epstein files?\u003cbr/\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003eThis is not a hidden fact that Trump\u0026#39;s name is in these documents, particularly within flight manifests of Epstein\u0026#39;s private aircraft, the \u0026#34;Lolita Express.\u0026#34; Documentation shows Trump travelled on this aircraft seven times during 1993-1997, predominantly between Palm Beach, Florida, and New York City. \u003cspan data-pos=\"35\"\u003e\u003c/span\u003eThese journeys included his former spouse Marla Maples, their daughter Tiffany, a nanny, whilst Jeffrey Epstein was listed amongst passengers on several occasions.\u003cspan data-pos=\"37\"\u003e\u003c/span\u003eEpstein accuser Johanna Sjoberg\u0026#39;s statement references an occurrence in 2001 when Epstein\u0026#39;s aircraft was redirected to Atlantic City, whereupon Epstein proposed visiting one of Trump\u0026#39;s gambling establishments. Trump\u0026#39;s details appear in Epstein\u0026#39;s contact directory alongside other notable individuals including Ivana Trump and Mick Jagger. \u003cspan data-pos=\"40\"\u003e\u003c/span\u003eIn a 2002 interview, Trump described Epstein as a \u0026#39;terrific\u0026#39; guy, though he subsequently separated himself from association following the emergence of accusations against Epstein.\u003cspan data-pos=\"42\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp data-pos=\"43\"\u003e\u003ch3\u003eFeud between Musk and Trump\u003cbr/\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"44\"\u003e\u003c/span\u003eTrump and Musk, once political allies, are now embroiled in a public feud sparked by disagreements over the government’s \u0026#39;ne Big Beautiful\u0026#39; bill. Musk sharply criticised the legislation, calling it “a disgusting abomination” and urging Americans to “kill the bill.” In response, Trump expressed his disappointment, claiming he had cut Musk out of key EV policy decisions and stripped him of influence in Washington.\u003cspan data-pos=\"46\"\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-06T05:45:00+05:30",
  "modifiedTime": null
}
