{
  "id": "799cdcf6-8465-4ce7-866f-38a9ddbb903b",
  "title": "Tesla shares drop on plunging European sales, concerns about Trump's tariffs",
  "link": "https://www.cnbc.com/2025/03/26/tesla-drops-on-slowing-european-sales-concerns-about-trump-tariffs.html",
  "description": "Tesla shares slid on Wednesday, continuing their downward trajectory for the year, after a rally over the past few days.",
  "author": "",
  "published": "Wed, 26 Mar 2025 20:21:09 GMT",
  "source": "https://www.cnbc.com/id/100727362/device/rss/rss.html",
  "categories": null,
  "byline": "Lora Kolodny",
  "length": 3720,
  "excerpt": "Tesla shares slid on Wednesday, continuing their downward trajectory for the year, after a rally over the past few days.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "White House Senior Advisor, Tesla and SpaceX CEO Elon Musk attends a cabinet meeting held by U.S. President Donald Trump at the White House on March 24, 2025 in Washington, DC. Win McNamee | Getty ImagesTesla shares fell almost 6% on Wednesday as data from Europe showed slowing sales last month, and investors grew increasingly concerned about President Donald Trump's plan for tariffs.The European Automobile Manufacturers' Association (ACEA) revealed on Tuesday that Tesla saw a 40% year-over-year drop in new vehicle registrations in Europe in February, while overall battery electric vehicle sales were up 26%.Meanwhile, the White House said on Wednesday that President Trump will announce new tariffs on auto imports in the afternoon. The president has hyped April 2 as \"liberation day\" and \"the big one\" for rolling out his plan to impose heavy tariffs on foreign trading partners, but Trump hinted earlier this week that auto tariffs could arrive sooner.Movements of this magnitude have become commonplace for Tesla's stock. On 14 separate days this year, Tesla shares have gained or lost at least 5%. Wednesday's selloff, alongside a 2% drop in the Nasdaq, followed a five-day rally that included a 12% jump on Monday.The trend for the year has been downward, particularly since President Trump began his second term in January, and brought Tesla CEO Elon Musk with him to the White House. Tesla shares are down 36% since Inauguration Day, after falling 28% in February, the steepest drop for any month since December 2022.Following the ACEA report on Tuesday, RBC analysts wrote in a note that the February numbers only represented a drop of about 11,000 Tesla vehicle registrations in Europe, and emphasized that data for the month \"might not be indicative of true demand.\"New car buyers in Europe, the analysts said, \"could be holding out for the Model Y refresh,\" or a \"new affordable model,\" which they expect in the second half of the year.Tesla is set to fully ramp up production of the redesigned version of its Model Y SUV next month. The company implemented partial production shutdowns at certain factories earlier this year to upgrade Model Y manufacturing lines.Some prospective EV buyers have been turned off of late by Musk's political rhetoric and his work for the Trump administration, where he's leading an effort to slash federal government spending, cut the federal workforce, and has said he wants to privatize many services, including social security.William Blair analysts wrote in a note on Wednesday that, \"pushback from Musk's foray into politics\" has led to \"brand damage and even vandalism,\" for Tesla at a time when the company's supply has been impacted by its Model Y changeover, and \"Chinese competition continues to heat up.\"Still, the firm maintained its buy recommendation on Tesla's stock, pointing to growth in the company's energy storage business, and its prospects in driverless ride hailing. Musk has promised that Tesla will kick off a robotaxi service in Austin in June. The company has yet to begin production of its dedicated robotaxi, dubbed the Cybercab.Alphabet's Waymo is already operating a commercial robotaxi service in Austin and other markets. And in China, several automakers are now offering an equivalent to Tesla's Full Self-Driving Supervised — a premium, partially automated driving system — as standard options rather than a paid service.In China this week, Tesla renamed its FSD system \"Intelligent Assisted Driving,\" according to CNEVPost, after previously branding it as \"Full Self-driving Capability.\" Tesla's system in all markets still requires a human at the wheel, ready to steer or brake at any time.WATCH: Tesla expectations 'near a bottom'",
  "image": "https://image.cnbcfm.com/api/v1/image/108114371-1741727582315-gettyimages-2203996474-2204586123.jpeg?v=1741727811\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108120393\" data-test=\"InlineImage\"\u003e\u003cp\u003eWhite House Senior Advisor, Tesla and SpaceX CEO Elon Musk attends a cabinet meeting held by U.S. President Donald Trump at the White House on March 24, 2025 in Washington, DC. \u003c/p\u003e\u003cp\u003eWin McNamee | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-1\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/TSLA/\"\u003eTesla\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e shares fell almost 6% on Wednesday as data from Europe showed slowing sales last month, and investors grew increasingly concerned about \u003ca href=\"https://www.cnbc.com/donald-trump/\"\u003ePresident Donald Trump\u0026#39;s\u003c/a\u003e plan for tariffs.\u003c/p\u003e\u003cp\u003eThe European Automobile Manufacturers\u0026#39; Association (ACEA) revealed on Tuesday that Tesla saw a 40% year-over-year drop in new vehicle registrations in Europe in February, while overall battery electric vehicle sales were up 26%.\u003c/p\u003e\u003cp\u003eMeanwhile, the White House \u003ca href=\"https://www.cnbc.com/2025/03/26/trump-could-sign-new-auto-tariffs-as-soon-as-wednesday-white-house-says.html\"\u003esaid\u003c/a\u003e on Wednesday that President Trump will announce new tariffs on auto imports in the afternoon. The president has hyped April 2 as \u0026#34;liberation day\u0026#34; and \u0026#34;the big one\u0026#34; for rolling out his plan to impose heavy tariffs on foreign trading partners, but Trump hinted earlier this week that auto tariffs could arrive sooner.\u003c/p\u003e\u003cp\u003eMovements of this magnitude have become commonplace for Tesla\u0026#39;s stock. On 14 separate days this year, Tesla shares have gained or lost at least 5%. Wednesday\u0026#39;s selloff, alongside a 2% drop in the Nasdaq, followed a five-day rally that included a \u003ca href=\"https://www.cnbc.com/2025/03/24/tesla-rebounds-10percent-for-biggest-pop-of-the-year-following-9-straight-weeks-of-losses.html\"\u003e12% jump on Monday\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe trend for the year has been downward, particularly since President Trump began his second term in January, and brought Tesla CEO \u003ca href=\"https://www.cnbc.com/elon-musk/\"\u003eElon Musk\u003c/a\u003e with him to the White House. Tesla shares are down 36% since Inauguration Day, after falling 28% in February, the steepest drop for any month since December 2022.\u003c/p\u003e\u003cp\u003eFollowing the ACEA report on Tuesday, RBC analysts wrote in a note that the February numbers only represented a drop of about 11,000 Tesla vehicle registrations in Europe, and emphasized that data for the month \u0026#34;might not be indicative of true demand.\u0026#34;\u003c/p\u003e\u003cp\u003eNew car buyers in Europe, the analysts said, \u0026#34;could be holding out for the Model Y refresh,\u0026#34; or a \u0026#34;new affordable model,\u0026#34; which they expect in the second half of the year.\u003c/p\u003e\u003cp\u003eTesla is set to fully ramp up production of the redesigned version of its Model Y SUV next month. The company implemented partial production shutdowns at certain factories earlier this year to upgrade Model Y manufacturing lines.\u003c/p\u003e\u003cp\u003eSome prospective EV buyers have been turned off of late by Musk\u0026#39;s political rhetoric and his work for the Trump administration, where he\u0026#39;s leading an effort to slash federal government spending, cut the federal workforce, and has said he wants to privatize many services, \u003ca href=\"https://www.cnbc.com/2025/02/19/amid-doge-cuts-elon-musk-turns-focus-to-social-security-beneficiaries-over-100.html\"\u003eincluding social security\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eWilliam Blair analysts wrote in a note on Wednesday that, \u0026#34;pushback from Musk\u0026#39;s foray into politics\u0026#34; has led to \u0026#34;brand damage and even vandalism,\u0026#34; for Tesla at a time when the company\u0026#39;s supply has been impacted by its Model Y changeover, and \u0026#34;Chinese competition continues to heat up.\u0026#34;\u003c/p\u003e\u003cp\u003eStill, the firm maintained its buy recommendation on Tesla\u0026#39;s stock, pointing to growth in the company\u0026#39;s energy storage business, and its prospects in driverless ride hailing. Musk has promised that Tesla will kick off a robotaxi service in Austin in June. The company has yet to begin production of its dedicated robotaxi, dubbed the \u003ca href=\"https://www.cnbc.com/2024/10/10/elon-musk-hypes-a-30000-tesla-cybercab-robovan-at-robotaxi-event.html\"\u003eCybercab\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-8\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/GOOGL/\"\u003eAlphabet\u0026#39;s\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e Waymo is already operating a commercial robotaxi service in Austin and other markets. And in China, several automakers are now offering an equivalent to Tesla\u0026#39;s Full Self-Driving Supervised — a premium, partially automated driving system — as standard options rather than a paid service.\u003c/p\u003e\u003cp\u003eIn China this week, Tesla renamed its FSD system \u0026#34;\u003ca href=\"https://cnevpost.com/2025/03/26/tesla-drops-fsd-from-name-smart-driving-china/\" target=\"_blank\"\u003eIntelligent Assisted Driving\u003c/a\u003e,\u0026#34; according to CNEVPost, after previously branding it as \u0026#34;Full Self-driving Capability.\u0026#34; Tesla\u0026#39;s system in all markets still requires a human at the wheel, ready to steer or brake at any time.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWATCH:\u003c/strong\u003e \u003ca href=\"https://www.cnbc.com/video/2025/03/26/tesla-expectations-near-a-bottom-says-william-blairs-dorsheimer.html\"\u003eTesla expectations \u0026#39;near a bottom\u0026#39;\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108121546\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000370852\" aria-labelledby=\"Placeholder-ArticleBody-Video-108121546\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108121547-17430030681743003065-39077431025-1080pnbcnews.jpg?v=1743003067\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"Tesla expectations \u0026#39;near a bottom,\u0026#39; growth to come after: William Blair\u0026#39;s Dorsheimer\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-03-26T18:57:28Z",
  "modifiedTime": "2025-03-26T20:21:09Z"
}
