{
  "id": "799f5411-e2eb-49f2-9576-c8d2011f2137",
  "title": "Russia Says Ready To Defend Through \"Any Means\"",
  "link": "https://www.ndtv.com/world-news/russia-says-ready-to-defend-through-any-means-7182901",
  "description": "Russian Foreign Minister Sergey Lavrov on Thursday said he hopes the West took \"seriously\" Moscow's recent use of a hypersonic missile in Ukraine, and warned that Russia was ready to use \"any means\" to defend itself.",
  "author": "",
  "published": "Fri, 06 Dec 2024 05:17:26 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "Agence France-Presse",
  "length": 1558,
  "excerpt": "Russian Foreign Minister Sergey Lavrov on Thursday said he hopes the West took \u0026quot;seriously\u0026quot; Moscow\u0026#039;s recent use of a hypersonic missile in Ukraine, and warned that Russia was ready to use \u0026quot;any means\u0026quot; to defend itself.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Moscow: Russian Foreign Minister Sergei Lavrov on Thursday said he hopes the West took \"seriously\" Moscow's recent use of a hypersonic missile in Ukraine, and warned that Russia was ready to use \"any means\" to defend itself.The United States and its allies \"must understand that we would be ready to use any means not to allow them to succeed in what they call strategic defeat of Russia,\" Lavrov said in an interview with US media personality Tucker Carlson released Thursday.Two weeks ago, Russia fired its new Oreshnik hypersonic missile on the Ukrainian city of Dnipro in a major escalation of the almost three-year war.Russian President Vladimir Putin has since threatened to use the weapon on Kyiv in response to Ukraine's strikes on Russia's territory.\"We are sending signals and we hope that the last one, a couple of weeks ago, the signal with the new weapons system called Oreshnik... was taken seriously,\" Lavrov said.While he insisted that Russia doesn't want to escalate the situation and wants to \"avoid any misunderstanding\" with Washington and its partners, Lavrov warned that \"we will send additional messages if they don't draw necessary conclusions.\"Putin said the Oreshnik missile flies at 10 times the speed of sound and cannot be intercepted by air defenses.Ukrainian President Volodymyr Zelensky has called the strike \"the latest bout of Russian madness\" and appealed for updated air-defense systems to meet the new threat.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
  "image": "https://i.ndtvimg.com/i/2016-10/sergey-lavrov-reuters-650_650x400_71476328610.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                \u003cp\u003e\u003cb\u003eMoscow: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eRussian Foreign Minister Sergei Lavrov on Thursday said he hopes the West took \u0026#34;seriously\u0026#34; Moscow\u0026#39;s recent use of a hypersonic missile in Ukraine, and warned that Russia was ready to use \u0026#34;any means\u0026#34; to defend itself.\u003c/p\u003e\u003cp\u003eThe United States and its allies \u0026#34;must understand that we would be ready to use any means not to allow them to succeed in what they call strategic defeat of Russia,\u0026#34; Lavrov said in an interview with US media personality Tucker Carlson released Thursday.\u003c/p\u003e\u003cp\u003eTwo weeks ago, Russia fired its new Oreshnik hypersonic missile on the Ukrainian city of Dnipro in a major escalation of the almost three-year war.\u003c/p\u003e\u003cp\u003eRussian President Vladimir Putin has since threatened to use the weapon on Kyiv in response to Ukraine\u0026#39;s strikes on Russia\u0026#39;s territory.\u003c/p\u003e\u003cp\u003e\u0026#34;We are sending signals and we hope that the last one, a couple of weeks ago, the signal with the new weapons system called Oreshnik... was taken seriously,\u0026#34; Lavrov said.\u003c/p\u003e\u003cp\u003eWhile he insisted that Russia doesn\u0026#39;t want to escalate the situation and wants to \u0026#34;avoid any misunderstanding\u0026#34; with Washington and its partners, Lavrov warned that \u0026#34;we will send additional messages if they don\u0026#39;t draw necessary conclusions.\u0026#34;\u003c/p\u003e\u003cp\u003ePutin said the Oreshnik missile flies at 10 times the speed of sound and cannot be intercepted by air defenses.\u003c/p\u003e\u003cp\u003eUkrainian President Volodymyr Zelensky has called the strike \u0026#34;the latest bout of Russian madness\u0026#34; and appealed for updated air-defense systems to meet the new threat.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                        \n                                        \n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-12-06T05:17:26+05:30",
  "modifiedTime": null
}
