{
  "id": "7ab40c8c-899e-4eb9-a5bf-9746120dea26",
  "title": "Vance scolds Denmark during Greenland trip",
  "link": "https://www.bbc.com/news/articles/cr525e49m2do",
  "description": "Denmark's prime minister said the visit by the US VP and other top officials  showed a \"lack of respect\".",
  "author": "",
  "published": "Fri, 28 Mar 2025 23:26:32 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Andrew Harding",
  "length": 6838,
  "excerpt": "Denmark's prime minister said the visit by the US VP and other top officials showed a \"lack of respect\".",
  "siteName": "BBC News",
  "favicon": "https://www.bbc.com/bbcx/apple-touch-icon.png",
  "text": "US Vice-President JD Vance has accused Denmark of leaving Greenland vulnerable to alleged incursions by China and Russia, as he asked its people to \"cut a deal\" with the US.Speaking during a visit to the Arctic island, Vance minimised recent threats by President Donald Trump to take over the island by force. Instead, he urged Greenlanders to sever its ties with Denmark, which has owned the island for more than 300 years, saying the nation had not invested enough to protect the semi-autonomous territory.An overwhelming majority of Greenlanders oppose the idea of annexation, a poll indicated in January. Greenland's prime minister has said the US visit showed a \"lack of respect\". And Denmark's King Frederik also rejected the US plan.\"We live in an altered reality,\" said the monarch on social media on Friday. \"There should be no doubt that my love for Greenland and my connectedness to the people of Greenland are intact.\" Friday's visit was initially billed as a \"cultural\" tour by Vance's wife, Usha, where she would watch a dog-sledding race, but it spiralled over multiple days of adjustments as the visit attracted scrutiny and security concerns, with multiple protests planned. Instead, Vance and the second lady were in Greenland for just a few hours, visiting just the Pituffik Space Base, a missile defence facility in the remote north of the island, some 930 miles (1,500km) from the capital, Nuuk.He used the opportunity to take aim at Denmark, alleging it had to \"keep the people of Greenland safe from a lot of very aggressive incursions from Russia, from China, and other nations\", without providing further details.He specifically called out the countries for taking interest in routes and minerals in the region, as the island of 57,000 people is believed to hold massive untapped mineral and oil reserves. In his remarks, Vance sought to reassure the people of Greenland that the US would not use military force to take the island from Denmark. Instead, he urged Greenlanders to embrace \"self-determination\" and sever ties with Denmark, which has controlled the region since 1721. \"We think we're going to be able to cut a deal, Donald Trump-style, to ensure the security of this territory,\" Vance said. \"We hope that they choose to partner with the United States, because we're the only nation on Earth that will respect their sovereignty and respect their security, \" he said, adding \"Their security is very much our security.\" The vice-president said the US did not have immediate plans to expand the American military presence on the ground, but would invest more resources, including naval ships and military icebreakers. \"Our message to Denmark is very simple,\" Vance said.\"You have not done a good job by the people of Greenland. You have under-invested in the people of Greenland and you have under-invested in the security of this incredible, beautiful landmass.\"Along with his wife, Vance was joined on trip by US national security adviser Mike Waltz, and energy secretary Chris Wright. The outside temperature at Pituffik was -3F (-19 C).Back at the White House, President Trump insisted the US needed Greenland to guarantee \"peace of the entire world\" and that its waterways had \"Chinese and Russian ships all over the place\". \"We need Greenland, very importantly, for international security,\" he said. \"We have to have Greenland. It's not a question of: 'Do you think we can do without it?' We can't.\" He said Denmark and the European Union understood the situation \"and if they don't, we're going to have to explain it to them.\" In a statement to the BBC, Danish Prime Minister Mette Frederiksen took issue with Vance's comments. \"For many years we have stood side by side with the Americans in very difficult situations,\" she said. \"Therefore, it is not an accurate way for the vice-president to refer to Denmark.\"She said Denmark had significantly increased defence spending, but would further boost its investment with more surveillance, new Arctic ships, long-range drones and satellite capacity. \"We are ready – day and night – to co-operate with the Americans,\" she said. \"A cooperation that must be based on the necessary international rules of the game.\"Greenland's new prime minister, Jens-Frederik Nielsen, said prior to Vance's visit that it showed \"a lack of respect for the Greenlandic people\". In Greenland's capital of Nuuk, some people the BBC spoke to were not won over by the US overtures.At a cultural centre in the city, artist Karline Poulsen said: \"There are many ways to say things. But I think the way President Trump is saying it is not the way.\"A woman who gave her name only as Nina said: \"I'm concerned [about the visit]. This is kind of odd, I don't like it.\"Her daughter, Anita, said the visit has caused \"a lot of uncertainty and a lot of people are worried\".Since 2009, Greenland has had the right to call an independence referendum, though in recent years some political parties have begun pushing more for it.Greenland governs its own domestic affairs, but decisions on foreign and defence policy are made in Copenhagen. Five of the six main parties who participated in this month's election favour independence from Denmark, but they disagree over the pace with which to reach it.Trump first floated the idea of buying Greenland during his first term - and his desire to own the island has only grown with time.Russian President Vladimir Putin said on Thursday he considered Trump's plans for Greenland \"serious\".He expressed concern that \"Nato countries, in general, are increasingly designating the Far North as a springboard for possible conflicts\". Qupanuk Olsen, a Greenland politician with the pro-independence party Naleraq, told the BBC the country is taking the US interest in the island very serious.\"We're afraid of being colonised again. We've been a colony for the past 300 years under Denmark, it still feels like it,\" Olsen says. \"Now another coloniser is interested in us.\"Troy Bouffard, a University of Alaska professor focused on arctic security, told the BBC that Trump is leaning on his business sense to accomplish what he wants in the region, rather than geopolitics or diplomacy.\"If you're thinking of this issue only in terms of diplomacy, you're going to miss out on what other options the US might have to close this deal to pressure the main actors into negotiating or compromising,\" he said.Mr Bouffard said the endgame for the US is to a have \"much more robust relationship\" with Greenland.One of the potential scenarios could be axing Denmark from the picture, and having the US establish a relationship that replaces Denmark, he notes.Mr Bouffard suggested it's possible the US changes the nature of the relationship and takes on some responsibilities that normally belongs to Denmark.Ana Faguy contributed reporting for this story.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ab65/live/54af6f90-0c17-11f0-b234-07dc7691c360.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eUS Vice-President JD Vance has accused Denmark of leaving Greenland vulnerable to alleged incursions by China and Russia, as he asked its people to \u0026#34;cut a deal\u0026#34; with the US.\u003c/p\u003e\u003cp\u003eSpeaking during a visit to the Arctic island, Vance minimised recent threats by President Donald Trump to take over the island by force. \u003c/p\u003e\u003cp\u003eInstead, he urged Greenlanders to sever its ties with Denmark, which has owned the island for more than 300 years, saying the nation had not invested enough to protect the semi-autonomous territory.\u003c/p\u003e\u003cp\u003eAn\u003ca target=\"_blank\" href=\"https://www.veriangroup.com/news-and-insights/opinion-poll-greenland-2025\"\u003e overwhelming majority\u003c/a\u003e of Greenlanders oppose the idea of annexation, a poll indicated in January. Greenland\u0026#39;s prime minister has said the US visit showed a \u0026#34;lack of respect\u0026#34;. \u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAnd Denmark\u0026#39;s King Frederik also rejected the US plan.\u003c/p\u003e\u003cp\u003e\u0026#34;We live in an altered reality,\u0026#34; said the monarch on social media on Friday. \u0026#34;There should be no doubt that my love for Greenland and my connectedness to the people of Greenland are intact.\u0026#34; \u003c/p\u003e\u003cp\u003eFriday\u0026#39;s visit was initially billed as a \u0026#34;cultural\u0026#34; tour by Vance\u0026#39;s wife, Usha, where she would watch a dog-sledding race, but it spiralled over multiple days of adjustments as the visit attracted scrutiny and security concerns, with multiple protests planned. \u003c/p\u003e\u003cp\u003eInstead, Vance and the second lady were in Greenland for just a few hours, visiting just the Pituffik Space Base, a missile defence facility in the remote north of the island, some 930 miles (1,500km) from the capital, Nuuk.\u003c/p\u003e\u003cp\u003eHe used the opportunity to take aim at Denmark, alleging it had to \u0026#34;keep the people of Greenland safe from a lot of very aggressive incursions from Russia, from China, and other nations\u0026#34;, without providing further details.\u003c/p\u003e\u003cp\u003eHe specifically called out the countries for taking interest in routes and minerals in the region, as the island of 57,000 people is believed to hold massive untapped mineral and oil reserves. \u003c/p\u003e\u003cp\u003eIn his remarks, Vance sought to reassure the people of Greenland that the US would not use military force to take the island from Denmark. Instead, he urged Greenlanders to embrace \u0026#34;self-determination\u0026#34; and sever ties with Denmark, which has controlled the region since 1721. \u003c/p\u003e\u003cp\u003e\u0026#34;We think we\u0026#39;re going to be able to cut a deal, Donald Trump-style, to ensure the security of this territory,\u0026#34; Vance said. \u003c/p\u003e\u003cp\u003e\u0026#34;We hope that they choose to partner with the United States, because we\u0026#39;re the only nation on Earth that will respect their sovereignty and respect their security, \u0026#34; he said, adding \u0026#34;Their security is very much our security.\u0026#34; \u003c/p\u003e\u003cp\u003eThe vice-president said the US did not have immediate plans to expand the American military presence on the ground, but would invest more resources, including naval ships and military icebreakers. \u003c/p\u003e\u003cp\u003e\u0026#34;Our message to Denmark is very simple,\u0026#34; Vance said.\u003c/p\u003e\u003cp\u003e\u0026#34;You have not done a good job by the people of Greenland. You have under-invested in the people of Greenland and you have under-invested in the security of this incredible, beautiful landmass.\u0026#34;\u003c/p\u003e\u003cp\u003eAlong with his wife, Vance was joined on trip by US national security adviser Mike Waltz, and energy secretary Chris Wright. \u003c/p\u003e\u003cp\u003eThe outside temperature at Pituffik was -3F (-19 C).\u003c/p\u003e\u003cp\u003eBack at the White House, President Trump insisted the US needed Greenland to guarantee \u0026#34;peace of the entire world\u0026#34; and that its waterways had \u0026#34;Chinese and Russian ships all over the place\u0026#34;. \u003c/p\u003e\u003cp\u003e\u0026#34;We need Greenland, very importantly, for international security,\u0026#34; he said. \u003c/p\u003e\u003cp\u003e\u0026#34;We have to have Greenland. It\u0026#39;s not a question of: \u0026#39;Do you think we can do without it?\u0026#39; We can\u0026#39;t.\u0026#34; \u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eHe said Denmark and the European Union understood the situation \u0026#34;and if they don\u0026#39;t, we\u0026#39;re going to have to explain it to them.\u0026#34;  \u003c/p\u003e\u003cp\u003eIn a statement to the BBC, Danish Prime Minister Mette Frederiksen took issue with Vance\u0026#39;s comments. \u003c/p\u003e\u003cp\u003e\u0026#34;For many years we have stood side by side with the Americans in very difficult situations,\u0026#34; she said. \u0026#34;Therefore, it is not an accurate way for the vice-president to refer to Denmark.\u0026#34;\u003c/p\u003e\u003cp\u003eShe said Denmark had significantly increased defence spending, but would further boost its investment with more surveillance, new Arctic ships, long-range drones and satellite capacity. \u003c/p\u003e\u003cp\u003e\u0026#34;We are ready – day and night – to co-operate with the Americans,\u0026#34; she said. \u0026#34;A cooperation that must be based on the necessary international rules of the game.\u0026#34;\u003c/p\u003e\u003cp\u003eGreenland\u0026#39;s new prime minister, Jens-Frederik Nielsen, said prior to Vance\u0026#39;s visit that it showed \u0026#34;a lack of respect for the Greenlandic people\u0026#34;. \u003c/p\u003e\u003cp\u003eIn Greenland\u0026#39;s capital of Nuuk, some people the BBC spoke to were not won over by the US overtures.\u003c/p\u003e\u003cp\u003eAt a cultural centre in the city, artist Karline Poulsen said: \u0026#34;There are many ways to say things. But I think the way President Trump is saying it is not the way.\u0026#34;\u003c/p\u003e\u003cp\u003eA woman who gave her name only as Nina said: \u0026#34;I\u0026#39;m concerned [about the visit]. This is kind of odd, I don\u0026#39;t like it.\u0026#34;\u003c/p\u003e\u003cp\u003eHer daughter, Anita, said the visit has caused \u0026#34;a lot of uncertainty and a lot of people are worried\u0026#34;.\u003c/p\u003e\u003cp\u003eSince 2009, Greenland has had the right to call an independence referendum, though in recent years some political parties have begun pushing more for it.\u003c/p\u003e\u003cp\u003eGreenland governs its own domestic affairs, but decisions on foreign and defence policy are made in Copenhagen. Five of the six main parties who participated in this month\u0026#39;s election favour independence from Denmark, but they disagree over the pace with which to reach it.\u003c/p\u003e\u003cp\u003eTrump first floated the idea of buying Greenland during his first term - and his desire to own the island has only grown with time.\u003c/p\u003e\u003cp\u003eRussian President Vladimir Putin said on Thursday he considered Trump\u0026#39;s plans for Greenland \u0026#34;serious\u0026#34;.\u003c/p\u003e\u003cp\u003eHe expressed concern that \u0026#34;Nato countries, in general, are increasingly designating the Far North as a springboard for possible conflicts\u0026#34;. \u003c/p\u003e\u003cp\u003eQupanuk Olsen, a Greenland politician with the pro-independence party Naleraq, told the BBC the country is taking the US interest in the island very serious.\u003c/p\u003e\u003cp\u003e\u0026#34;We\u0026#39;re afraid of being colonised again. We\u0026#39;ve been a colony for the past 300 years under Denmark, it still feels like it,\u0026#34; Olsen says. \u0026#34;Now another coloniser is interested in us.\u0026#34;\u003c/p\u003e\u003cp\u003eTroy Bouffard, a University of Alaska professor focused on arctic security, told the BBC that Trump is leaning on his business sense to accomplish what he wants in the region, rather than geopolitics or diplomacy.\u003c/p\u003e\u003cp\u003e\u0026#34;If you\u0026#39;re thinking of this issue only in terms of diplomacy, you\u0026#39;re going to miss out on what other options the US might have to close this deal to pressure the main actors into negotiating or compromising,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eMr Bouffard said the endgame for the US is to a have \u0026#34;much more robust relationship\u0026#34; with Greenland.\u003c/p\u003e\u003cp\u003eOne of the potential scenarios could be axing Denmark from the picture, and having the US establish a relationship that replaces Denmark, he notes.\u003c/p\u003e\u003cp\u003eMr Bouffard suggested it\u0026#39;s possible the US changes the nature of the relationship and takes on some responsibilities that normally belongs to Denmark.\u003c/p\u003e\u003cp\u003e\u003ci id=\"ana-faguy-contributed-reporting-for-this-story.\"\u003eAna Faguy contributed reporting for this story.\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-03-28T21:59:48.292Z",
  "modifiedTime": "2025-03-28T23:26:32.161Z"
}
