{
  "id": "7bda6c93-23a6-4265-880c-f8acc6ded4a3",
  "title": "Has Kate Middleton given up on reuniting Prince William and Prince Harry? What royal experts say",
  "link": "https://timesofindia.indiatimes.com/world/uk/has-kate-middleton-given-up-on-reuniting-prince-william-and-prince-harry-what-royal-experts-say/articleshow/114128120.cms",
  "description": "Kate Middleton has ceased mediating between Prince William and Prince Harry. After completing preventive chemotherapy, she is now prioritizing her health and family. Tensions persist within the royal family, with minimal communication between Harry, Meghan, and the palace.",
  "author": "TOI World Desk",
  "published": "2024-10-10T23:52:06+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 2507,
  "excerpt": "UK News: Kate Middleton has ceased mediating between Prince William and Prince Harry. After completing preventive chemotherapy, she is now prioritizing her hea",
  "siteName": "Times Of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "Prince William, Kate Middleton, Prince Harry and Meghan Markle Kate Middleton is no longer mediating between Prince William and Prince Harry amid ongoing family tensions, according to royal experts. Christopher Andersen, author of The King, shared with Fox News that the Princess of Wales has stopped trying to reconcile the brothers and is focusing on her health and family following her battle with cancer.Andersen said, “The idea that Kate somehow still has the time and energy to continue playing peacemaker is rubbish.She did try over a period of years and finally threw up her hands in disgust. She did her bit, but it wasn’t enough to build a bridge between William and Charles on one side and Harry on the other.” He noted that Kate is now concentrating on supporting the monarchy and her family, including King Charles III.Kate, 42, is gradually returning to royal duties after undergoing preventive chemotherapy. Royal expert Richard Fitzwilliams told Fox News Digital that Kate \"is totally at one\" with William regarding the family rift. He explained, \"Harry portrayed her as cold and unwelcoming to (his wife) Meghan Markle in (his memoir) Spare, when he painted an extremely damaging picture of the royal family.\"The relationship between Prince Harry and his family has been strained since Harry and Meghan left their royal roles in 2020, citing press intrusion and racism. Harry has spoken publicly about family issues in interviews and his memoir. In the book, Harry recounted a 2019 argument in which William allegedly called Meghan \"difficult\" and \"rude\" and then physically assaulted him.Reports suggest that Harry and Meghan have shown interest in Kate’s recovery, but their communication with the palace remains minimal. Kinsey Schofield, host of the To Di For Daily podcast, observed that Harry and Meghan have become less relevant to Kate, who is prioritizing her health and family. Former royal butler Grant Harrold believes reconciliation between Harry and his family is increasingly unlikely.The Princess of Wales announced in September that she had completed cancer treatment six months after revealing her diagnosis. She shared on X the relief she felt after completing chemotherapy. “Doing what I can to stay cancer-free is now my focus,” she wrote. Despite finishing treatment, Kate acknowledged in a video update that her full recovery will be a lengthy process and that she would continue to take it day by day, engaging in limited public duties for the remainder of the year.",
  "image": "https://static.toiimg.com/thumb/msid-114128875,width-1070,height-580,imgsize-882068,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003csection\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-114128875,imgsize-882068,width-400,resizemode-4/114128875.jpg\" alt=\"Has Kate Middleton given up on reuniting Prince William and Prince Harry? What royal experts say\" title=\" Prince William, Kate Middleton, Prince Harry and Meghan Markle \" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan title=\" Prince William, Kate Middleton, Prince Harry and Meghan Markle \"\u003e Prince William, Kate Middleton, Prince Harry and Meghan Markle \u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003cp\u003eKate Middleton is no longer mediating between Prince William and \u003ca href=\"https://timesofindia.indiatimes.com/topic/prince-harry\" styleobj=\"[object Object]\" frmappuse=\"1\"\u003ePrince Harry\u003c/a\u003e amid ongoing family tensions, according to royal experts. Christopher Andersen, author of The King, shared with Fox News that the Princess of Wales has stopped trying to reconcile the brothers and is focusing on her health and family following her battle with cancer.\u003cbr/\u003eAndersen said, “The idea that Kate somehow still has the time and energy to continue playing peacemaker is rubbish.\u003c/p\u003e\u003cp\u003eShe did try over a period of years and finally threw up her hands in disgust. She did her bit, but it wasn’t enough to build a bridge between William and Charles on one side and Harry on the other.” He noted that Kate is now concentrating on supporting the monarchy and her family, including King Charles III.\u003cbr/\u003eKate, 42, is gradually returning to royal duties after undergoing preventive chemotherapy. Royal expert Richard Fitzwilliams told Fox News Digital that Kate \u0026#34;is totally at one\u0026#34; with William regarding the family rift. He explained, \u0026#34;Harry portrayed her as cold and unwelcoming to (his wife) \u003ca href=\"https://timesofindia.indiatimes.com/topic/meghan-markle\" styleobj=\"[object Object]\" frmappuse=\"1\"\u003eMeghan Markle\u003c/a\u003e in (his memoir) Spare, when he painted an extremely damaging picture of the royal family.\u0026#34;\u003cbr/\u003eThe relationship between Prince Harry and his family has been strained since Harry and Meghan left their royal roles in 2020, citing press intrusion and racism. Harry has spoken publicly about family issues in interviews and his memoir. In the book, Harry recounted a 2019 argument in which William allegedly called Meghan \u0026#34;difficult\u0026#34; and \u0026#34;rude\u0026#34; and then physically assaulted him.\u003c/p\u003e\u003cp\u003eReports suggest that Harry and Meghan have shown interest in Kate’s recovery, but their communication with the palace remains minimal. Kinsey Schofield, host of the To Di For Daily podcast, observed that Harry and Meghan have become less relevant to Kate, who is prioritizing her health and family. Former royal butler Grant Harrold believes reconciliation between Harry and his family is increasingly unlikely.\u003c/p\u003e\u003cp\u003eThe Princess of Wales announced in September that she had completed cancer treatment six months after revealing her diagnosis. She shared on X the relief she felt after completing chemotherapy. “Doing what I can to stay cancer-free is now my focus,” she wrote. Despite finishing treatment, Kate acknowledged in a video update that her full recovery will be a lengthy process and that she would continue to take it day by day, engaging in limited public duties for the remainder of the year.\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-10T23:52:00+05:30",
  "modifiedTime": null
}
