{
  "id": "7e7b6024-3606-4303-9d8e-0e7e827ab7b8",
  "title": "Gaza aid site offered a 'women only' day. It didn't stop the killing",
  "link": "https://www.bbc.com/news/articles/c74z4gy5g31o",
  "description": "Families say mothers Mary Sheikh al-Eid and Khadija Abu Anza were shot while seeking aid from GHF station in southern Gaza.",
  "author": "",
  "published": "Sat, 26 Jul 2025 18:05:36 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Emir Nader",
  "length": 6621,
  "excerpt": "Families say mothers Mary Sheikh al-Eid and Khadija Abu Anza were shot while seeking aid from GHF station in southern Gaza.",
  "siteName": "BBC News",
  "favicon": "https://static.files.bbci.co.uk/bbcdotcom/web/20250711-084946-a521911844-web-2.25.0-9/apple-touch-icon.png",
  "text": "Emir NaderBBC News, JerusalemBBCMary Sheikh al-Eid’s family arrived at Nasser hospital in Khan Younis after learning she had been killedThe food distribution was announced in advance, like many before it, in a post on social media carrying an illustration of smiling Palestinians receiving boxes of aid.This time, however, the invitation shared by the Gaza Humanitarian Foundation (GHF) was different, featuring illustrations of only women. \"Tomorrow at our morning distribution at our location in the Saudi district, only women are welcome to come and receive a food box,\" the GHF post said. \"Men should avoid the site during this distribution.\"Mary Sheikh al-Eid wanted to feed her seven children. Her husband had been killed earlier in the war and the family had been surviving on lentil soup for three weeks, said Mary's sister Khawla, but the last week had been a struggle.\"Her children and mine told us not to go,\" Khawla told the BBC. \"Mary told me she wanted to because it was a day for women and the numbers wouldn't be big.\"GHFThe Gaza Humanitarian Foundation (GHF) announced the women-only aid distribution day on social media GHF's food aid distribution system has been marred by near-daily scenes of chaos and killing since it was implemented in May with Israeli and US support.Huge crowds are forced to walk long distances into Israeli military zones, entering fenced sites that are surrounded by private security contractors and Israeli troops. Palestinian men mostly take on the risk, jostling to secure a box of food for their family.For Gaza's two million people, there are just four GHF distribution sites but typically no more than two open on any given day.On Thursday, the sisters Mary and Khawla set off early for the aid point in the southern Rafah area. By the time they arrived, the scene was already chaos.\"There was a huge crowd of women and the place seemed out of control, they couldn't offload and distribute the aid,\" Khawla said. \"They started spraying the women with pepper spray, then they brought stun grenades and started throwing them on the women to force them backwards.\"The sisters got split up in the mayhem. Khawla's clothes were full of pepper spray and so she called her sister, agreeing to meet at their brother's house. Shortly after she called again, feeling something wasn't right.\"This time a stranger picked up, he told me the owner of the phone was shot and was being taken to the Red Cross [field hospital],\" said Khawla.\"I called again and this time I was told she was shot in the head. I ran like crazy and called again, but this time I was told the owner of this phone had been killed.\"Khawla Sheikh al-Eid (R) said her sister was shot after they had become separated at the aid site Since the GHF aid system was established in late May, the UN says over 1,000 Palestinians have been killed by the Israeli military while trying to get aid mostly near GHF distribution sites, as well as near UN and other aid convoys.On Friday, one former US soldier who worked with the GHF said he had witnessed Israeli troops and security contractors firing on crowds.Anthony Aguilar told the BBC he had never seen such a level of \"brutality and use of indiscriminate and unnecessary force against a civilian population, an unarmed, starving population\".Israel has previously said that its troops have fired \"warning shots\", and that it was implementing \"lessons learned\". It accuses Hamas of instigating chaos near the aid points and disputes the number of deaths reported.Mary Sheikh al-Eid's daughter, Warshazat (R), was comforted at Nasser hospitalMedics at Nasser hospital in Khan Younis said Mary Sheikh al-Eid died from a bullet injury to the neck. She is one of two women known to have been killed on Thursday's \"women's day\".The BBC also spoke to the family of the second woman who was killed, Khadija Abu Anza.One sister, Samah, who was with her said that they were travelling to a GHF aid site when an Israeli tank and troops arrived.From a distance of just metres, the troops first fired warning shots as they told them to move back, Samah said on Friday.\"We started walking back and then she was hit by the bullet,\" Samah said. \"They shot her in the neck and she died immediately.\"\"I tried to carry her and her blood fell on me, a man helped me carry her to Nasser hospital. The aid point was opened right after they shot her and they let people go in.\"In response to the BBC, the Israel Defense Forces (IDF) said it had \"identified suspects who approached them, posing a threat to the troops\" and \"fired warning shots\" early on Thursday, but added that it was unaware of casualties. It said the shots were fired 'hundreds of meters away' from the distribution site, before its opening hours.A spokesperson for the GHF said there were no incidents or fatalities near its site on Thursday.\"Overall, the day was very successful, with a lot of mothers and daughters participating,\" they added.ReutersUntil May, UN agencies, other international organisations and charities provided most of the aid to Gaza's population at 400 distribution sites throughout the territory.The introduction of the GHF has been criticised by many in the aid community as an attempt to undermine the previous humanitarian system and increase Israeli control over the distribution of food in Gaza, forcing people into dangerous military locations. The UN refuses to cooperate with the GHF system calling it unethical.In recent days, Israel's control over food deliveries to Gaza has been widely condemned by many European governments and the aid groups. Israel says that it introduced the GHF system because Hamas was previously diverting and profiting from aid under the United Nations-led system, though it hasn't provided evidence to show this happening on a systematic basis.The UN says it has recorded the killing of more than 1,000 Palestinians seeking aid since late MayDaily reports of death from malnutrition are gathering pace in Gaza. Humanitarian officials say that the territory must be flooded with aid in order to avert a total collapse.Under international law, Israel as the military power occupying Gaza has an obligation to protect civilian life - ensuring people can find food to survive. However Israel has blamed Hamas and aid agencies for the current shortages, while continuing to support the GHF distribution model.\"I pray to God they get shut down, they are death traps,\" says Mary's sister Khawla. \"She went to get food for her children but she returned by people carrying her body.\"Additional reporting by the BBC's freelance Gaza team and BBC Verify's Mohamed Shalaby",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4d23/live/0c8e3250-696e-11f0-ba8e-91d56f9acc4a.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cdiv data-testid=\"byline-new\" data-component=\"byline-block\"\u003e\u003cp\u003e\u003cspan\u003eEmir Nader\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBBC News, Jerusalem\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250711-084946-a521911844-web-2.25.0-9/grey-placeholder.png\" aria-label=\"image unavailable\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/4d23/live/0c8e3250-696e-11f0-ba8e-91d56f9acc4a.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/4d23/live/0c8e3250-696e-11f0-ba8e-91d56f9acc4a.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/4d23/live/0c8e3250-696e-11f0-ba8e-91d56f9acc4a.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/4d23/live/0c8e3250-696e-11f0-ba8e-91d56f9acc4a.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/4d23/live/0c8e3250-696e-11f0-ba8e-91d56f9acc4a.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/4d23/live/0c8e3250-696e-11f0-ba8e-91d56f9acc4a.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/4d23/live/0c8e3250-696e-11f0-ba8e-91d56f9acc4a.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/4d23/live/0c8e3250-696e-11f0-ba8e-91d56f9acc4a.jpg.webp\" loading=\"eager\" alt=\"BBC Mary Sheikh al-Eid\u0026#39;s family is comforted after her body is brought to Nasser Hospital in Khan Younis, southern Gaza (24 July 2025) \"/\u003e\u003cspan\u003eBBC\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eMary Sheikh al-Eid’s family arrived at Nasser hospital in Khan Younis after learning she had been killed\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe food distribution was announced in advance, like many before it, in a post on social media carrying an illustration of smiling Palestinians receiving boxes of aid.\u003c/p\u003e\u003cp\u003eThis time, however, the invitation shared by the Gaza Humanitarian Foundation (GHF) was different, featuring illustrations of only women. \u003c/p\u003e\u003cp\u003e\u0026#34;Tomorrow at our morning distribution at our location in the Saudi district, only women are welcome to come and receive a food box,\u0026#34; the GHF post said. \u0026#34;Men should avoid the site during this distribution.\u0026#34;\u003c/p\u003e\u003cp\u003eMary Sheikh al-Eid wanted to feed her seven children. Her husband had been killed earlier in the war and the family had been surviving on lentil soup for three weeks, said Mary\u0026#39;s sister Khawla, but the last week had been a struggle.\u003c/p\u003e\u003cp\u003e\u0026#34;Her children and mine told us not to go,\u0026#34; Khawla told the BBC. \u0026#34;Mary told me she wanted to because it was a day for women and the numbers wouldn\u0026#39;t be big.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250711-084946-a521911844-web-2.25.0-9/grey-placeholder.png\" aria-label=\"image unavailable\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/632f/live/3fa2d570-6a1c-11f0-b6f8-dbb4bbf920ec.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/632f/live/3fa2d570-6a1c-11f0-b6f8-dbb4bbf920ec.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/632f/live/3fa2d570-6a1c-11f0-b6f8-dbb4bbf920ec.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/632f/live/3fa2d570-6a1c-11f0-b6f8-dbb4bbf920ec.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/632f/live/3fa2d570-6a1c-11f0-b6f8-dbb4bbf920ec.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/632f/live/3fa2d570-6a1c-11f0-b6f8-dbb4bbf920ec.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/632f/live/3fa2d570-6a1c-11f0-b6f8-dbb4bbf920ec.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/632f/live/3fa2d570-6a1c-11f0-b6f8-dbb4bbf920ec.jpg.webp\" loading=\"lazy\" alt=\"GHF Promotional image from the Gaza Humanitarian Foundation for “women’s day” \"/\u003e\u003cspan\u003eGHF\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eThe Gaza Humanitarian Foundation (GHF) announced the women-only aid distribution day on social media \u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eGHF\u0026#39;s food aid distribution system has been marred by near-daily scenes of chaos and killing since it was implemented in May with Israeli and US support.\u003c/p\u003e\u003cp\u003eHuge crowds are forced to walk long distances into Israeli military zones, entering fenced sites that are surrounded by private security contractors and Israeli troops. Palestinian men mostly take on the risk, jostling to secure a box of food for their family.\u003c/p\u003e\u003cp\u003eFor Gaza\u0026#39;s two million people, there are just four GHF distribution sites but typically no more than two open on any given day.\u003c/p\u003e\u003cp\u003eOn Thursday, the sisters Mary and Khawla set off early for the aid point in the southern Rafah area. By the time they arrived, the scene was already chaos.\u003c/p\u003e\u003cp\u003e\u0026#34;There was a huge crowd of women and the place seemed out of control, they couldn\u0026#39;t offload and distribute the aid,\u0026#34; Khawla said. \u0026#34;They started spraying the women with pepper spray, then they brought stun grenades and started throwing them on the women to force them backwards.\u0026#34;\u003c/p\u003e\u003cp\u003eThe sisters got split up in the mayhem. Khawla\u0026#39;s clothes were full of pepper spray and so she called her sister, agreeing to meet at their brother\u0026#39;s house. \u003c/p\u003e\u003cp\u003eShortly after she called again, feeling something wasn\u0026#39;t right.\u003c/p\u003e\u003cp\u003e\u0026#34;This time a stranger picked up, he told me the owner of the phone was shot and was being taken to the Red Cross [field hospital],\u0026#34; said Khawla.\u003c/p\u003e\u003cp\u003e\u0026#34;I called again and this time I was told she was shot in the head. I ran like crazy and called again, but this time I was told the owner of this phone had been killed.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250711-084946-a521911844-web-2.25.0-9/grey-placeholder.png\" aria-label=\"image unavailable\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/201b/live/c79751e0-696d-11f0-ba8e-91d56f9acc4a.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/201b/live/c79751e0-696d-11f0-ba8e-91d56f9acc4a.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/201b/live/c79751e0-696d-11f0-ba8e-91d56f9acc4a.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/201b/live/c79751e0-696d-11f0-ba8e-91d56f9acc4a.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/201b/live/c79751e0-696d-11f0-ba8e-91d56f9acc4a.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/201b/live/c79751e0-696d-11f0-ba8e-91d56f9acc4a.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/201b/live/c79751e0-696d-11f0-ba8e-91d56f9acc4a.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/201b/live/c79751e0-696d-11f0-ba8e-91d56f9acc4a.jpg.webp\" loading=\"lazy\" alt=\"Khawla Sheikh al-Eid (R), the sister of Mary Sheikh al-Eid speaks to the BBC outside Nasser Hospital, in Khan Younis, southern Gaza (25 July 2025)\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eKhawla Sheikh al-Eid (R) said her sister was shot after they had become separated at the aid site \u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eSince the GHF aid system was established in late May, the UN says over 1,000 Palestinians have been killed by the Israeli military while trying to get aid mostly near GHF distribution sites, as well as near UN and other aid convoys.\u003c/p\u003e\u003cp\u003eOn Friday, one former US soldier who worked with the GHF said he had witnessed Israeli troops and security contractors firing on crowds.\u003c/p\u003e\u003cp\u003eAnthony Aguilar told the BBC he had never seen such a level of \u0026#34;brutality and use of indiscriminate and unnecessary force against a civilian population, an unarmed, starving population\u0026#34;.\u003c/p\u003e\u003cp\u003eIsrael has previously said that its troops have fired \u0026#34;warning shots\u0026#34;, and that it was implementing \u0026#34;lessons learned\u0026#34;. It accuses Hamas of instigating chaos near the aid points and disputes the number of deaths reported.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250711-084946-a521911844-web-2.25.0-9/grey-placeholder.png\" aria-label=\"image unavailable\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/4361/live/86f1a320-696d-11f0-ba8e-91d56f9acc4a.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/4361/live/86f1a320-696d-11f0-ba8e-91d56f9acc4a.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/4361/live/86f1a320-696d-11f0-ba8e-91d56f9acc4a.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/4361/live/86f1a320-696d-11f0-ba8e-91d56f9acc4a.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/4361/live/86f1a320-696d-11f0-ba8e-91d56f9acc4a.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/4361/live/86f1a320-696d-11f0-ba8e-91d56f9acc4a.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/4361/live/86f1a320-696d-11f0-ba8e-91d56f9acc4a.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/4361/live/86f1a320-696d-11f0-ba8e-91d56f9acc4a.jpg.webp\" loading=\"lazy\" alt=\"Mary Sheikh al-Eid\u0026#39;s daughter, Warshazat (R), is comforted after her body is brought to Nasser Hospital in Khan Younis, southern Gaza (24 July 2025) \"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eMary Sheikh al-Eid\u0026#39;s daughter, Warshazat (R), was comforted at Nasser hospital\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eMedics at Nasser hospital in Khan Younis said Mary Sheikh al-Eid died from a bullet injury to the neck. She is one of two women known to have been killed on Thursday\u0026#39;s \u0026#34;women\u0026#39;s day\u0026#34;.\u003c/p\u003e\u003cp\u003eThe BBC also spoke to the family of the second woman who was killed, Khadija Abu Anza.\u003c/p\u003e\u003cp\u003eOne sister, Samah, who was with her said that they were travelling to a GHF aid site when an Israeli tank and troops arrived.\u003c/p\u003e\u003cp\u003eFrom a distance of just metres, the troops first fired warning shots as they told them to move back, Samah said on Friday.\u003c/p\u003e\u003cp\u003e\u0026#34;We started walking back and then she was hit by the bullet,\u0026#34; Samah said. \u0026#34;They shot her in the neck and she died immediately.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;I tried to carry her and her blood fell on me, a man helped me carry her to Nasser hospital. The aid point was opened right after they shot her and they let people go in.\u0026#34;\u003c/p\u003e\u003cp\u003eIn response to the BBC, the Israel Defense Forces (IDF) said it had \u0026#34;identified suspects who approached them, posing a threat to the troops\u0026#34; and \u0026#34;fired warning shots\u0026#34; early on Thursday, but added that it was unaware of casualties. \u003c/p\u003e\u003cp\u003eIt said the shots were fired \u0026#39;hundreds of meters away\u0026#39; from the distribution site, before its opening hours.\u003c/p\u003e\u003cp\u003eA spokesperson for the GHF said there were no incidents or fatalities near its site on Thursday.\u003c/p\u003e\u003cp\u003e\u0026#34;Overall, the day was very successful, with a lot of mothers and daughters participating,\u0026#34; they added.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250711-084946-a521911844-web-2.25.0-9/grey-placeholder.png\" aria-label=\"image unavailable\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/4412/live/ba49cb10-696f-11f0-af20-030418be2ca5.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/4412/live/ba49cb10-696f-11f0-af20-030418be2ca5.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/4412/live/ba49cb10-696f-11f0-af20-030418be2ca5.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/4412/live/ba49cb10-696f-11f0-af20-030418be2ca5.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/4412/live/ba49cb10-696f-11f0-af20-030418be2ca5.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/4412/live/ba49cb10-696f-11f0-af20-030418be2ca5.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/4412/live/ba49cb10-696f-11f0-af20-030418be2ca5.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/4412/live/ba49cb10-696f-11f0-af20-030418be2ca5.jpg.webp\" loading=\"lazy\" alt=\"Reuters Palestinian women and girls seek aid supplies from a distribution site in southern Gaza run by the US- and Israel-backed Gaza Humanitarian Foundation (GHF), near Rafah, in the southern Gaza Strip (24 July 2025)\"/\u003e\u003cspan\u003eReuters\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eUntil May, UN agencies, other international organisations and charities provided most of the aid to Gaza\u0026#39;s population at 400 distribution sites throughout the territory.\u003c/p\u003e\u003cp\u003eThe introduction of the GHF has been criticised by many in the aid community as an attempt to undermine the previous humanitarian system and increase Israeli control over the distribution of food in Gaza, forcing people into dangerous military locations. The UN refuses to cooperate with the GHF system calling it unethical.\u003c/p\u003e\u003cp\u003eIn recent days, Israel\u0026#39;s control over food deliveries to Gaza has been widely condemned by many European governments and the aid groups. \u003c/p\u003e\u003cp\u003eIsrael says that it introduced the GHF system because Hamas was previously diverting and profiting from aid under the United Nations-led system, though it hasn\u0026#39;t provided evidence to show this happening on a systematic basis.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250711-084946-a521911844-web-2.25.0-9/grey-placeholder.png\" aria-label=\"image unavailable\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/5c48/live/f934e370-696d-11f0-ba8e-91d56f9acc4a.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/5c48/live/f934e370-696d-11f0-ba8e-91d56f9acc4a.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/5c48/live/f934e370-696d-11f0-ba8e-91d56f9acc4a.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/5c48/live/f934e370-696d-11f0-ba8e-91d56f9acc4a.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/5c48/live/f934e370-696d-11f0-ba8e-91d56f9acc4a.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/5c48/live/f934e370-696d-11f0-ba8e-91d56f9acc4a.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/5c48/live/f934e370-696d-11f0-ba8e-91d56f9acc4a.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/5c48/live/f934e370-696d-11f0-ba8e-91d56f9acc4a.jpg.webp\" loading=\"lazy\" alt=\"Men carry the body of Mary Sheikh al-Eid at Nasser Hospital, in Khan Younis, southern Gaza (25 July 2025)\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eThe UN says it has recorded the killing of more than 1,000 Palestinians seeking aid since late May\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eDaily reports of death from malnutrition are gathering pace in Gaza. Humanitarian officials say that the territory must be flooded with aid in order to avert a total collapse.\u003c/p\u003e\u003cp\u003eUnder international law, Israel as the military power occupying Gaza has an obligation to protect civilian life - ensuring people can find food to survive. However Israel has blamed Hamas and aid agencies for the current shortages, while continuing to support the GHF distribution model.\u003c/p\u003e\u003cp\u003e\u0026#34;I pray to God they get shut down, they are death traps,\u0026#34; says Mary\u0026#39;s sister Khawla. \u0026#34;She went to get food for her children but she returned by people carrying her body.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003ci id=\"additional-reporting-by-the-bbc\u0026#39;s-freelance-gaza-team-and-bbc-verify\u0026#39;s-mohamed-shalaby\"\u003eAdditional reporting by the BBC\u0026#39;s freelance Gaza team and BBC Verify\u0026#39;s Mohamed Shalaby\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-07-26T15:44:56.625Z",
  "modifiedTime": "2025-07-26T18:05:36.821Z"
}
