{
  "id": "7f945779-1f93-4551-b82f-ff8d2cec59bd",
  "title": "Syria: Over 1,000 killed in 2 days as Assad loyalists, forces, militants clash",
  "link": "https://timesofindia.indiatimes.com/world/rest-of-world/syria-over-1000-killed-in-2-days-as-assad-loyalists-security-forces-and-militants-clash-in-deadliest-violence-in-years/articleshow/118812478.cms",
  "description": "Intense fighting in Syria over two days has resulted in a death toll exceeding 1,000, marking one of the deadliest incidents in the 14-year conflict. Clashes between government forces and loyalists of ousted President Assad led to significant civilian casualties and mass displacement, with significant tension remaining in the region.",
  "author": "TOI World Desk",
  "published": "2025-03-09T05:16:13+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 1828,
  "excerpt": "Rest of World News: Intense fighting in Syria over two days has resulted in a death toll exceeding 1,000, marking one of the deadliest incidents in the 14-year conflict.",
  "siteName": "Times Of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "The death toll from two days of intense fighting in Syria has surpassed 1,000, making it one of the deadliest incidents in the country’s 14-year conflict, a war monitoring group said. The clashes involved Syrian security forces, armed loyalists of ousted President Bashar Assad, and retaliatory attacks. According to the Syrian Observatory for Human Rights, civilians bore the brunt of the violence, with hundreds killed in close-range shootings. Electricity and water services have been cut in affected areas. Thousands have fled, fearing further bloodshed. Fighting erupted last Thursday, marking a major challenge to the new government that took power after Assad’s removal three months ago. Government forces say they were responding to attacks from Assad’s remaining loyalists, but the violence quickly escalated. Revenge killings broke out on Friday, with Sunni gunmen targeting Alawites, the sect that largely supported Assad.What threat does the surge in violence in Syria pose? | Inside Story Eyewitnesses in Baniyas described horrific scenes to news agency Associated Press, with bodies lying in the streets and homes burned. Survivors reported that armed men were executing Alawites after checking their IDs. Many Alawite families have fled to nearby mountains, while some sought shelter at a Russian airbase in Hmeimim. Government forces claim they have regained control of most of the affected areas and have restricted access to Syria’s coastal region. However, tensions remain high. On Saturday, 31 bodies were buried in a mass grave in Tuwaym, including children. The conflict started when government forces tried to arrest a suspect near Jableh but were ambushed by Assad loyalists. The situation quickly spiraled into large-scale violence, highlighting Syria’s ongoing instability even after Assad’s departure.",
  "image": "https://static.toiimg.com/thumb/msid-118812539,width-1070,height-580,imgsize-111312,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-118812539,imgsize-111312,width-400,resizemode-4/118812539.jpg\" alt=\"Syria: Over 1,000 killed in 2 days as Assad loyalists, security forces, and militants clash in deadliest violence in years\" title=\"AP photo\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe death toll from two days of intense fighting in Syria has surpassed 1,000, making it one of the deadliest incidents in the country’s 14-year conflict, a war monitoring group said. The clashes involved Syrian security forces, armed loyalists of ousted President Bashar Assad, and retaliatory attacks. \u003cbr/\u003eAccording to the Syrian Observatory for Human Rights, civilians bore the brunt of the violence, with hundreds killed in close-range shootings. \u003cbr/\u003eElectricity and water services have been cut in affected areas. Thousands have fled, fearing further bloodshed.\u003cbr/\u003e Fighting erupted last Thursday, marking a major challenge to the new government that took power after Assad’s removal three months ago. Government forces say they were responding to attacks from Assad’s remaining loyalists, but the violence quickly escalated. Revenge killings broke out on Friday, with Sunni gunmen targeting Alawites, the sect that largely supported Assad.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eWhat threat does the surge in violence in Syria pose? | Inside Story\u003c/p\u003e\u003c/div\u003e\u003cp\u003e Eyewitnesses in Baniyas described horrific scenes to news agency Associated Press, with bodies lying in the streets and homes burned. Survivors reported that armed men were executing Alawites after checking their IDs. Many Alawite families have fled to nearby mountains, while some sought shelter at a Russian airbase in Hmeimim.\u003cbr/\u003e Government forces claim they have regained control of most of the affected areas and have restricted access to Syria’s coastal region. However, tensions remain high. \u003cbr/\u003eOn Saturday, 31 bodies were buried in a mass grave in Tuwaym, including children.\u003cbr/\u003e The conflict started when government forces tried to arrest a suspect near Jableh but were ambushed by Assad loyalists. The situation quickly spiraled into large-scale violence, highlighting Syria’s ongoing instability even after Assad’s departure.\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-03-09T05:16:00+05:30",
  "modifiedTime": null
}
