{
  "id": "81e30176-ef65-486e-bfbd-07e60de0e245",
  "title": "LA crews race to halt wildfires ahead of high winds",
  "link": "https://www.bbc.com/news/articles/ckgy0pyvglpo",
  "description": "The dry Santa Ana winds are expected to pick up overnight and continue to cause problems until Wednesday.",
  "author": "",
  "published": "Mon, 13 Jan 2025 00:16:43 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Max Matza",
  "length": 5694,
  "excerpt": "The dry Santa Ana winds are expected to pick up overnight and continue to cause problems until Wednesday.",
  "siteName": "BBC News",
  "favicon": "https://www.bbc.com/bbcx/apple-touch-icon.png",
  "text": "Watch: 'Homes razed to the ground' on Malibu iconic coastal roadWeather forecasters in California are warning fierce winds which fuelled the infernos around Los Angeles are expected to pick up again this week, as fire crews on the ground race to make progress controlling three wildfires.Officials warned that after a weekend of relatively calm winds, the notoriously dry Santa Ana winds would pick up again from Sunday night until Wednesday, reaching speeds of up to 60mph (96km/h).Ahead of the wind's uptick, some progress has been made in stopping the spread of the deadly Palisades and Eaton fires, which are burning on opposite ends of the city. Local firefighters are being assisted by crews from eight other states, as well as Canada and Mexico, who continue to arrive.In a news conference on Sunday, officials said that 16 people have been confirmed dead, and another 16 remain missing.They also warned that the death toll is expected to rise as urban search and rescue crews sweep the ruins using cadaver dogs. Three conflagrations continue to burn around Los Angeles. The largest fire is the Palisades, which has now burnt through more than 23,000 acres and is 11% contained.The Eaton fire is the second biggest and has burnt through more than 14,000 acres. It is 27% contained.The Hurst fire has grown to 799 acres and has been almost fully contained.While crews have managed to start containing the largest fires, authorities have warned the incoming wind event could lead to \"potential disastrous wind conditions\", with the whole of LA County put under fire threat.\"Unfortunately, we're going right back into red flag conditions with some potential disastrous wind conditions between now and Wednesday, with the peak winds expected to be on Tuesday,\" Pasadena fire chief Chad Augustin told the BBC.\"While we're making some progress, the end is not even close yet,\" he said.Kristin Crowley, the fire chief for the city of LA, called for residents near evacuation zones to be prepared to flee if an order is issued, and to stay off the roads as much as possible in order to not hinder crews.Topanga Canyon resident Alice Husum, 67, told the BBC a new fire that began in the area overnight was quickly contained, but that she and her neighbours are all \"dreading Tuesday\" when the wind speeds are likely to peak.But Ms Husum, who has stayed behind despite evacuation orders, notes that the forecast \"is a little better than the 100 mile-gusts that were hammering us\" earlier in the week.New fires continued to flare up on Sunday, threatening communities in the San Fernando Valley and near Nasa's Jet Propulsion Laboratory (JPL). On Sunday, firefighters were able to quickly stop the spread of new fires in the Angeles National Forest, which surround the facility that is at the heart of the US space programme and contains top secret technology. Authorities race to stop fire approaching Nasa facilityAt least 29 people have been arrested for looting in mandatory evacuation zones. Two people were caught posing as firefighters in order to steal from evacuees. Los Angeles County Sheriff Robert Luna said in a news conference Sunday he had requested more National Guard troops to bolster the 400 already in the area. California Governor Gavin Newsom has since announced that 1,000 additional members of the National Guard would be deployed.\"When I was out there in the Malibu area, I saw a gentleman that looked like a firefighter. And I asked him if he was okay because he was sitting down. I didn't realise we had him in handcuffs,\" Sheriff Luna told reporters. \"We are turning him over to LAPD because he was dressed like a fireman, and he was not. He just got caught burglarising a home. So those are issues that our front-line deputies and police officers are dealing with.\"There are now 14,000 firefighters in the southern California region, being assisted by 84 aircrafts and 1,354 fire engines, said Sheriff Luna.Evacuation numbers have dropped, with around 105,000 residents still under mandatory evacuation orders and 87,000 under evacuation warnings.Deanne Criswell, the administrator of the Federal Emergency Management Agency (Fema), told CNN on Sunday that a significant threat remained.\"I know that so many people probably want to get back into the area and check on their homes, but with winds picking back up, you never know which way they're going to go,\" she said.LAPD Chief Jim McDonnell said that limited access had been allowed to evacuated residents over the weekend, but that his officers are once again barring all residents from returning.ReutersOfficials have issued repeated orders for drone operators to not fly near fire zones, and are now seeking information after a drone crashed into a vital plane.The FBI has shared photos of the small drone which on Thursday collided with a plane known as a \"Super Scooper\", one of the world's most affective firefighting aircrafts, briefly grounding it.The drone ripped a 3-by-6-inch (8-by-15cm) hole in the plane.FBIOfficials have also warned of scammers seeking to take advantage of victims, and issued a stern warning that anyone caught price gouging will be prosecuted.Meanwhile the spat between California Governor Newsom and President-elect Donald Trump continues. Trump, who takes office on 20 January and has been invited by the governor to come tour the fire damage, on Saturday blamed \"incompetent\" politicians for \"one of the worst catastrophes in the history of our country\".Newsom, who is a Democrat, has in turn attacked Trump for sharing misinformation about the fires. In an interview on Sunday with NBC, Newsom called Trump's false claims \"inexcusable\".With additional reporting from Regan Morris",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e05f/live/09b50410-d133-11ef-b770-9b10717d0e64.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eWatch: \u0026#39;Homes razed to the ground\u0026#39; on Malibu iconic coastal road\u003c/figcaption\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eWeather forecasters in California are warning fierce winds which fuelled the infernos around Los Angeles are expected to pick up again this week, as fire crews on the ground race to make progress controlling three wildfires.\u003c/p\u003e\u003cp\u003eOfficials warned that after a weekend of relatively calm winds, the notoriously dry Santa Ana winds would pick up again from Sunday night until Wednesday, reaching speeds of up to 60mph (96km/h).\u003c/p\u003e\u003cp\u003eAhead of the wind\u0026#39;s uptick, some progress has been made in stopping the spread of the deadly Palisades and Eaton fires, which are burning on opposite ends of the city. Local firefighters are being assisted by crews from eight other states, as well as Canada and Mexico, who continue to arrive.\u003c/p\u003e\u003cp\u003eIn a news conference on Sunday, officials said that 16 people have been confirmed dead, and another 16 remain missing.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThey also warned that the death toll is expected to rise as urban search and rescue crews sweep the ruins using cadaver dogs. \u003c/p\u003e\u003cp\u003eThree conflagrations continue to burn around Los Angeles. \u003c/p\u003e\u003cp\u003eThe largest fire is the Palisades, which has now burnt through more than 23,000 acres and is 11% contained.\u003c/p\u003e\u003cp\u003eThe Eaton fire is the second biggest and has burnt through more than 14,000 acres. It is 27% contained.\u003c/p\u003e\u003cp\u003eThe Hurst fire has grown to 799 acres and has been almost fully contained.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eWhile crews have managed to start containing the largest fires, authorities have warned the incoming wind event could lead to \u0026#34;potential disastrous wind conditions\u0026#34;, with the whole of LA County put under fire threat.\u003c/p\u003e\u003cp\u003e\u0026#34;Unfortunately, we\u0026#39;re going right back into red flag conditions with some potential disastrous wind conditions between now and Wednesday, with the peak winds expected to be on Tuesday,\u0026#34; Pasadena fire chief Chad Augustin told the BBC.\u003c/p\u003e\u003cp\u003e\u0026#34;While we\u0026#39;re making some progress, the end is not even close yet,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eKristin Crowley, the fire chief for the city of LA, called for residents near evacuation zones to be prepared to flee if an order is issued, and to stay off the roads as much as possible in order to not hinder crews.\u003c/p\u003e\u003cp\u003eTopanga Canyon resident Alice Husum, 67, told the BBC a new fire that began in the area overnight was quickly contained, but that she and her neighbours are all \u0026#34;dreading Tuesday\u0026#34; when the wind speeds are likely to peak.\u003c/p\u003e\u003cp\u003eBut Ms Husum, who has stayed behind despite evacuation orders, notes that the forecast \u0026#34;is a little better than the 100 mile-gusts that were hammering us\u0026#34; earlier in the week.\u003c/p\u003e\u003cp\u003eNew fires continued to flare up on Sunday, threatening communities in the San Fernando Valley and near Nasa\u0026#39;s Jet Propulsion Laboratory (JPL). \u003c/p\u003e\u003cp\u003eOn Sunday, firefighters were able to quickly stop the spread of new fires in the Angeles National Forest, which surround the facility that is at the heart of the US space programme and contains top secret technology. \u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eAuthorities race to stop fire approaching Nasa facility\u003c/figcaption\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAt least 29 people have been arrested for looting in mandatory evacuation zones. Two people were caught posing as firefighters in order to steal from evacuees. \u003c/p\u003e\u003cp\u003eLos Angeles County Sheriff Robert Luna said in a news conference Sunday he had requested more National Guard troops to bolster the 400 already in the area. California Governor Gavin Newsom has since announced that 1,000 additional members of the National Guard would be deployed.\u003c/p\u003e\u003cp\u003e\u0026#34;When I was out there in the Malibu area, I saw a gentleman that looked like a firefighter. And I asked him if he was okay because he was sitting down. I didn\u0026#39;t realise we had him in handcuffs,\u0026#34; Sheriff Luna told reporters. \u003c/p\u003e\u003cp\u003e\u0026#34;We are turning him over to LAPD because he was dressed like a fireman, and he was not. He just got caught burglarising a home. So those are issues that our front-line deputies and police officers are dealing with.\u0026#34;\u003c/p\u003e\u003cp\u003eThere are now 14,000 firefighters in the southern California region, being assisted by 84 aircrafts and 1,354 fire engines, said Sheriff Luna.\u003c/p\u003e\u003cp\u003eEvacuation numbers have dropped, with around 105,000 residents still under mandatory evacuation orders and 87,000 under evacuation warnings.\u003c/p\u003e\u003cp\u003eDeanne Criswell, the administrator of the Federal Emergency Management Agency (Fema), told CNN on Sunday that a significant threat remained.\u003c/p\u003e\u003cp\u003e\u0026#34;I know that so many people probably want to get back into the area and check on their homes, but with winds picking back up, you never know which way they\u0026#39;re going to go,\u0026#34; she said.\u003c/p\u003e\u003cp\u003eLAPD Chief Jim McDonnell said that limited access had been allowed to evacuated residents over the weekend, but that his officers are once again barring all residents from returning.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/e05f/live/09b50410-d133-11ef-b770-9b10717d0e64.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/e05f/live/09b50410-d133-11ef-b770-9b10717d0e64.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/e05f/live/09b50410-d133-11ef-b770-9b10717d0e64.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/e05f/live/09b50410-d133-11ef-b770-9b10717d0e64.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/e05f/live/09b50410-d133-11ef-b770-9b10717d0e64.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/e05f/live/09b50410-d133-11ef-b770-9b10717d0e64.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/e05f/live/09b50410-d133-11ef-b770-9b10717d0e64.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/e05f/live/09b50410-d133-11ef-b770-9b10717d0e64.jpg.webp\" alt=\"Reuters Firefighters work near a church destroyed in the Palisades Fire, in the Pacific Palisades neighborhood in Los Angeles, California, U.S. January 10, 2025.\"/\u003e\u003cspan\u003eReuters\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eOfficials have issued repeated orders for drone operators to not fly near fire zones, and are now seeking information after a drone crashed into a vital plane.\u003c/p\u003e\u003cp\u003eThe FBI has shared photos of the small drone which on Thursday collided with a plane known as a \u0026#34;Super Scooper\u0026#34;, one of the world\u0026#39;s most affective firefighting aircrafts, briefly grounding it.\u003c/p\u003e\u003cp\u003eThe drone ripped a 3-by-6-inch (8-by-15cm) hole in the plane.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/0eed/live/97d70450-d129-11ef-a3cd-fb3afb972e12.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/0eed/live/97d70450-d129-11ef-a3cd-fb3afb972e12.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/0eed/live/97d70450-d129-11ef-a3cd-fb3afb972e12.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/0eed/live/97d70450-d129-11ef-a3cd-fb3afb972e12.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/0eed/live/97d70450-d129-11ef-a3cd-fb3afb972e12.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/0eed/live/97d70450-d129-11ef-a3cd-fb3afb972e12.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/0eed/live/97d70450-d129-11ef-a3cd-fb3afb972e12.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/0eed/live/97d70450-d129-11ef-a3cd-fb3afb972e12.jpg.webp\" alt=\"FBI Pieces of drone in an evidence bag\"/\u003e\u003cspan\u003eFBI\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eOfficials have also warned of scammers seeking to take advantage of victims, and issued a stern warning that anyone caught price gouging will be prosecuted.\u003c/p\u003e\u003cp\u003eMeanwhile the spat between California Governor Newsom and President-elect Donald Trump continues. \u003c/p\u003e\u003cp\u003eTrump, who takes office on 20 January and has been invited by the governor to come tour the fire damage, on Saturday blamed \u0026#34;incompetent\u0026#34; politicians for \u0026#34;one of the worst catastrophes in the history of our country\u0026#34;.\u003c/p\u003e\u003cp\u003eNewsom, who is a Democrat, has in turn attacked Trump for sharing misinformation about the fires. \u003c/p\u003e\u003cp\u003eIn an interview on Sunday with NBC, Newsom called Trump\u0026#39;s false claims \u0026#34;inexcusable\u0026#34;.\u003c/p\u003e\u003cp\u003e\u003ci id=\"with-additional-reporting-from-regan-morris\"\u003eWith additional reporting from Regan Morris\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/2590/live/24811fe0-d147-11ef-9fd6-0be88a764111.png.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/2590/live/24811fe0-d147-11ef-9fd6-0be88a764111.png.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/2590/live/24811fe0-d147-11ef-9fd6-0be88a764111.png.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/2590/live/24811fe0-d147-11ef-9fd6-0be88a764111.png.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/2590/live/24811fe0-d147-11ef-9fd6-0be88a764111.png.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/2590/live/24811fe0-d147-11ef-9fd6-0be88a764111.png.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/2590/live/24811fe0-d147-11ef-9fd6-0be88a764111.png.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/2590/live/24811fe0-d147-11ef-9fd6-0be88a764111.png.webp\" alt=\"Map with title \u0026#34;California wildfires tackling three blazes\u0026#34;, shows the locations of the Palisades, Eaton and Hurst fires in Los Angeles.\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-01-12T22:42:29.712Z",
  "modifiedTime": null
}
