{
  "id": "87772e51-d441-485b-88b0-9c92f1a50539",
  "title": "Inflation job nearly done but tariff risks loom — What European Central Bank members said this week",
  "link": "https://www.cnbc.com/2025/04/25/ecb-members-say-inflation-job-nearly-done-but-tariff-risks-loom.html",
  "description": "On tariffs, one central banker said: \"In the short run, we will have lower growth. We will probably also have lower inflation.\"",
  "author": "",
  "published": "Fri, 25 Apr 2025 13:24:46 GMT",
  "source": "https://www.cnbc.com/id/100727362/device/rss/rss.html",
  "categories": null,
  "byline": "Jenni Reid",
  "length": 6677,
  "excerpt": "On tariffs, one central banker said: \"In the short run, we will have lower growth. We will probably also have lower inflation.\"",
  "siteName": "CNBC",
  "favicon": "",
  "text": "Guests and attendeess mingle and walk through the atrium during the IMF/World Bank Group Spring Meetings at the IMF headquarters in Washington, DC, on April 24, 2025. Jim Watson | Afp | Getty ImagesAfter years dominated by the pandemic, supply chains, energy and inflation, there was a new topic topping the agenda at the World Bank and International Monetary Fund's Spring Meetings this year: tariffs.The IMF set the tone by kicking off the week with the release of its latest economic forecasts, which cut growth outlooks for the U.S., U.K. and many Asian countries. While economists, central bankers and politicians have been engaged in panels and behind-the-scenes talks, many are attempting to work out whether trade tensions between China and the U.S. are — or perhaps are not — cooling.Policymakers from the European Central Bank that CNBC spoke to this week broadly stuck a dovish-leaning tone, indicating they saw interest rates continuing to fall and few upside risks to euro zone inflation. However, all stressed the current high levels of uncertainty, the need to keep monitoring data, and the high risks to the growth outlook — sentiments also echoed by Bank of England Governor Andrew Bailey in his interview with CNBC on Thursday.These were some of the main messages from ECB members this week.Christine Lagarde, European Central Bank presidentOn inflation and monetary policy:\"We're heading towards our [inflation] target in the course of 2025, so that disinflationary process is so much on track that we are nearing completion. But we have the shocks, you know, and the shocks will be a dampen on GDP. It's a negative shock to demand.\"\"The net impact on inflation will depend on what countermeasures are eventually taken by Europe. Then we have to take into account the [German] fiscal push by the defense investments, by the infrastructure fund.\"\"We have seen successive movements, you know, announcement [of U.S. tariffs], and then a pause, and then some exemptions. So we have to be very attentive... Either we cut, either we pause, but we will be data dependent to the extreme.\"On market moves:\"When we had done our projections, we anticipated that... the dollar would appreciate, the euro would depreciate. It's not what we saw. And there have been some counter-intuitive movements in various categories.\"\"The German market has obviously been shocked in a positive way by the program soon to be put in place by the German government, with a commitment to defense, with a commitment to a big fund for infrastructure development.\"Klaas Knot, The Netherlands Bank presidentOn tariff uncertainty:\"If I look back over the last 14 years, in the initial days of the pandemic I think that was comparable uncertainty to what we have now.\"\"In the short run, it's crystal clear that the uncertainty that is created by the unpredictability of the tariff actions by the U.S. government works as a strong negative factor for growth. Basically, uncertainty is like a tax without revenue.\"On the inflation impact:\"In the short run, we will have lower growth. We will probably also have lower inflation. As we also see, the euro is appreciating as energy prices have also come down. So together with the sort of negative factor uncertainty in the short run, it's crystal clear that it will accelerate the disinflation.\"\"But in the medium term, the inflation outlook is not all that clear. I think there are still these negative factors. But in the medium term, you might get retaliation. You might get the disruption of global value chains, which might also be inflationary in other parts of the world than the U.S. only. And then, of course, we have the fiscal policy coming in in Europe. So this is actually a time in which you need projections.\"On a June rate cut and market pricing for two more ECB rate cuts in 2025:\"I'm fully open minded. I think it's way too early to already take a position on June, whether it would be another cut. It will fully depend on these projections.\"\"I would need to see a more structured analysis of the impact on the inflation profile ahead of us, and only then can I say whether the market is pricing fair or whether I don't.\"Robert Holzmann, Austrian National Bank governorOn the need to wait for more data and news on tariffs:\"We have not seen this uncertainty now for years... unless the uncertainty subsides, by the right decisions, we will have to hold back a number of our decisions, and hence, we don't know yet in what direction monetary policy should be best moved.\"\"Before looking at data in detail, the question is, what kind of political decisions will be taken? Is it that we will have some tariff increases? Is it that we will have strong tariff increases? Is it that we will have retribution by high counter tariffs?\"On the ECB's April rate cut:\"I think there's a broad consensus [on rates]. But of course, at the margin, people differ.\"\"My assessment is that at this time, it wasn't clear yet to what extent [tariff] countermeasures were being taken. Because with countermeasures in Europe, prices may have increased. Without countermeasures, quite likely the price pressure is downward. And for the time being, we don't know yet the direction.\"On the direction of interest rates:\"I think if the recent noises about an arrangement [on trade] were to be true, in this case, quite likely it is more towards the downside than the upside with regard to prices. But this can be changed with different decisions and the result of which, we may even imagine in [the] other direction. For the time being, no, it will be down.\"\"There may be further cuts this year, but the number is still outstanding.\"Mārtiņš Kazāks, Bank of Latvia governorOn opportunity from tariffs:\"With all this uncertainty and vulnerability, this is also the time of opportunities for Europe.\"\"It's a time for Europe to grasp all the aspects of being an economic superpower and becoming a really fully-fledged political and geopolitical superpower, and this requires doing all the decisions that in the past, were not carried out fully.\"\"This requires political will, political guts to make those decisions, and to strengthen the European economy and assert its place in a global world.\"On market reaction to tariffs:\"So far it seems to be relatively orderly ... but if one looks at the spillovers to Europe, the financial markets are working more or less fine, we haven't seen spreads exploding or anything like that.\"\"But in terms, however, of the macro scenarios, this uncertainty is extremely elevated in the sense that, given the possible outcomes, the multiple scenarios and their probabilities are very similar with the baseline [tariff] scenario.\"",
  "image": "https://image.cnbcfm.com/api/v1/image/108136588-1745576826778-gettyimages-2211097753-AFP_43CW6GW.jpeg?v=1745578947\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108136588\" data-test=\"InlineImage\"\u003e\u003cp\u003eGuests and attendeess mingle and walk through the atrium during the IMF/World Bank Group Spring Meetings at the IMF headquarters in Washington, DC, on April 24, 2025. \u003c/p\u003e\u003cp\u003eJim Watson | Afp | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAfter years dominated by the pandemic, supply chains, energy and inflation, there was a new topic topping the agenda at the World Bank and International Monetary Fund\u0026#39;s Spring Meetings this year: tariffs.\u003c/p\u003e\u003cp\u003eThe IMF set the tone by kicking off the week with the release of its latest economic forecasts, which cut growth outlooks for the \u003ca href=\"https://www.cnbc.com/2025/04/22/imf-slashes-us-growth-forecast-by-nearly-one-percentage-point.html\"\u003eU.S.\u003c/a\u003e, \u003ca href=\"https://www.cnbc.com/2025/04/22/imf-slashes-uks-growth-forecast-points-to-us-tariffs-and-borrowing-costs.html\"\u003eU.K.\u003c/a\u003e and \u003ca href=\"https://www.cnbc.com/2025/04/23/imf-cuts-2025-growth-forecast-for-major-asian-economies.html\"\u003emany Asian countries\u003c/a\u003e. While economists, central bankers and politicians have been engaged in panels and behind-the-scenes talks, many are attempting to work out whether trade tensions between China and the U.S. \u003ca href=\"https://www.cnbc.com/2025/04/22/bessent-trump-tariffs-china-deescalate.html\"\u003eare\u003c/a\u003e — or \u003ca href=\"https://www.cnbc.com/2025/04/24/china-says-no-talks-with-the-us-on-trade-calls-for-canceling-unilateral-tariffs.html\"\u003eperhaps are not\u003c/a\u003e — cooling.\u003c/p\u003e\u003cp\u003ePolicymakers from the European Central Bank that CNBC spoke to this week broadly stuck a dovish-leaning tone, indicating they \u003ca href=\"https://www.cnbc.com/2025/04/17/european-central-bank-interest-rate-decision-april-2025.html\"\u003esaw interest rates continuing to fall\u003c/a\u003e and few upside risks to \u003ca href=\"https://www.cnbc.com/2025/04/01/euro-zone-inflation-march-2025-.html\"\u003eeuro zone inflation\u003c/a\u003e. However, all stressed the current high levels of uncertainty, the need to keep monitoring data, and the high risks to the growth outlook — sentiments also echoed by \u003ca href=\"https://www.cnbc.com/2025/04/24/bank-of-england-chief-focused-on-tariff-growth-shock.html\"\u003eBank of England Governor Andrew Bailey in his interview with CNBC\u003c/a\u003e on Thursday.\u003c/p\u003e\u003cp\u003eThese were some of the main messages from ECB members this week.\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline0\"\u003e\u003c/a\u003eChristine Lagarde, European Central Bank president\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eOn inflation and monetary policy:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;We\u0026#39;re heading towards our [inflation] target in the course of 2025, so that disinflationary process is so much on track that we are nearing completion. But we have the shocks, you know, and the shocks will be a dampen on GDP. It\u0026#39;s a negative shock to demand.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;The net impact on inflation will depend on what \u003ca href=\"https://www.cnbc.com/2025/04/10/european-union-to-put-countermeasures-to-us-tariffs-on-hold-for-90-days.html\"\u003ecountermeasures\u003c/a\u003e are eventually taken by Europe. Then we have to take into account the \u003ca href=\"https://www.cnbc.com/2025/03/21/german-upper-house-of-parliament-oks-debt-reform-half-trillion-fund.html\"\u003e[German] fiscal push\u003c/a\u003e by the defense investments, by the infrastructure fund.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;We have seen successive movements, you know, announcement [\u003ca href=\"https://www.cnbc.com/2025/04/02/trump-reciprocal-tariffs-countries-chart-imports-united-states.html\"\u003eof U.S. tariffs\u003c/a\u003e], and then a \u003ca href=\"https://www.cnbc.com/2025/04/09/trump-announces-90-day-tariff-pause-for-at-least-some-countries.html\"\u003epause\u003c/a\u003e, and then some exemptions. So we have to be very attentive... Either we cut, either we pause, but we will be data dependent to the extreme.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108134805\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000373522\" aria-labelledby=\"Placeholder-ArticleBody-Video-108134805\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108134806-17453330521745333045-39476022228-1080pnbcnews.jpg?v=1745333051\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"Watch CNBC\u0026#39;s full interview with ECB president Christine Lagarde\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eOn market moves:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;When we had done our projections, we anticipated that... the dollar would appreciate, the euro would depreciate. It\u0026#39;s not what we saw. And there have been some counter-intuitive movements in various categories.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;The German market has obviously been shocked in a positive way by the program soon to be put in place by the German government, with a commitment to defense, with a commitment to a big fund for infrastructure development.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline1\"\u003e\u003c/a\u003eKlaas Knot, The Netherlands Bank president\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eOn tariff uncertainty:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;If I look back over the last 14 years, in the initial days of the pandemic I think that was comparable uncertainty to what we have now.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;In the short run, it\u0026#39;s crystal clear that the uncertainty that is created by the unpredictability of the tariff actions by the U.S. government works as a strong negative factor for growth. Basically, uncertainty is like a tax without revenue.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eOn the inflation impact:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;In the short run, we will have lower growth. We will probably also have lower inflation. As we also see, the euro is appreciating as energy prices have also come down. So together with the sort of negative factor uncertainty in the short run, it\u0026#39;s crystal clear that it will accelerate the disinflation.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108136270\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000373849\" aria-labelledby=\"Placeholder-ArticleBody-Video-108136270\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108136271-17455166511745516647-39507547511-1080pnbcnews.jpg?v=1745516650\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"It\u0026#39;s \u0026#39;crystal clear\u0026#39; that tariffs could hit growth in the short term, ECB\u0026#39;s Knot says\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u0026#34;But in the medium term, the inflation outlook is not all that clear. I think there are still these negative factors. But in the medium term, you might get retaliation. You might get the disruption of global value chains, which might also be inflationary in other parts of the world than the U.S. only. And then, of course, we have the fiscal policy coming in in Europe. So this is actually a time in which you need projections.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eOn a June rate cut and market pricing for two more ECB rate cuts in 2025:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m fully open minded. I think it\u0026#39;s way too early to already take a position on June, whether it would be another cut. It will fully depend on these projections.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;I would need to see a more structured analysis of the impact on the inflation profile ahead of us, and only then can I say whether the market is pricing fair or whether I don\u0026#39;t.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline2\"\u003e\u003c/a\u003eRobert Holzmann, Austrian National Bank governor\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eOn the need to wait for more data and news on tariffs:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;We have not seen this uncertainty now for years... unless the uncertainty subsides, by the right decisions, we will have to hold back a number of our decisions, and hence, we don\u0026#39;t know yet in what direction monetary policy should be best moved.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;Before looking at data in detail, the question is, what kind of political decisions will be taken? Is it that we will have some tariff increases? Is it that we will have strong tariff increases? Is it that we will have retribution by high counter tariffs?\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108136164\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000373827\" aria-labelledby=\"Placeholder-ArticleBody-Video-108136164\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108136165-17455077901745507783-39505993585-1080pnbcnews.jpg?v=1745507789\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"We have not seen this much uncertainty for years, Austrian central bank governor says\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eOn the ECB\u0026#39;s April rate cut:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;I think there\u0026#39;s a broad consensus [on rates]. But of course, at the margin, people differ.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;My assessment is that at this time, it wasn\u0026#39;t clear yet to what extent [tariff] countermeasures were being taken. Because with countermeasures in Europe, prices may have increased. Without countermeasures, quite likely the price pressure is downward. And for the time being, we don\u0026#39;t know yet the direction.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eOn the direction of interest rates:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;I think if the recent noises about an arrangement [on trade] were to be true, in this case, quite likely it is more towards the downside than the upside with regard to prices. But this can be changed with different decisions and the result of which, we may even imagine in [the] other direction. For the time being, no, it will be down.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;There may be further cuts this year, but the number is still outstanding.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline3\"\u003e\u003c/a\u003eMārtiņš Kazāks, Bank of Latvia governor\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eOn opportunity from tariffs:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;With all this uncertainty and vulnerability, this is also the time of opportunities for Europe.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s a time for Europe to grasp all the aspects of being an economic superpower and becoming a really fully-fledged political and geopolitical superpower, and this requires doing all the decisions that in the past, were not carried out fully.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;This requires political will, political guts to make those decisions, and to strengthen the European economy and assert its place in a global world.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108136073\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000373812\" aria-labelledby=\"Placeholder-ArticleBody-Video-108136073\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108136074-17455020621745502057-39504941193-1080pnbcnews.jpg?v=1745502060\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"Global vulnerability an opportunity for Europe, says ECB\u0026#39;s Kazāks\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eOn market reaction to tariffs:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;So far it seems to be relatively orderly ... but if one looks at the spillovers to Europe, the financial markets are working more or less fine, we haven\u0026#39;t seen spreads exploding or anything like that.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;But in terms, however, of the macro scenarios, this uncertainty is extremely elevated in the sense that, given the possible outcomes, the multiple scenarios and their probabilities are very similar with the baseline [tariff] scenario.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-04-25T13:24:46Z",
  "modifiedTime": "2025-04-25T13:24:46Z"
}
