{
  "id": "88eb3f43-9166-4c85-bf17-174e01313a5c",
  "title": "\"It's Just Better\": Trump Says Coca-Cola To Switch To Cane Sugar In US",
  "link": "https://www.ndtv.com/world-news/donald-trump-says-coca-cola-to-switch-to-cane-sugar-in-us-8890366#publisher=newsstand",
  "description": "Beverage giant Coca-Cola has agreed to use real cane sugar in its US production, President Donald Trump announced Wednesday on social media.",
  "author": "",
  "published": "Thu, 17 Jul 2025 04:39:53 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "",
  "length": 3113,
  "excerpt": "Beverage giant Coca-Cola has agreed to use real cane sugar in its US production, President Donald Trump announced Wednesday on social media.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Washington: Beverage giant Coca-Cola has agreed to use real cane sugar in its US production, President Donald Trump announced Wednesday on social media.The company currently uses high-fructose corn syrup (HFCS) in its domestic beverages -- a sweetener that has long drawn criticism from Health Secretary Robert F. Kennedy Jr. and his Make America Healthy Again movement.\"I have been speaking to Coca-Cola about using REAL Cane Sugar in Coke in the United States, and they have agreed to do so,\" Trump wrote on his Truth Social platform.\"I'd like to thank all of those in authority at Coca-Cola. This will be a very good move by them -- You'll see. It's just better!\"The US president did not explain what motivated his push for the change, which would not impact his well-known favorite beverage, Diet Coke.Since his return to the White House, Trump has re-installed a special button in the Oval Office which summons a helping of the sugar-free carbonated drink.Coca-Cola did not immediately confirm the ingredient shift.\"We appreciate President Trump's enthusiasm for our iconic Coca‑Cola brand. More details on new innovative offerings within our Coca‑Cola product range will be shared soon,\" the company said in a short statement.HFCS became popular in the 1970s, with its use skyrocketing thanks to government subsidies for corn growers and high import tariffs on cane sugar.Any shift away from corn is likely to draw backlash in the Corn Belt, a Midwestern region that has been a stronghold of support for Trump.Both HFCS and sucrose (cane sugar) are composed of fructose and glucose. However, they differ structurally: HFCS contains free (unbonded) fructose and glucose in varying ratios -- 55/45 in soft drinks -- while sucrose consists of the two sugars chemically bonded together.These structural differences, however, don't appear to significantly affect health outcomes. A 2022 review of clinical studies found no meaningful differences between HFCS and sucrose in terms of weight gain or heart health.The only notable distinction was an increase in a marker of inflammation in people consuming HFCS. Overall, both sweeteners appear similarly impactful when consumed at equal calorie levels.Despite this, Mexican Coke -- which is made with cane sugar -- is often sold at a premium in US stores and prized for its more \"natural\" flavor.Trump's prized Diet Coke is sweetened with aspartame -- a compound classified as a \"possible carcinogen\" by the International Agency for Research on Cancer (IARC).(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Featured Video Of The Day 'India's Space Program Has Done A Great Job': International Experts",
  "image": "https://c.ndtvimg.com/2025-07/c84b2tkg_coca-cola_625x300_17_July_25.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                        \n                                                                                \u003cp\u003e\u003cb\u003eWashington: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eBeverage giant Coca-Cola has agreed to use real cane sugar in its US production, President Donald Trump announced Wednesday on social media.\u003c/p\u003e\u003cp\u003eThe company currently uses high-fructose corn syrup (HFCS) in its domestic beverages -- a sweetener that has long drawn criticism from Health Secretary Robert F. Kennedy Jr. and his Make America Healthy Again movement.\u003c/p\u003e\u003cp\u003e\u0026#34;I have been speaking to Coca-Cola about using REAL Cane Sugar in Coke in the United States, and they have agreed to do so,\u0026#34; Trump wrote on his Truth Social platform.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;d like to thank all of those in authority at Coca-Cola. This will be a very good move by them -- You\u0026#39;ll see. It\u0026#39;s just better!\u0026#34;\u003c/p\u003e\u003cp\u003eThe US president did not explain what motivated his push for the change, which would not impact his well-known favorite beverage, Diet Coke.\u003c/p\u003e\u003cp\u003eSince his return to the White House, Trump has re-installed a special button in the Oval Office which summons a helping of the sugar-free carbonated drink.\u003c/p\u003e\u003cp\u003eCoca-Cola did not immediately confirm the ingredient shift.\u003c/p\u003e\u003cp\u003e\u0026#34;We appreciate President Trump\u0026#39;s enthusiasm for our iconic Coca‑Cola brand. More details on new innovative offerings within our Coca‑Cola product range will be shared soon,\u0026#34; the company said in a short statement.\u003c/p\u003e\u003cp\u003eHFCS became popular in the 1970s, with its use skyrocketing thanks to government subsidies for corn growers and high import tariffs on cane sugar.\u003c/p\u003e\u003cp\u003eAny shift away from corn is likely to draw backlash in the Corn Belt, a Midwestern region that has been a stronghold of support for Trump.\u003c/p\u003e\u003cp\u003eBoth HFCS and sucrose (cane sugar) are composed of fructose and glucose. However, they differ structurally: HFCS contains free (unbonded) fructose and glucose in varying ratios -- 55/45 in soft drinks -- while sucrose consists of the two sugars chemically bonded together.\u003c/p\u003e\u003cp\u003eThese structural differences, however, don\u0026#39;t appear to significantly affect health outcomes. \u003c/p\u003e\u003cp\u003eA 2022 review of clinical studies found no meaningful differences between HFCS and sucrose in terms of weight gain or heart health.\u003c/p\u003e\u003cp\u003eThe only notable distinction was an increase in a marker of inflammation in people consuming HFCS. Overall, both sweeteners appear similarly impactful when consumed at equal calorie levels.\u003c/p\u003e\u003cp\u003eDespite this, Mexican Coke -- which is made with cane sugar -- is often sold at a premium in US stores and prized for its more \u0026#34;natural\u0026#34; flavor.\u003c/p\u003e\u003cp\u003eTrump\u0026#39;s prized Diet Coke is sweetened with aspartame -- a compound classified as a \u0026#34;possible carcinogen\u0026#34; by the International Agency for Research on Cancer (IARC).\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                                                                \n                                                                                \n                                                                                \u003cdiv\u003e\n                                                    \u003cp\u003eFeatured Video Of The Day\u003c/p\u003e\n                                                    \n                                                    \u003cp\u003e\u0026#39;India\u0026#39;s Space Program Has Done A Great Job\u0026#39;: International Experts\u003c/p\u003e\n\n                                                \u003c/div\u003e\n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
