{
  "id": "8ac1ad5f-90d3-4c25-ad3f-bc509eeadea0",
  "title": "Live Updates: Fate of Iran’s Uranium Stockpile Unclear After U.S. Strikes",
  "link": "https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump",
  "description": "Senior U.S. officials said the attack had severely damaged Iran’s nuclear facilities but conceded they did not know the whereabouts of its supply of near-bomb-grade uranium. President Trump suggested that a new government could take over in Tehran.",
  "author": "The New York Times",
  "published": "Mon, 23 Jun 2025 01:18:07 +0000",
  "source": "https://rss.nytimes.com/services/xml/rss/nyt/World.xml",
  "categories": null,
  "byline": "Maggie Haberman, Farnaz Fassihi, Eric Schmitt, Aaron Boxerman, Michael D. Shear, Katie Benner, Alessandro Marazzi Sassoon, Jamie McGee, Valerie Crowder, Ephrat Livni, Annie Correal, Annie Correal and Sanam Mahoozi, David E. Sanger, Michael Crowley, Anushka Patil, Edward Wong, Stephen Castle, Chelsia Rose Marcius, Euan Ward, Rebecca F. Elliott, Samuel Granados, Josh Holder, Anatoly Kurmanaev, Vivian Nereim, Greg Jaffe",
  "length": 63674,
  "excerpt": "Senior U.S. officials said the attack had severely damaged Iran’s nuclear facilities but conceded they did not know the whereabouts of its supply of near-bomb-grade uranium. President Trump suggested that a new government could take over in Tehran.",
  "siteName": "The New York Times",
  "favicon": "https://www.nytimes.com/vi-assets/static-assets/ios-ipad-144x144-28865b72953380a40aa43318108876cb.png",
  "text": "Here are the latest developments.A day after U.S. bombers and submarines unleashed heavy strikes on a trio of Iranian nuclear facilities, the actual state of Tehran’s nuclear program remained unclear. Top officials said it was too soon to say whether Iran still retained the ability to make a nuclear weapon and the location of its existing stockpile of enriched uranium was unknown.The U.S. strikes stoked fears of a dangerously escalating conflict across the Middle East and urgent calls from world leaders for diplomacy. But after his administration spent much of the day emphasizing that the United States did not intend to enter an all-out war with Tehran, President Trump raised the prospect of regime change in Iran.“If the current Iranian Regime is unable to MAKE IRAN GREAT AGAIN, why wouldn’t there be a Regime change???” Mr. Trump wrote in a post on his social media site.The Iranian nuclear sites — at Fordo, Natanz and Isfahan — sustained what Pentagon officials called “severe damage” from the U.S. strikes. But the status of Iran’s enrichment program remained murky, with senior officials conceding they did not know the whereabouts of Iran’s supply of near-bomb-grade uranium.Rafael Mariano Grossi, the director of the International Atomic Energy Agency, the U.N.’s nuclear watchdog, said he believed the stockpile — which is stored in special casks small enough to fit in the trunks of about 10 cars — had been moved. There was also evidence, according to two Israeli officials with knowledge of the intelligence, that Iran had moved equipment and uranium from the site in recent days.Iranian officials castigated the United States for the strikes, with the country’s foreign minister, Abbas Araghchi, saying at a news conference in Istanbul that Iran “reserves all options to defend its security interests and people.” He declined to be more specific, including about whether Iran would retaliate against U.S. military assets in the Middle East, where more than 40,000 American military personnel are on bases and warships.The U.N. secretary general, António Guterres, called for diplomacy at an emergency meeting of the Security Council, saying that the world now risked “descending into a rathole of retaliation after retaliation.”But American military and intelligence officials had already detected signs that Iran-backed militias were preparing to attack U.S. bases in Iraq, and possibly Syria, in response. Iraqi officials were working hard to dissuade militia action, a U.S. official said on Sunday.Benjamin Netanyahu, the Israeli prime minister, thanked Mr. Trump during a news conference Sunday night, adding that Israel was “very close” to achieving its goals of removing the nuclear and ballistic threats Iran poses to Israel. But Iran’s ambassador to the United Nations, Amir Saeid Iravani, said the United States had “recklessly chosen to sacrifice its own security merely to safeguard Netanyahu.”Mr. Iravani accused the United States, the only country to have ever used nuclear weapons in combat, of waging war on Iran under the “fabricated and absurd pretext” of preventing it from acquiring nuclear weapons. “What a bitter and tragic irony,” he said.Here’s what you need to know:Potential damage: The nuclear sites attacked by the United States include Iran’s two major uranium enrichment centers: the heavily fortified mountain facility at Fordo and a larger enrichment plant at Natanz. The chairman of the Joint Chiefs of Staff, Gen. Dan Caine, said the initial battle damage assessment indicated that all three sites had sustained “severe damage and destruction,” but added that a final assessment would take time. The International Atomic Energy Agency said it had not detected any increases in radiation outside the sites.Possible response: Mr. Trump’s decision to attack Iran was likely to dim hopes for a negotiated solution to end the fighting, only days after the president had indicated he would wait for as long as two weeks to give diplomacy a chance. While U.S. officials say that Iran has depleted its stockpile of medium-range missiles, the country still has an ample supply of other weapons, including rockets and drones.The strikes: Pentagon officials described a tightly choreographed operation that included B-2 bombers carrying 30,000-pound bunker-buster bombs and submarine-fired Tomahawk cruise missiles hitting a trio of sites in less than a half-hour. Satellite images show that the U.S. may have targeted ventilation shafts at Fordo, the enrichment facility. A senior U.S. official acknowledged that the attack on Fordo had not destroyed the heavily fortified site, but said that it had been severely damaged.Mood in Iran: Many Iranians said in phone interviews that they faced an uncertain and frightening future after the strikes. Waking up to work after the strikes, many expressed a combination of sorrow and anger. “We’re all in shock — none of us expected that, within six or seven days, we’d reach this point,” one Iranian said. Read more ›International reaction: America’s allies and adversaries responded with condemnations and calls for restraint, while Gulf nations expressed dismay amid fears of retaliation. Mr. Araghchi arrived in Moscow to meet with President Vladimir V. Putin of Russia, a key ally, on Monday, but there was little sign that Moscow was prepared to provide military assistance.Tricky messaging: Defense Secretary Pete Hegseth sought to assuage concerns that the United States was about to enter a prolonged conflict. Mr. Trump’s allies had been careful on Sunday to characterize the strikes as a focused mission, not the start of a broader military operation. “We’re not at war with Iran,” Vice President JD Vance said in a televised interview on Sunday morning. “We’re at war with Iran’s nuclear program.”Global markets: Oil prices rose moderately as the market opened on Sunday evening, a sign that traders were concerned, though not panicked, about how Iran may respond to the U.S. bombing.What’s next? Now that Mr. Trump has helped Israel, it will most likely kick off a more dangerous phase in the war. Here is a look at Iran’s options.Reporting was contributed by David E. Sanger, Robert Jimison, Michael Gold, Megan Mineiro, Jonathan Swan, Yan Zhuang and Talya Minsberg.Around military bases in the U.S., unease over what comes next.ImageAn Army color guard during a ceremony at Fort Benning in Georgia in April.Credit...Brynn Anderson/Associated PressFor some families who gathered this weekend at Fort Benning in Georgia, the past few days have served as a solemn reminder of the unsettling emotions military service can bring. On Friday, a group of Army enlistees graduated from basic training. On Saturday, President Trump bombed Iran. On Sunday, service members and their loved ones pondered an uncertain future.“People can lose their life, so I’m worried,” said Michele Bixby, 24, of upstate New York, whose brother had just graduated. “But it’s what he wanted to do; it’s what he loves to do. He’s going to move forward with it no matter what.”One day after the administration announced it had carried out airstrikes at three nuclear sites in Iran, the mood in some communities around military bases on U.S. soil varied from firm support to bitter disagreement. But one sentiment stood out among those interviewed: concern for the safety of America’s troops everywhere.No one knows how the strikes on Iran could affect service members. Pete Hegseth, the secretary of defense, emphasized on Sunday that the administration did not want an open-ended war. But Iranian leaders have vowed to retaliate, and U.S. military installations in the Middle East, with more than 40,000 active-duty troops and civilians employed by the Pentagon, are already potential targets.That reality, along with the potential repercussions for the entire military, was on the minds of many people around U.S. bases at home, even as service members accepted that reality as part of the job.“A lot of the families around here are quickly realizing this is a real threat; this is something we need to be worried about,” said Meghan Gilles, 37, a self-described military brat who works in the Army Reserve’s human resources division at Fort Campbell in Kentucky, a training site and home to the 101st Airborne Division.ImageBlake Carlson, right, a National Guard member, was at Eglin Air Force Base on Sunday with his brother Brady, left, and their parents, Garry Pruitt and Tonya Carlson. Credit...Valerie CrowderAt Eglin Air Force Base in Florida, Blake Carlson, a 23-year-old Army National Guard combat medic who was visiting from Austin, Texas, said that he could be deployed. “It’s what I signed up for,” he said. “If I have to, I’ll do it.” But his mother and brother hoped the country would not be dragged into the escalating conflict in the Middle East.Some people who were interviewed stood by Mr. Trump and agreed with his assertions that the targeted bombings were unlikely to lead to a wider conflict. Mr. Carlson’s mother, Tonya Carlson, said she hoped the attack would force Iran to negotiate with the United States.Others stood by Mr. Trump’s statement that Iran posed an imminent threat — a point that contradicts recent national security assessments. “Iran doesn’t need to have nuclear weapons, for sure,” said Tony Saluzzo, 72, a former combat engineer who served in the U.S. offensive against Iraq and lives near Fort Campbell.James Arthur, a 42-year-old retired Coast Guard captain who lives north of Tampa, Fla., and was visiting the Air Force Armament Museum at the Eglin base, said that the Iran airstrikes happened “about two decades too late.”ImageJames Arthur, a retired Coast Guard captain who was visiting the museum at Eglin Air Force Base, said the airstrikes against Iran happened “about two decades too late.”Credit...Valerie CrowderOther former service members castigated Mr. Trump for bombing Iran without congressional approval. The Constitution’s framers included language to ensure that wars would not be entered rashly, said Paul Oyler, a Navy veteran who served in Iraq and Afghanistan and who lives near the Naval Air Station Lemoore in California, where he was based while on active duty.He said he would have agreed with the airstrikes if there were a proven, credible threat to the region, but “I don’t have any reason to believe that Iran was in possession of actual nuclear weapons.”Denver Thiery, 30, who works on military maintenance contracts and lives in Trenton, Ky., near Fort Campbell, said he would remain firmly behind Mr. Trump. But he also acknowledged that it was difficult to know exactly what capabilities Iran possessed.“I don’t know the truth of what’s going on,” he said. “I don’t know if they really have nuclear warheads or not. I don’t know what I can support anymore.”Ms. Gilles, the reservist, whose father is a veteran and whose husband is an active-duty serviceman, was troubled by the decision to edge the country to war at the very moment the government was cutting funding for Veterans Affairs.The administration is taking away a lot of benefits for veterans and “then just sending them off again to be the world police,” Ms. Gilles said.If the current conflict worsens, military members and veterans said, they would put aside their disagreements over Mr. Trump and support one another. But one veteran lamented what he said such a scenario would ultimately mean.“I learned from my time on active duty that war is devastating,” Mr. Oyler said.John Ismay contributed reporting.Several residents of Tehran are posting on social media and sending text messages about very heavy Israeli strikes tonight on several locations in central Tehran, including residential areas, and say they can hear and see air defense engaged with small Israeli drones. Ilia Hashemi, a well-known blogger and activist, posted a video of his neighborhood in Ghisha, central Tehran, with flying objects in the air and the sound of air defense interceptions followed by explosions.The Israeli military said early Monday that residents could leave protected spaces following an earlier announcement of a missile attack from Iran. The military did not provide details on any strikes or interceptions. Israel’s emergency medical service, Magen David Adom, said it had not received reports of injuries after sirens sounded in central Israel, except for cases of anxiety and people who were injured on their way to protected spaces.Air defense units are responding to Israeli air attacks over Karaj, west of Tehran, according to the Fars News Agency, an Iranian outlet affiliated with the Revolutionary Guards. Residents took to social media to report hearing dozens of explosions.Sirens sounded across several areas in Israel early Monday, as the military said it had identified missiles launched from Iran and was working to intercept the projectiles.Israel continued its aerial attack of Iran overnight Monday, hitting key military targets, including Parchin, according to Nour News, which is affiliated with Iran’s National Security Council. Parchin is a military complex southeast of Tehran where Iran is believed to have tested high explosives, and is among sites suspected to have been used by Iran to enrich uranium.Iran has denied Parchin has been used for nuclear development, but has refused to comply with demands from the U.N. nuclear watchdog to inspect the site.France’s foreign minister, Jean-Noël Barrot, said in a post on social media late on Sunday that, beginning on Monday, France will deploy military aircraft to Israel to bring home French citizens seeking to leave the country amid escalating tensions in the Middle East.Annie Correal and Sanam MahooziThe head of the judiciary of Iran, Mohsen Ejei, said in a post on X that the United States “must await severe punishment,” adding that it had been “complicit” with Israel “and now it is itself a perpetrator.”The Iranian foreign minister, Abbas Araghchi, has arrived in Moscow on a diplomatic campaign to “rally the world against Israel,” according to the Islamic Republic News Agency.Annie Correal and Sanam MahooziSeveral people were killed in an ambulance after an Israeli drone attack in Najafabad, a city in central Iran, according to the Mehr news agency, an outlet affiliated with the government, which quoted the governor of Najafabad. The Israeli military did not immediately comment on the attack.U.S. officials concede they don’t know the whereabouts of Iran’s stockpile of near-bomb-grade uranium.ImageU.S. Defense Secretary Pete Hegseth speaks during a news conference at the Pentagon on Sunday.Credit...Andrew Harnik/Getty ImagesA day after President Trump declared that Iran’s nuclear program had been “completely and totally obliterated” by American bunker-busting bombs and a barrage of missiles, the actual state of the program seemed far more murky, with senior officials conceding they did not know the fate of Iran’s stockpile of near-bomb-grade uranium.“We are going to work in the coming weeks to ensure that we do something with that fuel and that’s one of the things that we’re going to have conversations with the Iranians about,” Vice President JD Vance told ABC’s “This Week” on Sunday, referring to a batch of uranium sufficient to make nine or 10 atomic weapons. Nonetheless, he contended that the country’s potential to weaponize that fuel had been set back substantially because it no longer had the equipment to turn that fuel into operative weapons.The Iranians have made it clear they are not interested in having conversations with the United States, accusing Washington of deceiving Tehran during the last set of negotiations while planning the air attack. Moreover, that stockpile of fuel is now one of the few nuclear bargaining chips in Iranian hands.In a briefing for reporters on Sunday, Defense Secretary Pete Hegseth and the new chairman of the Joint Chiefs of Staff, Dan Caine, avoided Mr. Trump’s maximalist claims of success. They said an initial battle-damage assessment of all three sites struck by Air Force B-2 bombers and Navy Tomahawk missiles showed “severe damage and destruction.”Satellite photographs of the primary target, the Fordo uranium enrichment plant that Iran built under a mountain, showed several holes where a dozen 30,000-pound Massive Ordnance Penetrators — one of the largest conventional bombs in the U.S. arsenal — punched deep holes in the rock. The Israeli military’s initial analysis concluded that the site, the target of American and Israeli military planners for more than 26 years, sustained serious damage from the strike but had not been completely destroyed.But there was also evidence, according to two Israeli officials with knowledge of the intelligence, that Iran had moved equipment and uranium from the site in recent days. And there was growing evidence that the Iranians, attuned to Mr. Trump’s repeated threats to take military action, had removed 400 kilograms, or roughly 880 pounds, of uranium enriched to 60 percent purity. That is just below the 90 percent that is usually used in nuclear weapons.The 60-percent enriched fuel had been stored deep inside another nuclear complex, near the ancient capital of Isfahan. Rafael Mariano Grossi, the director general of the International Atomic Energy Agency, said by text that the fuel had last been seen by his teams of United Nations inspectors about a week before Israel began its attacks on Iran. In an interview on CNN on Sunday he added that “Iran has made no secret that they have protected this material.”Asked by text later in the day whether he meant that the fuel stockpile — which is stored in special casks small enough to fit in the trunks of about 10 cars — had been moved, he replied, “I do.” That appeared to be the mystery about the fuel’s fate that Mr. Vance was discussing.If so, Isfahan would not be the only place where the custodians of the Iranian nuclear program — a subject of nationalistic pride and the symbol of Iran’s ability to defend itself — were trying to move equipment and material out of sight, and harden the Fordo plant to protect what had to stay in place.Satellite images released by Maxar Technologies at the tunnels leading into the Fordo mountain, taken in the days before the American strike, show 16 cargo trucks positioned near an entrance. An analysis by the Open Source Centre in London suggested that Iran may have been preparing the site for a strike.It is unclear exactly what, if anything, was removed from the facility.In fact, there was only so much the Iranians could save. The giant centrifuges that spin at supersonic speeds, purifying uranium, are piped together and bolted to the cement floor. One U.S. official said it would have been unrealistic to completely move equipment out of Fordo after the conflict with Israel began.The official added that historical documents about the nuclear program were buried in the bowels of the site, likely complicating any efforts in reconstituting it. In coming days, both the Iranians and intelligence agencies expect to learn more about the Natanz enrichment site, which is older, larger and less well protected than Fordo. It was struck by the Israelis repeatedly, and they destroyed an aboveground enrichment center and disrupted the electrical system. Mr. Grossi later said he believed the interruption of the electrical supply could have sent the centrifuges spinning out of control, probably destroying all of them.How long it would take the Iranians to repair and replace that equipment is unknown; it would probably stretch for years. But Iran is also building a new, deep replacement for Natanz in the south of the city. Officials in Tehran have told the I.A.E. A. that they have not yet opened the plant, so there is nothing to see.If Iran is truly pursuing a nuclear weapon — which it officially denies — it is taking more time than any nuclear-armed nation in history. The United States developed the Manhattan Project in four years or so, developing the bombs dropped at Hiroshima and Nagasaki to end the war in the Pacific. The Soviet Union conducted its first test in 1949, only four years later. India, Pakistan and Israel all sped the process.The Iranians have been at it for more than 20 years, and an archive of data stolen from a Tehran warehouse by Israel a number of years ago showed that Iranian engineers were exploring nuclear triggers and other equipment that would only be used to detonate a weapon. That was around 2003, when, according to American intelligence, the engineers received instructions to halt work on weaponization.Comments by Mr. Trump and Prime Minister Benjamin Netanyahu in recent days suggest they believe that work has resumed, though no evidence to support the contention has been made public. If so, the strikes on Fordo, Natanz and Isfahan may only reinforce the view among Iranian leaders that they need a weapon for survival of the government.History also suggests that diplomacy has usually been more effective than sabotage or military attacks in providing assurances that a country does not pursue atomic weapons. More than 15 years ago, the joint U.S.- Israeli attack on Natanz, using a sophisticated cyber weapon, caused about a fifth of the country’s 5,000 or so centrifuges to blow up.But the Iranians not only rebuilt, they installed more sophisticated equipment. Before Israel’s attack this month, they had roughly 19,000 centrifuges in operation.It was only when the Obama administration struck the 2015 nuclear deal with Iran that the United States got a fuller picture of its capabilities, thanks to the work of inspectors. And those inspections were choked off — and many security cameras disabled — after Mr. Trump declared the nuclear accord a “disaster” and withdrew from it.Tehran’s reaction was to scale up centrifuge production, enrich uranium at levels only weapons states need, and stonewall the I.A.E.A.Now, it is unclear whether the team of I.A.E.A. inspectors who were in the country when the conflict with Israel broke out will be permitted by the Iranian government to resume their inspections, which would include verifying the whereabouts and the safety of that near-bomb-grade uranium.All international inspections have been suspended during wartime, Iranian officials have said. And even if they were to resume, it was unclear the inspectors could physically gain access to the bombed Fordo underground plant, or the wreckage of the larger enrichment facility at Natanz.Mick Mulroy, a former Pentagon official in the first Trump administration and a former C.I.A. officer, said of the strike: “With the type and amount of munitions used, it will likely set back the Iranian nuclear weapon program two to five years.”The State Department issued a worldwide travel advisory for Americans overseas, urging them to “exercise increased caution” due to “the “potential for demonstrations against U.S. citizens and interests abroad.” It also noted that the war is causing travel disruptions and airspace closures across the Middle East.Vice President JD Vance, asked on Sunday on ABC’s “This Week” whether Iran’s enrichment facilities had been “obliterated” as President Trump claimed, answered, “Severely damaged versus obliterated — I’m not exactly sure what the difference is.”He also suggested Iran’s stockpile of enriched uranium had not been destroyed, saying that “we are going to work in the coming weeks to ensure that we do something with that fuel and that’s one of the things that we’re going to have conversations with the Iranians about.”Michael Crowley and Edward WongMichael Crowley and Edward Wong report on diplomacy and foreign policy from Washington and have covered international news for decades.Is the U.S. at war with Iran?ImageDemonstrators hold signs against the U.S. strikes against Iran in Washington outside the White House on Sunday.Credit...Eric Lee for The New York TimesBefore he ordered strikes against Iran’s nuclear facilities, President Trump did not seek permission from Congress, to which the U.S. Constitution grants the sole power to declare war. Many Democrats and even some Republicans say that the attack was tantamount to a declaration of war and that Mr. Trump acted illegally.Several Trump aides say they disagree, calling the strike a limited action aimed solely at Iran’s nuclear capabilities that does not meet the definition of war. “This is not a war against Iran,” Secretary of State Marco Rubio told Fox News on Sunday.Vice President JD Vance argued that Mr. Trump had “clear authority to act to prevent the proliferation of weapons of mass destruction.”However, later on Sunday, Mr. Trump wrote online that his military aims could be much more expansive: “If the current Iranian Regime is unable to MAKE IRAN GREAT AGAIN, why wouldn’t there be a Regime change??? MIGA!!!”Criticisms of the attack, which came less than two weeks after Israel began its bombing campaign against Iran, include Mr. Trump not giving American policymakers, lawmakers and the public enough time to debate a role in a conflict that experts warn could grow quickly if Iran retaliates.The furor over the sudden strikes follows years of bipartisan efforts in Congress to try to place greater limits on a president’s ability to order military action, efforts that arose because of disastrous American wars in the Middle East and Central Asia.So is the United States at war with Iran? And did Mr. Trump have the authority to order his attack without consulting Congress?What does the U.S. Constitution say about war?ImageA demonstrator holds a shredded copy of the Constitution of the United States on Sunday.Credit...Eric Lee for The New York TimesArticle I, Section 8 of the Constitution assigns Congress dozens of powers like collecting taxes and creating post offices, as well as the power to “declare war” and to “raise and support armies.”The Constitution’s framers considered that clause a crucial check on presidential power, according to an essay by the law professors Michael D. Ramsey and Stephen I. Vladeck for the National Constitution Center. Early in American history, Congress approved even limited conflicts, including frontier clashes with Native American tribes.But the question is complicated by Article II of the Constitution, which delineates the powers of the president, and which designates the U.S. leader as the “commander in chief” of the U.S. military.Presidents of both parties, relying heavily on legal opinions written by executive-branch lawyers, have cited that language to justify military action without congressional involvement.Congress tried asserting itself with the War Powers Resolution of 1973, which says the American president must “consult with Congress before introducing United States Armed Forces into hostilities or into situation where imminent involvement in hostilities is clearly indicated by the circumstances.”But presidents have repeatedly disregarded that language or argued for a narrow definition of the “introduction” of forces. Congress has done little to enforce the resolution.What are members of Congress saying about the U.S. strikes?ImagePresident Trump walking across the South Lawn as he returned to the White House on Sunday.Credit...Anna Rose Layden for The New York TimesDemocrats have almost uniformly criticized Mr. Trump for acting without legislative consent, and a few Republicans have as well.“His actions are a clear violation of our Constitution — ignoring the requirement that only the Congress has the authority to declare war,” Senator Chris Van Hollen, Democrat of Maryland, said in a statement echoed by many of his colleagues.Representative Thomas Massie, Republican of Kentucky, told CBS News that there was no “imminent threat to the United States” from Iran.Senator Tim Kaine, Democrat of Virginia, said on the same CBS program that Congress must act this week to assert a role in any further U.S. military action.“Would we think it was war if Iran bombed a U.S. nuclear facility? Of course we would,” Mr. Kaine said. “This is the U.S. jumping into a war of choice at Donald Trump’s urging, without any compelling national security interests for the United States to act in this way, particularly without a debate and vote in Congress.”Some Democrats say Mr. Trump has already gone unforgivably far. Representative Alexandria Ocasio-Cortez of New York called on Saturday night for Mr. Trump’s impeachment.Hawkish Republicans rejected such talk. “He had all the authority he needs under the Constitution,” Senator Lindsey Graham of South Carolina told NBC News on Sunday. Mr. Graham cited Mr. Trump’s power as commander in chief under Article II of the Constitution.“Congress can declare war, or cut off funding. We can’t be the commander in chief. You can’t have 535 commander-in-chiefs,” Mr. Graham said, referring to the combined number of U.S. representatives and senators. “If you don’t like what the president does in terms of war, you can cut off the funding.”Mr. Graham noted that Congress has made formal war declarations in only five conflicts, and none since World War II. However, there has been a legal equivalent from Congress that President George W. Bush was the last American leader to successfully seek: an authorization for the use of military force, often called an A.U.M.F.What are legal scholars saying?ImageForeign Minister Abbas Araghchi of Iran called the U.S. attack an “outrageous, grave and unprecedented violation” of international law and of the United Nations charter.Credit...Khalil Hamra/Associated PressSeveral lawyers and scholars who have studied the international law of armed conflict say the United States is without a doubt at war with Iran for purposes of application of that law, and that Mr. Trump acted in violation of international conventions.“The short answer is that this is, in my view, illegal under both international law and U.S. domestic law,” said Oona Hathaway, a professor of international law at Yale Law School who has worked at the Defense Department.Brian Finucane, a former lawyer at the State Department, agreed that Mr. Trump needed to ask Congress for authorization beforehand. He also said “there is certainly a U.S. armed conflict with Iran, so the law of war applies.”On Sunday, Iran’s foreign minister, Abbas Araghchi, called the U.S. attack an “outrageous, grave and unprecedented violation” of international law and of the United Nations charter, which forbids U.N. members from violating the sovereignty of other members.Mr. Araghchi did not specifically say that his country is now at war with America. Mr. Finucane also said the United States had violated the U.N. charter.Ryan Goodman, a law professor at New York University who has also worked at the Defense Department, said “one important matter for both domestic law and especially international law is the issue of ‘imminence.’”The Trump administration is justifying the U.S. attack by saying Iran’s development of a nuclear weapon was imminent, Mr. Goodman noted.But “the law would require that the attack would be imminent,” he said, and “it is very hard to see how the administration can meet that test under even the most charitable legal assessment.”Even if one were to focus on the question of a nuclear bomb, U.S. intelligence agencies have assessed that Iran had not yet decided to make such a weapon, even though it had developed a large stockpile of the enriched uranium necessary for doing so.How often have presidents sought congressional approval for war?ImageThe furor over the sudden strikes also follows years of bipartisan efforts in Congress to try to place greater limits on a president’s ability to order military action, efforts that arose because of disastrous American wars in the Middle East and Central Asia.Credit...Eric Lee/The New York TimesIn the decades since Congress declared war on Japan and Germany in 1941, U.S. presidents have repeatedly joined or started major conflicts without congressional consent.President Harry S. Truman sent U.S. forces into Korea. President Ronald Reagan ordered military action in Libya, Grenada and Lebanon; President George H.W. Bush invaded Panama; President Bill Clinton ordered the bombing of mostly Serbian targets in Yugoslavia during the Kosovo War; President Barack Obama joined a 2011 NATO bombing campaign against the government of Muammar Qaddafi in Libya and led a military campaign against the Islamic State in Syria and Iraq.Mr. Obama broke with this trend in September 2013 when he decided against launching a planned strike against Syria without first seeking congressional authorization. The strike was unpopular in Congress, which never held a vote, and Mr. Obama did not act.President George W. Bush won separate congressional authorizations for the use of military force against Afghanistan and Iraq before ordering invasions of those countries in 2001 and 2003.In the years since the Al Qaeda attacks of Sept. 11, 2001, several presidents have also ordered countless airstrikes and special operations raids on foreign soil to kill accused terrorists. Those have largely relied on broad interpretations of the two authorizations for the use of military force that Congress granted the executive branch for the so-called war on terror.Emma Ashford, a scholar of U.S. foreign policy at the Stimson Center, said that in the post-9/11 wars, “some presidents have largely stopped asking permission at all.”In January 2020, Mr. Trump chose not to consult Congress before ordering an airstrike that killed a senior Iranian military commander, Qassim Suleimani, while he was visiting Iraq. Many members of Congress called that a clear act of war that was likely to begin wider hostilities. Iran responded by firing 27 missiles at U.S. forces in Iraq, inflicting traumatic brain injuries on about 100 U.S. troops. But the conflict did not expand further.Last year, President Joseph R. Biden Jr. ordered U.S. airstrikes against the Houthi militia in Yemen without getting congressional permission, and Mr. Trump did the same this year.Advances in military technology, including drones and precision-guided munitions, have allowed presidents to take action with minimal initial risk to U.S. forces. Military officials say that Saturday’s strike in Iran, carried out by B-2 stealth bombers, encountered no resistance.But critics say the action invites Iranian retaliation that could escalate into full-scale war.What happens nextImageAdvances in military technology, including drones and precision-guided munitions, have allowed presidents to take action with minimal initial risk to U.S. forces. Credit...Eric Lee for The New York TimesG.O.P. leaders in the House and Senate have signaled support for the strike, but Democrats and a few Republicans are demanding that Congress approve any further military action.Mr. Kaine, who serves on the committees on armed services and foreign relations, introduced a Senate resolution last week requiring that Mr. Trump get explicit congressional approval before taking military action against Iran. Mr. Kaine on Sunday said the measure was still relevant and that he hoped it would come to a vote this week.Mr. Massie, the Kentucky Republican, introduced a similar war powers resolution last week in the House with Ro Khanna, Democrat of California.“When two countries are bombing each other daily in a hot war, and a third country joins the bombing, that’s an act of war,” Mr. Massie wrote on social media on Sunday.Mr. Massie said he was “amazed at the mental gymnastics” Mr. Trump’s defenders have employed to argue the United States was not entering a war by attacking Iranian nuclear facilities.Megan Mineiro contributed reporting.In a phone call on Sunday, Prime Minister Keir Starmer of Britain and President Trump discussed U.S. military action and the “grave risk posed by Iran’s nuclear program to international security,” and “agreed that Iran must never be allowed to develop a nuclear weapon,” Downing Street said in a statement. The two leaders also “discussed the need for Iran to return to the negotiating table as soon as possible,” it added.Israel’s ambassador to the U.N., Danny Danon, in turn told the Security Council that the world should thank the United States for its strikes on Iran’s nuclear facilities. “Thank you, President Trump, for acting when so many hesitated,” he said.Iran’s ambassador to the United Nations, Amir Saeid Iravani, told the Security Council on Sunday that “America has once more recklessly chosen to sacrifice its own security merely to safeguard Netanyahu,” referring to the Israeli prime minister. The United States is the only country to have ever used nuclear weapons in combat and was now waging war against Iran under what he said was the “fabricated and absurd pretext” of preventing it from acquiring nuclear weapons, adding, “What a bitter and tragic irony.”ImageCredit...Eduardo Munoz/ReutersAnnie Correal and Sanam MahooziThe governor of the province of Tehran said in an interview on state television Sunday night that more than 200 places in the province, including a medical center, had been hit by Israeli strikes since the war began on June 13. The governor, Mohammad Sadegh Motamedian, said 200 residents of the province had been killed in the strikes, including at least 39 women and 12 children, and over 800 others had been hospitalized for injuries, according to the Mehr news agency, which is affiliated with the Iranian government. Infrastructure for the delivery of electricity, gas and water had also been hit, the governor said.American military and intelligence officials have detected signs that Iran-backed militias are preparing to attack U.S. bases in Iraq, and possibly Syria, in retaliation for the U.S. strikes in Iran. But so far the groups have held off, and Iraqi officials are working hard to dissuade militia action, a U.S. official said on Sunday.After several Trump cabinet members stressed no interest in regime change in Iran this morning, the president sounded more intrigued in a Truth Social post on Sunday afternoon: “It’s not politically correct to use the term, ‘Regime Change,’ but if the current Iranian Regime is unable to MAKE IRAN GREAT AGAIN, why wouldn’t there be a Regime change??? MIGA!!!” he wrote.The last of the more than a dozen B-2 bombers that took part in the strikes against three Iranian nuclear sites have returned safely to Whiteman Air Force Base in Missouri, a U.S. official said on Sunday. Several of the jets flew west as a ruse, allowing the seven planes carrying 30,000-pound bombs to fly undetected on an easterly route through Europe. The planes’ round-trip flights took up to 37 hours, the official said. The Israeli military said late on Sunday night that about 20 fighter jets had conducted strikes on military targets in Tehran, Iran’s capital, and in western Iran. The attacks targeted storage and missile-launching infrastructure and satellites, as well as military radar sites in western Iran, the Israeli military said.New York City increased the police’s presence at vulnerable sites after the U.S. strikes on Iran.ImageCredit...Eduardo Munoz/ReutersNew York City increased the police presence at religious, cultural and diplomatic sites following the U.S. bombings in Iran, Mayor Eric Adams said after a virtual meeting on Sunday among the mayor, Police Department leaders and the agency’s international liaisons.The mayor and the police commissioner, Jessica S. Tisch, held the briefing “to discuss the situation in the Middle East and how it affects us here at home,” Mr. Adams said in a statement on social media.He said the police presence had been increased “out of an abundance of caution.”In a separate statement on Sunday, Gov. Kathy Hochul said state officials were “not aware of any specific or credible threat to New Yorkers.” But “given New York’s distinctive global profile,” she said, “we are taking this situation extraordinarily seriously.”It is common practice for the Police Department — the country’s largest municipal law enforcement agency — to increase security after a major international event.To assist in those efforts, the department confers with its liaisons who are stationed at 14 posts worldwide. Four of those posts are in the Middle East: Tel Aviv; Doha, Qatar; Amman, Jordan; and Abu Dhabi, the United Arab Emirates. Police officials in those countries were part of the briefing on Sunday, Commissioner Tisch said.“We have over a dozen detectives embedded within international law enforcement agencies who serve as our eyes and ears for threat awareness overseas,” she said in a statement on social media.“Over the past week, they have also gone above and beyond, using their contacts to help New Yorkers seeking to evacuate and get home,” she added.In New York, the Metropolitan Transportation Authority, which operates the city’s subway system, and the Port Authority, the agency that oversees airports, seaports, and bridges and tunnels connecting New York to New Jersey, have activated counterterrorism protections, Ms. Hochul said. State Police officers will also patrol houses of worship and other at-risk sites.“We have some of America’s largest Jewish and Muslim communities, and many have loved ones in the region,” she said. “As we work to keep New Yorkers safe, we pray for the safety of our American troops, for speedy de-escalation of this conflict, and for durable peace in the region.”The safety of New York City in the wake of the attack on Iran also arose as an issue in the mayoral race over the weekend. Former Gov. Andrew M. Cuomo, the front-runner in the imminent Democratic primary, took the opportunity on Sunday to criticize his closest competitor, Assemblyman Zohran Mamdani, saying that Mr. Mamdani was not prepared to lead the city in a situation when it was on “high alert.”Mr. Cuomo said that while he believed President Trump should have consulted Congress before authorizing the strikes, “I think the world is a safer place without Iran having nuclear weapons.”Mr. Mamdani, for his part, condemned the attack, calling it an unconstitutional escalation that would “plunge the world deeper into chaos.”Hezbollah condemned the U.S. strike on Iran’s nuclear facilities in a statement on Sunday, calling it a “treacherous and barbaric American aggression,” and warned it risks plunging the region into deeper conflict. The Lebanese militant group, which has long been Iran’s most-powerful regional ally, stopped short of threatening any military response of its own, but said Tehran had “every right to respond” to the attack.The interim U.S. representative to the United Nations, Dorothy Camille Shea, told the Security Council on Sunday that “the time finally came” for the United States to “act decisively” in defense of its own interest and in defense of Israel. “Let us be clear, Iran should not escalate,” she added.ImageCredit...Eduardo Munoz/ReutersThe nuclear nonproliferation treaty raised by several speakers during this U.N. Security Council session went into effect in 1970. Its aspirations were to prevent the spread of nuclear weapons and technology and to make advances toward disarmament, and though 191 countries have joined, its reach remains somewhat limited. Israel, which has nuclear weapons, is one of five countries — joining India, Pakistan, North Korea and South Sudan — that is not a signatory to the treaty. And Iran, which is, threatened to withdraw this week after the I.A.E.A. accused it of failing to comply with its obligations.Farnaz FassihiFarnaz Fassihi has lived and worked in Iran, has covered the country for three decades and was a war correspondent in the Middle East for 15 years.Iranian officials are trying to project a sense of normalcy, even though nothing is normal.ImagePresident Masoud Pezeshkian of Iran made the rounds in Tehran on Sunday.Credit...Arash Khamooshi for The New York TimesIran was reeling from American military attacks on its three main nuclear sites early Sunday, with four officials describing the mood in the government as one of defeat and national humiliation, amid divisions about how to respond.Publicly, Iranian officials have tried to project a sense of normalcy even though nothing is normal. They have tried to downplay the damage to the nuclear facilities at Fordo, Natanz and Isfahan, even though satellite images show the mountainous site of Fordo’s underground facilities punctured with huge holes.But Hamid Hosseini, a member of the country’s Chamber of Commerce energy committee, said in a phone interview from Tehran that Iran did not have the upper hand — militarily and technologically — and that it was time to stand down.“We need to make national interests the priority,” he said. “We are not supposed to be at war forever.”On Sunday, Iran’s president, Masoud Pezeshkian, made public rounds in the capital, stopping at an anti-American demonstration in downtown Tehran and visiting victims of the attacks at a hospital. A heart surgeon and former health minister, he praised the medical staff members for their service during the war.In a post on social media, Mr. Pezeshkian wrote: “We will walk this path together. We will protect Iran and show the world that our great people are undefeatable.”The post was accompanied by a photograph of Mr. Pezeshkian smiling and waving during his street appearance on Sunday.State television and news media affiliated with the Islamic Revolutionary Guards Corps reported that the nuclear sites had not sustained major damage, and that nearby residents in the area had not heard huge explosions. They broadcast scenes of people going about their daily routines, shopping at the market and driving on roads in Qum and Isfahan, the urban areas closest to the nuclear sites.Abdollah Abdollahi, the conservative editor of the Tasnim news agency, wrote in an editorial that Iran’s nuclear program had three components, knowledge, technology and infrastructure, and that the American strikes had only partly damaged the last one. He called for Iran to “react without restraint to Israel and the United States aggression.”Iran’s Atomic Safety Center said in a statement after the attacks that, as a precautionary measure before the U.S. strikes, the nuclear sites had been evacuated and equipment had been relocated.Iran’s Red Crescent Society said 11 people had been injured in the attacks, and four remained hospitalized. The spokesman for Iran’s Ministry of Health, Hossein Kermanpour, said none of the injured had signs of radiation contamination.The war has been raging since Israel attacked Iran on June 13, and Iranian officials from all political factions appeared united in their calls for the country to retaliate immediately and forcefully. Iran and Israel have been exchanging strikes, with growing civilian casualties on both sides.But going to war against the United States, which has toppled governments in the region through wars and invasions, including in countries neighboring Iran’s east and west, poses formidable risks for Iran’s clerical rulers.The reactions from Iranian officials and prominent political and military pundits have been varied.Conservative, hard-line members of Parliament called for Iran to leave the Nuclear Nonproliferation Treaty and close the Strait of Hormuz. Iran controls the strait, but any move to block vessels from transiting through the waterway could invite further U.S. attacks because about 20 percent of the world’s energy supply travels through it every day.Ebrahim Rezaei, the spokesman for the national security and foreign committees of Iran’s Parliament, told Iranian news media that Tehran would not suspend its nuclear activity and that committee members were “insisting on a forceful and appropriate response to the United States.”He added, “Retaliation in kind and actions that would create deterrence is what we recommend.”Other voices cautioned restraint. Former President Mohammad Khatami, the father of the reformist movement in Iran, said in a statement, “All decisions, positions, diplomatic and defense reactions must be made wisely, with foresight and without excitement and solely based on revenge.”Iran’s supreme leader, Ayatollah Ali Khamenei, will have the final say on how Iran responds to the American attacks. But almost 24 hours after the raids on the nuclear sites, Ayatollah Khamenei had made no official statement and had not addressed the nation.Two Iranian officials said the questions on everyone’s minds were: “Where is Khamenei? Why isn’t he speaking?”But the officials, who are familiar with the ayatollah’s security protocols and insisted on not being named to discuss sensitive issues, said that communication with the supreme leader was extremely difficult, and that messages were being passed in writing and through human messengers since he had been sheltering in a bunker without electronic communication.But Ayatollah Khamenei’s top foreign policy adviser, Ali Akbar Velayati, signaled tough posturing in a post on social media. But he stopped short of threatening military retaliation.“Now that the United States has started the war,” he wrote, “it should know that the Islamic Republic of Iran will have the last word.”The big question facing energy markets: Will Iran disrupt oil and gas flows?ImageAny attempt by Iran to stop the flow of oil and natural gas through the Strait of Hormuz could send already rising fuel prices even higher.Credit...Joe Raedle/Getty ImagesOil prices rose moderately as the market opened on Sunday evening, a sign that traders are concerned, though not panicked, about how Iran may respond to the U.S. bombing of its nuclear facilities over the weekend.The increase of around 3 percent left U.S. oil prices hovering around $76 a barrel. That is notably higher than prices were two weeks ago, before Israel struck Iran, but still tame by recent standards.So far, the conflict between Israel and Iran has damaged oil and gas facilities in both countries, but it has not meaningfully affected the flow of energy.The big question is whether Iran will seek to change that. If it were to disrupt the flow of oil and natural gas in the Persian Gulf region, the economic toll would be steep, including for Iran. That is because a large portion of the world’s oil and liquefied natural gas, or L.N.G., passes through the Strait of Hormuz, a waterway that hugs a portion of Iran’s southern border.Any attempt by Iran to close the strait, which connects the Persian Gulf to the Gulf of Oman, would most likely send oil prices soaring. It would also inflict severe economic damage in Iran because nearly all of the country’s oil exports move through the channel.Another risk is if Iran were to attack U.S. military bases in the Middle East.“If Iran follows through on threats to retaliate against U.S. forces in the region, traders might finally — after more than three years of geopolitical ‘wolf’ cries — price in escalatory pathways that previously seemed far-fetched,” ClearView Energy Partners, a Washington research firm, wrote after the United States bombed Iran.Price of Oil The war is already increasing energy costs for consumers in the United States. The price of a gallon of regular gasoline climbed nearly 3 percent last week, to $3.22, according to the AAA motor club. This time last year, the price was $3.45 a gallon. Prices at the pump generally lag oil prices.Iran’s foreign minister, Abbas Araghchi, said on Sunday that Iran would respond in “self-defense” but declined to explain what that might entail.Iran would have a hard time closing the Strait of Hormuz for a long time, but the country could make passing through it more treacherous, analysts have said. “Multiple security experts contend that Iran has the ability to strike individual tankers and key ports with missiles and mines,” RBC Capital Markets analysts wrote on Sunday.Last week, two oil tankers collided near the strait as many vessels reported experiencing interference with their GPS systems. The United Arab Emirates attributed the crash to navigational errors.Around a fifth of the world’s oil and related products flows through the Strait of Hormuz each day, according to the U.S. Energy Information Administration. A similar share of L.N.G., or natural gas that has been cooled for shipment, also makes the journey.More than 80 percent of those fuels go to Asia, meaning those countries would be severely affected by any closing, the energy administration said. Destination of Oil Shipped Through the Strait of Hormuz The United States and other countries would feel the effects in the form of higher energy costs.Vice President JD Vance said on Sunday morning that disrupting shipping in the Strait of Hormuz would be “suicidal” for Iran.“What would make sense is for them to come to the negotiating table to actually give up their nuclear weapons program over the long term,” he said on the NBC program “Meet the Press.”Satellite images show the U.S. may have targeted ventilation shafts at Fordo.A New York Times analysis of satellite imagery shows that the United States targeted Fordo, Iran’s underground nuclear enrichment facility, at the precise locations of two structures that experts said might be ventilation shafts.The structures were visible only during the early stages of the plant’s operation, and could be seen in satellite images in 2009. By 2011, both were no longer visible. Experts said they might be ventilation shafts used during the plant’s construction, and then buried.“Hitting a ventilation shaft would make sense, because the hole for air already penetrates the thick rock, interrupting its integrity,” said Mark Fitzpatrick, a nuclear expert at the International Institute for Strategic Studies.A U.S. official said that six B-2 bombers had dropped a dozen 30,000-pound “bunker buster” bombs on Fordo overnight.Ventilation shafts “are probably the most vulnerable points of the facility,” said Scott Roecker, a vice president at the Nuclear Threat Initiative, a nonprofit dedicated to reducing the spread of nuclear weapons.Whether or not the attack on those areas was enough to completely destroy Fordo is unclear. While President Trump said on Saturday that Iran’s nuclear enrichment facilities were “completely and totally obliterated,” his early public pronouncements were in contrast with more cautious initial assessments by the U.S. and Israeli militaries, which indicated the facility was severely damaged. Those damage assessments are ongoing, and the United States and Israel have not made any final conclusions.Given that the U.S. attack appears to have targeted the area around the two structures, “I would assume the U.S. has active intelligence that seems to indicate that those shafts were structural weaknesses,” said Joseph Rodgers, a nuclear expert at the Center for Strategic and International Studies, a research institute in Washington.Satellite imagery taken by Maxar Technologies on Sunday showed debris scattered around the large complex, but the site’s support buildings appeared intact. That indicates, Mr. Rodgers said, that “the key target was really how to destroy the structure underground,” and that the attack was most likely not trying to take the facility offline by targeting other support infrastructure.In satellite images after the strike, the facility’s entrance tunnels appeared filled in with dirt. Experts said that was probably a measure taken as part of Iran’s preparation for an attack, possibly in an attempt to shield the facility inside.Satellite imagery released by Maxar Technologies showed a flurry of abnormal activity near the entrance tunnel in the three days preceding the U.S. strikes.On June 19, there were 16 cargo trucks near an entrance tunnel. The following day, the trucks had moved northwest away from the site, but other trucks and bulldozers were near the entrance.New dirt could be seen in the tunnel entrances on June 20, and far more is visible in satellite images taken after the strikes.Russia may be ‘a friend’ of Iran, but it seems unlikely to offer much help.ImageThe Iranian foreign minister, Abbas Araghchi, said Russia and Iran “enjoy a strategic partnership.”Credit...Ozan Kose/Agence France-Presse — Getty ImagesThe Iranian foreign minister said on Sunday that he was heading to Russia to meet with President Vladimir V. Putin on Monday, as Iran weighed a response to a wave of U.S. strikes on its nuclear sites.There was little sign that Russia was prepared to provide military assistance to Iran, its closest remaining Middle East ally, as it prioritized its own war against Ukraine. Iran has not received concrete support from any allies through 10 days of war with Israel and, now, an attack by the United States, leaving the country more isolated than it has been in decades.In announcing the trip to Moscow, the Iranian foreign minister, Abbas Araghchi, called Russia “a friend of Iran” and said that the two countries “enjoy a strategic partnership and we always consult with each other and coordinate our positions.”By Sunday evening, the Kremlin had not confirmed the meeting.ImageMr. Araghchi with his Russian counterpart, Sergey V. Lavrov, in Moscow in April. The Kremlin has not publicly commented on the U.S. attacks on Iran.Credit...Tatyana Makeyeva/Agence France-Presse — Getty ImagesThe Russian Foreign Ministry condemned the American military intervention in Iran, saying it had undermined global efforts to contain the proliferation of nuclear weapons. But the Kremlin has not publicly commented on the attacks, and it has not announced any tangible steps to help Iran.The guarded reaction reflects Mr. Putin’s limited resources, with Russia in its fourth year of war in Ukraine, and his conflicting geopolitical priorities.Russia is trying to maintain warm relations with Iran’s Middle Eastern rivals, including Saudi Arabia. The Kremlin is also likely to tread carefully on issues that may alienate President Trump, whose support — or, at least, acquiescence — it needs to secure a peace deal in Ukraine on its own terms.In addition, Russia has benefited from a rise in oil prices caused by the growing unrest in the Middle East. Oil exports provide the main source of funding for Russia’s war machine.These factors have led Russia to stand on the sidelines while Israel has destroyed Iranian air defenses, struck nuclear facilities and killed members of Iran’s military leadership.The hands-off approach has contrasted with the military support that Russia received from Iran while it was struggling during the first year of the war in Ukraine. Drones and drone technology provided by Iran helped the Russian military regain its footing after the initial battlefield disasters.Gulf countries, fearing retaliation, express concern at U.S. attack.ImageAmerican bases in fossil-fuel-rich Gulf countries could be prime targets for Iranian retaliation against the United States.Credit...Eric Lee for The New York TimesGulf Arab countries that host U.S. military bases issued a series of statements on Sunday expressing dismay over the American attack on Iranian nuclear facilities — while pointedly stopping short of condemning the United States, their main ally.Saudi Arabia’s Foreign Ministry called for de-escalation and restraint, saying that it was following the situation with “deep concern.”Qatar’s Foreign Ministry — in a grammatically acrobatic statement that did not name the United States at all — said that it regretted “the deterioration of the situation with the strikes on Iranian nuclear facilities,” expressing hope that all parties would “exercise wisdom” and restraint. That stood in contrast with the directness of Qatar’s statement the day before, in which the country’s prime minister had condemned Israel by name, saying the Israeli attacks against Iran constituted “a flagrant violation of Iran’s sovereignty and security.”Kuwait and the United Arab Emirates also avoided mentioning the United States, while expressing “deep concern” at the bombing of Iranian nuclear facilities in Kuwait’s case and “profound concern” in the case of the Emirates.Fossil-fuel-rich Gulf countries host tens of thousands of U.S. military personnel. The American bases on their lands — along with oil and gas-producing infrastructure that is vital to the global economy — could be prime targets for Iranian retaliation against the United States.In a statement on Sunday, the Islamic Revolutionary Guards Corps of Iran appeared to threaten the American bases, saying that they were a vulnerability and “not points of strength.”Bahrain, an island nation in the Persian Gulf with a U.S. naval base, asked a majority of its civil servants to work from home and warned residents to use main roads “only when necessary.”Saudi Arabia and the Emirates have sought to chart more independent foreign-policy courses — and to diversify their sources of weaponry — over the past few years. But they remain highly dependent on the United States to defend them when their territories come under attack, as they have by Iran-backed militias in the past.In an attempt to ward off that danger, both countries have shifted toward a policy of cultivating ties with Iran, seeing diplomacy as a more pragmatic way to contain their neighbor. Those warmer relations mean that Iran may be less likely to target their countries than it was in the past. But fears remain.Behind the calls for de-escalation are worries of what wider violence could do to the national and regional projects of the Gulf’s authoritarian rulers, who have tried to diversify their economies away from fossil fuels by turning their countries into global hubs for finance, tourism and trade.“The longer a war takes, the more dangerous it becomes,” Anwar Gargash, diplomatic adviser to the Emirati president, told journalists in a briefing on Friday. “There are many issues in the region. If we choose to tackle everything with a hammer, nothing will be left unbroken.”The Foreign Ministry of Oman, which had been serving as a mediator in nuclear negotiations between the United States and Iran before those talks collapsed in the wake of Israel’s surprise attack on Iran on June 13, issued the strongest-worded statement among the Gulf countries. The ministry expressed “deep concern and condemnation regarding the escalation resulting from the direct airstrikes conducted by the United States,” adding that the American attack was a “serious violation of international law.”But even Yemen’s Iran-backed Houthi militia — whose slogan includes the phrase “death to America” — stopped short of threatening American bases in the region. Before the U.S. attack, the Houthis had warned that they would break the truce reached in May with the United States and target American ships in the Red Sea if President Trump decided his country should enter the conflict.After the U.S. attack, the Houthis said only that they were “prepared” to target American ships, without elaborating.Mohammed al-Bukhaiti, a Houthi official, said on social media on Sunday that the Houthis would “stand by any Arab or Islamic state that faces Israeli or American aggression,” but then added that they would not be “more kingly than the king” — an Arabic expression akin to “holier than the pope.” He did not respond to a request for comment asking for clarification.Ismaeel Naar contributed reporting from Dubai, United Arab Emirates, and Shuaib Almosawa contributed reporting from Sana, Yemen.A correction was made onJune 22, 2025: An earlier version of this article misstated the day Anwar Gargash, a diplomatic adviser to president of the United Arab Emirates, spoke to journalists. It was on Friday, not Saturday.",
  "image": "https://static01.nyt.com/images/2025/06/22/multimedia/22int-israel-iran-promo-9pm-photo-vqwk/22int-israel-iran-promo-9pm-photo-vqwk-facebookJumbo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection role=\"region\" aria-label=\"Live feed\" id=\"live-feed-items\"\u003e\u003cdiv data-testid=\"live-blog-post\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#here-are-the-latest-developments\" data-source-id=\"100000010243003\" role=\"article\" aria-posinset=\"48\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlL2Q0NTg0MzM1LTYwZTAtNWM5Zi1hYmU3LTRkNzZhMDY5ZGMxOQ==\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003cspan\u003e\u003cimg alt=\"\" src=\"https://static01.nyt.com/images/icons/t_logo_291_black.png\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2 id=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlL2Q0NTg0MzM1LTYwZTAtNWM5Zi1hYmU3LTRkNzZhMDY5ZGMxOQ==\"\u003e\u003ca href=\"#here-are-the-latest-developments\"\u003eHere are the latest developments.\u003c/a\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003eA day after U.S. bombers and submarines unleashed heavy strikes on a trio of Iranian nuclear facilities, the actual state of Tehran’s nuclear program remained unclear. Top officials said it was too soon to say whether Iran still retained the ability to make a nuclear weapon and the location of its existing stockpile of enriched uranium was unknown.\u003c/p\u003e\u003cp\u003eThe U.S. strikes stoked fears of a \u003ca href=\"https://www.nytimes.com/2025/06/22/world/middleeast/iran-had-vowed-to-retaliate-now-it-faces-hard-choices.html\" title=\"\"\u003edangerously escalating conflict\u003c/a\u003e across the Middle East and urgent calls from world leaders for diplomacy. But after his administration spent much of the day emphasizing that the United States did not intend to enter an all-out war with Tehran, President Trump raised the prospect of regime change in Iran.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e“If the current Iranian Regime is unable to MAKE IRAN GREAT AGAIN, why wouldn’t there be a Regime change???” Mr. Trump wrote in a post on his social media site.\u003c/p\u003e\u003cp\u003eThe Iranian nuclear sites — at Fordo, Natanz and Isfahan — sustained what Pentagon officials called “severe damage” from the U.S. strikes. But the status of Iran’s enrichment program remained murky, with senior officials conceding they \u003ca href=\"#iran-uranium-stockpile-whereabouts\" title=\"\"\u003edid not know the whereabouts of Iran’s supply\u003c/a\u003e of near-bomb-grade uranium.\u003c/p\u003e\u003cp\u003eRafael Mariano Grossi, the director of the International Atomic Energy Agency, the U.N.’s nuclear watchdog, said he believed the stockpile — which is stored in special casks small enough to fit in the trunks of about 10 cars — had been moved. There was also evidence, according to two Israeli officials with knowledge of the intelligence, that Iran had \u003ca href=\"https://www.nytimes.com/2025/06/22/world/middleeast/iran-fordo-nuclear-damaged-not-destroyed.html?smid=url-share\" title=\"\"\u003emoved equipment and uranium\u003c/a\u003e from the site in recent days.\u003c/p\u003e\u003cp\u003eIranian officials castigated the United States for the strikes, with the country’s foreign minister, Abbas Araghchi, saying at \u003ca href=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump/we-have-to-respond-irans-foreign-minister-warns?smid=url-share\" title=\"\"\u003ea news conference in Istanbul\u003c/a\u003e that Iran “reserves all options to defend its security interests and people.” He declined to be more specific, including about whether Iran would retaliate against U.S. military assets in the Middle East, where \u003ca href=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump/us-troops-may-be-vulnerable-to-potential-iranian-strikes?smid=url-share\" title=\"\"\u003emore than 40,000 American military personnel\u003c/a\u003e are on bases and warships.\u003c/p\u003e\u003cp\u003eThe U.N. secretary general, António Guterres, called for diplomacy at an emergency meeting of the Security Council, saying that the world now risked “descending into a rathole of retaliation after retaliation.”\u003c/p\u003e\u003cp\u003eBut American military and intelligence officials had already detected signs that Iran-backed militias were preparing to attack U.S. bases in Iraq, and possibly Syria, in response. Iraqi officials were working hard to dissuade militia action, a U.S. official said on Sunday.\u003c/p\u003e\u003cp\u003eBenjamin Netanyahu, the Israeli prime minister, thanked Mr. Trump during a news conference Sunday night, adding that Israel was “very close” to achieving its goals of removing the nuclear and ballistic threats Iran poses to Israel. But Iran’s ambassador to the United Nations, Amir Saeid Iravani, said the United States had “recklessly chosen to sacrifice its own security merely to safeguard Netanyahu.”\u003c/p\u003e\u003cp\u003eMr. Iravani accused the United States, the only country to have ever used nuclear weapons in combat, of waging war on Iran under the “fabricated and absurd pretext” of preventing it from acquiring nuclear weapons. “What a bitter and tragic irony,” he said.\u003c/p\u003e\u003cp\u003eHere’s what you need to know:\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003e\u003cstrong\u003ePotential damage:\u003c/strong\u003e The nuclear sites attacked by the United States include Iran’s two major uranium enrichment centers: the \u003ca href=\"https://www.nytimes.com/2025/06/22/world/middleeast/fordo-iran-nuclear-site.html?smid=url-share\" title=\"\"\u003eheavily fortified mountain facility at Fordo\u003c/a\u003e and a larger enrichment plant at Natanz. The chairman of the Joint Chiefs of Staff, Gen. Dan Caine, said the initial battle damage assessment indicated that all three sites had sustained “severe damage and destruction,” but added that a final assessment would take time. The International Atomic Energy Agency said \u003ca href=\"https://x.com/iaeaorg/status/1936650574939685121?s=46\" title=\"\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eit had not detected\u003c/a\u003e any increases in radiation outside the sites.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cstrong\u003ePossible response\u003c/strong\u003e: Mr. Trump’s decision to attack Iran was likely to \u003ca href=\"https://www.nytimes.com/2025/06/22/world/middleeast/us-strikes-iran-diplomacy.html?smid=url-share\" title=\"\"\u003edim hopes for a negotiated solution\u003c/a\u003e to end the fighting, only days after the president had indicated he would wait for as long as two weeks to give diplomacy a chance. While U.S. officials say that Iran has \u003ca href=\"https://www.nytimes.com/2025/06/22/us/politics/iran-weapons-us-bases.html\" title=\"\"\u003edepleted its stockpile of medium-range\u003c/a\u003e missiles, the country still has an ample supply of other weapons, including rockets and drones.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cstrong\u003eThe strikes:\u003c/strong\u003e Pentagon officials described \u003ca href=\"https://www.nytimes.com/2025/06/22/world/middleeast/pentagon-iran-nuclear-sites-attack-details.html\" title=\"\"\u003ea tightly choreographed operation\u003c/a\u003e that included B-2 bombers carrying \u003ca href=\"https://www.nytimes.com/interactive/2025/06/20/world/middleeast/iran-nuclear-fordo-bunker-buster-bomb.html\" title=\"\"\u003e30,000-pound bunker-buster bombs\u003c/a\u003e and submarine-fired Tomahawk cruise missiles hitting a trio of sites in less than a half-hour. Satellite images show that the U.S. \u003ca href=\"#fordo-iran-nuclear-bomb-satellite\" title=\"\"\u003emay have targeted ventilation shafts\u003c/a\u003e at Fordo, the enrichment facility. A senior U.S. official acknowledged that the attack on Fordo had not destroyed the heavily fortified site, but said that \u003ca href=\"https://www.nytimes.com/2025/06/22/world/middleeast/iran-fordo-nuclear-damaged-not-destroyed.html\" title=\"\"\u003eit had been severely damaged\u003c/a\u003e.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cstrong\u003eMood in Iran:\u003c/strong\u003e Many Iranians said in phone interviews that they faced an uncertain and frightening future after the strikes. Waking up to work after the strikes, many expressed a combination of sorrow and anger. “We’re all in shock — none of us expected that, within six or seven days, we’d reach this point,” one Iranian said. \u003ca href=\"https://www.nytimes.com/2025/06/22/world/middleeast/iranian-civilians-react-us-attack.html\" title=\"\"\u003eRead more ›\u003c/a\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cstrong\u003eInternational reaction: \u003c/strong\u003eAmerica’s allies and adversaries responded with \u003ca href=\"https://www.nytimes.com/2025/06/22/world/middleeast/world-leaders-react-iran-strikes.html?smid=url-share\" title=\"\"\u003econdemnations and calls for restraint\u003c/a\u003e, while Gulf nations expressed \u003ca href=\"#gulf-countries-us-attack-iran\" title=\"\"\u003edismay amid fears of retaliation\u003c/a\u003e. Mr. Araghchi arrived in Moscow to meet with President Vladimir V. Putin of Russia, a key ally, on Monday, but there was \u003ca href=\"#russia-may-be-a-friend-of-iran-but-it-seems-unlikely-to-offer-much-help\" title=\"\"\u003elittle sign that Moscow was prepared to provide military assistance\u003c/a\u003e.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cstrong\u003eTricky messaging:\u003c/strong\u003e Defense Secretary Pete Hegseth sought to assuage \u003ca href=\"https://www.nytimes.com/2025/06/22/us/politics/hegseth-iran-strikes.html\" title=\"\"\u003econcerns that the United States was about to enter a prolonged conflict\u003c/a\u003e. Mr. Trump’s allies had been careful on Sunday to characterize the strikes as a focused mission, not the start of a broader military operation. “We’re not at war with Iran,” Vice President JD Vance \u003ca href=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump/vance-iran-nuclear-sites-damage\" title=\"\"\u003esaid in a televised interview\u003c/a\u003e on Sunday morning. “We’re at war with Iran’s nuclear program.”\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cstrong\u003eGlobal markets: \u003c/strong\u003eOil prices rose moderately as the market opened on Sunday evening, a sign that traders were concerned, though not panicked, about how Iran may respond to the U.S. bombing.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cstrong\u003eWhat’s next?\u003c/strong\u003e Now that Mr. Trump has helped Israel, it will most likely kick off a more dangerous phase in the war. Here is a look at \u003ca href=\"https://www.nytimes.com/2025/06/22/world/middleeast/iran-retaliate-us-strikes.html?smid=url-share\" title=\"\"\u003eIran’s options\u003c/a\u003e.\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eReporting was contributed by David E. Sanger, Robert Jimison, Michael Gold, Megan Mineiro, Jonathan Swan, Yan Zhuang and Talya Minsberg.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv data-testid=\"live-blog-post\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#iran-reaction-military-bases-united-states\" data-source-id=\"100000010243198\" role=\"article\" aria-posinset=\"47\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlL2UxOTRmMDg2LTUwMzAtNTM0Ni05NjUxLTBmOWVhOWQ2YmQ0MA==\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003cspan\u003e\u003cimg alt=\"\" src=\"https://static01.nyt.com/images/icons/t_logo_291_black.png\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2 id=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlL2UxOTRmMDg2LTUwMzAtNTM0Ni05NjUxLTBmOWVhOWQ2YmQ0MA==\"\u003e\u003ca href=\"#iran-reaction-military-bases-united-states\"\u003eAround military bases in the U.S., unease over what comes next.\u003c/a\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eAn Army color guard during a ceremony at Fort Benning in Georgia in April.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eBrynn Anderson/Associated Press\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eFor some families who gathered this weekend at Fort Benning in Georgia, the past few days have served as a solemn reminder of the unsettling emotions military service can bring. On Friday, a group of Army enlistees graduated from basic training. On Saturday, President Trump bombed Iran. On Sunday, service members and their loved ones pondered an uncertain future.\u003c/p\u003e\u003cp\u003e“People can lose their life, so I’m worried,” said Michele Bixby, 24, of upstate New York, whose brother had just graduated. “But it’s what he wanted to do; it’s what he loves to do. He’s going to move forward with it no matter what.”\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eOne day after the administration announced it had carried out airstrikes at three nuclear sites in Iran, the mood in some communities around military bases on U.S. soil varied from firm support to bitter disagreement. But one sentiment stood out among those interviewed: concern for the safety of America’s troops everywhere.\u003c/p\u003e\u003cp\u003eNo one knows how the strikes on Iran could affect service members. Pete Hegseth, the secretary of defense, emphasized on Sunday that the administration did not want an open-ended war. But Iranian leaders have vowed to retaliate, and U.S. military installations in the Middle East, with more than 40,000 active-duty troops and civilians employed by the Pentagon, are already \u003ca href=\"https://www.nytimes.com/2025/06/21/us/politics/military-middle-east-wars.html\" title=\"\"\u003epotential targets\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThat reality, along with the potential repercussions for the entire military, was on the minds of many people around U.S. bases at home, even as service members accepted that reality as part of the job.\u003c/p\u003e\u003cp\u003e“A lot of the families around here are quickly realizing this is a real threat; this is something we need to be worried about,” said Meghan Gilles, 37, a self-described military brat who works in the Army Reserve’s human resources division at Fort Campbell in Kentucky, a training site and home to the 101st Airborne Division.\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eBlake Carlson, right, a National Guard member, was at Eglin Air Force Base on Sunday with his brother Brady, left, and their parents, Garry Pruitt and Tonya Carlson.  \u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eValerie Crowder\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eAt Eglin Air Force Base in Florida, Blake Carlson, a 23-year-old Army National Guard combat medic who was visiting from Austin, Texas, said that he could be deployed. “It’s what I signed up for,” he said. “If I have to, I’ll do it.” But his mother and brother hoped the country would not be dragged into the escalating conflict in the Middle East.\u003c/p\u003e\u003cp\u003eSome people who were interviewed stood by Mr. Trump and agreed with his assertions that the targeted bombings were unlikely to lead to a wider conflict. Mr. Carlson’s mother, Tonya Carlson, said she hoped the attack would force Iran to negotiate with the United States.\u003c/p\u003e\u003cp\u003eOthers stood by Mr. Trump’s statement that Iran posed an imminent threat — a point that contradicts recent national security assessments. “Iran doesn’t need to have nuclear weapons, for sure,” said Tony Saluzzo, 72, a former combat engineer who served in the U.S. offensive against Iraq and lives near Fort Campbell.\u003c/p\u003e\u003cp\u003eJames Arthur, a 42-year-old retired Coast Guard captain who lives north of Tampa, Fla., and was visiting the Air Force Armament Museum at the Eglin base, said that the Iran airstrikes happened “about two decades too late.”\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eJames Arthur, a retired Coast Guard captain who was visiting the museum at Eglin Air Force Base, said the airstrikes against Iran happened “about two decades too late.”\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eValerie Crowder\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eOther former service members castigated Mr. Trump for bombing Iran without congressional approval. The Constitution’s framers included language to ensure that wars would not be entered rashly, said Paul Oyler, a Navy veteran who served in Iraq and Afghanistan and who lives near the Naval Air Station Lemoore in California, where he was based while on active duty.\u003c/p\u003e\u003cp\u003eHe said he would have agreed with the airstrikes if there were a proven, credible threat to the region, but “I don’t have any reason to believe that Iran was in possession of actual nuclear weapons.”\u003c/p\u003e\u003cp\u003eDenver Thiery, 30, who works on military maintenance contracts and lives in Trenton, Ky., near Fort Campbell, said he would remain firmly behind Mr. Trump. But he also acknowledged that it was difficult to know exactly what capabilities Iran possessed.\u003c/p\u003e\u003cp\u003e“I don’t know the truth of what’s going on,” he said. “I don’t know if they really have nuclear warheads or not. I don’t know what I can support anymore.”\u003c/p\u003e\u003cp\u003eMs. Gilles, the reservist, whose father is a veteran and whose husband is an active-duty serviceman, was troubled by the decision to edge the country to war at the very moment the government was cutting funding for Veterans Affairs.\u003c/p\u003e\u003cp\u003eThe administration is taking away a lot of benefits for veterans and “then just sending them off again to be the world police,” Ms. Gilles said.\u003c/p\u003e\u003cp\u003eIf the current conflict worsens, military members and veterans said, they would put aside their disagreements over Mr. Trump and support one another. But one veteran lamented what he said such a scenario would ultimately mean.\u003c/p\u003e\u003cp\u003e“I learned from my time on active duty that war is devastating,” Mr. Oyler said.\u003c/p\u003e\u003cp\u003eJohn Ismay contributed reporting.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"91fe4344-955f-5a75-95bf-482c6df4e8a3\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#91fe4344-955f-5a75-95bf-482c6df4e8a3\" role=\"article\" aria-posinset=\"45\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvOTFmZTQzNDQtOTU1Zi01YTc1LTk1YmYtNDgyYzZkZjRlOGEz\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/farnaz-fassihi\"\u003e\u003cimg alt=\"Farnaz Fassihi\" src=\"https://static01.nyt.com/images/2022/02/28/world/farnaz-fassahi/farnaz-fassahi-thumbLarge-v2.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2022/02/28/world/farnaz-fassahi/farnaz-fassahi-thumbStandard-v2.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2022/02/28/world/farnaz-fassahi/farnaz-fassahi-thumbLarge-v2.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eSeveral residents of Tehran are posting on social media and sending text messages about very heavy Israeli strikes tonight on several locations in central Tehran, including residential areas, and say they can hear and see air defense engaged with small Israeli drones. Ilia Hashemi, a well-known blogger and activist, posted a video of his neighborhood in Ghisha, central Tehran, with flying objects in the air and the sound of air defense interceptions followed by explosions.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"d791bb96-8b12-5b77-9ede-c2aac37ddf1f\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#d791bb96-8b12-5b77-9ede-c2aac37ddf1f\" role=\"article\" aria-posinset=\"44\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvZDc5MWJiOTYtOGIxMi01Yjc3LTllZGUtYzJhYWMzN2RkZjFm\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/ephrat-livni\"\u003e\u003cimg alt=\"Ephrat Livni\" src=\"https://static01.nyt.com/images/2021/09/08/business/author-ephrat-livni/author-ephrat-livni-thumbLarge-v6.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2021/09/08/business/author-ephrat-livni/author-ephrat-livni-thumbStandard-v6.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2021/09/08/business/author-ephrat-livni/author-ephrat-livni-thumbLarge-v6.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe Israeli military said early Monday that residents could leave protected spaces following an earlier announcement of a missile attack from Iran. The military did not provide details on any strikes or interceptions. Israel’s emergency medical service, Magen David Adom, said it had not received reports of injuries after sirens sounded in central Israel, except for cases of anxiety and people who were injured on their way to protected spaces.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"f220534b-b46a-56be-8475-665fbe869e68\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#f220534b-b46a-56be-8475-665fbe869e68\" role=\"article\" aria-posinset=\"43\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvZjIyMDUzNGItYjQ2YS01NmJlLTg0NzUtNjY1ZmJlODY5ZTY4\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/annie-correal\"\u003e\u003cimg alt=\"Annie Correal\" src=\"https://static01.nyt.com/images/2024/09/25/reader-center/author-annie-correal/author-annie-correal-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2024/09/25/reader-center/author-annie-correal/author-annie-correal-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2024/09/25/reader-center/author-annie-correal/author-annie-correal-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAir defense units are responding to Israeli air attacks over Karaj, west of Tehran, according to the Fars News Agency, an Iranian outlet affiliated with the Revolutionary Guards. Residents took to social media to report hearing dozens of explosions.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"fbeb56a4-e9af-5a6a-a6d8-1d07be27520e\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#fbeb56a4-e9af-5a6a-a6d8-1d07be27520e\" role=\"article\" aria-posinset=\"42\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvZmJlYjU2YTQtZTlhZi01YTZhLWE2ZDgtMWQwN2JlMjc1MjBl\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/ephrat-livni\"\u003e\u003cimg alt=\"Ephrat Livni\" src=\"https://static01.nyt.com/images/2021/09/08/business/author-ephrat-livni/author-ephrat-livni-thumbLarge-v6.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2021/09/08/business/author-ephrat-livni/author-ephrat-livni-thumbStandard-v6.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2021/09/08/business/author-ephrat-livni/author-ephrat-livni-thumbLarge-v6.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eSirens sounded across several areas in Israel early Monday, as the military said it had identified missiles launched from Iran and was working to intercept the projectiles.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"568f3a7d-0f56-5942-93f0-f9d1fb8a6694\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#568f3a7d-0f56-5942-93f0-f9d1fb8a6694\" role=\"article\" aria-posinset=\"41\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvNTY4ZjNhN2QtMGY1Ni01OTQyLTkzZjAtZjlkMWZiOGE2Njk0\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/annie-correal\"\u003e\u003cimg alt=\"Annie Correal\" src=\"https://static01.nyt.com/images/2024/09/25/reader-center/author-annie-correal/author-annie-correal-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2024/09/25/reader-center/author-annie-correal/author-annie-correal-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2024/09/25/reader-center/author-annie-correal/author-annie-correal-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eIsrael continued its aerial attack of Iran overnight Monday, hitting key military targets, including Parchin, according to Nour News, which is affiliated with Iran’s National Security Council. Parchin is a military complex southeast of Tehran where Iran is believed to have tested high explosives, and is among sites suspected to have been used by Iran to enrich uranium.\u003c/p\u003e\u003cp\u003eIran has denied Parchin has been used for nuclear development, but has refused to comply with demands from the U.N. nuclear watchdog to inspect the site.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"84cdeb7d-60e0-54bf-acc6-ff7a591b190f\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#84cdeb7d-60e0-54bf-acc6-ff7a591b190f\" role=\"article\" aria-posinset=\"40\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvODRjZGViN2QtNjBlMC01NGJmLWFjYzYtZmY3YTU5MWIxOTBm\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/ephrat-livni\"\u003e\u003cimg alt=\"Ephrat Livni\" src=\"https://static01.nyt.com/images/2021/09/08/business/author-ephrat-livni/author-ephrat-livni-thumbLarge-v6.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2021/09/08/business/author-ephrat-livni/author-ephrat-livni-thumbStandard-v6.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2021/09/08/business/author-ephrat-livni/author-ephrat-livni-thumbLarge-v6.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eFrance’s foreign minister, Jean-Noël Barrot, said in a post on social media late on Sunday that, beginning on Monday, France will deploy military aircraft to Israel to bring home French citizens seeking to leave the country amid escalating tensions in the Middle East.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"e2c94b74-9e45-5da4-946c-b218ac3aa2e2\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#e2c94b74-9e45-5da4-946c-b218ac3aa2e2\" role=\"article\" aria-posinset=\"39\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvZTJjOTRiNzQtOWU0NS01ZGE0LTk0NmMtYjIxOGFjM2FhMmUy\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003cspan\u003e\u003cimg alt=\"Annie Correal and Sanam Mahoozi\" src=\"https://static01.nyt.com/images/icons/t_logo_291_black.png?quality=75\u0026amp;auto=webp\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan itemprop=\"name\"\u003eAnnie Correal and Sanam Mahoozi\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eThe head of the judiciary of Iran, Mohsen Ejei, said in a post on X that the United States “must await severe punishment,” adding that it had been “complicit” with Israel “and now it is itself a perpetrator.”\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"319b0c54-3107-584e-a767-0db0ab085448\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#319b0c54-3107-584e-a767-0db0ab085448\" role=\"article\" aria-posinset=\"38\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvMzE5YjBjNTQtMzEwNy01ODRlLWE3NjctMGRiMGFiMDg1NDQ4\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/ephrat-livni\"\u003e\u003cimg alt=\"Ephrat Livni\" src=\"https://static01.nyt.com/images/2021/09/08/business/author-ephrat-livni/author-ephrat-livni-thumbLarge-v6.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2021/09/08/business/author-ephrat-livni/author-ephrat-livni-thumbStandard-v6.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2021/09/08/business/author-ephrat-livni/author-ephrat-livni-thumbLarge-v6.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe Iranian foreign minister, Abbas Araghchi, has arrived in Moscow on a diplomatic campaign to “rally the world against Israel,” according to the Islamic Republic News Agency.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"f6f65926-84c8-5c08-82ba-8542971fe06e\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#f6f65926-84c8-5c08-82ba-8542971fe06e\" role=\"article\" aria-posinset=\"37\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvZjZmNjU5MjYtODRjOC01YzA4LTgyYmEtODU0Mjk3MWZlMDZl\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003cspan\u003e\u003cimg alt=\"Annie Correal and Sanam Mahoozi\" src=\"https://static01.nyt.com/images/icons/t_logo_291_black.png?quality=75\u0026amp;auto=webp\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan itemprop=\"name\"\u003eAnnie Correal and Sanam Mahoozi\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eSeveral people were killed in an ambulance after an Israeli drone attack in Najafabad, a city in central Iran, according to the Mehr news agency, an outlet affiliated with the government, which quoted the governor of Najafabad. The Israeli military did not immediately comment on the attack.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"live-blog-post\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#iran-uranium-stockpile-whereabouts\" data-source-id=\"100000010243621\" role=\"article\" aria-posinset=\"36\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlLzg2NTJlMDE1LTNiNjktNTJmMC05YTEzLThkZGRhYWVjMGNjMw==\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/david-e-sanger\"\u003e\u003cimg alt=\"David E. Sanger\" src=\"https://static01.nyt.com/images/2018/10/03/multimedia/author-david-e-sanger/author-david-e-sanger-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2018/10/03/multimedia/author-david-e-sanger/author-david-e-sanger-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2018/10/03/multimedia/author-david-e-sanger/author-david-e-sanger-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2 id=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlLzg2NTJlMDE1LTNiNjktNTJmMC05YTEzLThkZGRhYWVjMGNjMw==\"\u003e\u003ca href=\"#iran-uranium-stockpile-whereabouts\"\u003eU.S. officials concede they don’t know the whereabouts of Iran’s stockpile of near-bomb-grade uranium.\u003c/a\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eU.S. Defense Secretary Pete Hegseth speaks during a news conference at the Pentagon on Sunday.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eAndrew Harnik/Getty Images\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eA day after President Trump declared that Iran’s nuclear program had been “completely and totally obliterated” by American bunker-busting bombs and a barrage of missiles, the actual state of the program seemed far more murky, with senior officials conceding they did not know the fate of Iran’s stockpile of near-bomb-grade uranium.\u003c/p\u003e\u003cp\u003e“We are going to work in the coming weeks to ensure that we do something with that fuel and that’s one of the things that we’re going to have conversations with the Iranians about,” Vice President JD Vance told ABC’s “This Week” on Sunday, referring to a batch of uranium sufficient to make nine or 10 atomic weapons. Nonetheless, he contended that the country’s potential to weaponize that fuel had been set back substantially because it no longer had the equipment to turn that fuel into operative weapons.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eThe Iranians have made it clear they are not interested in having conversations with the United States, accusing Washington of deceiving Tehran during the last set of negotiations while planning the air attack. Moreover, that stockpile of fuel is now one of the few nuclear bargaining chips in Iranian hands.\u003c/p\u003e\u003cp\u003eIn a briefing for reporters on Sunday, Defense Secretary Pete Hegseth and the new chairman of the Joint Chiefs of Staff, Dan Caine, avoided Mr. Trump’s maximalist claims of success. They said an initial battle-damage assessment of all three sites struck by Air Force B-2 bombers and Navy Tomahawk missiles showed “severe damage and destruction.”\u003c/p\u003e\u003cp\u003e\u003ca href=\"#fordo-iran-nuclear-bomb-satellite\" title=\"\"\u003eSatellite photographs of the primary target\u003c/a\u003e, the Fordo uranium enrichment plant that Iran built under a mountain, showed several holes where a dozen 30,000-pound Massive Ordnance Penetrators — one of the largest conventional bombs in the U.S. arsenal — punched deep holes in the rock. The Israeli military’s initial analysis concluded that the site, the target of American and Israeli military planners for more than 26 years, sustained serious damage from the strike but had not been completely destroyed.\u003c/p\u003e\u003cp\u003eBut there was also evidence, according to two Israeli officials with knowledge of the intelligence, \u003ca href=\"https://www.nytimes.com/2025/06/22/world/middleeast/israel-us-strikes-iran-mood.html\" title=\"\"\u003ethat Iran had moved equipment and uranium from the site\u003c/a\u003e in recent days. And there was growing evidence that the Iranians, attuned to Mr. Trump’s repeated threats to take military action, had removed 400 kilograms, or roughly 880 pounds, of uranium enriched to 60 percent purity. That is just below the 90 percent that is usually used in nuclear weapons.\u003c/p\u003e\u003cp\u003eThe 60-percent enriched fuel had been stored deep inside another nuclear complex, near the ancient capital of Isfahan. Rafael Mariano Grossi, the director general of the International Atomic Energy Agency, said by text that the fuel had last been seen by his teams of United Nations inspectors about a week before Israel began its attacks on Iran. In an interview on CNN on Sunday he added that “Iran has made no secret that they have protected this material.”\u003c/p\u003e\u003cp\u003eAsked by text later in the day whether he meant that the fuel stockpile — which is stored in special casks small enough to fit in the trunks of about 10 cars — had been moved, he replied, “I do.” That appeared to be the mystery about the fuel’s fate that Mr. Vance was discussing.\u003c/p\u003e\u003cp\u003eIf so, Isfahan would not be the only place where the custodians of the Iranian nuclear program — a subject of nationalistic pride and the symbol of Iran’s ability to defend itself — were trying to move equipment and material out of sight, and harden the Fordo plant to protect what had to stay in place.\u003c/p\u003e\u003cp\u003eSatellite images released by Maxar Technologies at the tunnels leading into the Fordo mountain, taken in the days before the American strike, show 16 cargo trucks positioned near an entrance. An analysis by the Open Source Centre in London suggested that Iran may have been preparing the site for a strike.\u003c/p\u003e\u003cp\u003eIt is unclear exactly what, if anything, was removed from the facility.\u003c/p\u003e\u003cp\u003eIn fact, there was only so much the Iranians could save. The giant centrifuges that spin at supersonic speeds, purifying uranium, are piped together and bolted to the cement floor. One U.S. official said it would have been unrealistic to completely move equipment out of Fordo after the conflict with Israel began.\u003c/p\u003e\u003cp\u003eThe official added that historical documents about the nuclear program were buried in the bowels of the site, likely complicating any efforts in reconstituting it. In coming days, both the Iranians and intelligence agencies expect to learn more about the Natanz enrichment site, which is older, larger and less well protected than Fordo. It was struck by the Israelis repeatedly, and they destroyed an aboveground enrichment center and disrupted the electrical system. Mr. Grossi later said he believed the interruption of the electrical supply could have sent the centrifuges spinning out of control, probably destroying all of them.\u003c/p\u003e\u003cp\u003eHow long it would take the Iranians to repair and replace that equipment is unknown; it would probably stretch for years. But Iran is also building a new, deep replacement for Natanz in the south of the city. Officials in Tehran have told the I.A.E. A. that they have not yet opened the plant, so there is nothing to see.\u003c/p\u003e\u003cp\u003eIf Iran is truly pursuing a nuclear weapon — which it officially denies — it is taking more time than any nuclear-armed nation in history. The United States developed the Manhattan Project in four years or so, developing the bombs dropped at Hiroshima and Nagasaki to end the war in the Pacific. The Soviet Union conducted its first test in 1949, only four years later. India, Pakistan and Israel all sped the process.\u003c/p\u003e\u003cp\u003eThe Iranians have been at it for more than 20 years, and an archive of data stolen from a Tehran warehouse by Israel a number of years ago showed that Iranian engineers were exploring nuclear triggers and other equipment that would only be used to detonate a weapon. That was around 2003, when, according to American intelligence, the engineers received instructions to halt work on weaponization.\u003c/p\u003e\u003cp\u003eComments by Mr. Trump and Prime Minister Benjamin Netanyahu in recent days suggest they believe that work has resumed, though no evidence to support the contention has been made public. If so, the strikes on Fordo, Natanz and Isfahan \u003ca href=\"https://www.nytimes.com/2025/06/22/us/politics/iran-nuclear-weapon.html\" title=\"\"\u003emay only reinforce the view among Iranian leaders\u003c/a\u003e that they need a weapon for survival of the government.\u003c/p\u003e\u003cp\u003eHistory also suggests that diplomacy has usually been more effective than sabotage or military attacks in providing assurances that a country does not pursue atomic weapons. More than 15 years ago, the joint U.S.- Israeli attack on Natanz, using a sophisticated cyber weapon, caused about a fifth of the country’s 5,000 or so centrifuges to blow up.\u003c/p\u003e\u003cp\u003eBut the Iranians not only rebuilt, they installed more sophisticated equipment. Before Israel’s attack this month, they had roughly 19,000 centrifuges in operation.\u003c/p\u003e\u003cp\u003eIt was only when the Obama administration struck the 2015 nuclear deal with Iran that the United States got a fuller picture of its capabilities, thanks to the work of inspectors. And those inspections were choked off — and many security cameras disabled — after Mr. Trump declared the nuclear accord a “disaster” and withdrew from it.\u003c/p\u003e\u003cp\u003eTehran’s reaction was to scale up centrifuge production, enrich uranium at levels only weapons states need, and stonewall the I.A.E.A.\u003c/p\u003e\u003cp\u003eNow, it is unclear whether the team of I.A.E.A. inspectors who were in the country when the conflict with Israel broke out will be permitted by the Iranian government to resume their inspections, which would include verifying the whereabouts and the safety of that near-bomb-grade uranium.\u003c/p\u003e\u003cp\u003eAll international inspections have been suspended during wartime, Iranian officials have said. And even if they were to resume, it was unclear the inspectors could physically gain access to the bombed Fordo underground plant, or the wreckage of the larger enrichment facility at Natanz.\u003c/p\u003e\u003cp\u003eMick Mulroy, a former Pentagon official in the first Trump administration and a former C.I.A. officer, said of the strike: “With the type and amount of munitions used, it will likely set back the Iranian nuclear weapon program two to five years.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"587a8d34-68b2-50d4-b919-3b5e3dcf4c83\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#587a8d34-68b2-50d4-b919-3b5e3dcf4c83\" role=\"article\" aria-posinset=\"35\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvNTg3YThkMzQtNjhiMi01MGQ0LWI5MTktM2I1ZTNkY2Y0Yzgz\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/michael-crowley\"\u003e\u003cimg alt=\"Michael Crowley\" src=\"https://static01.nyt.com/images/2019/10/25/reader-center/author-michael-crowley/author-michael-crowley-thumbLarge-v4.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2019/10/25/reader-center/author-michael-crowley/author-michael-crowley-thumbStandard-v4.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2019/10/25/reader-center/author-michael-crowley/author-michael-crowley-thumbLarge-v4.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe State Department issued a worldwide travel advisory for Americans overseas, urging them to “exercise increased caution” due to “the “potential for demonstrations against U.S. citizens and interests abroad.” It also noted that the war is causing travel disruptions and airspace closures across the Middle East.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"97d63461-4dc1-5d62-94a0-fbd31f6f3fd9\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#97d63461-4dc1-5d62-94a0-fbd31f6f3fd9\" role=\"article\" aria-posinset=\"34\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvOTdkNjM0NjEtNGRjMS01ZDYyLTk0YTAtZmJkMzFmNmYzZmQ5\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/anushka-patil\"\u003e\u003cimg alt=\"Anushka Patil\" src=\"https://static01.nyt.com/images/2022/04/12/reader-center/author-anushka-patil/author-anushka-patil-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2022/04/12/reader-center/author-anushka-patil/author-anushka-patil-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2022/04/12/reader-center/author-anushka-patil/author-anushka-patil-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eVice President JD Vance, asked on Sunday on ABC’s “This Week” whether Iran’s enrichment facilities had been “obliterated” as President Trump claimed, answered, “Severely damaged versus obliterated — I’m not exactly sure what the difference is.”\u003c/p\u003e\u003cp\u003eHe also suggested Iran’s stockpile of enriched uranium had not been destroyed, saying that “we are going to work in the coming weeks to ensure that we do something with that fuel and that’s one of the things that we’re going to have conversations with the Iranians about.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"live-blog-post\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#trump-strikes-war-iran\" data-source-id=\"100000010243255\" role=\"article\" aria-posinset=\"33\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlLzYxNzUzYjJjLWMzYWQtNWRkZC1iNDUyLTQ0Y2JhMWQ1MzIyOQ==\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/michael-crowley\"\u003e\u003cimg alt=\"Michael Crowley\" src=\"https://static01.nyt.com/images/2019/10/25/reader-center/author-michael-crowley/author-michael-crowley-thumbLarge-v4.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2019/10/25/reader-center/author-michael-crowley/author-michael-crowley-thumbStandard-v4.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2019/10/25/reader-center/author-michael-crowley/author-michael-crowley-thumbLarge-v4.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003ca href=\"https://www.nytimes.com/by/edward-wong\"\u003e\u003cimg alt=\"Edward Wong\" src=\"https://static01.nyt.com/images/2018/09/24/multimedia/author-edward-wong/author-edward-wong-thumbLarge-v5.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2018/09/24/multimedia/author-edward-wong/author-edward-wong-thumbStandard-v5.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2018/09/24/multimedia/author-edward-wong/author-edward-wong-thumbLarge-v5.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/michael-crowley\" itemprop=\"name\"\u003eMichael Crowley\u003c/a\u003e and \u003ca href=\"https://www.nytimes.com/by/edward-wong\" itemprop=\"name\"\u003eEdward Wong\u003c/a\u003e\u003c/p\u003e\u003cp\u003eMichael Crowley and Edward Wong report on diplomacy and foreign policy from Washington and have covered international news for decades.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003e\u003ch2 id=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlLzYxNzUzYjJjLWMzYWQtNWRkZC1iNDUyLTQ0Y2JhMWQ1MzIyOQ==\"\u003e\u003ca href=\"#trump-strikes-war-iran\"\u003eIs the U.S. at war with Iran?\u003c/a\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eDemonstrators hold signs against the U.S. strikes against Iran in Washington outside the White House on Sunday.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eEric Lee for The New York Times\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eBefore he ordered strikes against Iran’s nuclear facilities, President Trump did not seek \u003ca href=\"https://www.justsecurity.org/64645/war-powers-trump-iran-strikes/\" title=\"\" rel=\"noopener noreferrer\" target=\"_blank\"\u003epermission from Congress\u003c/a\u003e, to which the U.S. Constitution grants the sole power to declare war. Many Democrats and even some Republicans say that the attack was tantamount to a declaration of war and that Mr. Trump acted illegally.\u003c/p\u003e\u003cp\u003eSeveral Trump aides say they disagree, calling the strike a limited action aimed solely at Iran’s nuclear capabilities that does not meet the definition of war. “This is not a war against Iran,” Secretary of State Marco Rubio told Fox News on Sunday.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eVice President JD Vance argued that Mr. Trump had “clear authority to act to prevent the proliferation of weapons of mass destruction.”\u003c/p\u003e\u003cp\u003eHowever, later on Sunday, Mr. Trump wrote online that his military aims could be much more expansive: “If the current Iranian Regime is unable to MAKE IRAN GREAT AGAIN, why wouldn’t there be a Regime change??? MIGA!!!”\u003c/p\u003e\u003cp\u003eCriticisms of the attack, which came less than two weeks after Israel began its bombing campaign against Iran, include Mr. Trump not giving American policymakers, lawmakers and the public enough time to debate a role in a conflict that experts warn could \u003ca href=\"https://www.justsecurity.org/115234/policy-legal-iran-nuclear-strikes/\" title=\"\" rel=\"noopener noreferrer\" target=\"_blank\"\u003egrow quickly\u003c/a\u003e if Iran retaliates.\u003c/p\u003e\u003cp\u003eThe furor over the sudden strikes follows years of \u003ca href=\"https://www.nytimes.com/2021/07/20/us/politics/presidential-war-power-bill.html\" title=\"\"\u003ebipartisan efforts\u003c/a\u003e in Congress to try to place greater limits on a president’s ability to order military action, efforts that arose because of \u003ca href=\"https://www.nytimes.com/2020/02/02/us/politics/trump-forever-war.html\" title=\"\"\u003edisastrous American wars\u003c/a\u003e in the Middle East and Central Asia.\u003c/p\u003e\u003cp\u003eSo is the United States at war with Iran? And did Mr. Trump have the authority to order his attack without consulting Congress?\u003c/p\u003e\u003ch2 id=\"link-42f6e9d0\"\u003eWhat does the U.S. Constitution say about war?\u003c/h2\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eA demonstrator holds a shredded copy of the Constitution of the United States on Sunday.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eEric Lee for The New York Times\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eArticle I, Section 8 of the Constitution assigns Congress dozens of powers like collecting taxes and creating post offices, as well as the power to “declare war” and to “raise and support armies.”\u003c/p\u003e\u003cp\u003eThe Constitution’s framers considered that clause a crucial check on presidential power, according to an \u003ca href=\"https://constitutioncenter.org/the-constitution/articles/article-i/clauses/753\" title=\"\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eessay\u003c/a\u003e by the law professors Michael D. Ramsey and Stephen I. Vladeck for the National Constitution Center. Early in American history, Congress approved even limited conflicts, including frontier clashes with Native American tribes.\u003c/p\u003e\u003cp\u003eBut the question is complicated by Article II of the Constitution, which delineates the powers of the president, and which designates the U.S. leader as the “commander in chief” of the U.S. military.\u003c/p\u003e\u003cp\u003ePresidents of both parties, relying heavily on legal opinions written by executive-branch lawyers, have cited that language to justify military action without congressional involvement.\u003c/p\u003e\u003cp\u003eCongress tried asserting itself with the \u003ca href=\"https://avalon.law.yale.edu/20th_century/warpower.asp\" title=\"\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eWar Powers Resolution of 1973\u003c/a\u003e, which says the American president must “consult with Congress before introducing United States Armed Forces into hostilities or into situation where imminent involvement in hostilities is clearly indicated by the circumstances.”\u003c/p\u003e\u003cp\u003eBut presidents have repeatedly disregarded that language or argued for a narrow definition of the “introduction” of forces. Congress has done little to enforce the resolution.\u003c/p\u003e\u003ch2 id=\"link-4f8570d9\"\u003eWhat are members of Congress saying about the U.S. strikes?\u003c/h2\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003ePresident Trump walking across the South Lawn as he returned to the White House on Sunday.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eAnna Rose Layden for The New York Times\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eDemocrats have almost uniformly criticized Mr. Trump for acting without legislative consent, and a few Republicans have as well.\u003c/p\u003e\u003cp\u003e“His actions are a clear violation of our Constitution — ignoring the requirement that only the Congress has the authority to declare war,” Senator Chris Van Hollen, Democrat of Maryland, said in a statement echoed by many of his colleagues.\u003c/p\u003e\u003cp\u003eRepresentative Thomas Massie, Republican of Kentucky, \u003ca href=\"https://www.cbsnews.com/news/thomas-massie-ro-khanna-face-the-nation-transcript-6-22-2025/\" title=\"\" rel=\"noopener noreferrer\" target=\"_blank\"\u003etold CBS News\u003c/a\u003e that there was no “imminent threat to the United States” from Iran.\u003c/p\u003e\u003cp\u003eSenator Tim Kaine, Democrat of Virginia, said on the same CBS program that Congress must act this week to assert a role in any further U.S. military action.\u003c/p\u003e\u003cp\u003e“Would we think it was war if Iran bombed a U.S. nuclear facility? Of course we would,” Mr. Kaine said. “This is the U.S. jumping into a war of choice at Donald Trump’s urging, without any compelling national security interests for the United States to act in this way, particularly without a debate and vote in Congress.”\u003c/p\u003e\u003cp\u003eSome Democrats say Mr. Trump has already gone unforgivably far. Representative Alexandria Ocasio-Cortez of New York called on Saturday night for Mr. Trump’s impeachment.\u003c/p\u003e\u003cp\u003eHawkish Republicans rejected such talk. “He had all the authority he needs under the Constitution,” Senator Lindsey Graham of South Carolina told NBC News on Sunday. Mr. Graham cited Mr. Trump’s power as commander in chief under Article II of the Constitution.\u003c/p\u003e\u003cp\u003e“Congress can declare war, or cut off funding. We can’t be the commander in chief. You can’t have 535 commander-in-chiefs,” Mr. Graham said, referring to the combined number of U.S. representatives and senators. “If you don’t like what the president does in terms of war, you can cut off the funding.”\u003c/p\u003e\u003cp\u003eMr. Graham noted that Congress has made formal war declarations in only five conflicts, and none since World War II. However, there has been a legal equivalent from Congress that President George W. Bush was the last American leader to successfully seek: an authorization for the use of military force, often called an A.U.M.F.\u003c/p\u003e\u003ch2 id=\"link-5bfb1d24\"\u003eWhat are legal scholars saying?\u003c/h2\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eForeign Minister Abbas Araghchi of Iran called the U.S. attack an “outrageous, grave and unprecedented violation” of international law and of the United Nations charter.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eKhalil Hamra/Associated Press\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eSeveral lawyers and scholars who have studied the international law of armed conflict say the United States is without a doubt at war with Iran for purposes of application of that law, and that Mr. Trump acted in violation of international conventions.\u003c/p\u003e\u003cp\u003e“The short answer is that this is, in my view, illegal under both international law and U.S. domestic law,” said Oona Hathaway, a professor of international law at Yale Law School who has worked at the Defense Department.\u003c/p\u003e\u003cp\u003eBrian Finucane, a former lawyer at the State Department, agreed that Mr. Trump needed to ask Congress for authorization beforehand. He also said “there is certainly a U.S. armed conflict with Iran, so the law of war applies.”\u003c/p\u003e\u003cp\u003eOn Sunday, Iran’s foreign minister, Abbas Araghchi, called the U.S. attack an “outrageous, grave and unprecedented violation” of international law and of the United Nations charter, which forbids U.N. members from violating the sovereignty of other members.\u003c/p\u003e\u003cp\u003eMr. Araghchi did not specifically say that his country is now at war with America. Mr. Finucane also said the United States had violated the U.N. charter.\u003c/p\u003e\u003cp\u003eRyan Goodman, a law professor at New York University who has also worked at the Defense Department, said “one important matter for both domestic law and especially international law is the issue of ‘imminence.’”\u003c/p\u003e\u003cp\u003eThe Trump administration is justifying the U.S. attack by saying Iran’s development of a nuclear weapon was imminent, Mr. Goodman noted.\u003c/p\u003e\u003cp\u003eBut “the law would require that the attack would be imminent,” he said, and “it is very hard to see how the administration can meet that test under even the most charitable legal assessment.”\u003c/p\u003e\u003cp\u003eEven if one were to focus on the question of a nuclear bomb, U.S. intelligence agencies \u003ca href=\"https://www.nytimes.com/2025/06/19/us/politics/iran-nuclear-weapons-assessment.html\" title=\"\"\u003ehave assessed\u003c/a\u003e that Iran had not yet decided to make such a weapon, even though it had developed a large stockpile of the enriched uranium necessary for doing so.\u003c/p\u003e\u003ch2 id=\"link-4edfdd36\"\u003eHow often have presidents sought congressional approval for war?\u003c/h2\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eThe furor over the sudden strikes also follows years of bipartisan efforts in Congress to try to place greater limits on a president’s ability to order military action, efforts that arose because of disastrous American wars in the Middle East and Central Asia.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eEric Lee/The New York Times\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eIn the decades since Congress declared war on Japan and Germany in 1941, U.S. presidents have repeatedly joined or started major conflicts without congressional consent.\u003c/p\u003e\u003cp\u003ePresident Harry S. Truman sent U.S. forces into Korea. President Ronald Reagan ordered military action in Libya, Grenada and Lebanon; President George H.W. Bush invaded Panama; President Bill Clinton ordered the bombing of mostly Serbian targets in Yugoslavia during the Kosovo War; President Barack Obama joined a 2011 NATO bombing campaign against the government of Muammar Qaddafi in Libya and led a military campaign against the Islamic State in Syria and Iraq.\u003c/p\u003e\u003cp\u003eMr. Obama broke with this trend in September 2013 when he decided against launching a planned strike against Syria without first seeking congressional authorization. The strike was unpopular in Congress, which never held a vote, and Mr. Obama did not act.\u003c/p\u003e\u003cp\u003ePresident George W. Bush won separate congressional authorizations for the use of military force against Afghanistan and Iraq before ordering invasions of those countries in 2001 and 2003.\u003c/p\u003e\u003cp\u003eIn the years since the Al Qaeda attacks of Sept. 11, 2001, several presidents have also ordered countless airstrikes and special operations raids on foreign soil to kill accused terrorists. Those have largely relied on broad interpretations of the two authorizations for the use of military force that Congress granted the executive branch for the so-called war on terror.\u003c/p\u003e\u003cp\u003eEmma Ashford, a scholar of U.S. foreign policy at the Stimson Center, said that in the post-9/11 wars, “some presidents have largely stopped asking permission at all.”\u003c/p\u003e\u003cp\u003eIn January 2020, Mr. Trump chose not to consult Congress before ordering an airstrike that killed a senior Iranian military commander, \u003ca href=\"https://www.nytimes.com/2020/01/03/obituaries/qassem-soleimani-dead.html\" title=\"\"\u003eQassim Suleimani\u003c/a\u003e, while he was visiting Iraq. Many members of Congress called that a clear act of war that was likely to begin wider hostilities. Iran responded by firing 27 missiles at U.S. forces in Iraq, inflicting traumatic brain injuries on about 100 U.S. troops. But the conflict did not expand further.\u003c/p\u003e\u003cp\u003eLast year, President Joseph R. Biden Jr. \u003ca href=\"https://www.nytimes.com/2024/01/11/us/politics/us-houthi-missile-strikes.html\" title=\"\"\u003eordered U.S. airstrikes\u003c/a\u003e against the Houthi militia in Yemen without getting congressional permission, and Mr. Trump \u003ca href=\"https://www.nytimes.com/2025/04/04/us/politics/us-strikes-yemen-houthis.html\" title=\"\"\u003edid the same\u003c/a\u003e this year.\u003c/p\u003e\u003cp\u003eAdvances in military technology, including drones and precision-guided munitions, have allowed presidents to take action with minimal initial risk to U.S. forces. Military officials say that Saturday’s strike in Iran, carried out by B-2 stealth bombers, encountered no resistance.\u003c/p\u003e\u003cp\u003eBut critics say the action invites \u003ca href=\"https://www.nytimes.com/2025/06/22/world/middleeast/iran-retaliate-us-strikes.html\" title=\"\"\u003eIranian retaliation\u003c/a\u003e that could escalate into full-scale war.\u003c/p\u003e\u003ch2 id=\"link-637e7577\"\u003eWhat happens next\u003c/h2\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eAdvances in military technology, including drones and precision-guided munitions, have allowed presidents to take action with minimal initial risk to U.S. forces. \u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eEric Lee for The New York Times\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eG.O.P. leaders in the House and Senate have \u003ca href=\"https://www.nytimes.com/2025/06/21/world/middleeast/congress-iran-strike-republicans-democrats.html\" title=\"\"\u003esignaled support for the strike\u003c/a\u003e, but Democrats and a few Republicans are demanding that Congress approve any further military action.\u003c/p\u003e\u003cp\u003eMr. Kaine, who serves on the committees on armed services and foreign relations, introduced \u003ca href=\"https://www.nytimes.com/2025/06/16/world/middleeast/kaine-trump-war-powers.html\" title=\"\"\u003ea Senate resolution last week\u003c/a\u003e requiring that Mr. Trump get explicit congressional approval before taking military action against Iran. Mr. Kaine on Sunday said the measure was still relevant and that he hoped it would come to a vote this week.\u003c/p\u003e\u003cp\u003eMr. Massie, the Kentucky Republican, introduced a similar war powers resolution last week in the House with Ro Khanna, Democrat of California.\u003c/p\u003e\u003cp\u003e“When two countries are bombing each other daily in a hot war, and a third country joins the bombing, that’s an act of war,” Mr. Massie wrote on social media on Sunday.\u003c/p\u003e\u003cp\u003eMr. Massie said he was “amazed at the mental gymnastics” Mr. Trump’s defenders have employed to argue the United States was not entering a war by attacking Iranian nuclear facilities.\u003c/p\u003e\u003cp\u003eMegan Mineiro contributed reporting.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"191f535a-ac97-5b0d-afe2-f49b3185448d\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#191f535a-ac97-5b0d-afe2-f49b3185448d\" role=\"article\" aria-posinset=\"32\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvMTkxZjUzNWEtYWM5Ny01YjBkLWFmZTItZjQ5YjMxODU0NDhk\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/stephen-castle\"\u003e\u003cimg alt=\"Stephen Castle\" src=\"https://static01.nyt.com/images/2018/10/08/multimedia/author-stephen-castle/author-stephen-castle-thumbLarge-v2.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2018/10/08/multimedia/author-stephen-castle/author-stephen-castle-thumbStandard-v2.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2018/10/08/multimedia/author-stephen-castle/author-stephen-castle-thumbLarge-v2.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eIn a phone call on Sunday, Prime Minister Keir Starmer of Britain and President Trump discussed U.S. military action and the “grave risk posed by Iran’s nuclear program to international security,” and “agreed that Iran must never be allowed to develop a nuclear weapon,” Downing Street said in a statement. The two leaders also “discussed the need for Iran to return to the negotiating table as soon as possible,” it added.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"b3132eb9-64b1-5907-9c04-38cf2c0626b1\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#b3132eb9-64b1-5907-9c04-38cf2c0626b1\" role=\"article\" aria-posinset=\"31\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvYjMxMzJlYjktNjRiMS01OTA3LTljMDQtMzhjZjJjMDYyNmIx\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/anushka-patil\"\u003e\u003cimg alt=\"Anushka Patil\" src=\"https://static01.nyt.com/images/2022/04/12/reader-center/author-anushka-patil/author-anushka-patil-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2022/04/12/reader-center/author-anushka-patil/author-anushka-patil-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2022/04/12/reader-center/author-anushka-patil/author-anushka-patil-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eIsrael’s ambassador to the U.N., Danny Danon, in turn told the Security Council that the world should thank the United States for its strikes on Iran’s nuclear facilities. “Thank you, President Trump, for acting when so many hesitated,” he said.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"a4224842-faea-54d0-83ed-110bf0c957b8\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#a4224842-faea-54d0-83ed-110bf0c957b8\" role=\"article\" aria-posinset=\"30\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvYTQyMjQ4NDItZmFlYS01NGQwLTgzZWQtMTEwYmYwYzk1N2I4\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/anushka-patil\"\u003e\u003cimg alt=\"Anushka Patil\" src=\"https://static01.nyt.com/images/2022/04/12/reader-center/author-anushka-patil/author-anushka-patil-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2022/04/12/reader-center/author-anushka-patil/author-anushka-patil-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2022/04/12/reader-center/author-anushka-patil/author-anushka-patil-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eIran’s ambassador to the United Nations, Amir Saeid Iravani, told the Security Council on Sunday that “America has once more recklessly chosen to sacrifice its own security merely to safeguard Netanyahu,” referring to the Israeli prime minister. The United States is the only country to have ever used nuclear weapons in combat and was now waging war against Iran under what he said was the “fabricated and absurd pretext” of preventing it from acquiring nuclear weapons, adding, “What a bitter and tragic irony.”\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eEduardo Munoz/Reuters\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"e258213d-e391-5ce3-b9be-146ee3d82830\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#e258213d-e391-5ce3-b9be-146ee3d82830\" role=\"article\" aria-posinset=\"29\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvZTI1ODIxM2QtZTM5MS01Y2UzLWI5YmUtMTQ2ZWUzZDgyODMw\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003cspan\u003e\u003cimg alt=\"Annie Correal and Sanam Mahoozi\" src=\"https://static01.nyt.com/images/icons/t_logo_291_black.png?quality=75\u0026amp;auto=webp\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan itemprop=\"name\"\u003eAnnie Correal and Sanam Mahoozi\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eThe governor of the province of Tehran said in an interview on state television Sunday night that more than 200 places in the province, including a medical center, had been hit by Israeli strikes since the war began on June 13. The governor, Mohammad Sadegh Motamedian, said 200 residents of the province had been killed in the strikes, including at least 39 women and 12 children, and over 800 others had been hospitalized for injuries, according to the Mehr news agency, which is affiliated with the Iranian government. Infrastructure for the delivery of electricity, gas and water had also been hit, the governor said.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"7d6242e7-663f-5716-bff7-2dc5bdc3b76b\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#7d6242e7-663f-5716-bff7-2dc5bdc3b76b\" role=\"article\" aria-posinset=\"28\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvN2Q2MjQyZTctNjYzZi01NzE2LWJmZjctMmRjNWJkYzNiNzZi\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/eric-schmitt\"\u003e\u003cimg alt=\"Eric Schmitt\" src=\"https://static01.nyt.com/images/2018/06/12/multimedia/author-eric-schmitt/author-eric-schmitt-thumbLarge-v2.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2018/06/12/multimedia/author-eric-schmitt/author-eric-schmitt-thumbStandard-v2.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2018/06/12/multimedia/author-eric-schmitt/author-eric-schmitt-thumbLarge-v2.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAmerican military and intelligence officials have detected signs that Iran-backed militias are preparing to attack U.S. bases in Iraq, and possibly Syria, in retaliation for the U.S. strikes in Iran. But so far the groups have held off, and Iraqi officials are working hard to dissuade militia action, a U.S. official said on Sunday.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"1d6567b4-cb3d-5217-9834-a3047db47ab5\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#1d6567b4-cb3d-5217-9834-a3047db47ab5\" role=\"article\" aria-posinset=\"27\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvMWQ2NTY3YjQtY2IzZC01MjE3LTk4MzQtYTMwNDdkYjQ3YWI1\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/maggie-haberman\"\u003e\u003cimg alt=\"Maggie Haberman\" src=\"https://static01.nyt.com/images/2018/07/12/multimedia/author-maggie-haberman/author-maggie-haberman-thumbLarge-v2.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2018/07/12/multimedia/author-maggie-haberman/author-maggie-haberman-thumbStandard-v4.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2018/07/12/multimedia/author-maggie-haberman/author-maggie-haberman-thumbLarge-v2.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eAfter several Trump cabinet members stressed no interest in regime change in Iran this morning, the president sounded more intrigued in a Truth Social post on Sunday afternoon: “It’s not politically correct to use the term, ‘Regime Change,’ but if the current Iranian Regime is unable to MAKE IRAN GREAT AGAIN, why wouldn’t there be a Regime change??? MIGA!!!” he wrote.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"adc57580-f271-5af6-951b-d8b3cf7be135\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#adc57580-f271-5af6-951b-d8b3cf7be135\" role=\"article\" aria-posinset=\"26\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvYWRjNTc1ODAtZjI3MS01YWY2LTk1MWItZDhiM2NmN2JlMTM1\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/eric-schmitt\"\u003e\u003cimg alt=\"Eric Schmitt\" src=\"https://static01.nyt.com/images/2018/06/12/multimedia/author-eric-schmitt/author-eric-schmitt-thumbLarge-v2.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2018/06/12/multimedia/author-eric-schmitt/author-eric-schmitt-thumbStandard-v2.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2018/06/12/multimedia/author-eric-schmitt/author-eric-schmitt-thumbLarge-v2.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe last of the more than a dozen B-2 bombers that took part in the strikes against three Iranian nuclear sites have returned safely to Whiteman Air Force Base in Missouri, a U.S. official said on Sunday. Several of the jets flew west as a ruse, allowing the seven planes carrying 30,000-pound bombs to fly undetected on an easterly route through Europe. The planes’ round-trip flights took up to 37 hours, the official said. \u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"f9a92501-59b4-5955-9c8a-43e332079368\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#f9a92501-59b4-5955-9c8a-43e332079368\" role=\"article\" aria-posinset=\"25\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvZjlhOTI1MDEtNTliNC01OTU1LTljOGEtNDNlMzMyMDc5MzY4\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/ephrat-livni\"\u003e\u003cimg alt=\"Ephrat Livni\" src=\"https://static01.nyt.com/images/2021/09/08/business/author-ephrat-livni/author-ephrat-livni-thumbLarge-v6.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2021/09/08/business/author-ephrat-livni/author-ephrat-livni-thumbStandard-v6.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2021/09/08/business/author-ephrat-livni/author-ephrat-livni-thumbLarge-v6.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe Israeli military said late on Sunday night that about 20 fighter jets had conducted strikes on military targets in Tehran, Iran’s capital, and in western Iran. The attacks targeted storage and missile-launching infrastructure and satellites, as well as military radar sites in western Iran, the Israeli military said.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"live-blog-post\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#iran-bombings-nypd-counterterrorism\" data-source-id=\"100000010243292\" role=\"article\" aria-posinset=\"24\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlL2E2OTExNmEzLTMxYjQtNWE5MS04OTA4LTJkYWY4ODIzNWZiOA==\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/chelsia-rose-marcius\"\u003e\u003cimg alt=\"Chelsia Rose Marcius\" src=\"https://static01.nyt.com/images/icons/t_logo_291_black.png?quality=75\u0026amp;auto=webp\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2 id=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlL2E2OTExNmEzLTMxYjQtNWE5MS04OTA4LTJkYWY4ODIzNWZiOA==\"\u003e\u003ca href=\"#iran-bombings-nypd-counterterrorism\"\u003eNew York City increased the police’s presence at vulnerable sites after the U.S. strikes on Iran.\u003c/a\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eEduardo Munoz/Reuters\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eNew York City increased the police presence at religious, cultural and diplomatic sites following the U.S. bombings in Iran, Mayor Eric Adams said after a virtual meeting on Sunday among the mayor, Police Department leaders and the agency’s international liaisons.\u003c/p\u003e\u003cp\u003eThe mayor and the police commissioner, Jessica S. Tisch, held the briefing “to discuss the situation in the Middle East and how it affects us here at home,” Mr. Adams said in a \u003ca href=\"https://x.com/NYCMayor/status/1936808800880566569/photo/2\" title=\"\" rel=\"noopener noreferrer\" target=\"_blank\"\u003estatement on social media\u003c/a\u003e.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eHe said the police presence had been increased “out of an abundance of caution.”\u003c/p\u003e\u003cp\u003eIn a separate statement on Sunday, Gov. Kathy Hochul said state officials were “not aware of any specific or credible threat to New Yorkers.” But “given New York’s distinctive global profile,” she said, “we are taking this situation extraordinarily seriously.”\u003c/p\u003e\u003cp\u003eIt is common practice for the Police Department — the country’s largest municipal law enforcement agency — to increase security after a major international event.\u003c/p\u003e\u003cp\u003eTo assist in those efforts, the department confers with its \u003ca href=\"https://www.nycpolicefoundation.org/ourwork/advance/counterterrorism/\" title=\"\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eliaisons who are stationed at 14 posts worldwide\u003c/a\u003e. Four of those posts are in the Middle East: Tel Aviv; Doha, Qatar; Amman, Jordan; and Abu Dhabi, the United Arab Emirates. Police officials in those countries were part of the briefing on Sunday, Commissioner Tisch said.\u003c/p\u003e\u003cp\u003e“We have over a dozen detectives embedded within international law enforcement agencies who serve as our eyes and ears for threat awareness overseas,” she said in a \u003ca href=\"https://x.com/NYPDPC/status/1936857137860288827\" title=\"\" rel=\"noopener noreferrer\" target=\"_blank\"\u003estatement on social media\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e“Over the past week, they have also gone above and beyond, using their contacts to help New Yorkers seeking to evacuate and get home,” she added.\u003c/p\u003e\u003cp\u003eIn New York, the Metropolitan Transportation Authority, which operates the city’s subway system, and the Port Authority, the agency that oversees airports, seaports, and bridges and tunnels connecting New York to New Jersey, have activated counterterrorism protections, Ms. Hochul said. State Police officers will also patrol houses of worship and other at-risk sites.\u003c/p\u003e\u003cp\u003e“We have some of America’s largest Jewish and Muslim communities, and many have loved ones in the region,” she said. “As we work to keep New Yorkers safe, we pray for the safety of our American troops, for speedy de-escalation of this conflict, and for durable peace in the region.”\u003c/p\u003e\u003cp\u003eThe safety of New York City in the wake of \u003ca href=\"https://www.nytimes.com/2025/06/22/nyregion/bill-clinton-endorse-cuomo-mayor.html\" title=\"\"\u003ethe attack on Iran also arose as an issue in the mayoral race\u003c/a\u003e over the weekend. Former Gov. Andrew M. Cuomo, the front-runner in the imminent Democratic primary, took the opportunity on Sunday to criticize his closest competitor, Assemblyman Zohran Mamdani, saying that Mr. Mamdani was not prepared to lead the city in a situation when it was on “high alert.”\u003c/p\u003e\u003cp\u003eMr. Cuomo said that while he believed President Trump should have consulted Congress before authorizing the strikes, “I think the world is a safer place without Iran having nuclear weapons.”\u003c/p\u003e\u003cp\u003eMr. Mamdani, for his part, condemned the attack, calling it an unconstitutional escalation that would “plunge the world deeper into chaos.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"ee0377ff-2b2e-55c6-9e11-33c34df75221\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#ee0377ff-2b2e-55c6-9e11-33c34df75221\" role=\"article\" aria-posinset=\"23\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvZWUwMzc3ZmYtMmIyZS01NWM2LTllMTEtMzNjMzRkZjc1MjIx\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/euan-ward\"\u003e\u003cimg alt=\"Euan Ward\" src=\"https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2023/02/08/reader-center/author-euan-ward/author-euan-ward-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eHezbollah condemned the U.S. strike on Iran’s nuclear facilities in a statement on Sunday, calling it a “treacherous and barbaric American aggression,” and warned it risks plunging the region into deeper conflict. The Lebanese militant group, which has long been Iran’s most-powerful regional ally, stopped short of threatening any military response of its own, but said Tehran had “every right to respond” to the attack.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"9e03f8c0-0445-5774-80c1-060228b0b9c9\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#9e03f8c0-0445-5774-80c1-060228b0b9c9\" role=\"article\" aria-posinset=\"22\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvOWUwM2Y4YzAtMDQ0NS01Nzc0LTgwYzEtMDYwMjI4YjBiOWM5\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/anushka-patil\"\u003e\u003cimg alt=\"Anushka Patil\" src=\"https://static01.nyt.com/images/2022/04/12/reader-center/author-anushka-patil/author-anushka-patil-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2022/04/12/reader-center/author-anushka-patil/author-anushka-patil-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2022/04/12/reader-center/author-anushka-patil/author-anushka-patil-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe interim U.S. representative to the United Nations, Dorothy Camille Shea, told the Security Council on Sunday that “the time finally came” for the United States to “act decisively” in defense of its own interest and in defense of Israel. “Let us be clear, Iran should not escalate,” she added.\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eEduardo Munoz/Reuters\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"3f505a8a-a479-5503-a415-b3ffe306af15\" data-testid=\"reporter-update\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#3f505a8a-a479-5503-a415-b3ffe306af15\" role=\"article\" aria-posinset=\"21\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-UmVwb3J0ZXJVcGRhdGU6bnl0Oi8vcmVwb3J0ZXJ1cGRhdGUvM2Y1MDVhOGEtYTQ3OS01NTAzLWE0MTUtYjNmZmUzMDZhZjE1\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/anushka-patil\"\u003e\u003cimg alt=\"Anushka Patil\" src=\"https://static01.nyt.com/images/2022/04/12/reader-center/author-anushka-patil/author-anushka-patil-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2022/04/12/reader-center/author-anushka-patil/author-anushka-patil-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2022/04/12/reader-center/author-anushka-patil/author-anushka-patil-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe nuclear nonproliferation treaty raised by several speakers during this U.N. Security Council session went into effect in 1970. Its aspirations were to prevent the spread of nuclear weapons and technology and to make advances toward disarmament, and though 191 countries have joined, its reach remains somewhat limited. Israel, which \u003ca href=\"https://www.nytimes.com/2025/06/17/world/middleeast/israel-nuclear-weapons.html\" title=\"\"\u003ehas nuclear weapons\u003c/a\u003e, is one of five countries — joining India, Pakistan, North Korea and South Sudan — that is not a signatory to the treaty. And Iran, which is, threatened to withdraw this week after the \u003ca href=\"https://www.nytimes.com/2025/06/12/world/middleeast/un-iaea-iran-nuclear-program.html\" title=\"\"\u003eI.A.E.A. accused it of failing to comply with its obligations\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"live-blog-post\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#iran-government-us-attack\" data-source-id=\"100000010243215\" role=\"article\" aria-posinset=\"20\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlLzBlOTUyZmRlLTI5ODEtNWE2Mi1hOTk1LTQ0OTEwOTYwYjQ2Ng==\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/farnaz-fassihi\"\u003e\u003cimg alt=\"Farnaz Fassihi\" src=\"https://static01.nyt.com/images/2022/02/28/world/farnaz-fassahi/farnaz-fassahi-thumbLarge-v2.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2022/02/28/world/farnaz-fassahi/farnaz-fassahi-thumbStandard-v2.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2022/02/28/world/farnaz-fassahi/farnaz-fassahi-thumbLarge-v2.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/farnaz-fassihi\" itemprop=\"name\"\u003eFarnaz Fassihi\u003c/a\u003e\u003c/p\u003e\u003cp\u003eFarnaz Fassihi has lived and worked in Iran, has covered the country for three decades and was a war correspondent in the Middle East for 15 years.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003e\u003ch2 id=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlLzBlOTUyZmRlLTI5ODEtNWE2Mi1hOTk1LTQ0OTEwOTYwYjQ2Ng==\"\u003e\u003ca href=\"#iran-government-us-attack\"\u003eIranian officials are trying to project a sense of normalcy, even though nothing is normal.\u003c/a\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003ePresident Masoud Pezeshkian of Iran made the rounds in Tehran on Sunday.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eArash Khamooshi for The New York Times\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eIran was reeling from American military attacks on its three main nuclear sites early Sunday, with four officials describing the mood in the government as one of defeat and national humiliation, amid divisions about how to respond.\u003c/p\u003e\u003cp\u003ePublicly, Iranian officials have tried to project a sense of normalcy even though nothing is normal. They have tried to downplay the damage to the nuclear facilities at Fordo, Natanz and Isfahan, even though \u003ca href=\"https://www.nytimes.com/interactive/2025/06/22/world/middleeast/us-iran-nuclear-sites.html\" title=\"\"\u003esatellite images\u003c/a\u003e show the mountainous site of Fordo’s underground facilities punctured with huge holes.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eBut Hamid Hosseini, a member of the country’s Chamber of Commerce energy committee, said in a phone interview from Tehran that Iran did not have the upper hand — militarily and technologically — and that it was time to stand down.\u003c/p\u003e\u003cp\u003e“We need to make national interests the priority,” he said. “We are not supposed to be at war forever.”\u003c/p\u003e\u003cp\u003eOn Sunday, Iran’s president, Masoud Pezeshkian, made public rounds in the capital, stopping at an anti-American demonstration in downtown Tehran and visiting victims of the attacks at a hospital. A heart surgeon and former health minister, he praised the medical staff members for their service during the war.\u003c/p\u003e\u003cp\u003eIn a post \u003ca href=\"https://x.com/drpezeshkian/status/1936819767437844784\" title=\"\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eon social media,\u003c/a\u003e Mr. Pezeshkian wrote: “We will walk this path together. We will protect Iran and show the world that our great people are undefeatable.”\u003c/p\u003e\u003cp\u003eThe post was accompanied by a photograph of Mr. Pezeshkian smiling and waving during his street appearance on Sunday.\u003c/p\u003e\u003cp\u003eState television and news media affiliated with the Islamic Revolutionary Guards Corps reported that the nuclear sites had not sustained major damage, and that nearby residents in the area had not heard huge explosions. They broadcast scenes of people going about their daily routines, shopping at the market and driving on roads in Qum and Isfahan, the urban areas closest to the nuclear sites.\u003c/p\u003e\u003cp\u003eAbdollah Abdollahi, the conservative editor of the Tasnim news agency, wrote in an editorial that Iran’s nuclear program had three components, knowledge, technology and infrastructure, and that the American strikes had only partly damaged the last one. He called for Iran to “react without restraint to Israel and the United States aggression.”\u003c/p\u003e\u003cp\u003eIran’s Atomic Safety Center said in a statement after the attacks that, as a precautionary measure before the U.S. strikes, the nuclear sites had been evacuated and equipment had been relocated.\u003c/p\u003e\u003cp\u003eIran’s Red Crescent Society said 11 people had been injured in the attacks, and four remained hospitalized. The spokesman for Iran’s Ministry of Health, Hossein Kermanpour, said none of the injured had signs of radiation contamination.\u003c/p\u003e\u003cp\u003eThe war has been raging since Israel attacked Iran on June 13, and Iranian officials from all political factions appeared united in their calls for the country to retaliate immediately and forcefully. Iran and Israel have been exchanging strikes, with growing civilian casualties on both sides.\u003c/p\u003e\u003cp\u003eBut going to war against the United States, which has toppled governments in the region through wars and invasions, including in countries neighboring Iran’s east and west, poses formidable risks for Iran’s clerical rulers.\u003c/p\u003e\u003cp\u003eThe reactions from Iranian officials and prominent political and military pundits have been varied.\u003c/p\u003e\u003cp\u003eConservative, hard-line members of Parliament called for Iran to leave the Nuclear Nonproliferation Treaty and close the Strait of Hormuz. Iran controls the strait, but any move to block vessels from transiting through the waterway could invite further U.S. attacks because about 20 percent of the world’s energy supply travels through it every day.\u003c/p\u003e\u003cp\u003eEbrahim Rezaei, the spokesman for the national security and foreign committees of Iran’s Parliament, told Iranian news media that Tehran would not suspend its nuclear activity and that committee members were “insisting on a forceful and appropriate response to the United States.”\u003c/p\u003e\u003cp\u003eHe added, “Retaliation in kind and actions that would create deterrence is what we recommend.”\u003c/p\u003e\u003cp\u003eOther voices cautioned restraint. Former President Mohammad Khatami, the father of the reformist movement in Iran, said in a statement, “All decisions, positions, diplomatic and defense reactions must be made wisely, with foresight and without excitement and solely based on revenge.”\u003c/p\u003e\u003cp\u003eIran’s supreme leader, Ayatollah Ali Khamenei, will have the final say on how Iran responds to the American attacks. But almost 24 hours after the raids on the nuclear sites, Ayatollah Khamenei had made no official statement and had not addressed the nation.\u003c/p\u003e\u003cp\u003eTwo Iranian officials said the questions on everyone’s minds were: “Where is Khamenei? Why isn’t he speaking?”\u003c/p\u003e\u003cp\u003eBut the officials, who are familiar with the ayatollah’s security protocols and insisted on not being named to discuss sensitive issues, said that communication with the supreme leader was extremely difficult, and that messages were being passed in writing and through human messengers since \u003ca href=\"https://www.nytimes.com/2025/06/21/world/middleeast/iran-ayatollah-israel-war.html\" title=\"\"\u003ehe had been sheltering in a bunker without electronic communication\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eBut Ayatollah Khamenei’s top foreign policy adviser, Ali Akbar Velayati, signaled tough posturing \u003ca href=\"https://x.com/Drvelayati_ir/status/1936763798284599402?t=LWBVfGdk_x0krJGDnEYt3Q\u0026amp;s=19https://x.com/Drvelayati_ir/status/1936763798284599402?t=LWBVfGdk_x0krJGDnEYt3Q\u0026amp;s=19https://x.com/Drvelayati_ir/status/1936763798284599402?t=LWBVfGdk_x0krJGDnEYt3Q\u0026amp;s=19\" title=\"\" rel=\"noopener noreferrer\" target=\"_blank\"\u003ein a post\u003c/a\u003e on social media. But he stopped short of threatening military retaliation.\u003c/p\u003e\u003cp\u003e“Now that the United States has started the war,” he wrote, “it should know that the Islamic Republic of Iran will have the last word.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv data-testid=\"live-blog-post\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#iran-oil-gas-markets\" data-source-id=\"100000010243171\" role=\"article\" aria-posinset=\"19\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlLzAzYWZlMGJkLWU1YjktNWVhZi04ZWQ5LTMxMmQ1NTJjY2FmYQ==\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/rebecca-f-elliott\"\u003e\u003cimg alt=\"Rebecca F. Elliott\" src=\"https://static01.nyt.com/images/2024/05/29/reader-center/author-rebecca-f-elliott/author-rebecca-f-elliott-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2024/05/29/reader-center/author-rebecca-f-elliott/author-rebecca-f-elliott-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2024/05/29/reader-center/author-rebecca-f-elliott/author-rebecca-f-elliott-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2 id=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlLzAzYWZlMGJkLWU1YjktNWVhZi04ZWQ5LTMxMmQ1NTJjY2FmYQ==\"\u003e\u003ca href=\"#iran-oil-gas-markets\"\u003eThe big question facing energy markets: Will Iran disrupt oil and gas flows?\u003c/a\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eAny attempt by Iran to stop the flow of oil and natural gas through the Strait of Hormuz could send already rising fuel prices even higher.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eJoe Raedle/Getty Images\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eOil prices rose moderately as the market opened on Sunday evening, a sign that traders are concerned, though not panicked, about how Iran may respond to the U.S. bombing of its nuclear facilities over the weekend.\u003c/p\u003e\u003cp\u003eThe increase of around 3 percent left U.S. oil prices hovering around $76 a barrel. That is notably higher than prices were two weeks ago, before Israel struck Iran, but still tame by recent standards.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eSo far, the conflict between Israel and Iran has \u003ca href=\"https://www.nytimes.com/2025/06/17/business/energy-environment/oil-prices-trump-iran.html\" title=\"\"\u003edamaged oil and gas facilities in both countries\u003c/a\u003e, but it has not meaningfully affected the flow of energy.\u003c/p\u003e\u003cp\u003eThe big question is whether Iran will seek to change that. If it were to disrupt the flow of oil and natural gas in the Persian Gulf region, the economic toll would be steep, including for Iran. That is because a large portion of the world’s oil and liquefied natural gas, or L.N.G., passes through the Strait of Hormuz, a waterway that hugs a portion of Iran’s southern border.\u003c/p\u003e\u003cp\u003eAny attempt by Iran to close the strait, which connects the Persian Gulf to the Gulf of Oman, would most likely send oil prices soaring. It would also inflict severe economic damage in Iran because \u003ca href=\"https://www.nytimes.com/2025/06/13/business/energy-environment/oil-prices-israel-iran.html\" title=\"\"\u003enearly all of the country’s oil exports move through the channel\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eAnother risk is if Iran were to attack U.S. military bases in the Middle East.\u003c/p\u003e\u003cp\u003e“If Iran follows through on threats to retaliate against U.S. forces in the region, traders might finally — after more than three years of geopolitical ‘wolf’ cries — price in escalatory pathways that previously seemed far-fetched,” ClearView Energy Partners, a Washington research firm, wrote after the United States bombed Iran.\u003c/p\u003e\u003cdiv id=\"markets-embed-oil\" data-preview-slug=\"bk-otqgZdUsAIaafg\" data-birdkit-hydrate=\"231ec667c6629057\" slug=\"markets-embed-oil\" data-sourceid=\"100000010213015\" data-testid=\"inline-interactive\" data-id=\"100000010213015\" data-source-id=\"100000010213015\"\u003e\u003cp\u003e\u003ch2\u003ePrice of Oil\u003c/h2\u003e \u003c/p\u003e  \u003c/div\u003e\u003cp\u003eThe war is already increasing energy costs for consumers in the United States. The price of a gallon of regular gasoline climbed nearly 3 percent last week, to $3.22, according to the AAA motor club. This time last year, the price was $3.45 a gallon. Prices at the pump generally lag oil prices.\u003c/p\u003e\u003cp\u003eIran’s foreign minister, Abbas Araghchi, \u003ca href=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump?smid=url-share#we-have-to-respond-irans-foreign-minister-warns\" title=\"\"\u003esaid on Sunday\u003c/a\u003e that Iran would respond in “self-defense” but declined to explain what that might entail.\u003c/p\u003e\u003cp\u003eIran would have a hard time closing the Strait of Hormuz for a long time, but the country could make passing through it more treacherous, analysts have said. “Multiple security experts contend that Iran has the ability to strike individual tankers and key ports with missiles and mines,” RBC Capital Markets analysts wrote on Sunday.\u003c/p\u003e\u003cp\u003eLast week, two oil tankers \u003ca href=\"https://www.nytimes.com/2025/06/19/business/tanker-collision-hormuz-israel-iran.html\" title=\"\"\u003ecollided near the strait\u003c/a\u003e as many vessels reported experiencing interference with their GPS systems. The United Arab Emirates attributed the crash to navigational errors.\u003c/p\u003e\u003cp\u003eAround a fifth of the world’s oil and related products flows through the Strait of Hormuz each day, according to the U.S. Energy Information Administration. A similar share of L.N.G., or natural gas that has been cooled for shipment, also makes the journey.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.eia.gov/todayinenergy/detail.php?id=65504\u0026amp;utm_medium=PressOps\" title=\"\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eMore than 80 percent of those fuels\u003c/a\u003e go to Asia, meaning those countries would be severely affected by any closing, the energy administration said.\u003c/p\u003e\u003cdiv slug=\"datawrapper_RjZut\" data-sourceid=\"100000010243417\" id=\"datawrapper_RjZut\" data-testid=\"inline-interactive\" data-id=\"100000010243417\" data-source-id=\"100000010243417\"\u003e\n      \n    \n\n\u003cp\u003eDestination of Oil Shipped Through the Strait of Hormuz\u003c/p\u003e\n\u003c/div\u003e\u003cp\u003eThe United States and other countries would feel the effects in the form of higher energy costs.\u003c/p\u003e\u003cp\u003eVice President JD Vance said on Sunday morning that disrupting shipping in the Strait of Hormuz would be “suicidal” for Iran.\u003c/p\u003e\u003cp\u003e“What would make sense is for them to come to the negotiating table to actually give up their nuclear weapons program over the long term,” he said on the NBC program “\u003ca href=\"https://www.youtube.com/watch?v=PZpRbo7RD_Y\" title=\"\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eMeet the Press.\u003c/a\u003e”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv data-testid=\"live-blog-post\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#fordo-iran-nuclear-bomb-satellite\" data-source-id=\"100000010243095\" role=\"article\" aria-posinset=\"11\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlL2FlODdjYzY3LTM0YTAtNTY5Mi1iZWVjLWQwOWIwYmNjMDlmMQ==\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/samuel-granados\"\u003e\u003cimg alt=\"Samuel Granados\" src=\"https://static01.nyt.com/images/icons/t_logo_291_black.png?quality=75\u0026amp;auto=webp\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003ca href=\"https://www.nytimes.com/by/josh-holder\"\u003e\u003cimg alt=\"Josh Holder\" src=\"https://static01.nyt.com/images/2023/09/22/reader-center/author-josh-holder/author-josh-holder-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2023/09/22/reader-center/author-josh-holder/author-josh-holder-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2023/09/22/reader-center/author-josh-holder/author-josh-holder-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2 id=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlL2FlODdjYzY3LTM0YTAtNTY5Mi1iZWVjLWQwOWIwYmNjMDlmMQ==\"\u003e\u003ca href=\"#fordo-iran-nuclear-bomb-satellite\"\u003eSatellite images show the U.S. may have targeted ventilation shafts at Fordo.\u003c/a\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003eA New York Times analysis of satellite imagery shows that the United States targeted Fordo, Iran’s underground nuclear enrichment facility, at the precise locations of two structures that experts said might be ventilation shafts.\u003c/p\u003e\u003cp\u003eThe structures were visible only during the early stages of the plant’s operation, and could be seen in satellite images in 2009. By 2011, both were no longer visible. Experts said they might be ventilation shafts used during the plant’s construction, and then buried.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e“Hitting a ventilation shaft would make sense, because the hole for air already penetrates the thick rock, interrupting its integrity,” said Mark Fitzpatrick, a nuclear expert at the International Institute for Strategic Studies.\u003c/p\u003e\u003cp\u003eA U.S. official \u003ca href=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump/dcd70805-505b-51e1-b7b1-13234e020218?smid=url-share\" title=\"\"\u003esaid\u003c/a\u003e that six B-2 bombers had dropped a dozen 30,000-pound “bunker buster” bombs on Fordo overnight.\u003c/p\u003e\u003cp\u003eVentilation shafts “are probably the most vulnerable points of the facility,” said Scott Roecker, a vice president at the Nuclear Threat Initiative, a nonprofit dedicated to reducing the spread of nuclear weapons.\u003c/p\u003e\u003cp\u003eWhether or not the attack on those areas was enough to completely destroy Fordo \u003ca href=\"https://www.nytimes.com/2025/06/22/world/middleeast/iran-fordo-nuclear-damaged-not-destroyed.html\" title=\"\"\u003eis unclear\u003c/a\u003e. While President Trump said on Saturday that Iran’s nuclear enrichment facilities were “completely and totally obliterated,” his early public pronouncements were in contrast with more cautious initial assessments by the U.S. and Israeli militaries, which indicated the facility was severely damaged. Those damage assessments \u003ca href=\"https://www.nytimes.com/2025/06/22/world/middleeast/iran-fordo-nuclear-damaged-not-destroyed.html\" title=\"\"\u003eare ongoing\u003c/a\u003e, and the United States and Israel have not made any final conclusions.\u003c/p\u003e\u003cp\u003eGiven that the U.S. attack appears to have targeted the area around the two structures, “I would assume the U.S. has active intelligence that seems to indicate that those shafts were structural weaknesses,” said Joseph Rodgers, a nuclear expert at the Center for Strategic and International Studies, a research institute in Washington.\u003c/p\u003e\u003cp\u003eSatellite imagery taken by Maxar Technologies on Sunday showed debris scattered around the large complex, but the site’s support buildings appeared intact. That indicates, Mr. Rodgers said, that “the key target was really how to destroy the structure underground,” and that the attack was most likely not trying to take the facility offline by targeting other support infrastructure.\u003c/p\u003e\u003cp\u003eIn satellite images after the strike, the facility’s entrance tunnels appeared filled in with dirt. Experts said that was probably a measure taken as part of Iran’s preparation for an attack, possibly in an attempt to shield the facility inside.\u003c/p\u003e\u003cp\u003eSatellite imagery released by Maxar Technologies showed a flurry of abnormal activity near the entrance tunnel in the three days preceding the U.S. strikes.\u003c/p\u003e\u003cp\u003eOn June 19, there were 16 cargo trucks near an entrance tunnel. The following day, the trucks had moved northwest away from the site, but other trucks and bulldozers were near the entrance.\u003c/p\u003e\u003cp\u003eNew dirt could be seen in the tunnel entrances on June 20, and far more is visible in satellite images taken after the strikes.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv data-testid=\"live-blog-post\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#russia-may-be-a-friend-of-iran-but-it-seems-unlikely-to-offer-much-help\" data-source-id=\"100000010243275\" role=\"article\" aria-posinset=\"7\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlLzM4Yjk3YzgxLTM5NTQtNTJhMS04ZTAwLTFmNjFkNWY2N2JmZQ==\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/anatoly-kurmanaev\"\u003e\u003cimg alt=\"Anatoly Kurmanaev\" src=\"https://static01.nyt.com/images/2021/08/12/reader-center/author-anatoly-kurmanaev/author-anatoly-kurmanaev-thumbLarge-v4.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2021/08/12/reader-center/author-anatoly-kurmanaev/author-anatoly-kurmanaev-thumbStandard-v4.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2021/08/12/reader-center/author-anatoly-kurmanaev/author-anatoly-kurmanaev-thumbLarge-v4.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2 id=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlLzM4Yjk3YzgxLTM5NTQtNTJhMS04ZTAwLTFmNjFkNWY2N2JmZQ==\"\u003e\u003ca href=\"#russia-may-be-a-friend-of-iran-but-it-seems-unlikely-to-offer-much-help\"\u003eRussia may be ‘a friend’ of Iran, but it seems unlikely to offer much help.\u003c/a\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eThe Iranian foreign minister, Abbas Araghchi, said Russia and Iran “enjoy a strategic partnership.”\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eOzan Kose/Agence France-Presse — Getty Images\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eThe Iranian foreign minister said on Sunday that he was heading to Russia to meet with President Vladimir V. Putin on Monday, as Iran weighed a response to a wave of U.S. \u003ca href=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump\" title=\"\"\u003estrikes\u003c/a\u003e on its nuclear sites.\u003c/p\u003e\u003cp\u003eThere was little sign that Russia was prepared to provide military assistance to Iran, its closest remaining Middle East ally, as it prioritized its own war against Ukraine. Iran has not received concrete support from any allies through 10 days of war with Israel and, now, an attack by the United States, leaving the country \u003ca href=\"https://www.nytimes.com/2025/06/22/world/middleeast/iran-israel-hezbollah-houthis-hamas-iraq.html\" title=\"\"\u003emore isolated\u003c/a\u003e than it has been in decades.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eIn announcing the trip to Moscow, the Iranian foreign minister, Abbas Araghchi, called Russia “a friend of Iran” and said that the two countries “enjoy a strategic partnership and we always consult with each other and coordinate our positions.”\u003c/p\u003e\u003cp\u003eBy Sunday evening, the Kremlin had not confirmed the meeting.\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eMr. Araghchi with his Russian counterpart, Sergey V. Lavrov, in Moscow in April. The Kremlin has not publicly commented on the U.S. attacks on Iran.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eTatyana Makeyeva/Agence France-Presse — Getty Images\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eThe Russian Foreign Ministry condemned the American military intervention in Iran, saying it had undermined global efforts to contain the proliferation of nuclear weapons. But the Kremlin has not publicly commented on the attacks, and it has not announced any tangible steps to help Iran.\u003c/p\u003e\u003cp\u003eThe guarded reaction reflects Mr. Putin’s limited resources, with Russia in its fourth year of war in Ukraine, and his conflicting geopolitical priorities.\u003c/p\u003e\u003cp\u003eRussia is trying to maintain warm relations with Iran’s Middle Eastern rivals, including Saudi Arabia. The Kremlin is also likely to tread carefully on issues that may alienate President Trump, whose support — or, at least, acquiescence — it needs to secure a peace deal in Ukraine on its own terms.\u003c/p\u003e\u003cp\u003eIn addition, Russia has benefited from a rise in oil prices caused by the growing unrest in the Middle East. Oil exports provide the main source of funding for Russia’s war machine.\u003c/p\u003e\u003cp\u003eThese factors have led Russia to stand on the sidelines while Israel has destroyed Iranian air defenses, \u003ca href=\"https://www.nytimes.com/2025/06/13/world/middleeast/iran-israel-strikes-nuclear-talks.html\" title=\"\"\u003estruck\u003c/a\u003e nuclear facilities and \u003ca href=\"https://www.nytimes.com/2025/06/21/world/middleeast/israel-iran-war-attack-nuclear.html\" title=\"\"\u003ekilled\u003c/a\u003e members of Iran’s military leadership.\u003c/p\u003e\u003cp\u003eThe hands-off approach has contrasted with the military support that Russia received from Iran while it was struggling during the first year of the war in Ukraine. Drones and drone technology provided by Iran helped the Russian military regain its footing after the initial battlefield disasters.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv data-testid=\"live-blog-post\" data-url=\"https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump#gulf-countries-us-attack-iran\" data-source-id=\"100000010243027\" role=\"article\" aria-posinset=\"6\" aria-setsize=\"-1\" aria-live=\"off\" aria-labelledby=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlL2NjMTAyNTM2LWIzZTMtNWY1Mi05YjQwLTM3MDVlMzlmN2M3ZQ==\"\u003e\u003cdiv data-testid=\"live-blog-byline\"\u003e\u003cp\u003e\u003ca href=\"https://www.nytimes.com/by/vivian-nereim\"\u003e\u003cimg alt=\"Vivian Nereim\" src=\"https://static01.nyt.com/images/2023/03/03/reader-center/author-vivian-nereim/author-vivian-nereim-thumbLarge.png?quality=75\u0026amp;auto=webp\" srcset=\"https://static01.nyt.com/images/2023/03/03/reader-center/author-vivian-nereim/author-vivian-nereim-thumbStandard.png?quality=75\u0026amp;auto=webp 75w, https://static01.nyt.com/images/2023/03/03/reader-center/author-vivian-nereim/author-vivian-nereim-thumbLarge.png?quality=75\u0026amp;auto=webp 150w\" sizes=\"40px\" height=\"40\" width=\"40\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2 id=\"post-title-QXJ0aWNsZTpueXQ6Ly9hcnRpY2xlL2NjMTAyNTM2LWIzZTMtNWY1Mi05YjQwLTM3MDVlMzlmN2M3ZQ==\"\u003e\u003ca href=\"#gulf-countries-us-attack-iran\"\u003eGulf countries, fearing retaliation, express concern at U.S. attack.\u003c/a\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"photoviewer-children-figure\"\u003e\u003cp\u003e\u003cspan\u003eImage\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-caption\"\u003e\u003cspan\u003eAmerican bases in fossil-fuel-rich Gulf countries could be prime targets for Iranian retaliation against the United States.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eEric Lee for The New York Times\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eGulf Arab countries that host U.S. military bases issued a series of statements on Sunday expressing dismay over the American attack on Iranian nuclear facilities — while pointedly stopping short of condemning the United States, their main ally.\u003c/p\u003e\u003cp\u003eSaudi Arabia’s Foreign Ministry called for de-escalation and restraint, saying that it was following the situation with “deep concern.”\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eQatar’s Foreign Ministry — in a grammatically acrobatic \u003ca href=\"https://mofa.gov.qa/en/latest-articles/statements/qatar-regrets-the-deterioration-of-the-situation-with-the-strikes-on-iranian-nuclear-facilities\" title=\"\" rel=\"noopener noreferrer\" target=\"_blank\"\u003estatement\u003c/a\u003e that did not name the United States at all — said that it regretted “the deterioration of the situation with the strikes on Iranian nuclear facilities,” expressing hope that all parties would “exercise wisdom” and restraint. That stood in contrast with the directness of Qatar’s statement the day before, in which the country’s prime minister had condemned Israel by name, saying the Israeli attacks against Iran constituted “a flagrant violation of Iran’s sovereignty and security.”\u003c/p\u003e\u003cp\u003eKuwait and the United Arab Emirates also avoided mentioning the United States, while \u003ca href=\"https://www.kuna.net.kw/ArticleDetails.aspx?id=3237388\" title=\"\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eexpressing\u003c/a\u003e “deep concern” at the bombing of Iranian nuclear facilities in Kuwait’s case and “profound concern” in the case of the Emirates.\u003c/p\u003e\u003cp\u003eFossil-fuel-rich Gulf countries host \u003ca href=\"https://www.nytimes.com/2025/06/18/world/middleeast/us-troops-middle-east-iran.html\" title=\"\"\u003etens of thousands of U.S. military personnel\u003c/a\u003e. The American bases on their lands — along with oil and gas-producing infrastructure that is vital to the global economy — could be prime targets for Iranian retaliation against the United States.\u003c/p\u003e\u003cp\u003eIn a statement on Sunday, the Islamic Revolutionary Guards Corps of Iran appeared to threaten the American bases, saying that they were a vulnerability and “not points of strength.”\u003c/p\u003e\u003cp\u003eBahrain, an island nation in the Persian Gulf with a U.S. naval base, asked a majority of its civil servants to work from home and warned residents to use main roads “only when necessary.”\u003c/p\u003e\u003cp\u003eSaudi Arabia and the Emirates have sought to chart \u003ca href=\"https://www.nytimes.com/2023/08/08/world/middleeast/uae-russia-china-us.html\" title=\"\"\u003emore independent foreign-policy\u003c/a\u003e courses — and to \u003ca href=\"https://www.eiu.com/n/saudi-arabia-forges-alternative-defence-partnerships/\" title=\"\" rel=\"noopener noreferrer\" target=\"_blank\"\u003ediversify their sources of weaponry\u003c/a\u003e — over the past few years. But they remain highly dependent on the United States to defend them when their territories come under attack, as they have by Iran-backed militias in the past.\u003c/p\u003e\u003cp\u003eIn an attempt to ward off that danger, both countries have shifted toward a policy of cultivating ties with Iran, seeing diplomacy as a more pragmatic way to contain their neighbor. Those warmer relations mean that Iran may be less likely to target their countries than it was in the past. But fears remain.\u003c/p\u003e\u003cp\u003eBehind the calls for de-escalation are worries of what wider violence could do to the national and regional projects of the Gulf’s authoritarian rulers, who have tried to diversify their economies away from fossil fuels by turning their countries into global hubs for finance, tourism and trade.\u003c/p\u003e\u003cp\u003e“The longer a war takes, the more dangerous it becomes,” Anwar Gargash, diplomatic adviser to the Emirati president, told journalists in a briefing on Friday. “There are many issues in the region. If we choose to tackle everything with a hammer, nothing will be left unbroken.”\u003c/p\u003e\u003cp\u003eThe Foreign Ministry of Oman, which had been serving as a mediator in nuclear negotiations between the United States and Iran before those talks collapsed in the wake of Israel’s surprise attack on Iran on June 13, issued the strongest-worded statement among the Gulf countries. The ministry expressed “deep concern and condemnation regarding the escalation resulting from the direct airstrikes conducted by the United States,” adding that the American attack was a “serious violation of international law.”\u003c/p\u003e\u003cp\u003eBut even Yemen’s Iran-backed Houthi militia — whose slogan includes the phrase “death to America” — stopped short of threatening American bases in the region. Before the U.S. attack, the Houthis had warned that they would break the truce reached in May with the United States and target American ships in the Red Sea if President Trump decided his country should enter the conflict.\u003c/p\u003e\u003cp\u003eAfter the U.S. attack, the Houthis said only that they were “prepared” to target American ships, without elaborating.\u003c/p\u003e\u003cp\u003eMohammed al-Bukhaiti, a Houthi official, said on social media on Sunday that the Houthis would “stand by any Arab or Islamic state that faces Israeli or American aggression,” but then added that they would not be “more kingly than the king” — an Arabic expression akin to “holier than the pope.” He did not respond to a request for comment asking for clarification.\u003c/p\u003e\u003cp\u003eIsmaeel Naar contributed reporting from Dubai, United Arab Emirates, and Shuaib Almosawa contributed reporting from Sana, Yemen.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eA correction was made on\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eJune 22, 2025\u003c/p\u003e\u003cp\u003e: \u003c/p\u003e\u003cp\u003eAn earlier version of this article misstated the day Anwar Gargash, a diplomatic adviser to president of the United Arab Emirates, spoke to journalists. It was on Friday, not Saturday.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "66 min read",
  "publishedTime": "2025-06-22T07:12:41Z",
  "modifiedTime": "2025-06-23T01:18:05.477Z"
}
