{
  "id": "a6a8c7f5-ee83-4569-b3f6-aa3c58cc7dc3",
  "title": "Palestinian-American author supports killing of Israeli diplomats in DC, says she's surprised it didn't happen sooner",
  "link": "https://timesofindia.indiatimes.com/world/us/palestinian-american-author-supports-killing-of-israeli-diplomats-in-dc-says-shes-surprised-it-didnt-happen-sooner/articleshow/121385748.cms",
  "description": "",
  "author": "TOI World Desk",
  "published": "2025-05-25T01:10:26+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 2237,
  "excerpt": "US News: Palestinian author and activist Susan Abulhawa came under fire for supporting the murder of two young Israeli diplomats outside the Capital Jewish Mus.",
  "siteName": "Times of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "Palestinian-American author Susan Abulhawa supported Elias Rodriguez who killed two young Israeli diplomats outside Jewish museum.Palestinian author and activist Susan Abulhawa came under fire for supporting the murder of two young Israeli diplomats outside the Capital Jewish Museum in Washington as she said she was surprised that it didn't happen sooner.Yaron Kischinsky, 30, and Sarah Lynn Milgrim, 26, were shot dead by Chicago's Elias Rodriguez, who said he did it for Palestine.The young couple, soon to be married, were attending a Jewish conference of the American Jewish Committee. They were shot in the back and after being attacked, Milgrim even tried to crawl away from the shooter but Rodriguez ensured that both of them are killed. \"Now we’re supposed to feel bad for two genocide cheerleaders after watching these colonizer baby killers slaughter people by the hundreds every day for two years,\" Susan wrote. \"I’ve seen the inside of too many children’s skulls to give a crap about the human garbage who get off on mass murder. It wouldn’t surprise me if it was a false flag to focus on manufactured antisemitism instead of the actual holocaust being committed by Jewish supremacists,\" she added.Supporting shooter Rodriguez, Susan wrote: \"What Mr. Rodriguez did should come as no surprise. In fact, I’m surprised it has not happened sooner.\"\"Natural logic: when governments fail to hold Israel accountable for an actual holocaust being committed before our very eyes, no genocidal Zionist should be safe anywhere in the world,\" the writer said.Susan's posts were flagged by many who tagged FBI and asked for investigation against the Palestinian author. Abulhawa lives in Pennsylvania with her daughter and serves as executive director of the Palestine Writes Literature Festival. In November 2024, she debated at the Oxford Union, supporting the motion that Israel is an apartheid state responsible for genocide, winning 278 to 59. The Union later censored her speech on YouTube, prompting her criticism of Zionist influence. In April 2025, her scheduled talk at MIT on Palestinian writer Ghassan Kanafani was canceled after objections from other speakers, leading her to criticize them as avoiding political discourse.",
  "image": "https://static.toiimg.com/thumb/msid-121385770,width-1070,height-580,imgsize-28616,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003csection\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-121385770,imgsize-28616,width-400,resizemode-4/121385770.jpg\" alt=\"Palestinian-American author supports killing of Israeli diplomats in DC, says she\u0026#39;s surprised it didn\u0026#39;t happen sooner\" title=\"Palestinian-American author Susan Abulhawa supported Elias Rodriguez who killed two young Israeli diplomats outside Jewish museum.\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan title=\"Palestinian-American author Susan Abulhawa supported Elias Rodriguez who killed two young Israeli diplomats outside Jewish museum.\"\u003ePalestinian-American author Susan Abulhawa supported Elias Rodriguez who killed two young Israeli diplomats outside Jewish museum.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003cp\u003ePalestinian author and activist Susan Abulhawa came under fire for supporting the murder of two young Israeli diplomats outside the Capital Jewish Museum in Washington as she said she was surprised that it didn\u0026#39;t happen sooner.Yaron Kischinsky, 30, and Sarah Lynn Milgrim, 26, were shot dead by Chicago\u0026#39;s Elias Rodriguez, who said he did it for Palestine.\u003cspan data-pos=\"3\"\u003e\u003c/span\u003eThe young couple, soon to be married, were attending a Jewish conference of the American Jewish Committee. They were shot in the back and after being attacked, Milgrim even tried to crawl away from the shooter but Rodriguez ensured that both of them are killed. \u003cspan data-pos=\"5\"\u003e\u003c/span\u003e\u0026#34;Now we’re supposed to feel bad for two genocide cheerleaders after watching these colonizer baby killers slaughter people by the hundreds every day for two years,\u0026#34; Susan wrote. \u003cspan data-pos=\"8\"\u003e\u003c/span\u003e\u0026#34;I’ve seen the inside of too many children’s skulls to give a crap about the human garbage who get off on mass murder. It wouldn’t surprise me if it was a false flag to focus on manufactured antisemitism instead of the actual holocaust being committed by Jewish supremacists,\u0026#34; she added.\u003cspan data-pos=\"10\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"12\"\u003e\u003c/span\u003eSupporting shooter Rodriguez, Susan wrote: \u0026#34;What Mr. Rodriguez did should come as no surprise. In fact, I’m surprised it has not happened sooner.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"15\"\u003e\u003c/span\u003e\u0026#34;Natural logic: when governments fail to hold Israel accountable for an actual holocaust being committed before our very eyes, no genocidal Zionist should be safe anywhere in the world,\u0026#34; the writer said.\u003cspan data-pos=\"17\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"21\"\u003e\u003c/span\u003eSusan\u0026#39;s posts were flagged by many who tagged FBI and asked for investigation against the Palestinian author. \u003cspan data-pos=\"23\"\u003e\u003c/span\u003eAbulhawa lives in Pennsylvania with her daughter and serves as executive director of the Palestine Writes Literature Festival. In November 2024, she debated at the Oxford Union, supporting the motion that Israel is an apartheid state responsible for genocide, winning 278 to 59. The Union later censored her speech on YouTube, prompting her criticism of Zionist influence. In April 2025, her scheduled talk at MIT on Palestinian writer Ghassan Kanafani was canceled after objections from other speakers, leading her to criticize them as avoiding political discourse.\u003cspan data-pos=\"25\"\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-25T01:10:00+05:30",
  "modifiedTime": null
}
