{
  "id": "a9f07c13-14ec-42ee-8c9b-a3ccd3e5eddc",
  "title": "Former China deputy central bank head gets suspended death sentence for taking bribes",
  "link": "https://www.yahoo.com/news/former-china-deputy-central-bank-095333807.html",
  "description": "",
  "author": "",
  "published": "2024-10-10T09:53:33Z",
  "source": "https://www.yahoo.com/news/rss",
  "categories": null,
  "byline": "Reuters",
  "length": 2036,
  "excerpt": "BEIJING (Reuters) -China's former deputy central bank governor, Fan Yifei, has been sentenced to death for taking bribes with a two-year reprieve, state...",
  "siteName": "Yahoo News",
  "favicon": "",
  "text": "BEIJING (Reuters) -China's former deputy central bank governor, Fan Yifei, has been sentenced to death for taking bribes with a two-year reprieve, state media said on Thursday, amid a sweeping anti-graft drive in the financial sector.Fan was found guilty of illegally accepting property worth more than 386 million yuan ($54.55 million), taking advantage of his senior positions at the central bank and other financial institutions, including China Construction Bank, according to the report, citing a Chinese court.Following the two-year reprieve, Fan's death sentence will be commuted to life imprisonment, with no possibility of commutation or parole, state media cited Huanggang Intermediate People's Court in Hubei province as saying.\"Fan Yifei accepted bribes of an extremely large amount, the circumstances of his crimes were extremely serious, the social impact was extremely bad, and the interests of the state and the people suffered extremely heavy losses,\" the court was quoted as saying.Fan, 60, is the highest-ranking official at the People's Bank of China to be arrested under President Xi Jinping's anti-graft drive in the past decade, in a campaign aimed at weeding out corrupt officials in the financial sector.Fan was placed under investigation by Chinese authorities in late 2022, and was expelled from the Communist Party in 2023.Reuters was not able to contact Fan for comment.China's anti-graft watchdog has in recent months launched a sweeping crackdown on the financial sector that has ensnared some of the country’s biggest names, including Liu Liange, former chairman of state-owned Bank of China, and Wang Bin, former head of state-owned China Life Insurance.In April, Liu, who stepped down in March 2023, pled guilty to accepting bribes totaling more than 121 million yuan, according to state media.Tang Shuangning, ex-chairman of China Everbright Group, has also been charged with bribery and corruption.($1 = 7.0761 Chinese yuan renminbi)(Reporting by Beijing newsroom and Kevin YaoEditing by Ros Russell)",
  "image": "https://media.zenfs.com/en/reuters.com/3366376a26552ba2a740f03422c84220",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eBEIJING (Reuters) -China\u0026#39;s former deputy central bank governor, Fan Yifei, has been sentenced to death for taking bribes with a two-year reprieve, state media said on Thursday, amid a sweeping anti-graft drive in the financial sector.\u003c/p\u003e\u003cp\u003eFan was found guilty of illegally accepting property worth more than 386 million yuan ($54.55 million), taking advantage of his senior positions at the central bank and other financial institutions, including China Construction Bank, according to the report, citing a Chinese court.\u003c/p\u003e\u003cp\u003eFollowing the two-year reprieve, Fan\u0026#39;s death sentence will be commuted to life imprisonment, with no possibility of commutation or parole, state media cited Huanggang Intermediate People\u0026#39;s Court in Hubei province as saying.\u003c/p\u003e\u003cp\u003e\u0026#34;Fan Yifei accepted bribes of an extremely large amount, the circumstances of his crimes were extremely serious, the social impact was extremely bad, and the interests of the state and the people suffered extremely heavy losses,\u0026#34; the court was quoted as saying.\u003c/p\u003e\u003cp\u003eFan, 60, is the highest-ranking official at the People\u0026#39;s Bank of China to be arrested under President Xi Jinping\u0026#39;s anti-graft drive in the past decade, in a campaign aimed at weeding out corrupt officials in the financial sector.\u003c/p\u003e\u003cp\u003eFan was placed under investigation by Chinese authorities in late 2022, and was expelled from the Communist Party in 2023.\u003c/p\u003e\u003cp\u003eReuters was not able to contact Fan for comment.\u003c/p\u003e\u003cp\u003eChina\u0026#39;s anti-graft watchdog has in recent months launched a sweeping crackdown on the financial sector that has ensnared some of the country’s biggest names, including Liu Liange, former chairman of state-owned Bank of China, and Wang Bin, former head of state-owned China Life Insurance.\u003c/p\u003e\u003cp\u003eIn April, Liu, who stepped down in March 2023, pled guilty to accepting bribes totaling more than 121 million yuan, according to state media.\u003c/p\u003e\u003cp\u003eTang Shuangning, ex-chairman of China Everbright Group, has also been charged with bribery and corruption.\u003c/p\u003e\u003cp\u003e($1 = 7.0761 Chinese yuan renminbi)\u003c/p\u003e\u003cp\u003e(Reporting by Beijing newsroom and Kevin YaoEditing by Ros Russell)\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-10T09:53:33Z",
  "modifiedTime": null
}
