{
  "id": "afebbc39-4fca-4106-9c77-f8e96ce95924",
  "title": "Honoured to meet Pak army chief Asim Munir, says Trump after their discussion",
  "link": "https://timesofindia.indiatimes.com/world/us/honoured-to-meet-pak-army-chief-asim-munir-says-trump-after-their-discussion/articleshow/121962781.cms",
  "description": "President Trump walked back on his claims of brokering an India-Pakistan ceasefire after meeting with Pakistan's army chief, Field Marshal Asim Munir. Trump lauded the two nations' leaders for averting a potential nuclear conflict. Discussions also involved a potential US-Pakistan trade partnership and the Iran-Israel situation, with Trump seeking Pakistan's insights on Iran.",
  "author": "",
  "published": "2025-06-20T04:57:07+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TNN",
  "length": 3364,
  "excerpt": "US News: President Trump walked back on his claims of brokering an India-Pakistan ceasefire after meeting with Pakistan's army chief, Field Marshal Asim Munir.",
  "siteName": "Times of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "US President Donald TrumpTwo \"very smart\" leaders of India and Pakistan decided to end last month's conflict that could have turned into a nuclear war, US President Donald Trump said after holding a rare luncheon meeting with Pakistan army chief Field Marshal Asim Munir at the White House. \"Those are two nuclear powers, big ones, big, big nuclear powers, and they decided that (to end the conflict),\" Trump said. The comments were seen at variance with his claims over a dozen times in the last few weeks that he brokered the India-Pakistan \"ceasefire deal\".The unusual display of self-restraint by the US President in not squeezing himself in the frame immediately attracted attention in India because it followed PM Modi's Tuesday conversation with Trump, in which Modi had made plain that India would never let anyone meddle in its dealings with Pakistan. tnn \u0026 agencies In the telephonic conversation, Modi had also refuted Donald Trump's public claim that he had brandished the threat of not doing a trade deal to get India agree to suspend the conflict with Pakistan, and asserted that Islamabad sued for peace after severe damage to its nine strategically crucial airbases by the IAF.In his remarks to the media, Trump said he was \"honoured\" to meet Munir and that he discussed with the army chief the situation arising out of Iran-Israel conflict, amid speculation that Washington was looking at using Pakistani military bases in case it decides to launch attacks on Iran. Trump was effusive in lauding Modi, and referred to his telephonic conversation with the PM Tuesday night.In a statement, the Pakistani Army said the US President expressed keen interest in forging a \"mutually beneficial\" trade partnership with Pakistan based on long-term strategic convergence and shared interests. Trump was accompanied at the meeting by secretary of state Marco Rubio and US Special Representative for the Middle East Steve Witkoff. Munir was joined in by Pakistan national security adviser and spy agency ISI chief Lt Gen Asim Malik.Ahead of his meeting with Trump, Munir reportedly pitched for Nobel Peace Prize for the president for \"preventing a nuclear war\" between India and Pakistan. \"The reason I had him here was that I want to thank him for not going into war (with India)... And, I want to thank PM Modi as well,\" Trump said. \"We're working on a trade deal with India. We're working on a trade deal with Pakistan.\" Hours before hosting Munir, Trump claimed credit for ending the conflict but he did not repeat it in his media remarks after the meet. Asked if Iran was discussed in the meeting with Munir, Trump said: \"Well, they know Iran very well, better than most...\" \"It's not that they're bad with Israel. They know them both, actually, but they probably, maybe they know Iran better, but they see what's going on, and he agreed with me,\" he said.The US-Pakistan trade partnership discussions, the Pakistan army said, encompassed avenues for expanding cooperation in domains such as economic development, mines and minerals, AI, energy, cryptocurrency and emerging technologies. It is rare for the US President to host a lunch for a foreign country's army chief. There have been precedents of Pakistan army chiefs, including Ayub Khan, Zia ul-Haq and Pervez Musharraf, receiving such invites. But they were holding the post of president as well.",
  "image": "https://static.toiimg.com/thumb/msid-121963163,width-1070,height-580,imgsize-23438,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003csection\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-121963163,imgsize-23438,width-400,resizemode-4/121963163.jpg\" alt=\"Honoured to meet Pak army chief Asim Munir, says Trump after their discussion\" title=\"US President Donald Trump\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan title=\"US President Donald Trump\"\u003eUS President Donald Trump\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003cp\u003eTwo \u0026#34;very smart\u0026#34; leaders of India and Pakistan decided to end last month\u0026#39;s conflict that could have turned into a nuclear war, US President Donald Trump said after holding a rare luncheon meeting with Pakistan army chief Field Marshal Asim Munir at the White House. \u0026#34;Those are two nuclear powers, big ones, big, big nuclear powers, and they decided that (to end the conflict),\u0026#34; Trump said. The comments were seen at variance with his claims over a dozen times in the last few weeks that he brokered the India-Pakistan \u0026#34;ceasefire deal\u0026#34;.\u003cspan data-pos=\"3\"\u003e\u003c/span\u003eThe unusual display of self-restraint by the US President in not squeezing himself in the frame immediately attracted attention in India because it followed PM Modi\u0026#39;s Tuesday conversation with Trump, in which Modi had made plain that India would never let anyone meddle in its dealings with Pakistan. tnn \u0026amp; agencies\u003cspan data-pos=\"5\"\u003e\u003c/span\u003e In the telephonic conversation, Modi had also refuted Donald Trump\u0026#39;s public claim that he had brandished the threat of not doing a trade deal to get India agree to suspend the conflict with Pakistan, and asserted that Islamabad sued for peace after severe damage to its nine strategically crucial airbases by the IAF.\u003cspan data-pos=\"8\"\u003e\u003c/span\u003eIn his remarks to the media, Trump said he was \u0026#34;honoured\u0026#34; to meet Munir and that he discussed with the army chief the situation arising out of Iran-Israel conflict, amid speculation that Washington was looking at using Pakistani military bases in case it decides to launch attacks on Iran. Trump was effusive in lauding Modi, and referred to his telephonic conversation with the PM Tuesday night.\u003cspan data-pos=\"10\"\u003e\u003c/span\u003eIn a statement, the Pakistani Army said the US President expressed keen interest in forging a \u0026#34;mutually beneficial\u0026#34; trade partnership with Pakistan based on long-term strategic convergence and shared interests. \u003c/p\u003e\u003cp\u003eTrump was accompanied at the meeting by secretary of state Marco Rubio and US Special Representative for the Middle East Steve Witkoff. Munir was joined in by Pakistan national security adviser and spy agency ISI chief Lt Gen Asim Malik.\u003cspan data-pos=\"14\"\u003e\u003c/span\u003eAhead of his meeting with Trump, Munir reportedly pitched for Nobel Peace Prize for the president for \u0026#34;preventing a nuclear war\u0026#34; between India and Pakistan. \u003cspan data-pos=\"16\"\u003e\u003c/span\u003e\u0026#34;The reason I had him here was that I want to thank him for not going into war (with India)... And, I want to thank PM Modi as well,\u0026#34; Trump said. \u0026#34;We\u0026#39;re working on a trade deal with India. We\u0026#39;re working on a trade deal with Pakistan.\u0026#34; \u003cspan data-pos=\"20\"\u003e\u003c/span\u003eHours before hosting Munir, Trump claimed credit for ending the conflict but he did not repeat it in his media remarks after the meet. Asked if Iran was discussed in the meeting with Munir, Trump said: \u0026#34;Well, they know Iran very well, better than most...\u0026#34; \u0026#34;It\u0026#39;s not that they\u0026#39;re bad with Israel. They know them both, actually, but they probably, maybe they know Iran better, but they see what\u0026#39;s going on, and he agreed with me,\u0026#34; he said.\u003cspan data-pos=\"24\"\u003e\u003c/span\u003eThe US-Pakistan trade partnership discussions, the Pakistan army said, encompassed avenues for expanding cooperation in domains such as economic development, mines and minerals, AI, energy, cryptocurrency and emerging technologies. \u003cspan data-pos=\"26\"\u003e\u003c/span\u003eIt is rare for the US President to host a lunch for a foreign country\u0026#39;s army chief. There have been precedents of Pakistan army chiefs, including Ayub Khan, Zia ul-Haq and Pervez Musharraf, receiving such invites. But they were holding the post of president as well.\u003cspan data-pos=\"28\"\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-20T04:57:00+05:30",
  "modifiedTime": null
}
