{
  "id": "b1f6e5a8-1036-4258-acf8-b25f43152dc4",
  "title": "Super Micro delays filing September-quarter report as delisting looms",
  "link": "https://finance.yahoo.com/news/super-micro-delays-filing-september-112648377.html",
  "description": "",
  "author": "",
  "published": "2024-11-13T11:26:48Z",
  "source": "https://www.yahoo.com/news/rss",
  "categories": null,
  "byline": "Reuters",
  "length": 1484,
  "excerpt": "The company's shares fell about 4% in premarket trading. The stock is down 55% since Ernst \u0026 Young resigned as auditor in October after earlier flagging...",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "(Reuters) -Super Micro Computer said on Wednesday it would delay the filing of its financial report for the September quarter, as the AI server-maker seeks a new auditor amid a delisting threat following its failure to submit its annual report. The company's shares fell about 4% in premarket trading. The stock is down 55% since Ernst \u0026 Young resigned as auditor in October after earlier flagging concerns about the company's governance, transparency and internal control over financial reporting. Earlier this month, the company said a special committee set up to probe the issues raised by EY in late July had not found evidence of fraud. Super Micro said on Wednesday it needs additional time to select and engage a new auditor and for management to complete its assessment of internal controls over financial reporting as of June 30, 2024. The Nasdaq on Sept. 17 notified the company of non-compliance with listing rules and it had 60 days to file its annual report or submit a plan to regain compliance. A partner for leading chipmakers such as Nvidia and AMD, Super Micro's shares jumped more than three-fold in 2023, making it one of the biggest beneficiaries of a rally in AI-linked stocks. However, the shares have come under pressure this year on concerns over its accounting practices, while Hindenburg Research disclosed a short position in August, alleging \"accounting manipulation.\" (Reporting by Arsheeya Bajwa in Bengaluru; Editing by Varun H K and Sriraj Kalluvila)",
  "image": "https://media.zenfs.com/en/reuters-finance.com/830dedfecdeeb3432ed204dd963b37b1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e    \u003cp\u003e(Reuters) -Super Micro Computer said on Wednesday it would delay the filing of its financial report for the September quarter, as the AI server-maker seeks a new auditor amid a delisting threat following its failure to submit its annual report.\u003c/p\u003e \u003cp\u003eThe company\u0026#39;s shares fell about 4% in premarket trading. The stock is down 55% since Ernst \u0026amp; Young resigned as auditor in October after earlier flagging concerns about the company\u0026#39;s governance, transparency and internal control over financial reporting.\u003c/p\u003e  \u003cp\u003eEarlier this month, the company said a special committee set up to probe the issues raised by EY in late July had not found evidence of fraud.\u003c/p\u003e \u003cp\u003eSuper Micro said on Wednesday it needs additional time to select and engage a new auditor and for management to complete its assessment of internal controls over financial reporting as of June 30, 2024.\u003c/p\u003e \u003cp\u003eThe Nasdaq on Sept. 17 notified the company of non-compliance with listing rules and it had 60 days to file its annual report or submit a plan to regain compliance.\u003c/p\u003e \u003cp\u003eA partner for leading chipmakers such as Nvidia and AMD, Super Micro\u0026#39;s shares jumped more than three-fold in 2023, making it one of the biggest beneficiaries of a rally in AI-linked stocks.\u003c/p\u003e \u003cp\u003eHowever, the shares have come under pressure this year on concerns over its accounting practices, while Hindenburg Research disclosed a short position in August, alleging \u0026#34;accounting manipulation.\u0026#34;\u003c/p\u003e \u003cp\u003e(Reporting by Arsheeya Bajwa in Bengaluru; Editing by Varun H K and Sriraj Kalluvila)\u003c/p\u003e      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-11-13T11:26:48Z",
  "modifiedTime": null
}
