{
  "id": "b432da3e-cba6-4324-8264-c1f1cd95442c",
  "title": "No-one gets France's difficulty more than me, says Macron's new PM Bayrou",
  "link": "https://www.bbc.com/news/articles/cwyx04pmnrgo",
  "description": "France's fourth prime minister this year says he fully understands the \"Himalayan\" task ahead.",
  "author": "",
  "published": "Fri, 13 Dec 2024 17:25:22 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Paul Kirby",
  "length": 6362,
  "excerpt": "France's fourth prime minister this year says he fully understands the \"Himalayan\" task ahead.",
  "siteName": "BBC News",
  "favicon": "https://www.bbc.com/bbcx/apple-touch-icon.png",
  "text": "ReutersIn his first words François Bayrou singled out reducing France's deficit and debt as a moral priorityCentrist leader François Bayrou has become France's latest prime minister, chosen by President Emmanuel Macron in a bid to end months of political turmoil.Bayrou, a 73-year-old mayor from the south-west who leads the MoDem party, said he was fully aware of the \"Himalayan\" task facing France, and he vowed to \"hide nothing, neglect nothing and leave nothing aside\".He is seen by Macron's entourage as a potential consensus candidate and his task will be to avoid the fate of his predecessor. Ex-Brexit negotiator Michel Barnier was ousted by MPs nine days ago and welcomed Bayrou to the prime minister's residence on Friday.Barnier was voted out over a budget aimed at cutting France's budget deficit, which is set to hit 6.1% of economic output (GDP) this year. Bayrou said the deficit and public debt were a moral as well as a financial problem - because \"passing it on to one's children is a terrible thing to do\".Macron is half-way through his second term as president and Bayrou will be his fourth prime minister this year. French politics has been deadlocked ever since Macron called snap parliamentary elections during the summer and an opinion poll for BFMTV on Thursday suggested 61% of French voters were worried by the political situation. Although a succession of allies lined up to praise Bayrou's appointment, Socialist regional leader Carole Delga said the whole process had become a \"bad movie\". Far-left France Unbowed (LFI) leader Manuel Bompard complained of a \"pathetic spectacle\".The centre-left Socialists said they were ready to talk to Bayrou but would not take part in his government. Leader Olivier Faure said because Macron had chosen someone \"from his own camp\", the Socialists would remain in opposition.BERTRAND GUAY/POOL/AFPFriday's handover took place at the prime minister's residence at the Hôtel MatignonPresident Macron has vowed to remain in office until his second term ends in 2027, despite Barnier's downfall last week. He cut short a trip to Poland on Thursday and had been expected to name his new prime minister on Thursday night, but postponed his announcement until Friday.He then met Bayrou at the Elysée Palace and a final decision was made hours later. But in an indication of the fraught nature of the talks, Le Monde newspaper suggested that Macron had preferred another ally, Roland Lescure, but changed his mind when Bayrou threatened to withdraw his party's support.Bayrou arrived at the prime minister's residence at Hôtel Matignon late on Friday afternoon. A red carpet had been rolled out for the transfer of power even before his name was confirmed.His challenge will be in forming a government that will not be brought down the way his predecessor's was in the National Assembly. The far left France Unbowed (LFI) have already threatened to demand a vote of no confidence as soon as they can.Ahead of his appointment, Macron held round-table talks with leaders from all the main political parties, bar the far left of Jean-Luc Mélenchon and far-right National Rally of Marine Le Pen.The question is who can be persuaded to join Bayrou's government, or at least agree a pact so they do not oust him. Anne RENAUT/AFPThe red carpet was laid out at the prime minister's residence even before Bayrou was namedWhen the only possible means of survival for a minority government is to build bridges on left and right, Bayrou has the advantage of having passable relations with both sides, reports BBC Paris correspondent Hugh Schofield.Michel Barnier was appointed only in September and said on Friday he knew from the outset that his government's days were numbered.He was voted out when Le Pen's National Rally joined left-wing MPs in rejecting his plans for €60bn (£50bn) in tax rises and spending cuts. His outgoing government has put forward a bill to enable the provisions of the 2024 budget to continue into next year. But a replacement budget for 2025 will have to be approved once the next government takes office.Bayrou said that reducing France's deficit and debt was a \"moral obligation\".Barnier wished his successor his best wishes, adding that \"our country is in an unprecedented and serious situation\".Under the political system of France's Fifth Republic, the president is elected for five years and names a prime minister whose choice of cabinet is then appointed by the president.Unusually, President Macron called snap elections for parliament over the summer after poor results in the EU elections in June. The outcome left France in political stalemate, with three large political blocs made up of the left, centre and far right.Eventually he chose Barnier to form a minority government reliant on Marine Le Pen's National Rally for its survival. Macron is now hoping to restore stability without depending on her party.Getty ImagesMarine Le Pen withdrew her support for the previous government, backing a left-sponsored vote of no confidenceThree centre-left parties - the Socialists, Greens and Communists - broke ranks with the more radical left LFI by taking part in talks with Macron.However, they made clear they wanted a prime minister from the left, rather than a centrist.\"I told you I wanted someone from the left and the Greens and I think Mr Bayrou isn't one or the other,\" Greens leader Marine Tondelier told French TV on Thursday.Patrick Kanner of the Socialists said that just because his party was not joining Bayrou's government, \"that doesn't mean we're going to bash it\".Sébastien Chenu, a National Rally MP, said for his party it was less about who Macron picked than the \"political line\" he chose. If Bayrou wanted to tackle immigration and the cost of living crisis then he would \"find an ally in us\".Relations between the centre left and the radical LFI of Jean-Luc Mélenchon appear to have broken down over the three parties' decision to pursue talks with President Macron.After the LFI leader called on his former allies to steer clear of a coalition deal, Olivier Faure of the Socialists told French TV that \"the more Mélenchon shouts the less he's heard\".Meanwhile, Marine Le Pen has called for her party's policies on the cost of living to be taken into account by the incoming government, by building a budget that \"doesn't cross each party's red lines\".",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cdda/live/c04173e0-b972-11ef-a0f2-fd81ae5962f4.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/cdda/live/c04173e0-b972-11ef-a0f2-fd81ae5962f4.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/cdda/live/c04173e0-b972-11ef-a0f2-fd81ae5962f4.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/cdda/live/c04173e0-b972-11ef-a0f2-fd81ae5962f4.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/cdda/live/c04173e0-b972-11ef-a0f2-fd81ae5962f4.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/cdda/live/c04173e0-b972-11ef-a0f2-fd81ae5962f4.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/cdda/live/c04173e0-b972-11ef-a0f2-fd81ae5962f4.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/cdda/live/c04173e0-b972-11ef-a0f2-fd81ae5962f4.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/cdda/live/c04173e0-b972-11ef-a0f2-fd81ae5962f4.jpg.webp\" alt=\"Reuters France\u0026#39;s new prime minister François Bayrou (on the left) arrives at the prime minister\u0026#39;s residence in Paris where he is greeted by the man who was ousted from the job last week\"/\u003e\u003cspan\u003eReuters\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eIn his first words François Bayrou singled out reducing France\u0026#39;s deficit and debt as a moral priority\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eCentrist leader François Bayrou has become France\u0026#39;s latest prime minister, chosen by President Emmanuel Macron in a bid to end months of political turmoil.\u003c/p\u003e\u003cp\u003eBayrou, a 73-year-old mayor from the south-west who leads the MoDem party, said he was fully aware of the \u0026#34;Himalayan\u0026#34; task facing France, and he vowed to \u0026#34;hide nothing, neglect nothing and leave nothing aside\u0026#34;.\u003c/p\u003e\u003cp\u003eHe is seen by Macron\u0026#39;s entourage as a potential consensus candidate and his task will be to avoid the fate of his predecessor. \u003c/p\u003e\u003cp\u003eEx-Brexit negotiator Michel Barnier was ousted by MPs nine days ago and welcomed Bayrou to the prime minister\u0026#39;s residence on Friday.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eBarnier was voted out over a budget aimed at cutting France\u0026#39;s budget deficit, which is set to hit 6.1% of economic output (GDP) this year. Bayrou said the deficit and public debt were a moral as well as a financial problem - because \u0026#34;passing it on to one\u0026#39;s children is a terrible thing to do\u0026#34;.\u003c/p\u003e\u003cp\u003eMacron is half-way through his second term as president and Bayrou will be his fourth prime minister this year. \u003c/p\u003e\u003cp\u003eFrench politics has been deadlocked ever since Macron called snap parliamentary elections during the summer and an opinion poll for BFMTV on Thursday suggested 61% of French voters were worried by the political situation. \u003c/p\u003e\u003cp\u003eAlthough a succession of allies lined up to praise Bayrou\u0026#39;s appointment, Socialist regional leader Carole Delga said the whole process had become a \u0026#34;bad movie\u0026#34;. Far-left France Unbowed (LFI) leader Manuel Bompard complained of a \u0026#34;pathetic spectacle\u0026#34;.\u003c/p\u003e\u003cp\u003eThe centre-left Socialists said they were ready to talk to Bayrou but would not take part in his government. Leader Olivier Faure said because Macron had chosen someone \u0026#34;from his own camp\u0026#34;, the Socialists would remain in opposition.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/6b24/live/a6b37400-b977-11ef-b092-b1cccc33a085.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/6b24/live/a6b37400-b977-11ef-b092-b1cccc33a085.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/6b24/live/a6b37400-b977-11ef-b092-b1cccc33a085.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/6b24/live/a6b37400-b977-11ef-b092-b1cccc33a085.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/6b24/live/a6b37400-b977-11ef-b092-b1cccc33a085.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/6b24/live/a6b37400-b977-11ef-b092-b1cccc33a085.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/6b24/live/a6b37400-b977-11ef-b092-b1cccc33a085.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/6b24/live/a6b37400-b977-11ef-b092-b1cccc33a085.jpg.webp\" alt=\"BERTRAND GUAY/POOL/AFP An audience outside the French prime minister\u0026#39;s residence welcomes the new prime minister and says goodbye to his predecessor\"/\u003e\u003cspan\u003eBERTRAND GUAY/POOL/AFP\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eFriday\u0026#39;s handover took place at the prime minister\u0026#39;s residence at the Hôtel Matignon\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003ePresident Macron has vowed to remain in office until his second term ends in 2027, despite Barnier\u0026#39;s downfall last week. \u003c/p\u003e\u003cp\u003eHe cut short a trip to Poland on Thursday and had been expected to name his new prime minister on Thursday night, but postponed his announcement until Friday.\u003c/p\u003e\u003cp\u003eHe then met Bayrou at the Elysée Palace and a final decision was made hours later. But in an indication of the fraught nature of the talks, \u003ci id=\"le-monde\"\u003eLe Monde\u003c/i\u003e newspaper suggested that Macron had preferred another ally, Roland Lescure, but changed his mind when Bayrou threatened to withdraw his party\u0026#39;s support.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eBayrou arrived at the prime minister\u0026#39;s residence at Hôtel Matignon late on Friday afternoon. A red carpet had been rolled out for the transfer of power even before his name was confirmed.\u003c/p\u003e\u003cp\u003eHis challenge will be in forming a government that will not be brought down the way his predecessor\u0026#39;s was in the National Assembly. The far left France Unbowed (LFI) have already threatened to demand a vote of no confidence as soon as they can.\u003c/p\u003e\u003cp\u003eAhead of his appointment, Macron held round-table talks with leaders from all the main political parties, bar the far left of Jean-Luc Mélenchon and far-right National Rally of Marine Le Pen.\u003c/p\u003e\u003cp\u003eThe question is who can be persuaded to join Bayrou\u0026#39;s government, or at least agree a pact so they do not oust him. \u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/a656/live/7ce55020-b950-11ef-84bf-dbb52689c9f2.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/a656/live/7ce55020-b950-11ef-84bf-dbb52689c9f2.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/a656/live/7ce55020-b950-11ef-84bf-dbb52689c9f2.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/a656/live/7ce55020-b950-11ef-84bf-dbb52689c9f2.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/a656/live/7ce55020-b950-11ef-84bf-dbb52689c9f2.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/a656/live/7ce55020-b950-11ef-84bf-dbb52689c9f2.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/a656/live/7ce55020-b950-11ef-84bf-dbb52689c9f2.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/a656/live/7ce55020-b950-11ef-84bf-dbb52689c9f2.jpg.webp\" alt=\"Anne RENAUT/AFP A red carpet appears outside the prime minister\u0026#39;s residence at Hotel Matignon in the centre of Paris.\"/\u003e\u003cspan\u003eAnne RENAUT/AFP\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eThe red carpet was laid out at the prime minister\u0026#39;s residence even before Bayrou was named\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eWhen the only possible means of survival for a minority government is to build bridges on left and right, \u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/articles/cy9qv79n40zo\"\u003eBayrou has the advantage of having passable relations with both sides, reports BBC Paris correspondent Hugh Schofield.\u003c/a\u003e\u003c/p\u003e\u003cp\u003eMichel Barnier was appointed only in September and said on Friday he knew from the outset that his government\u0026#39;s days were numbered.\u003c/p\u003e\u003cp\u003eHe was voted out when Le Pen\u0026#39;s National Rally joined left-wing MPs in rejecting his plans for €60bn (£50bn) in tax rises and spending cuts. \u003c/p\u003e\u003cp\u003eHis outgoing government has put forward a bill to enable the provisions of the 2024 budget to continue into next year. But a replacement budget for 2025 will have to be approved once the next government takes office.\u003c/p\u003e\u003cp\u003eBayrou said that reducing France\u0026#39;s deficit and debt was a \u0026#34;moral obligation\u0026#34;.\u003c/p\u003e\u003cp\u003eBarnier wished his successor his best wishes, adding that \u0026#34;our country is in an unprecedented and serious situation\u0026#34;.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eUnder the political system of France\u0026#39;s Fifth Republic, the president is elected for five years and names a prime minister whose choice of cabinet is then appointed by the president.\u003c/p\u003e\u003cp\u003eUnusually, President Macron called snap elections for parliament over the summer after poor results in the EU elections in June. The outcome left France in political stalemate, with three large political blocs made up of the left, centre and far right.\u003c/p\u003e\u003cp\u003eEventually he chose Barnier to form a minority government reliant on Marine Le Pen\u0026#39;s National Rally for its survival. Macron is now hoping to restore stability without depending on her party.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/4d04/live/14781000-b936-11ef-aff0-072ce821b6ab.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/4d04/live/14781000-b936-11ef-aff0-072ce821b6ab.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/4d04/live/14781000-b936-11ef-aff0-072ce821b6ab.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/4d04/live/14781000-b936-11ef-aff0-072ce821b6ab.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/4d04/live/14781000-b936-11ef-aff0-072ce821b6ab.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/4d04/live/14781000-b936-11ef-aff0-072ce821b6ab.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/4d04/live/14781000-b936-11ef-aff0-072ce821b6ab.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/4d04/live/14781000-b936-11ef-aff0-072ce821b6ab.jpg.webp\" alt=\"Getty Images Marine Le Pen, France\u0026#39;s far-right National Rally leader, addresses the National Assembly wearing a dark-coloured jacket and holding her hands together\"/\u003e\u003cspan\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eMarine Le Pen withdrew her support for the previous government, backing a left-sponsored vote of no confidence\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThree centre-left parties - the Socialists, Greens and Communists - broke ranks with the more radical left LFI by taking part in talks with Macron.\u003c/p\u003e\u003cp\u003eHowever, they made clear they wanted a prime minister from the left, rather than a centrist.\u003c/p\u003e\u003cp\u003e\u0026#34;I told you I wanted someone from the left and the Greens and I think Mr Bayrou isn\u0026#39;t one or the other,\u0026#34; Greens leader Marine Tondelier told French TV on Thursday.\u003c/p\u003e\u003cp\u003ePatrick Kanner of the Socialists said that just because his party was not joining Bayrou\u0026#39;s government, \u0026#34;that doesn\u0026#39;t mean we\u0026#39;re going to bash it\u0026#34;.\u003c/p\u003e\u003cp\u003eSébastien Chenu, a National Rally MP, said for his party it was less about who Macron picked than the \u0026#34;political line\u0026#34; he chose. If Bayrou wanted to tackle immigration and the cost of living crisis then he would \u0026#34;find an ally in us\u0026#34;.\u003c/p\u003e\u003cp\u003eRelations between the centre left and the radical LFI of Jean-Luc Mélenchon appear to have broken down over the three parties\u0026#39; decision to pursue talks with President Macron.\u003c/p\u003e\u003cp\u003eAfter the LFI leader called on his former allies to steer clear of a coalition deal, Olivier Faure of the Socialists told French TV that \u0026#34;the more Mélenchon shouts the less he\u0026#39;s heard\u0026#34;.\u003c/p\u003e\u003cp\u003eMeanwhile, Marine Le Pen has called for her party\u0026#39;s policies on the cost of living to be taken into account by the incoming government, by building a budget that \u0026#34;doesn\u0026#39;t cross each party\u0026#39;s red lines\u0026#34;.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-12-13T11:44:08.54Z",
  "modifiedTime": null
}
