{
  "id": "b9b4cb9a-1a00-49f7-8a59-eb26df48f21c",
  "title": "Trump ends all U.S. trade talks with Canada over digital services tax",
  "link": "https://www.cnbc.com/2025/06/27/trump-canada-trade-talks-tariffs.html",
  "description": "Trump's announcement on Truth Social accused Canada of \"copying the European Union\" with the \"egregious\" tax.",
  "author": "",
  "published": "Fri, 27 Jun 2025 21:18:33 GMT",
  "source": "https://www.cnbc.com/id/100727362/device/rss/rss.html",
  "categories": null,
  "byline": "Kevin Breuninger",
  "length": 3006,
  "excerpt": "Trump's announcement on Truth Social accused Canada of \"copying the European Union\" with the \"egregious\" tax.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "President Donald Trump on Friday said the United States is immediately \"terminating ALL discussions on Trade with Canada\" in response to Ottawa's decision to impose a digital services tax on American tech firms.Trump's surprise announcement on Truth Social accused Canada of \"copying the European Union\" with the \"egregious\" tax.\"We will let Canada know the Tariff that they will be paying to do business with the United States of America within the next seven day period,\" Trump added.Read Trump's full post:\"We have just been informed that Canada, a very difficult Country to TRADE with, including the fact that they have charged our Farmers as much as 400% Tariffs, for years, on Dairy Products, has just announced that they are putting a Digital Services Tax on our American Technology Companies, which is a direct and blatant attack on our Country. They are obviously copying the European Union, which has done the same thing, and is currently under discussion with us, also. Based on this egregious Tax, we are hereby terminating ALL discussions on Trade with Canada, effective immediately. We will let Canada know the Tariff that they will be paying to do business with the United States of America within the next seven day period. Thank you for your attention to this matter!\"\"We have such power over Canada,\" Trump said in the Oval Office later Friday. \"They were foolish\" to go forward with the new tax, Trump said. He said the U.S. would \"stop all negotiations with Canada right now until they straighten out their act.\"The office of Canadian Prime Minister Mark Carney did not immediately respond to CNBC's request for comment.The president's angry declaration suddenly imperils America's trade relationship with a close ally that has long been one of its top two global trading partners.U.S. goods trade with Canada totaled roughly $762 billion last year, according to the office of the U.S. trade representative.Following Trump's announcement, the S\u0026P 500 and the Nasdaq Composite both turned negative, retreating from the record highs they had reached earlier in the day.The first payments from Canada's digital services tax, which was enacted last year and applies retroactively to 2022, are set to be collected Monday. The tax would hit both domestic and foreign tech companies, including U.S. giants such as Amazon, Google and Meta.Canadian officials said this month that they would not pause the digital services tax, despite ferocious opposition from the United States.\"Obviously, we think it's patently unfair to do it retroactively,\" Treasury Secretary Scott Bessent said later Friday on CNBC's \"Closing Bell: Overtime.\" Bessent said the Trump administration was hoping that Carney's government would \"put a brake on\" the tax \"as a sign of goodwill.\"He now expects that Trump trade representative Jamieson Greer will start an unfair trade practice investigation under Section 301 of the Trade Act of 1974 \"to determine the amount of harm\" that the new Canadian taxes pose to the U.S.",
  "image": "https://image.cnbcfm.com/api/v1/image/108159899-17500890652025-06-16t154900z_1315000810_rc2p3fa40dq4_rtrmadp_0_g7-summit.jpeg?v=1750089093\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108165395\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000380761\" aria-labelledby=\"Placeholder-ArticleBody-Video-108165395\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108165396-17510551761751055173-40460741437-1080pnbcnews.jpg?v=1751055175\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"Treasury Sec. Bessent: 301 investigation would be targeted across tariffs on Canadian products\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003ePresident \u003ca href=\"https://www.cnbc.com/donald-trump/\"\u003eDonald Trump\u003c/a\u003e on Friday said the United States is immediately \u0026#34;terminating ALL discussions on Trade with \u003ca href=\"https://www.cnbc.com/2025/04/18/canadian-small-businesses-trump-tariffs.html\"\u003eCanada\u003c/a\u003e\u0026#34; in response to Ottawa\u0026#39;s decision to impose a \u003ca href=\"https://www.cnbc.com/video/2025/05/30/deepwaters-gene-munster-talks-germany-weighing-a-10-percent-digital-services-tax.html\"\u003edigital services tax\u003c/a\u003e on American tech firms.\u003c/p\u003e\u003cp\u003eTrump\u0026#39;s surprise announcement on \u003ca href=\"https://truthsocial.com/@realDonaldTrump/114756567645919781\" target=\"_blank\"\u003eTruth Social\u003c/a\u003e accused Canada of \u0026#34;copying the European Union\u0026#34; with the \u0026#34;egregious\u0026#34; tax.\u003c/p\u003e\u003cp\u003e\u0026#34;We will let Canada know the Tariff that they will be paying to do business with the United States of America within the next seven day period,\u0026#34; Trump added.\u003c/p\u003e\u003cp\u003eRead Trump\u0026#39;s full post:\u003c/p\u003e\u003cp\u003e\u0026#34;We have just been informed that Canada, a very difficult Country to TRADE with, including the fact that they have charged our Farmers as much as 400% Tariffs, for years, on Dairy Products, has just announced that they are putting a Digital Services Tax on our American Technology Companies, which is a direct and blatant attack on our Country. They are obviously copying the European Union, which has done the same thing, and is currently under discussion with us, also. Based on this egregious Tax, we are hereby terminating ALL discussions on Trade with Canada, effective immediately. We will let Canada know the Tariff that they will be paying to do business with the United States of America within the next seven day period. Thank you for your attention to this matter!\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;We have such power over Canada,\u0026#34; Trump said in the Oval Office later Friday. \u003c/p\u003e\u003cp\u003e\u0026#34;They were foolish\u0026#34; to go forward with the new tax, Trump said. \u003c/p\u003e\u003cp\u003eHe said the U.S. would \u0026#34;stop all negotiations with Canada right now until they straighten out their act.\u0026#34;\u003c/p\u003e\u003cp\u003eThe office of Canadian Prime Minister Mark Carney did not immediately respond to CNBC\u0026#39;s request for comment.\u003c/p\u003e\u003cp\u003eThe president\u0026#39;s angry declaration suddenly imperils America\u0026#39;s trade relationship with a close ally that has long been one of its top two global trading partners.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108165301\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000380737\" aria-labelledby=\"Placeholder-ArticleBody-Video-108165301\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108165302-17510469321751046930-40459213840-1080pnbcnews.jpg?v=1751046931\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"Trump says U.S. is immediately terminating trade talks with Canada, citing digital service tax\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eU.S. goods trade with Canada totaled roughly $762 billion last year, according to the office of the \u003ca href=\"https://ustr.gov/countries-regions/americas/canada\" target=\"_blank\"\u003eU.S. trade representative\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eFollowing Trump\u0026#39;s announcement, the \u003ca href=\"https://www.cnbc.com/quotes/.SPX/\"\u003eS\u0026amp;P 500\u003c/a\u003e and the \u003ca href=\"https://www.cnbc.com/quotes/.IXIC/\"\u003eNasdaq Composite\u003c/a\u003e both turned negative, retreating from the \u003ca href=\"https://www.cnbc.com/2025/06/26/stock-market-today-live-updates.html\"\u003erecord highs\u003c/a\u003e they had reached earlier in the day.\u003c/p\u003e\u003cp\u003eThe first payments from Canada\u0026#39;s digital services tax, which was enacted last year and applies retroactively to 2022, are set to be collected Monday. The tax would hit both domestic and foreign tech companies, including U.S. giants such as \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-9\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/AMZN/\"\u003eAmazon\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e, \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-10\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/GOOGL/\"\u003eGoogle\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e and\u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-11\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/META/\"\u003e Meta\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e.\u003c/p\u003e\u003cp\u003eCanadian officials said this month that they \u003ca href=\"https://www.cbc.ca/news/politics/canada-digital-services-tax-1.7565966\" target=\"_blank\"\u003ewould not pause the digital services tax\u003c/a\u003e, despite ferocious opposition from the United States.\u003c/p\u003e\u003cp\u003e\u0026#34;Obviously, we think it\u0026#39;s patently unfair to do it retroactively,\u0026#34; Treasury Secretary Scott Bessent said later Friday on CNBC\u0026#39;s \u0026#34;\u003ca href=\"https://www.cnbc.com/closing-bell-overtime/\"\u003eClosing Bell: Overtime\u003c/a\u003e.\u0026#34; \u003c/p\u003e\u003cp\u003eBessent said the Trump administration was hoping that Carney\u0026#39;s government would \u0026#34;put a brake on\u0026#34; the tax \u0026#34;as a sign of goodwill.\u0026#34;\u003c/p\u003e\u003cp\u003eHe now expects that Trump trade representative Jamieson Greer will start an unfair trade practice investigation under Section 301 of the Trade Act of 1974 \u0026#34;to determine the amount of harm\u0026#34; that the new Canadian taxes pose to the U.S.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-27T17:51:54Z",
  "modifiedTime": "2025-06-27T21:18:33Z"
}
