{
  "id": "bb8a20b6-59ba-471c-bb70-b78cb235b9d9",
  "title": "White House looks for new fed chair as Powell nears end amid Trump pressures",
  "link": "https://timesofindia.indiatimes.com/world/us/white-house-looks-for-new-fed-chair-as-powell-nears-end-amid-trump-pressures/articleshow/120294065.cms",
  "description": "The White House is set to begin interviewing candidates for the next Federal Reserve Chair this autumn, as Jerome Powell's term concludes in May 2026. Treasury Secretary Scott Bessent confirmed the timeline amidst President Trump's repeated calls for interest rate cuts. While Bessent affirmed the Fed's independence and dismissed immediate concerns, he suggested a review of its regulatory role.",
  "author": "TOI World Desk",
  "published": "2025-04-15T06:07:56+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 1699,
  "excerpt": "US News: The White House is set to begin interviewing candidates for the next Federal Reserve Chair this autumn, as Jerome Powell's term concludes in May 2026.",
  "siteName": "Times Of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "US Federal Reserve Chair Jerome Powell (AP photo) The White House is preparing to begin interviews for a new Federal Reserve Chair this autumn, as Jerome Powell, a Biden appointee's term ends in May 2026. Treasury secretary Scott Bessent confirmed to Bloomberg the timeline during a visit to Argentina, saying it gives the Trump administration a six-month window to plan ahead. The decision comes amid growing political pressure on the Federal Reserve. President Donald Trump has repeatedly urged the Fed to cut interest rates. On 4 April, he posted on Truth Social: “Cut interest rates, Jeroma, and stop playing politics” Despite the criticism, Bessent said there were no plans to remove Powell before his term ends. He also said the Fed’s independence is not under threat. However, Bessent did call for more conversation about the Fed’s regulatory role. “The Fed is one of three bank regulators—the other two being the Comptroller of the Currency and the FDIC,” he said. “It’s possible to separate monetary policy from regulatory policy.”Bessent on Trade Talks, Powell Future, Argentina, Dollar He also noted there was no sign of panic during his recent visit to the Fed. “It seems like business as usual,” he added.Powell had warned that Trump's new tariffs could lead to slower growth and higher inflation. Speaking in Virginia last week, he said the economy faces “elevated risks” of both rising joblessness and price pressures—challenges that could complicate any decision by his eventual successor.\"We face a highly uncertain outlook with elevated risks of both higher unemployment and higher inflation,\" he said, undermining both of the Fed's mandates of 2% inflation and maximum employment.",
  "image": "https://static.toiimg.com/thumb/msid-120294098,width-1070,height-580,imgsize-28742,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003csection\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-120294098,imgsize-28742,width-400,resizemode-4/Untitled-design-2025-04-15T054735-299.jpg\" alt=\"White House looks for new fed chair as Powell nears end amid Trump pressures\" title=\" US Federal Reserve Chair Jerome Powell (AP photo)\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan title=\" US Federal Reserve Chair Jerome Powell (AP photo)\"\u003e US Federal Reserve Chair Jerome Powell (AP photo)\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003cp\u003e The White House is preparing to begin interviews for a new Federal Reserve Chair this autumn, as Jerome Powell, a Biden appointee\u0026#39;s term ends in May 2026. Treasury secretary Scott Bessent confirmed to Bloomberg the timeline during a visit to Argentina, saying it gives the Trump administration a six-month window to plan ahead.\u003cbr/\u003e The decision comes amid growing political pressure on the Federal Reserve. President Donald Trump has repeatedly urged the Fed to cut interest rates. On 4 April, he posted on Truth Social: “Cut interest rates, Jeroma, and stop playing politics”\u003cbr/\u003e Despite the criticism, Bessent said there were no plans to remove Powell before his term ends. He also said the Fed’s independence is not under threat. However, Bessent did call for more conversation about the Fed’s regulatory role. “The Fed is one of three bank regulators—the other two being the Comptroller of the Currency and the FDIC,” he said. “It’s possible to separate monetary policy from regulatory policy.”\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eBessent on Trade Talks, Powell Future, Argentina, Dollar\u003c/p\u003e\u003c/div\u003e\u003cp\u003e He also noted there was no sign of panic during his recent visit to the Fed. “It seems like business as usual,” he added.\u003cbr/\u003ePowell had warned that Trump\u0026#39;s new tariffs could lead to slower growth and higher inflation. Speaking in Virginia last week, he said the economy faces “elevated risks” of both rising joblessness and price pressures—challenges that could complicate any decision by his eventual successor.\u003cbr/\u003e\u0026#34;We face a highly uncertain outlook with elevated risks of both higher unemployment and higher inflation,\u0026#34; he said, undermining both of the Fed\u0026#39;s mandates of 2% inflation and maximum employment.\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-04-15T06:07:00+05:30",
  "modifiedTime": null
}
