{
  "id": "bc5073b6-767e-4494-b9be-5bf7f7468b40",
  "title": "Trump Urges US Supreme Court To Pause Law Threatening TikTok Ban",
  "link": "https://www.ndtv.com/world-news/donald-trump-urges-us-supreme-court-to-pause-law-threatening-tiktok-ban-7347340",
  "description": "US President-elect Donald Trump filed a brief Friday urging the Supreme Court to pause a law that would ban TikTok the day before his January 20 inauguration if it is not sold by its Chinese owner ByteDance.",
  "author": "",
  "published": "Sat, 28 Dec 2024 04:17:00 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "",
  "length": 3462,
  "excerpt": "US President-elect Donald Trump filed a brief Friday urging the Supreme Court to pause a law that would ban TikTok the day before his January 20 inauguration if it is not sold by its Chinese owner ByteDance.",
  "siteName": "www.ndtv.com",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Washington: US President-elect Donald Trump filed a brief Friday urging the Supreme Court to pause a law that would ban TikTok the day before his January 20 inauguration if it is not sold by its Chinese owner ByteDance.\"In light of the novelty and difficulty of this case, the court should consider staying the statutory deadline to grant more breathing space to address these issues,\" Trump's legal team wrote, to give him \"the opportunity to pursue a political resolution.\"US President-elect Donald Trump filed a brief Friday urging the Supreme Court to pause a law that would ban TikTok the day before his January 20 inauguration if it is not sold by its Chinese owner ByteDance.\"In light of the novelty and difficulty of this case, the court should consider staying the statutory deadline to grant more breathing space to address these issues,\" Trump's legal team wrote, to give him \"the opportunity to pursue a political resolution.\"Trump was fiercely opposed to TikTok during his 2017-21 first term, and tried in vain to ban the video app on national security grounds.The Republican voiced concerns -- echoed by political rivals -- that the Chinese government might tap into US TikTok users' data or manipulate what they see on the platform.US officials had also voiced alarm over the popularity of the video-sharing app with young people, alleging that its parent company is subservient to Beijing and that the app is used to spread propaganda, claims denied by the company and the Chinese government.Trump called for a US company to buy TikTok, with the government sharing in the sale price, and his successor Joe Biden went one stage further -- signing a law to ban the app for the same reasons.Trump has now, however, reversed course.\"Now (that) I'm thinking about it, I'm for TikTok, because you need competition,\" he recently told Bloomberg.\"If you don't have TikTok, you have Facebook and Instagram -- and that's, you know, that's Zuckerberg.\"Facebook, founded by Mark Zuckerberg and part of his Meta tech empire, was among the social media networks that banned Trump after attacks by his supporters on the US Capitol on January 6, 2021.The ban was driven by concerns that he would use the platform to promote more violence.Those bans on major social media platforms were later lifted.In the brief filed on Friday, Trump's lawyer made it clear the president-elect did not take a position on the legal merits of the current case.\"President Trump takes no position on the underlying merits of this dispute,\" John Sauer wrote in the amicus curiae -- or \"friend of the court\" -- brief.\"Instead, he respectfully requests that the court consider staying the act's deadline for divestment of January 19, 2025, while it considers the merits of this case, thus permitting President Trump's incoming Administration the opportunity to pursue a political resolution of the questions at issue in the case.\"(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Featured Video Of The Day Manmohan Singh's Contribution To Development Of India Will Always Be Remembered: PM Modi's Tribute",
  "image": "https://c.ndtvimg.com/2024-12/o37c91h8_donald-trump-reuters_625x300_10_December_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                \u003cp\u003e\u003cb\u003eWashington: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eUS President-elect Donald Trump filed a brief Friday urging the Supreme Court to pause a law that would ban TikTok the day before his January 20 inauguration if it is not sold by its Chinese owner ByteDance.\u003c/p\u003e\u003cp\u003e\u0026#34;In light of the novelty and difficulty of this case, the court should consider staying the statutory deadline to grant more breathing space to address these issues,\u0026#34; Trump\u0026#39;s legal team wrote, to give him \u0026#34;the opportunity to pursue a political resolution.\u0026#34;\u003c/p\u003e\u003cp\u003eUS President-elect Donald Trump filed a brief Friday urging the Supreme Court to pause a law that would ban TikTok the day before his January 20 inauguration if it is not sold by its Chinese owner ByteDance.\u003c/p\u003e\u003cp\u003e\u0026#34;In light of the novelty and difficulty of this case, the court should consider staying the statutory deadline to grant more breathing space to address these issues,\u0026#34; Trump\u0026#39;s legal team wrote, to give him \u0026#34;the opportunity to pursue a political resolution.\u0026#34;\u003c/p\u003e\u003cp\u003eTrump was fiercely opposed to TikTok during his 2017-21 first term, and tried in vain to ban the video app on national security grounds.\u003c/p\u003e\u003cp\u003eThe Republican voiced concerns -- echoed by political rivals -- that the Chinese government might tap into US TikTok users\u0026#39; data or manipulate what they see on the platform.\u003c/p\u003e\u003cp\u003eUS officials had also voiced alarm over the popularity of the video-sharing app with young people, alleging that its parent company is subservient to Beijing and that the app is used to spread propaganda, claims denied by the company and the Chinese government.\u003c/p\u003e\u003cp\u003eTrump called for a US company to buy TikTok, with the government sharing in the sale price, and his successor Joe Biden went one stage further -- signing a law to ban the app for the same reasons.\u003c/p\u003e\u003cp\u003eTrump has now, however, reversed course.\u003c/p\u003e\u003cp\u003e\u0026#34;Now (that) I\u0026#39;m thinking about it, I\u0026#39;m for TikTok, because you need competition,\u0026#34; he recently told Bloomberg.\u003c/p\u003e\u003cp\u003e\u0026#34;If you don\u0026#39;t have TikTok, you have Facebook and Instagram -- and that\u0026#39;s, you know, that\u0026#39;s Zuckerberg.\u0026#34;\u003c/p\u003e\u003cp\u003eFacebook, founded by Mark Zuckerberg and part of his Meta tech empire, was among the social media networks that banned Trump after attacks by his supporters on the US Capitol on January 6, 2021.\u003c/p\u003e\u003cp\u003eThe ban was driven by concerns that he would use the platform to promote more violence.\u003c/p\u003e\u003cp\u003eThose bans on major social media platforms were later lifted.\u003c/p\u003e\u003cp\u003eIn the brief filed on Friday, Trump\u0026#39;s lawyer made it clear the president-elect did not take a position on the legal merits of the current case.\u003c/p\u003e\u003cp\u003e\u0026#34;President Trump takes no position on the underlying merits of this dispute,\u0026#34; John Sauer wrote in the amicus curiae -- or \u0026#34;friend of the court\u0026#34; -- brief.\u003c/p\u003e\u003cp\u003e\u0026#34;Instead, he respectfully requests that the court consider staying the act\u0026#39;s deadline for divestment of January 19, 2025, while it considers the merits of this case, thus permitting President Trump\u0026#39;s incoming Administration the opportunity to pursue a political resolution of the questions at issue in the case.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                        \n                                        \n                                                                                \u003cdiv\u003e\n                                                    \u003cp\u003eFeatured Video Of The Day\u003c/p\u003e\n                                                    \n                                                    \u003cp\u003eManmohan Singh\u0026#39;s Contribution To Development Of India Will Always Be Remembered: PM Modi\u0026#39;s Tribute\u003c/p\u003e\n\n                                                \u003c/div\u003e\n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
