{
  "id": "c60875d7-f7fc-4900-97c5-b3b73a95bbd9",
  "title": "India says it carried out military strikes against Pakistan as tensions spiral after Kashmir killings",
  "link": "https://www.cnbc.com/2025/05/07/india-says-it-carried-out-targeted-military-strikes-against-pakistan-.html",
  "description": "The operation follows a militant attack in Pahalgam, Jammu and Kashmir, in which 26 people were killed last month.",
  "author": "",
  "published": "Wed, 07 May 2025 00:39:52 GMT",
  "source": "https://www.cnbc.com/id/100727362/device/rss/rss.html",
  "categories": null,
  "byline": "Vinay Dwivedi",
  "length": 2822,
  "excerpt": "The operation follows a militant attack in Pahalgam, Jammu and Kashmir, in which 26 people were killed last month.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "Security personnel stand guard near Dal Lake in Srinagar, India, on May 6, 2025. Basit Zargar | AFP | Getty ImagesIndia early on Wednesday said its armed forces had conducted strikes against Pakistan and what it calls Pakistan-occupied Jammu and Kashmir, targeting \"terrorist infrastructure.\"\"Our actions have been focused, measured and non-escalatory in nature. No Pakistani military facilities have been targeted,\" the country's Ministry of Defence said.The operation, which targeted nine sites, follows a militant attack in Pahalgam, Jammu and Kashmir, in which 26 people were killed last month, the ministry said.\"We are living up to the commitment that those responsible for this attack will be held accountable,\" the statement said, while adding that India had shown \"considerable restraint in selection of targets and method of execution.\"The Defence Ministry said it will hold a detailed briefing on the strikes, labeled \"Operation Sindoor,\" later in the day. Sindoor refers to a red- or orange-colored powder mostly worn by Indian Hindu married women.\"Pakistan has every right to give a robust response to this act of war imposed by India, and a strong response is indeed being given,\" Pakistan's Prime Minister Shehbaz Sharif said, according to AP.British media outlet The Guardian reported that Pakistani Defense Minister Khawaja Asif said Indian missiles had struck at least two locations in Pakistan-administered Kashmir and five in the country's eastern Punjab province.Asif also added that the country was \"in the process of retaliating,\" adding \"You will see Pakistan's response before the morning.\"Three Indian Air Force fighter jets were reportedly shot down, according to Pakistani state media.India's embassy in the U.S. posted a statement that its actions were \"focused and precise,\" adding that \"no Pakistani civilian, economic or military targets have been hit. Only known terror camps were targeted.\"Most airlines are diverting out of Pakistani airspace, flight tracker FlightRadar24 said on X, while Indian airlines such as IndiGo and SpiceJet said that airports in northern India and flights were impacted. Middle Eastern airline Qatar Airways said that it has temporarily suspended flights to Pakistan due to the closure of Pakistani airspace.U.S. President Donald Trump reportedly told journalists in the White House that \"I guess people knew something was going to happen based on a little bit of the past. They've been fighting for a long time.\"Trump sad that \"it's a shame,\" and that he hopes this will end \"very quickly.\"On Monday, United Nations Secretary General Antonio Guterres said in a post on X that it India and Pakistan should avoid a military confrontation as it could spin out of control. \"A military solution is no solution.\"This is breaking news. Please check back for updates.",
  "image": "https://image.cnbcfm.com/api/v1/image/108141851-1746563902699-gettyimages-2213172099-MEI-India-BZ-SIIKAPA-20250506-0006.jpeg?v=1746564003\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108141851\" data-test=\"InlineImage\"\u003e\u003cp\u003eSecurity personnel stand guard near Dal Lake in Srinagar, India, on May 6, 2025. \u003c/p\u003e\u003cp\u003eBasit Zargar | AFP | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIndia early on Wednesday said its armed forces had conducted strikes against Pakistan and what it calls Pakistan-occupied Jammu and Kashmir, targeting \u0026#34;terrorist infrastructure.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;Our actions have been focused, measured and non-escalatory in nature. No Pakistani military facilities have been targeted,\u0026#34; the country\u0026#39;s Ministry of Defence said.\u003c/p\u003e\u003cp\u003eThe operation, which targeted nine sites, follows a militant attack in Pahalgam, Jammu and Kashmir, in which 26 people were killed last month, the ministry said.\u003c/p\u003e\u003cp\u003e\u0026#34;We are living up to the commitment that those responsible for this attack will be held accountable,\u0026#34; the statement said, while adding that India had shown \u0026#34;considerable restraint in selection of targets and method of execution.\u0026#34;\u003c/p\u003e\u003cp\u003eThe Defence Ministry said it will hold a detailed briefing on the strikes, labeled \u0026#34;Operation Sindoor,\u0026#34; later in the day. Sindoor refers to a red- or orange-colored powder mostly worn by Indian Hindu married women.\u003c/p\u003e\u003cp\u003e\u0026#34;Pakistan has every right to give a robust response to this act of war imposed by India, and a strong response is indeed being given,\u0026#34; Pakistan\u0026#39;s Prime Minister Shehbaz Sharif said, according to AP.\u003c/p\u003e\u003cp\u003eBritish media outlet \u003ca href=\"https://www.theguardian.com/world/2025/may/06/pakistan-vows-to-retaliate-after-wave-of-indian-missiles-hit-country\" target=\"_blank\"\u003eThe Guardian reported\u003c/a\u003e that Pakistani Defense Minister Khawaja Asif said Indian missiles had struck at least two locations in Pakistan-administered Kashmir and five in the country\u0026#39;s eastern Punjab province.\u003c/p\u003e\u003cp\u003eAsif also added that the country was \u0026#34;in the process of retaliating,\u0026#34; adding \u0026#34;You will see Pakistan\u0026#39;s response before the morning.\u0026#34;\u003c/p\u003e\u003cp\u003eThree Indian Air Force fighter jets were reportedly shot down, according to Pakistani state media.\u003c/p\u003e\u003cp\u003eIndia\u0026#39;s embassy in the U.S. \u003ca href=\"https://x.com/IndianEmbassyUS/status/1919881589648974067\" target=\"_blank\"\u003eposted a statement\u003c/a\u003e that its actions were \u0026#34;focused and precise,\u0026#34; adding that \u0026#34;no Pakistani civilian, economic or military targets have been hit. Only known terror camps were targeted.\u0026#34;\u003c/p\u003e\u003cp\u003eMost airlines are diverting out of Pakistani airspace, flight tracker FlightRadar24 \u003ca href=\"https://x.com/flightradar24/status/1919849397220741189\" target=\"_blank\"\u003esaid on X\u003c/a\u003e, while Indian airlines \u003ca href=\"https://x.com/IndiGo6E/status/1919872391074758823\" target=\"_blank\"\u003esuch as IndiGo\u003c/a\u003e and \u003ca href=\"https://x.com/flyspicejet/status/1919886650047660234\" target=\"_blank\"\u003eSpiceJet said\u003c/a\u003e that airports in northern India and flights were impacted. \u003cstrong\u003e\u003cbr/\u003e\u003c/strong\u003e\u003cbr/\u003eMiddle Eastern airline \u003ca href=\"https://x.com/qatarairways/status/1919896562333077917?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet\" target=\"_blank\"\u003eQatar Airways said\u003c/a\u003e that it has temporarily suspended flights to Pakistan due to the closure of Pakistani airspace.\u003c/p\u003e\u003cp\u003eU.S. President Donald Trump \u003ca href=\"https://www.reuters.com/world/trump-calls-indian-strikes-kashmir-dispute-shame-2025-05-06/\" target=\"_blank\"\u003ereportedly told journalists\u003c/a\u003e in the White House that \u0026#34;I guess people knew something was going to happen based on a little bit of the past. They\u0026#39;ve been fighting for a long time.\u0026#34;\u003c/p\u003e\u003cp\u003eTrump sad that \u0026#34;it\u0026#39;s a shame,\u0026#34; and that he hopes this will end \u0026#34;very quickly.\u0026#34;\u003c/p\u003e\u003cp\u003eOn Monday, United Nations Secretary General Antonio Guterres said \u003ca href=\"https://x.com/antonioguterres/status/1919423995511742743\" target=\"_blank\"\u003ein a post on X\u003c/a\u003e that it India and Pakistan should avoid a military confrontation as it could spin out of control. \u0026#34;A military solution is no solution.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cem\u003eThis is breaking news. Please check back for updates.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-05-06T23:20:09Z",
  "modifiedTime": "2025-05-07T00:39:52Z"
}
