{
  "id": "ce42955d-d589-4f0d-91a1-c15755416660",
  "title": "Pak's Mass Destruction Weapons Mention In US Threat Report - And China Link",
  "link": "https://www.ndtv.com/world-news/pakistan-sees-india-as-an-existential-threat-us-threat-assessment-report-8503035#publisher=newsstand",
  "description": "\"Pakistan Sees India As An Existential Threat\": US Threat Assessment Report",
  "author": "",
  "published": "Sun, 25 May 2025 21:55:28 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "NDTV News Desk",
  "length": 5453,
  "excerpt": "\u0026quot;Pakistan Sees India As An Existential Threat\u0026quot;: US Threat Assessment Report",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Quick Read Summary is AI generated, newsroom reviewed. The US Defense Intelligence Agency's 2025 report highlights India's focus on countering China while viewing Pakistan as a secondary threat. It notes ongoing military modernisation in the nations, their regional conflicts, and evolving ties Pakistan regards India as an \"existential threat\", but India considers China its \"primary adversary,\" and Pakistan more of an \"ancillary security problem\", the US Defence Intelligence Agency has said in its worldwide threat assessment report for 2025.The report forecasts that Prime Minister Narendra Modi's defence priorities will probably focus on demonstrating global leadership, countering China, and enhancing New Delhi's military power. \"India views China as its primary adversary and Pakistan more an ancillary security problem to be managed, despite cross-border attacks in mid-May by both India's and Pakistan's militaries,\" the report says.The reference was to the India-Pakistan conflict earlier in this month after Indian airstrikes targeted terrorist infrastructure in Pakistan and Pakistan-Occupied Kashmir.\"Following a late April terrorist attack in Jammu and Kashmir, New Delhi conducted missile strikes on terrorism-related infrastructure facilities in Pakistan. The missile strike provoked multiple rounds of missile, drone, and loitering munition attacks, and heavy artillery fire, by both militaries from 7 to 10 May. As of 10 May, both militaries had agreed to a full ceasefire,\" the report says.India, it says, is prioritising bilateral defense partnerships in the Indian Ocean region to counter Chinese influence and boost its global leadership role.It also referred to the India-China border dispute and said last year's disengagement \"did not resolve the longstanding dispute about border demarcation but reduced some tension still lingering\" from the 2020 clash.\"India almost certainly will continue promoting its \"Made in India\" initiative this year to build its domestic defense industry, mitigate supply chain concerns, and modernize its military India continued to modernize its military in 2024, conducting a test of the nuclear-capable developmental Agni-I Prime MRBM and the Agni-V multiple independently targetable reentry vehicle while also commissioning its second nuclear-powered submarine to strengthen its nuclear triad and bolster its ability to deter adversaries,\" it said.On India-Russia ties, the US report said India will maintain its relationship with Russia through 2025 because it views its ties to Russia \"as important for achieving its economic and defense objectives and sees value in the relationship as a means to offset deepening Russia-China relations\". \"Under Modi, India has reduced its procurement of Russian-origin military equipment but still relies on Russian spare parts to maintain and sustain its large inventory of Russian-origin tanks and fighter aircraft that form the backbone of its military's ability to counter perceived threats from China and Pakistan,\" it says.The Defense Intelligence Agency comes under the US Department of Defense and specialises in military intelligence.In its section on Pakistan, the US report said Pakistan military's top priorities are likely to remain cross-border skirmishes with regional neighbors, rising attacks by Tehrik-e Taliban Pakistan and Baloch nationalist militants, counterterrorism efforts, and nuclear modernisation. \"Despite Pakistan's daily operations during the past year, militants killed more than 2,500 people in Pakistan in 2024.\"\"Pakistan regards India as an existential threat and will continue to pursue its military modernization effort, including the development of battlefield nuclear weapons, to offset India's conventional military advantage,\" the report says.It adds that Pakistan is modernising its nuclear arsenal. \"Pakistan is modernizing its nuclear arsenal and maintaining the security of its nuclear materials and nuclear command and control. Pakistan almost certainly procures WMD-applicable goods from foreign suppliers and intermediaries,\" the report says. WMD here means Weapons of Mass Destruction.Pakistan, the report notes, receives economic and military largesse from China and its forces conduct multiple military exercises with Chinese forces. \"Foreign materials and technology supporting Pakistan's WMD programs are very likely acquired primarily from suppliers in China, and sometimes are transshipped through Hong Kong, Singapore, Turkey, and the United Arab Emirates. However, terrorist attacks targeting Chinese workers who support China-Pakistan Economic Corridor projects has emerged as a point of friction between the countries; seven Chinese nationals were killed in Pakistan in 2024,\" it says.On Pakistan's ties with Iran, the report says, \"Pakistan and Iran have taken steps, including high-level meetings, to deescalate tensions after the two countries conducted unilateral airstrikes on each other's territory in January 2024 in response to cross-border terror attacks.\"\"In September 2024, Taliban and Pakistani border forces clashed near border posts, resulting in the death of eight Taliban fighters. In March 2025, Pakistan and the Afghanistan exchanged air and artillery strikes on each other's territory, each citing alleged militant infrastructure as the targets,\" it adds.",
  "image": "https://c.ndtvimg.com/2022-02/krr2uhm_white-house-generic_625x300_03_February_22.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                         \u003cdiv\u003e\n            \u003cdiv\u003e\n                \u003cp\u003eQuick Read\u003c/p\u003e\n                    \u003cp\u003eSummary is AI generated, newsroom reviewed.\n                \u003c/p\u003e\n                \u003c/div\u003e\n         \u003cdiv\u003e\n            \u003cp\u003eThe US Defense Intelligence Agency\u0026#39;s 2025 report highlights India\u0026#39;s focus on countering China while viewing Pakistan as a secondary threat. It notes ongoing military modernisation in the nations, their regional conflicts, and evolving ties\u003c/p\u003e\n    \u003c/div\u003e\n\u003c/div\u003e                                        \u003cp\u003ePakistan regards India as an \u0026#34;existential threat\u0026#34;, but India considers China its \u0026#34;primary adversary,\u0026#34; and Pakistan more of an \u0026#34;ancillary security problem\u0026#34;, the US Defence Intelligence Agency has said in its worldwide threat assessment report for 2025.\u003c/p\u003e\u003cp\u003eThe report forecasts that Prime Minister Narendra Modi\u0026#39;s defence priorities will probably focus on demonstrating global leadership, countering China, and enhancing New Delhi\u0026#39;s military power. \u0026#34;India views China as its primary adversary and Pakistan more an ancillary security problem to be managed, despite cross-border attacks in mid-May by both India\u0026#39;s and Pakistan\u0026#39;s militaries,\u0026#34; the report says.\u003c/p\u003e\u003cp\u003eThe reference was to the India-Pakistan conflict earlier in this month after Indian airstrikes targeted terrorist infrastructure in Pakistan and Pakistan-Occupied Kashmir.\u003c/p\u003e\u003cp\u003e\u0026#34;Following a late April terrorist attack in Jammu and Kashmir, New Delhi conducted missile strikes on terrorism-related infrastructure facilities in Pakistan. The missile strike provoked multiple rounds of missile, drone, and loitering munition attacks, and heavy artillery fire, by both militaries from 7 to 10 May. As of 10 May, both militaries had agreed to a full ceasefire,\u0026#34; the report says.\u003c/p\u003e\u003cp\u003eIndia, it says, is prioritising bilateral defense partnerships in the Indian Ocean region to counter Chinese influence and boost its global leadership role.\u003c/p\u003e\u003cp\u003eIt also referred to the India-China border dispute and said last year\u0026#39;s disengagement \u0026#34;did not resolve the longstanding dispute about border demarcation but reduced some tension still lingering\u0026#34; from the 2020 clash.\u003c/p\u003e\u003cp\u003e\u0026#34;India almost certainly will continue promoting its \u0026#34;Made in India\u0026#34; initiative this year to build its domestic defense industry, mitigate supply chain concerns, and modernize its military India continued to modernize its military in 2024, conducting a test of the nuclear-capable developmental Agni-I Prime MRBM and the Agni-V multiple independently targetable reentry vehicle while also commissioning its second nuclear-powered submarine to strengthen its nuclear triad and bolster its ability to deter adversaries,\u0026#34; it said.\u003c/p\u003e\u003cp\u003eOn India-Russia ties, the US report said India will maintain its relationship with Russia through 2025 because it views its ties to Russia \u0026#34;as important for achieving its economic and defense objectives and sees value in the relationship as a means to offset deepening Russia-China relations\u0026#34;. \u0026#34;Under Modi, India has reduced its procurement of Russian-origin military equipment but still relies on Russian spare parts to maintain and sustain its large inventory of Russian-origin tanks and fighter aircraft that form the backbone of its military\u0026#39;s ability to counter perceived threats from China and Pakistan,\u0026#34; it says.\u003c/p\u003e\u003cp\u003eThe Defense Intelligence Agency comes under the US Department of Defense and specialises in military intelligence.\u003c/p\u003e\u003cp\u003eIn its section on Pakistan, the US report said Pakistan military\u0026#39;s top priorities are likely to remain cross-border skirmishes with regional neighbors, rising attacks by Tehrik-e Taliban Pakistan and Baloch nationalist militants, counterterrorism efforts, and nuclear modernisation. \u0026#34;Despite Pakistan\u0026#39;s daily operations during the past year, militants killed more than 2,500 people in Pakistan in 2024.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;Pakistan regards India as an existential threat and will continue to pursue its military modernization effort, including the development of battlefield nuclear weapons, to offset India\u0026#39;s conventional military advantage,\u0026#34; the report says.\u003c/p\u003e\u003cp\u003eIt adds that Pakistan is modernising its nuclear arsenal. \u0026#34;Pakistan is modernizing its nuclear arsenal and maintaining the security of its nuclear materials and nuclear command and control. Pakistan almost certainly procures WMD-applicable goods from foreign suppliers and intermediaries,\u0026#34; the report says. WMD here means Weapons of Mass Destruction.\u003c/p\u003e\u003cp\u003ePakistan, the report notes, receives economic and military largesse from China and its forces conduct multiple military exercises with Chinese forces. \u0026#34;Foreign materials and technology supporting Pakistan\u0026#39;s WMD programs are very likely acquired primarily from suppliers in China, and sometimes are transshipped through Hong Kong, Singapore, Turkey, and the United Arab Emirates. However, terrorist attacks targeting Chinese workers who support China-Pakistan Economic Corridor projects has emerged as a point of friction between the countries; seven Chinese nationals were killed in Pakistan in 2024,\u0026#34; it says.\u003c/p\u003e\u003cp\u003eOn Pakistan\u0026#39;s ties with Iran, the report says, \u0026#34;Pakistan and Iran have taken steps, including high-level meetings, to deescalate tensions after the two countries conducted unilateral airstrikes on each other\u0026#39;s territory in January 2024 in response to cross-border terror attacks.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;In September 2024, Taliban and Pakistani border forces clashed near border posts, resulting in the death of eight Taliban fighters. In March 2025, Pakistan and the Afghanistan exchanged air and artillery strikes on each other\u0026#39;s territory, each citing alleged militant infrastructure as the targets,\u0026#34; it adds.\u003c/p\u003e                                                                                \n                                                                                \n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-05-25T14:49:11+05:30",
  "modifiedTime": null
}
