{
  "id": "df3c86fd-8ced-42e2-a52f-c4e8d5a61438",
  "title": "Myanmar's Military Continues To Bomb Towns Amid Deadly Earthquake Crisis",
  "link": "https://www.ndtv.com/world-news/myanmar-military-continues-to-bomb-towns-amid-deadly-earthquake-crisis-myanmar-earthquake-8048698",
  "description": "An armed resistance movement against Myanmar's military-run government criticised the junta on Sunday for conducting airstrikes on villages even as the country reels from an earthquake that has killed around 1,700 people.",
  "author": "",
  "published": "Sun, 30 Mar 2025 22:21:48 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "Reuters",
  "length": 2140,
  "excerpt": "An armed resistance movement against Myanmar\u0026#039;s military-run government criticised the junta on Sunday for conducting airstrikes on villages even as the country reels from an earthquake that has killed around 1,700 people.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "An armed resistance movement against Myanmar's military-run government criticised the junta on Sunday for conducting airstrikes on villages even as the country reels from an earthquake that has killed around 1,700 people.The Karen National Union, one of Myanmar's oldest ethnic armies, said in a statement that the junta \"continues to carry out airstrikes targeting civilian areas, even as the population suffers tremendously from the earthquake\".The group said that under normal circumstances, the military would be prioritising relief efforts, but instead is focused on \"deploying forces to attack its people\".A spokesman for the junta did not reply to queries from Reuters about the criticism.Myanmar has been locked in civil war with multiple armed opposition groups since a 2021 coup, when the military seized power from the elected government of Nobel Peace Prize laureate Aung San Suu Kyi.Shortly after Friday's devastating earthquake, military jets launched airstrikes and drone attacks in Karen state, near the KNU headquarters, according to the Free Burma Rangers, a relief organisation.The epicentre of the 7.7-magnitude quake was in an area held by junta forces, but the devastation is widespread and also affected some territory held by armed resistance movements.On Sunday, the opposition National Unity Government, which includes remnants of the government ousted in 2021, said anti-junta militias under its command would pause all offensive military action for two weeks.Richard Horsey, the senior Myanmar adviser at Crisis Group, said some anti-junta forces have halted their offensives but fighting continues elsewhere.\"The regime also continues to launch airstrikes, including in affected areas. That needs to stop,\" he said.He added that the regime was not providing much visible support in quake-hit areas.\"Local fire brigades, ambulance crews, and community organisations have mobilised, but the military - who would normally be mobilised to support in such a crisis - are nowhere to be seen,\" Horsey said.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
  "image": "https://c.ndtvimg.com/2024-02/sbpal73o_myanmar-military-_625x300_14_February_24.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                        \u003cp\u003eAn armed resistance movement against Myanmar\u0026#39;s military-run government criticised the junta on Sunday for conducting airstrikes on villages even as the country reels from an earthquake that has killed around 1,700 people.\u003c/p\u003e\u003cp\u003eThe Karen National Union, one of Myanmar\u0026#39;s oldest ethnic armies, said in a statement that the junta \u0026#34;continues to carry out airstrikes targeting civilian areas, even as the population suffers tremendously from the earthquake\u0026#34;.\u003c/p\u003e\u003cp\u003eThe group said that under normal circumstances, the military would be prioritising relief efforts, but instead is focused on \u0026#34;deploying forces to attack its people\u0026#34;.\u003c/p\u003e\u003cp\u003eA spokesman for the junta did not reply to queries from Reuters about the criticism.\u003c/p\u003e\u003cp\u003eMyanmar has been locked in civil war with multiple armed opposition groups since a 2021 coup, when the military seized power from the elected government of Nobel Peace Prize laureate Aung San Suu Kyi.\u003c/p\u003e\u003cp\u003eShortly after Friday\u0026#39;s devastating earthquake, military jets launched airstrikes and drone attacks in Karen state, near the KNU headquarters, according to the Free Burma Rangers, a relief organisation.\u003c/p\u003e\u003cp\u003eThe epicentre of the 7.7-magnitude quake was in an area held by junta forces, but the devastation is widespread and also affected some territory held by armed resistance movements.\u003c/p\u003e\u003cp\u003eOn Sunday, the opposition National Unity Government, which includes remnants of the government ousted in 2021, said anti-junta militias under its command would pause all offensive military action for two weeks.\u003c/p\u003e\u003cp\u003eRichard Horsey, the senior Myanmar adviser at Crisis Group, said some anti-junta forces have halted their offensives but fighting continues elsewhere.\u003c/p\u003e\u003cp\u003e\u0026#34;The regime also continues to launch airstrikes, including in affected areas. That needs to stop,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eHe added that the regime was not providing much visible support in quake-hit areas.\u003c/p\u003e\u003cp\u003e\u0026#34;Local fire brigades, ambulance crews, and community organisations have mobilised, but the military - who would normally be mobilised to support in such a crisis - are nowhere to be seen,\u0026#34; Horsey said.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                        \n                                        \n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-03-30T22:21:48+05:30",
  "modifiedTime": null
}
