{
  "id": "e294b99f-ebe7-4817-b1b5-82496cc13b76",
  "title": "UN climate talks 'no longer fit for purpose' say key experts",
  "link": "https://www.bbc.com/news/articles/cx2lknel1xpo",
  "description": "Call for change comes after host country Azerbaijan's president calls oil and gas a 'gift of God'",
  "author": "",
  "published": "Fri, 15 Nov 2024 00:11:01 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Matt McGrath",
  "length": 4461,
  "excerpt": "Call for change comes after host country Azerbaijan's president calls oil and gas a 'gift of God'",
  "siteName": "BBC News",
  "favicon": "https://www.bbc.com/bbcx/apple-touch-icon.png",
  "text": "gettyRecent deadly floods in Valencia, Spain, were made worse by climate change, scientists sayThe United Nations' COP climate talks are \"no longer fit for purpose\" and need an urgent overhaul, key experts including a former UN secretary general and former UN climate chief have said.In a letter to the UN, senior figures say countries should not host the talks if they don’t support the phase out of fossil energy.This week the Azerbaijani president told world leaders gathered in his country for COP29 that natural gas was a “gift from God” and he shouldn’t be blamed for bringing it to market.That came days after the BBC reported that a senior Azerbaijani official appeared to have used his role at COP to arrange a meeting to discuss potential fossil fuel deals.The UN’s climate talks have made significant progress in recent years, despite the fact that unanimous agreement is needed among almost 200 countries to take action.The Paris climate agreement, signed in 2015, outlines a long-term plan to rein in rising temperatures, as countries strive to keep that rise under 1.5C this century. They have also agreed to transition away from fossil fuels in energy systems, and to treble renewable power by 2030.But while the authors of this letter recognise these achievements, they feel that the slow-moving COP process is “no longer fit for purpose” in dealing with a fast-moving climate crisis.\"Its current structure simply cannot deliver the change at exponential speed and scale, which is essential to ensure a safe climate landing for humanity,\" said its signatories. They include former UN Secretary General Ban-Ki Moon, former UN climate chief Christiana Figueres and former president of Ireland Mary Robinson.This year will likely be the warmest on record, with emissions of planet warming gases still rising, while the impacts of warming often outpace the ability of countries to cope.“Planet Earth is in critical condition,” said leading climate scientist Johan Rockström, another signatory. “There is still a window of opportunity for a safe landing for humanity, but this requires a global climate policy process that can deliver change at exponential speed and scale,” Prof Rockström said.Getty ImagesThe President of Azerbaijan, Ilham Aliyev addressing COP29 delegatesThe letter has been prompted by growing concerns about some of the countries chosen to host COP talks and their ability to deliver a significant advance in the fight against rising temperatures.Just before the latest conference started, a secret recording showed the chief executive of Azerbaijan's COP29 team, Elnur Soltanov, discussing \"investment opportunities\" in the state oil and gas company with a man posing as a potential investor.At the start of COP29, the country’s authoritarian leader, Ilham Aliyev, defended Azerbaijan’s current exports of gas and plans to expand production by a third in the next decade.“It's a gift of God,” he told an audience in Baku.“Every natural resource whether it's oil, gas, wind, sun, gold, silver, copper, all that are natural resources,\" he said. \"And countries should not be blamed for having them and should not be blamed for bringing these resources to the market because the market needs them, the people need them.\"The use of oil and gas are major causes of global warming, as they release planet-warming gases like carbon dioxide when they are burned.President Aliyev also hit out at France for carrying out colonialist “crimes” and “human rights violations” in overseas territories.Such strongly expressed views are extremely rare from the leader of a COP host, where the aim is to build consensus on how to tackle rising temperatures.The authors of the letter are also concerned by the selection process for hosting COPs. Azerbaijan followed on from another major oil producer, the United Arab Emirates, which held the conference in Dubai last year.“At the last COP, fossil fuel lobbyists outnumbered representatives of scientific institutions, Indigenous communities and vulnerable nations,\" said former UN climate chief Christiana Figueres.\"We cannot hope to achieve a just transition without significant reforms to the COP process that ensure fair representation of those most affected.”The authors say that host countries “must demonstrate their high level of ambition to uphold the goals of the Paris agreement.\"They also want smaller, more frequent COPs with clear accountability for the promises that countries make.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cd36/live/77ac9db0-a2e0-11ef-bf71-6ff17bcfa8a9.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/cd36/live/77ac9db0-a2e0-11ef-bf71-6ff17bcfa8a9.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/cd36/live/77ac9db0-a2e0-11ef-bf71-6ff17bcfa8a9.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/cd36/live/77ac9db0-a2e0-11ef-bf71-6ff17bcfa8a9.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/cd36/live/77ac9db0-a2e0-11ef-bf71-6ff17bcfa8a9.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/cd36/live/77ac9db0-a2e0-11ef-bf71-6ff17bcfa8a9.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/cd36/live/77ac9db0-a2e0-11ef-bf71-6ff17bcfa8a9.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/cd36/live/77ac9db0-a2e0-11ef-bf71-6ff17bcfa8a9.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/cd36/live/77ac9db0-a2e0-11ef-bf71-6ff17bcfa8a9.jpg.webp\" alt=\"getty Man cleaning up after flood, wearing face mask\"/\u003e\u003cspan\u003egetty\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eRecent deadly floods in Valencia, Spain, were made worse by climate change, scientists say\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe United Nations\u0026#39; COP climate talks are \u0026#34;no longer fit for purpose\u0026#34; and need an urgent overhaul, key experts including a former UN secretary general and former UN climate chief have said.\u003c/p\u003e\u003cp\u003eIn a letter to the UN, senior figures say countries should not host the talks if they don’t support the phase out of fossil energy.\u003c/p\u003e\u003cp\u003eThis week the Azerbaijani president told world leaders gathered in his country for COP29 that natural gas was a “gift from God” and he shouldn’t be blamed for bringing it to market.\u003c/p\u003e\u003cp\u003eThat came days after the BBC reported that a senior Azerbaijani official appeared to have used his role at COP to arrange a meeting to discuss potential fossil fuel deals.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe UN’s climate talks have made significant progress in recent years, despite the fact that unanimous agreement is needed among almost 200 countries to take action.\u003c/p\u003e\u003cp\u003eThe \u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/science-environment-35073297\"\u003eParis climate agreement\u003c/a\u003e, signed in 2015, outlines a long-term plan to rein in rising temperatures, as countries strive to keep that rise under 1.5C this century. \u003c/p\u003e\u003cp\u003eThey have also agreed to transition away from fossil fuels in energy systems, and to treble renewable power by 2030.\u003c/p\u003e\u003cp\u003eBut while the authors of this letter recognise these achievements, they feel that the slow-moving COP process is “no longer fit for purpose” in dealing with a fast-moving climate crisis.\u003c/p\u003e\u003cp\u003e\u0026#34;Its current structure simply cannot deliver the change at exponential speed and scale, which is essential to ensure a safe climate landing for humanity,\u0026#34; said its signatories. They include former UN Secretary General Ban-Ki Moon, former UN climate chief Christiana Figueres and former president of Ireland Mary Robinson.\u003c/p\u003e\u003cp\u003eThis year will likely be the \u003ca target=\"_self\" href=\"https://www.bbc.com/news/articles/c1dpnxnvv2go\"\u003ewarmest on record\u003c/a\u003e, with emissions of planet warming gases still rising, while the impacts of warming often outpace the ability of countries to cope.\u003c/p\u003e\u003cp\u003e“Planet Earth is in critical condition,” said leading climate scientist Johan Rockström, another signatory. \u003c/p\u003e\u003cp\u003e“There is still a window of opportunity for a safe landing for humanity, but this requires a global climate policy process that can deliver change at exponential speed and scale,” Prof Rockström said.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/5392/live/2772b7d0-a2b3-11ef-98e0-d94796d9d8bd.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/5392/live/2772b7d0-a2b3-11ef-98e0-d94796d9d8bd.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/5392/live/2772b7d0-a2b3-11ef-98e0-d94796d9d8bd.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/5392/live/2772b7d0-a2b3-11ef-98e0-d94796d9d8bd.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/5392/live/2772b7d0-a2b3-11ef-98e0-d94796d9d8bd.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/5392/live/2772b7d0-a2b3-11ef-98e0-d94796d9d8bd.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/5392/live/2772b7d0-a2b3-11ef-98e0-d94796d9d8bd.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/5392/live/2772b7d0-a2b3-11ef-98e0-d94796d9d8bd.jpg.webp\" alt=\"Getty Images The president of Axerbaijan speaking to COP29 delegates\"/\u003e\u003cspan\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eThe President of Azerbaijan, Ilham Aliyev addressing COP29 delegates\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe letter has been prompted by growing concerns about some of the countries chosen to host COP talks and their ability to deliver a significant advance in the fight against rising temperatures.\u003c/p\u003e\u003cp\u003eJust before the latest conference started, a secret recording showed the chief executive of Azerbaijan\u0026#39;s COP29 team, Elnur Soltanov, discussing \u0026#34;investment opportunities\u0026#34; in the state oil and gas company with a man posing as a potential investor.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAt the start of COP29, the country’s authoritarian leader, Ilham Aliyev, defended Azerbaijan’s current exports of gas and plans to expand production by a third in the next decade.\u003c/p\u003e\u003cp\u003e\u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/articles/cpqd1rzw9r4o\"\u003e“It\u0026#39;s a gift of God,” he told an audience in Baku.\u003c/a\u003e\u003c/p\u003e\u003cp\u003e“Every natural resource whether it\u0026#39;s oil, gas, wind, sun, gold, silver, copper, all that are natural resources,\u0026#34; he said. \u003c/p\u003e\u003cp\u003e\u0026#34;And countries should not be blamed for having them and should not be blamed for bringing these resources to the market because the market needs them, the people need them.\u0026#34;\u003c/p\u003e\u003cp\u003eThe use of oil and gas are major causes of global warming, as they release planet-warming gases like carbon dioxide when they are burned.\u003c/p\u003e\u003cp\u003ePresident Aliyev also hit out at France for carrying out colonialist “crimes” and “human rights violations” in overseas territories.\u003c/p\u003e\u003cp\u003eSuch strongly expressed views are extremely rare from the leader of a COP host, where the aim is to build consensus on how to tackle rising temperatures.\u003c/p\u003e\u003cp\u003eThe authors of the letter are also concerned by the selection process for hosting COPs. Azerbaijan followed on from another major oil producer, the United Arab Emirates, which held the conference in Dubai last year.\u003c/p\u003e\u003cp\u003e“At the last COP, fossil fuel lobbyists outnumbered representatives of scientific institutions, Indigenous communities and vulnerable nations,\u0026#34; said former UN climate chief Christiana Figueres.\u003c/p\u003e\u003cp\u003e\u0026#34;We cannot hope to achieve a just transition without significant reforms to the COP process that ensure fair representation of those most affected.”\u003c/p\u003e\u003cp\u003eThe authors say that host countries “must demonstrate their high level of ambition to uphold the goals of the Paris agreement.\u0026#34;\u003c/p\u003e\u003cp\u003eThey also want smaller, more frequent COPs with clear accountability for the promises that countries make.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-11-14T23:05:06.637Z",
  "modifiedTime": null
}
