{
  "id": "f6482533-6ac3-4339-ae58-d97af124bcb7",
  "title": "Trump To Sign Order On Reciprocal Tariffs Ahead Of PM Modi's US Visit",
  "link": "https://www.ndtv.com/world-news/donald-trump-to-sign-order-on-reciprocal-tariffs-ahead-of-pm-modis-us-visit-7697788",
  "description": "US President Donald Trump committed Wednesday to announcing \"reciprocal tariffs\" on other countries, saying he could sign an order for them within a day, a move that could open new fronts in a trade war.",
  "author": "",
  "published": "Thu, 13 Feb 2025 04:19:50 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "",
  "length": 3257,
  "excerpt": "US President Donald Trump committed Wednesday to announcing \"reciprocal tariffs\" on other countries, saying he could sign an order for them within a day, a move that could open new fronts in a trade war.",
  "siteName": "www.ndtv.com",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Washington: US President Donald Trump committed Wednesday to announcing \"reciprocal tariffs\" on other countries, saying he could sign an order for them within a day, a move that could open new fronts in a trade war.During election campaigning, Trump had promised: \"An eye for an eye, a tariff for a tariff, same exact amount.\"Analysts expect reciprocal duties involve hiking tariff rates on US imports to match the rate that exporting countries charge on American products.Speaking in the Oval Office on Wednesday, Trump said that he could sign an order for reciprocal duties later in the day, or on Thursday morning.Analysts have warned that such levies could bring a broad tariff hike to emerging market economies like India and Thailand.Earlier on Wednesday, White House Press Secretary Karoline Leavitt told reporters she believed Trump's tariff plan could be announced before he meets with Indian Prime Minister Narendra Modi on Thursday.Since taking office on January 20, Trump has unveiled sweeping levies on US trading partners.On Wednesday, a White House official told AFP that Trump's planned 25 percent tariffs on all steel and aluminum imports will stack on top of the hefty duties he earlier announced on Canada and Mexico.Trump had in early February unveiled sweeping tariffs of 25 percent on Canadian and Mexican goods, with a lower rate of 10 percent on Canadian energy imports.But shortly after making that announcement, he halted the blanket levies on the United States' immediate neighbors for a month as both countries vowed to implement measures against illegal immigration and fentanyl smuggling.If those tariffs are reimposed at the end of a 30-day deadline, the levies on Canadian and Mexican steel and aluminum could hit 50 percent, the official said, speaking on condition of anonymity.Canada's finance minister Dominic LeBlanc, who is in Washington with Canadian provincial leaders, told reporters Wednesday that Ottawa would not get ahead of America's decision on tariffs.\"We have a number of weeks to work together, and President Trump's words were very precise to structure an economic deal with Canada,\" said LeBlanc, who is meeting US policymakers including National Economic Council director Kevin Hassett and Commerce Secretary nominee Howard Lutnick.Wab Kinew, premier of Manitoba in western Canada, added that his country has critical minerals that could help the US economy.Mexican President Claudia Sheinbaum separately added that economy minister Marcelo Ebrard has been in talks with his expected US counterpart.While talks between the North American trading partners continued, Trump signed separate orders to impose 25 percent tariffs on steel and aluminum imports from March 12.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Featured Video Of The Day PM In France: Modi, Macron Review Ties In Defence, Civil Nuclear Energy, Space",
  "image": "https://c.ndtvimg.com/2025-02/37pm769s_donald-trump_625x300_13_February_25.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                \u003cp\u003e\u003cb\u003eWashington: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eUS President Donald Trump committed Wednesday to announcing \u0026#34;reciprocal tariffs\u0026#34; on other countries, saying he could sign an order for them within a day, a move that could open new fronts in a trade war.\u003c/p\u003e\u003cp\u003eDuring election campaigning, Trump had promised: \u0026#34;An eye for an eye, a tariff for a tariff, same exact amount.\u0026#34;\u003c/p\u003e\u003cp\u003eAnalysts expect reciprocal duties involve hiking tariff rates on US imports to match the rate that exporting countries charge on American products.\u003c/p\u003e\u003cp\u003eSpeaking in the Oval Office on Wednesday, Trump said that he could sign an order for reciprocal duties later in the day, or on Thursday morning.\u003c/p\u003e\u003cp\u003eAnalysts have warned that such levies could bring a broad tariff hike to emerging market economies like India and Thailand.\u003c/p\u003e\u003cp\u003eEarlier on Wednesday, White House Press Secretary Karoline Leavitt told reporters she believed Trump\u0026#39;s tariff plan could be announced before he meets with Indian Prime Minister Narendra Modi on Thursday.\u003c/p\u003e\u003cp\u003eSince taking office on January 20, Trump has unveiled sweeping levies on US trading partners.\u003c/p\u003e\u003cp\u003eOn Wednesday, a White House official told AFP that Trump\u0026#39;s planned 25 percent tariffs on all steel and aluminum imports will stack on top of the hefty duties he earlier announced on Canada and Mexico.\u003c/p\u003e\u003cp\u003eTrump had in early February unveiled sweeping tariffs of 25 percent on Canadian and Mexican goods, with a lower rate of 10 percent on Canadian energy imports.\u003c/p\u003e\u003cp\u003eBut shortly after making that announcement, he halted the blanket levies on the United States\u0026#39; immediate neighbors for a month as both countries vowed to implement measures against illegal immigration and fentanyl smuggling.\u003c/p\u003e\u003cp\u003eIf those tariffs are reimposed at the end of a 30-day deadline, the levies on Canadian and Mexican steel and aluminum could hit 50 percent, the official said, speaking on condition of anonymity.\u003c/p\u003e\u003cp\u003eCanada\u0026#39;s finance minister Dominic LeBlanc, who is in Washington with Canadian provincial leaders, told reporters Wednesday that Ottawa would not get ahead of America\u0026#39;s decision on tariffs.\u003c/p\u003e\u003cp\u003e\u0026#34;We have a number of weeks to work together, and President Trump\u0026#39;s words were very precise to structure an economic deal with Canada,\u0026#34; said LeBlanc, who is meeting US policymakers including National Economic Council director Kevin Hassett and Commerce Secretary nominee Howard Lutnick.\u003c/p\u003e\u003cp\u003eWab Kinew, premier of Manitoba in western Canada, added that his country has critical minerals that could help the US economy.\u003c/p\u003e\u003cp\u003eMexican President Claudia Sheinbaum separately added that economy minister Marcelo Ebrard has been in talks with his expected US counterpart.\u003c/p\u003e\u003cp\u003eWhile talks between the North American trading partners continued, Trump signed separate orders to impose 25 percent tariffs on steel and aluminum imports from March 12.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                        \n                                        \n                                                                                \u003cdiv\u003e\n                                                    \u003cp\u003eFeatured Video Of The Day\u003c/p\u003e\n                                                    \n                                                    \u003cp\u003ePM In France: Modi, Macron Review Ties In Defence, Civil Nuclear Energy, Space\u003c/p\u003e\n\n                                                \u003c/div\u003e\n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
