{
  "id": "fb9cc832-940e-4731-9730-171f00cabc1c",
  "title": "Ukraine fires US-supplied longer-range missiles into Russia, Moscow says",
  "link": "https://www.bbc.com/news/articles/c0mzjm7knw7o",
  "description": "Missiles targeted an ammunitions depot in Bryansk region, Moscow says, with Foreign Minister Lavrov saying the US wanted to escalate the conflict.",
  "author": "",
  "published": "Tue, 19 Nov 2024 15:39:40 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Maia Davies",
  "length": 3500,
  "excerpt": "Missiles targeted an ammunitions depot in Bryansk region, Moscow says, with Foreign Minister Lavrov saying the US wanted to escalate the conflict.",
  "siteName": "BBC News",
  "favicon": "https://www.bbc.com/bbcx/apple-touch-icon.png",
  "text": "White Sands Missile RangeArmy Tactical Missile Systems (Atacms) can reach up to 300km (186 miles) and are tough to intercept due to their high speedUkraine has fired US-supplied longer-range missiles at Russian territory for the first time, the Russian government said, a day after Washington gave its permission for such attacks. US officials also confirmed use of the Army Tactical Missile System (Atacms) to CBS news, the BBC's US partner. Ukraine has not commented.Russia's defence ministry said the strike had targeted the Bryansk region bordering Ukraine to the north on Tuesday morning.It said five missiles had been shot down and one had caused damage - with its fragments starting a fire at a military facility. But two US officials said initial indications suggested Russia had intercepted just two missiles out of around eight fired by Ukraine. The BBC has not been able to independently verify the contradicting figures.Russia’s Foreign Minister, Sergei Lavrov, accused Washington of trying to escalate the conflict. \"That Atacms was used repeatedly overnight against Bryansk Region is of course a signal that they [the US] want escalation,\" he said. \"And without the Americans, use of these high-tech missiles, as [Russian President Vladimir] Putin has said many times, is impossible.\"He said Russia would \"proceed from the understanding\" that the missiles were operated by \"American military experts\".\"We will be taking this as a renewed face of the Western war against Russia and we will react accordingly,\" he told a press conference at the G20 in Rio de Janeiro.Earlier on Tuesday, the Kremlin approved changes to Russia’s nuclear doctrine, setting out new conditions under which the country would consider using its arsenal.It now says an attack from a non-nuclear state, if backed by a nuclear power, will be treated as a joint assault on Russia.Commenting on the changes, US state department spokesperson Matthew Miller said: \"Since the beginning of its war of aggression against Ukraine, [Russia] has sought to coerce and intimidate both Ukraine and other countries around the world through irresponsible nuclear rhetoric and behaviour.\"He added that the US had not \"seen any reason\" to change its own nuclear posture, but would \"continue to call on Russia to stop bellicose and irresponsible rhetoric\".UK Prime Minister Sir Keir Starmer also described the move as \"irresponsible rhetoric\", adding that was \"not going to deter our support for Ukraine\".Ukraine has already been using Atacms in Russian-occupied areas of its own territory for more than a year.The missiles can hit targets at a range of up to 300km (186 miles) and are difficult to intercept.Kyiv is now able to strike deeper into Russia using the missiles, including around the Kursk region, where Ukrainian forces hold more than 1,000 sq km of territory. Ukrainian and US officials reportedly expect a counter-offensive in the region.Atacms: What we know about missile system Ukraine is using to strike RussiaIn a statement, Russia’s defence ministry said the strike had been launched at 03:25 (00:25 GMT).A fire caused by fallen debris from one of the missiles was quickly extinguished and there were no casualties, it said.Ukraine’s military earlier confirmed that it had struck an ammunition warehouse in the Russian region of Bryansk, but it did not specify whether Atacms had been used.It said the attack, on a depot around 100km from the border near the town of Karachev, had caused 12 secondary explosions.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8733/live/50de1630-a693-11ef-a4fe-a3e9a6c5d640.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/8733/live/50de1630-a693-11ef-a4fe-a3e9a6c5d640.png.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/8733/live/50de1630-a693-11ef-a4fe-a3e9a6c5d640.png.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/8733/live/50de1630-a693-11ef-a4fe-a3e9a6c5d640.png.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/8733/live/50de1630-a693-11ef-a4fe-a3e9a6c5d640.png.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/8733/live/50de1630-a693-11ef-a4fe-a3e9a6c5d640.png.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/8733/live/50de1630-a693-11ef-a4fe-a3e9a6c5d640.png.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/8733/live/50de1630-a693-11ef-a4fe-a3e9a6c5d640.png.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/8733/live/50de1630-a693-11ef-a4fe-a3e9a6c5d640.png.webp\" alt=\"White Sands Missile Range Army Tactical Missile Systems (Atacms) being launched\"/\u003e\u003cspan\u003eWhite Sands Missile Range\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eArmy Tactical Missile Systems (Atacms) can reach up to 300km (186 miles) and are tough to intercept due to their high speed\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eUkraine has fired US-supplied longer-range missiles at Russian territory for the first time, the Russian government said, a day after Washington gave its permission for such attacks. \u003c/p\u003e\u003cp\u003eUS officials also confirmed use of the Army Tactical Missile System (Atacms) to CBS news, the BBC\u0026#39;s US partner. Ukraine has not commented.\u003c/p\u003e\u003cp\u003eRussia\u0026#39;s defence ministry said the strike had targeted the Bryansk region bordering Ukraine to the north on Tuesday morning.\u003c/p\u003e\u003cp\u003eIt said five missiles had been shot down and one had caused damage - with its fragments starting a fire at a military facility. \u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eBut two US officials said initial indications suggested Russia had intercepted just two missiles out of around eight fired by Ukraine. \u003c/p\u003e\u003cp\u003eThe BBC has not been able to independently verify the contradicting figures.\u003c/p\u003e\u003cp\u003eRussia’s Foreign Minister, Sergei Lavrov, accused Washington of trying to escalate the conflict. \u003c/p\u003e\u003cp\u003e\u0026#34;That Atacms was used repeatedly overnight against Bryansk Region is of course a signal that they [the US] want escalation,\u0026#34; he said. \u003c/p\u003e\u003cp\u003e\u0026#34;And without the Americans, use of these high-tech missiles, as [Russian President Vladimir] Putin has said many times, is impossible.\u0026#34;\u003c/p\u003e\u003cp\u003eHe said Russia would \u0026#34;proceed from the understanding\u0026#34; that the missiles were operated by \u0026#34;American military experts\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;We will be taking this as a renewed face of the Western war against Russia and we will react accordingly,\u0026#34; he told a press conference at the G20 in Rio de Janeiro.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eEarlier on Tuesday, the Kremlin approved changes to Russia’s nuclear doctrine, setting out new conditions under which the country would consider using its arsenal.\u003c/p\u003e\u003cp\u003eIt now says an attack from a non-nuclear state, if backed by a nuclear power, will be treated as a joint assault on Russia.\u003c/p\u003e\u003cp\u003eCommenting on the changes, US state department spokesperson Matthew Miller said: \u0026#34;Since the beginning of its war of aggression against Ukraine, [Russia] has sought to coerce and intimidate both Ukraine and other countries around the world through irresponsible nuclear rhetoric and behaviour.\u0026#34;\u003c/p\u003e\u003cp\u003eHe added that the US had not \u0026#34;seen any reason\u0026#34; to change its own nuclear posture, but would \u0026#34;continue to call on Russia to stop bellicose and irresponsible rhetoric\u0026#34;.\u003c/p\u003e\u003cp\u003eUK Prime Minister Sir Keir Starmer also described the move as \u0026#34;irresponsible rhetoric\u0026#34;, adding that was \u0026#34;not going to deter our support for Ukraine\u0026#34;.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/801f/live/93b8df50-a691-11ef-8ab9-9192db313061.png.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/801f/live/93b8df50-a691-11ef-8ab9-9192db313061.png.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/801f/live/93b8df50-a691-11ef-8ab9-9192db313061.png.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/801f/live/93b8df50-a691-11ef-8ab9-9192db313061.png.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/801f/live/93b8df50-a691-11ef-8ab9-9192db313061.png.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/801f/live/93b8df50-a691-11ef-8ab9-9192db313061.png.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/801f/live/93b8df50-a691-11ef-8ab9-9192db313061.png.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/801f/live/93b8df50-a691-11ef-8ab9-9192db313061.png.webp\" alt=\"A map showing the location of the Bryansk region of Russia, which lies on the northern border of Ukraine and also shares a border with Belarus. The entire region is shown as being within the range of Ukraine’s Aatcms missiles.\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eUkraine has already been using Atacms in Russian-occupied areas of its own territory for more than a year.\u003c/p\u003e\u003cp\u003eThe missiles can hit targets at a range of up to 300km (186 miles) and are difficult to intercept.\u003c/p\u003e\u003cp\u003eKyiv is now able to strike deeper into Russia using the missiles, including around the Kursk region, where Ukrainian forces hold more than 1,000 sq km of territory. Ukrainian and US officials reportedly expect a counter-offensive in the region.\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/articles/cx2nrlq1840o\"\u003eAtacms: What we know about missile system Ukraine is using to strike Russia\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eIn a statement, Russia’s defence ministry said the strike had been launched at 03:25 (00:25 GMT).\u003c/p\u003e\u003cp\u003eA fire caused by fallen debris from one of the missiles was quickly extinguished and there were no casualties, it said.\u003c/p\u003e\u003cp\u003eUkraine’s military earlier confirmed that it had struck an ammunition warehouse in the Russian region of Bryansk, but it did not specify whether Atacms had been used.\u003c/p\u003e\u003cp\u003eIt said the attack, on a depot around 100km from the border near the town of Karachev, had caused 12 secondary explosions.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-11-19T12:33:26.328Z",
  "modifiedTime": null
}
