{
  "id": "224034e4-e13e-49db-aa03-ff4dcb07212b",
  "title": "The Old-School Puerto Rican Holiday Dish My Family Makes Every Single Year",
  "link": "https://www.thekitchn.com/pasteles-recipe-23695937?utm_source=RSS\u0026utm_medium=feed\u0026utm_campaign=Category%2FChannel%3A+main",
  "description": "Unwrapping one is the perfect treat. READ MORE...",
  "author": "Dinatalia Farina",
  "published": "Fri, 29 Nov 2024 12:00:00 -0500",
  "source": "https://www.thekitchn.com/main.rss",
  "categories": [
    "Recipes",
    "Main Dish",
    "Recipe",
    "SEO November 2024",
    "Latin American",
    "Pork \u0026amp; Ham",
    "pork",
    "Meat",
    "thanksgiving",
    "christmas",
    "autumn"
  ],
  "byline": "Dinatalia Farina",
  "length": 11665,
  "excerpt": "Unwrapping one is the perfect treat.",
  "siteName": "Kitchn",
  "favicon": "https://www.thekitchn.com/static/icons/favicon-32x32.png",
  "text": "RecipesWhat To Make WithPork \u0026 HamPuerto Rican Pastelespublished about 4 hours agoCredit: Photo: Alex Lepe; Food Styling: Spencer RichardsUnwrapping one of these is the best gift you can give yourself.MakesMakes 22 pastelesPrep4 hoursCook2 hours 30 minutesWe independently select these products—if you buy from one of our links, we may earn a commission. All prices were accurate at the time of publishing.Credit: Photo: Alex Lepe; Food Styling: Spencer RichardsSometime during the beginning of November in Puerto Rico and around the diaspora, families come together and make a party out of making pasteles, tender and savory masa stuffed with stewed pork and wrapped in a banana leaf. Typically the children are in charge of grating the root vegetables, while the adults assemble. According to Puerto Rican food historian Cruz Miguel Ortíz Cuadra, the origins of pasteles are not easily traced, but there are African roots in relation to wrapping them in banana leaves. In his book, Eating Puerto Rico, he states, “There is no single accepted way of making pastel.” Each family makes pasteles their own way, and what’s important is coming together and spending quality time with one another around the holidays.If you’re looking for something different to bring to your Thanksgiving meal (or Friendsgiving gathering), give these pasteles a try and make it fun! I say the more the merrier when it comes to this recipe — and if you can, try to save some to freeze for later. Why You’ll Love It The filling is the best part. It’s tender, succulent, and so good you could eat it all alone. One bite will make you a fan. While the recipe is a bit of an undertaking, this beloved classic is so worth it.  Credit: Photo: Alex Lepe; Food Styling: Spencer RichardsKey Ingredients in Pasteles Root vegetables. These are the stars of the recipe. You’ll need green bananas (also known as unripe bananas, which are not the same as plantains), yautia (or malanga or cocoyam), kabocha squash, and green plantain. The bananas should be green, and for the rest of the root vegetables, the less bruising the better. Pork butt or pork shoulder. Truly the best cut for this recipe; it’s very tender and absorbs flavor so well. Annatto oil. You will use this quite a bit, as it adds color as well as helps the masa not stick to the banana leaf. Fresh sofrito. Made with cilantro, culantro, garlic, aji peppers, and onion, this is the base for your stew. Some people will add red and green bell peppers, as well as cubanelle peppers. You can use thawed frozen sofrito in place of fresh.  Credit: Photo: Alex Lepe; Food Styling: Spencer RichardsHow to Make Pasteles Prep your banana leaves and twine. Using scissors, trim your leaves and cut into rectangles. Wipe with a damp paper towel, and warm over a low gas flame (if you don’t have a gas stove, you can place them in a low oven). Cut your butcher’s twine.  Make the annatto oil. Heat vegetable oil and annatto seeds together until almost simmering, then let sit for 10 minutes to infuse with flavor. Strain into a heatproof bowl and let cool completely.  Stew your pork. Cook cubed pork with tomato paste, annatto oil, sofrito, minced garlic, garlic power, onion powder, kosher salt, black pepper, dried oregano, and water. After simmering for 30 minutes, add chickpeas and olives. Let cool to room temperature. Make the masa. Peel all of your root vegetables and place them into a food processor. Doing this saves so much time versus grating them by hand. Stir in some annatto oil, cooking liquid from the stewed pork, minced garlic cloves, and olive brine. Assemble your pasteles. Brush a banana leaf with annatto oil, then spread masa followed by pork filling, and finish with a sliver of a roasted red pepper on top. Fold the banana leaf around the filling to enclose, tucking the ends underneath. Wrap the pastel in parchment or pastel paper and tie with twine.   Cook the pasteles. Bring a large pot of water to a boil, and stir in kosher salt until dissolved. Add the pasteles and boil for 45 minutes. To serve, cut and remove the kitchen twine, then unwrap and remove the parchment followed by the banana leaf. Helpful Swaps  You can use 2 1/4 teaspoons of salt-free adobo seasoning in place of the garlic powder, onion powder, and dried oregano in the filling. Storage and Make-Ahead Tips  The pork filling, masa, and annatto oil can be made a day or two in advance.  Assembled, uncooked pasteles can be frozen for up to 2 months. Boil frozen for 1 hour. Cooked pasteles can be refrigerated (still in the banana leaf) for up to 4 days, or frozen for up to 2 months. Thaw overnight in the refrigerator. Reheat by simmering for 15 minutes. What to Serve with PastelesYou can top your pastel with ketchup or pique, a vinegar-based hot sauce commonly eaten in Puerto Rico. Pique usually contains peppercorns, whole garlic cloves, culantro, aji caballero, bay leaves, vinegar, and water. Although you can eat them alone, pasteles are usually served with some of the dishes below during holiday meals. CommentsUnwrapping one of these is the best gift you can give yourself.Nutritional InfoIngredientsFor the annatto oil:1 cup vegetable oil3 tablespoons annatto seedsFor the filling:1 (6-ounce) can tomato paste2 tablespoons annatto oil (recipe above)2 tablespoons fresh sofrito or thawed frozen sofrito2 pounds boneless pork butt or pork shoulder, trimmed of excess fat and cut into 1-inch cubes6 large cloves garlic, minced1 tablespoon garlic powder1 tablespoon onion powder1 tablespoon kosher salt1/2 teaspoon freshly ground black pepper1/4 teaspoon dried oregano1 1/2 cups water1 (15-ounce) can chickpeas, drained and rinsed1/4 cup stuffed Spanish manzanilla olives (no pits), halved For the masa:5 to 6 pounds green bananas (guineos, 2 bunches), peeled and cut into 1-inch chunks2 to 3 pounds yautia, malanga, or cocoyam, peeled and cut into 1-inch chunks2 pounds kabocha squash (calabaza, about 1/2 medium), peeled and cut into 1-inch chunks1 medium green plantain (6 to 10 ounces), peeled and cut into 1-inch chunks2 tablespoons annatto oil (recipe above)4 large cloves garlic, minced2 tablespoons olive brine (from the stuffed Spanish olives in the filling)Kosher saltFor assembling and cooking the pasteles:16 ounces frozen banana leaves, thawed22 (12x18-inch) parchment paper sheets, or pastele paperAnnatto oil (recipe above)22 thin slivers jarred roasted red peppers22 (16-inch) pieces kitchen twine2 tablespoons kosher saltMake the annatto oil:Heat 1 cup vegetable oil and 3 tablespoons annatto seeds in a small saucepan over low heat until almost simmering, then turn off the heat. Let sit for 10 minutes to infuse with flavor. Strain through a fine-mesh strainer into a heatproof bowl and let cool completely. Discard the contents of the strainer.Make the filling:Cook 1 (6-ounce) can tomato paste, 2 tablespoons annatto oil, and 2 tablespoons sofrito in a Dutch oven or large pot over low heat, stirring often, until the tomato paste darkens in color and the mixture is fragrant, about 3 minutes.Increase the heat to medium. Stir in 2 pounds trimmed pork shoulder cubes until evenly coated with the tomato mixture. Stir in 6 minced large garlic cloves, 1 tablespoon garlic powder, 1 tablespoon onion powder, 1 tablespoon kosher salt, 1/2 teaspoon black pepper, and 1/4 teaspoon dried oregano. Cook until the pork begins to release its juices, 10 to 15 minutes.Stir in 1 1/2 cups water and scrape up any browned bits from the bottom of the pot. Return to a simmer. Reduce the heat to low, cover, and simmer for 30 minutes. (This is a good time to start the masa.)Stir in 1 (15-ounce) can drained and rinsed chickpeas. Cover and simmer until the pork is tender, about 1 hour more. Stir in 1/4 cup halved Spanish olives. Turn off the heat. Skim off and discard the fat from the surface. Let cool until room temperature, about 45 minutes. Meanwhile, start the masa.Start the masa:Working in 4 batches and using a combination each time, pulse the chunks of green bananas, yautia, kabocha squash, and plantain in a food processor into small pieces, then process continually into a purée. Transfer to the same large bowl after each batch. Stir in 2 tablespoons annatto oil.Assemble the pasteles:Transfer about 1/2 cup of the pork cooking liquid to the masa. Add 4 minced large garlic cloves and 2 tablespoons olive brine to the masa, and stir until combined.Prepare 16 ounces thawed frozen banana leaves: Trim the edges with kitchen shears. Wipe each leaf gently with a damp cloth or paper towel, working in the direction of the veins so as to not tear the leaf. Warm each leaf by placing it over a low gas flame, flipping often with tongs every few seconds, until the bright green color starts to dull. (If you don’t have a gas stove, place in a 250ºF oven for a few minutes.) Cut the leaves into 8x9-inch rectangles until you have 22.Assemble the pasteles one at a time: Arrange a 12x18-inch sheet of parchment paper on a work surface with a long side closer to you. Place a banana leaf on the parchment with a long side closer to you. Spread or brush about 1 teaspoon of the annatto oil onto the banana leaf into a 4x5-inch rectangle with a long side closer to you. Scoop about 1/2 cup of the masa onto the annatto oil and spread into a 3 1/2 x 6-inch rectangle with a long side closer to you. Use a slotted spoon to scoop up 2 to 3 tablespoons of the pork filling, then place down the center of the masa. Top the filling with a thin slice of roasted red pepper.Lift the top of the banana leaf up and over the filling with one hand, then hold a flexible spatula in the other hand and use it to nudge the masa over the filling. Place the top of the leaf back down. Repeat with lifting up the bottom of the banana leaf over the filling and nudging the masa. Use the spatula to make sure the masa covers the filling.Lift the bottom and top of the banana leaf up at the same time to meet in the middle over the pastele, then press them together and fold vertically down to seal in the pastele. Fold the two open ends underneath the pastele. The pastele should now be neatly wrapped up in the banana leaf.Make sure the pastele is in the center of the parchment. Repeat wrapping the pastele in parchment like you did in the banana leaf. Everything should now be neatly wrapped up in parchment.Wrap a 16-inch long piece of kitchen twine around the pastele both the long and short way (like putting ribbon on a gift), then tie a knot to hold the twine in place. Repeat assembling the remaining pasteles.Bring a large pot of water to a boil over medium-high heat. Stir in 2 tablespoons kosher salt until dissolved. Add the pasteles and boil for 45 minutes. Transfer to a strainer and drain well (hot water will be in the packages). To serve, cut and remove the kitchen twine, then unwrap and remove the parchment. Unwrap by opening up the banana leaf before eating (do not eat the leaf).Recipe NotesMake ahead: The masa can be made up to 1 day ahead and refrigerated in an airtight container. Alternatively, the assembled, uncooked pasteles can be frozen for up to 2 months. Boil frozen for 1 hour.Storage: Leftover annatto oil can be refrigerated in an airtight container for up to a few weeks. Cooked pasteles can be refrigerated (still in the banana leaf) for up to 4 days, or frozen for up to 2 months. Thaw overnight in the refrigerator. Reheat by simmering for 15 minutes.Forever CookiesMeet the cookies that'll forever change your holiday baking. From the beloved recipes our families have made for decades to clever twists on classics, these are the keepers we turn to year after year.",
  "image": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/k%2FPhoto%2FRecipes%2F2024-11-pasteles%2Fpasteles-351_1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-testid=\"ContentBundle\" data-gtm-page-title=\"Puerto Rican Pasteles\" data-gtm-page-canonical-url=\"https://www.thekitchn.com/pasteles-recipe-23695937\" data-gtm-page-path=\"/pasteles-recipe-23695937\" data-gtm-page-type=\"post\" data-gtm-page-post-id=\"23695937\" data-gtm-page-breadcrumb-root=\"Recipes\" data-gtm-page-breadcrumb-path=\"Recipes \u0026gt; What To Make With \u0026gt; Pork \u0026amp; Ham\" data-gtm-page-date-published=\"2024-11-29\" data-gtm-page-date-modified=\"2024-11-27\" data-gtm-page-author=\"Dinatalia Farina\" data-gtm-page-category=\"Recipes\" data-gtm-page-categories=\"Recipes\" data-gtm-page-tags=\"Main Dish, Recipe, SEO November 2024, Latin American, Pork \u0026amp;amp; Ham, pork, Meat, thanksgiving, christmas, autumn\" data-gtm-page-post-bundle-item-types=\"{\u0026#34;Cloudinary Image\u0026#34;:3,\u0026#34;Email Signup Block\u0026#34;:1,\u0026#34;Recipes\u0026#34;:1}\" data-gtm-page-post-content-class=\"Recipe\" data-page-path=\"/pasteles-recipe-23695937\"\u003e\u003carticle data-gtm-post-id=\"23695937\"\u003e\u003cdiv\u003e\u003cul data-testid=\"BreadcrumbTrail__breadcrumb\"\u003e\u003cli\u003e\u003ca data-gtm-trigger=\"click\" data-gtm-event-name=\"click\" data-gtm-event-category=\"site_navigation\" data-gtm-ui-component=\"breadcrumb_trail\" data-gtm-list-item-position=\"1\" data-gtm-list-item-total=\"3\" data-gtm-category=\"Navigation\" data-gtm-action=\"click: breadcrumb trail\" data-gtm-label=\"item: 1\" href=\"https://www.thekitchn.com/recipes\"\u003eRecipes\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca data-gtm-trigger=\"click\" data-gtm-event-name=\"click\" data-gtm-event-category=\"site_navigation\" data-gtm-ui-component=\"breadcrumb_trail\" data-gtm-list-item-position=\"2\" data-gtm-list-item-total=\"3\" data-gtm-category=\"Navigation\" data-gtm-action=\"click: breadcrumb trail\" data-gtm-label=\"item: 2\" href=\"https://www.thekitchn.com/collection/ingredient\"\u003eWhat To Make With\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca data-gtm-trigger=\"click\" data-gtm-event-name=\"click\" data-gtm-event-category=\"site_navigation\" data-gtm-ui-component=\"breadcrumb_trail\" data-gtm-list-item-position=\"3\" data-gtm-list-item-total=\"3\" data-gtm-category=\"Navigation\" data-gtm-action=\"click: breadcrumb trail\" data-gtm-label=\"item: 3\" href=\"https://www.thekitchn.com/collection/pork-ham\"\u003ePork \u0026amp; Ham\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003ch2\u003ePuerto Rican Pasteles\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan data-testid=\"published-label\"\u003epublished\u003c/span\u003e \u003cspan data-testid=\"published-date\"\u003eabout 4 hours ago\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cfigure data-testid=\"Figure\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7\" srcset=\"https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1456,h_1092/k%2FPhoto%2FRecipes%2F2024-11-pasteles%2Fpasteles-351_1 1456w,https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_728,h_546/k%2FPhoto%2FRecipes%2F2024-11-pasteles%2Fpasteles-351_1 728w,https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1220,h_915/k%2FPhoto%2FRecipes%2F2024-11-pasteles%2Fpasteles-351_1 1220w,https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_610,h_458/k%2FPhoto%2FRecipes%2F2024-11-pasteles%2Fpasteles-351_1 610w,https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_750,h_563/k%2FPhoto%2FRecipes%2F2024-11-pasteles%2Fpasteles-351_1 750w,https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_375,h_282/k%2FPhoto%2FRecipes%2F2024-11-pasteles%2Fpasteles-351_1 375w\" sizes=\"(min-width: 77rem) 728px,(min-width: 48rem) 610px,(min-width: 0px) 375px\" alt=\"overhead shot of a platter of pasteles and some on plates\" fetchpriority=\"auto\" data-gtm-cta-text=\"[image]\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003eCredit: Photo: Alex Lepe; Food Styling: Spencer Richards\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/div\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eUnwrapping one of these is the best gift you can give yourself.\u003c/p\u003e\u003ca placement=\"recipe-intro\" href=\"#post-recipe-718800003\"\u003e\u003cp\u003e\u003cspan\u003eMakes\u003c/span\u003e\u003cspan\u003eMakes 22 pasteles\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003ePrep\u003c/span\u003e\u003cspan\u003e4 hours\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eCook\u003c/span\u003e\u003cspan\u003e2 hours 30 minutes\u003c/span\u003e\u003c/p\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWe \u003ca href=\"https://www.thekitchn.com/about/the-kitchn-commerce-guidelines\" target=\"_blank\"\u003eindependently\u003c/a\u003e select these products—if you buy from one of our links, we may earn a commission. All prices were accurate at the time of publishing.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cfigure data-testid=\"Figure\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"overhead shot of a platter of pasteles and some on plates\" src=\"https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fit,w_730,h_548/k%2FPhoto%2FRecipes%2F2024-11-pasteles%2Fpasteles-351_1\" data-gtm-cta-text=\"[image]\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003eCredit: Photo: Alex Lepe; Food Styling: Spencer Richards\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/div\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cp\u003eSometime during the beginning of November in Puerto Rico and around the diaspora, families come together and make a party out of making pasteles, tender and savory masa stuffed with stewed pork and wrapped in a banana leaf. Typically the children are in charge of grating the root vegetables, while the adults assemble. According to Puerto Rican food historian Cruz Miguel Ortíz Cuadra, the origins of pasteles are not easily traced, but there are African roots in relation to wrapping them in banana leaves. In his book, \u003ca rel=\"noopener nofollow sponsored\" data-link-type=\"product\" data-product-id=\"TextLinkProduct:6171335920189440\" target=\"_blank\" href=\"https://www.amazon.com/Eating-Puerto-Rico-Translation-Traducci%C3%B3n/dp/1469629976?asc_campaign=KT-23695937\u0026amp;asc_refurl=https%3A%2F%2Fwww.thekitchn.com%2Fpasteles-recipe-23695937\u0026amp;asc_source=%7BREFERRAL_SOURCE%7D\u0026amp;tag=kitchn-20\" data-gtm-teaser-product-id=\"TextLinkProduct:6171335920189440\" data-gtm-teaser-product-name=\"[PLACEHOLDER NAME]\" data-gtm-teaser-product-retailers=\"Amazon\" data-gtm-teaser-product-url=\"https://www.amazon.com/Eating-Puerto-Rico-Translation-Traducci%C3%B3n/dp/1469629976\" data-gtm-product-id=\"TextLinkProduct:6171335920189440\" data-gtm-product-name=\"[PLACEHOLDER NAME]\" data-gtm-product-retailers=\"Amazon\" data-gtm-product-url=\"https://www.amazon.com/Eating-Puerto-Rico-Translation-Traducci%C3%B3n/dp/1469629976\"\u003e\u003cem\u003eEating Puerto Rico\u003c/em\u003e,\u003c/a\u003e he states, “There is no single accepted way of making pastel.” Each family makes pasteles their own way, and what’s important is coming together and spending quality time with one another around the holidays.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cp\u003eIf you’re looking for something different to bring to your \u003ca href=\"https://www.thekitchn.com/collection/thanksgiving\"\u003eThanksgiving meal\u003c/a\u003e (or \u003ca href=\"https://www.thekitchn.com/everything-you-need-to-know-about-friendsgiving-251148\"\u003eFriendsgiving gathering\u003c/a\u003e), give these pasteles a try and make it fun! I say the more the merrier when it comes to this recipe — and if you can, try to save some to freeze for later. \u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cp data-testid=\"base-html\"\u003e\u003ch2\u003eWhy You’ll Love It\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eThe filling is the best part\u003c/strong\u003e. It’s tender, succulent, and so good you could eat it all alone.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eOne bite will make you a fan. \u003c/strong\u003eWhile the recipe is a bit of an undertaking, this beloved classic is so worth it. \u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cfigure data-testid=\"Figure\"\u003e\u003cdiv\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003eCredit: Photo: Alex Lepe; Food Styling: Spencer Richards\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/div\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cp data-testid=\"base-html\"\u003e\u003ch2\u003eKey Ingredients in Pasteles\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eRoot vegetables. \u003c/strong\u003eThese are the stars of the recipe. You’ll need green bananas (also known as unripe bananas, which are not the same as plantains), yautia (or malanga or cocoyam), kabocha squash, and green plantain. The bananas should be green, and for the rest of the root vegetables, the less bruising the better.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003ePork butt or pork shoulder. \u003c/strong\u003eTruly the best cut for this recipe; it’s very tender and absorbs flavor so well.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eAnnatto oil. \u003c/strong\u003eYou will use this quite a bit, as it adds color as well as helps the masa not stick to the banana leaf.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.thekitchn.com/freezer-sofrito-tip-23433318\"\u003e\u003cstrong\u003eFresh sofrito\u003c/strong\u003e\u003c/a\u003e\u003cstrong\u003e. \u003c/strong\u003eMade with cilantro, culantro, garlic, aji peppers, and onion, this is the base for your stew. Some people will add red and green bell peppers, as well as cubanelle peppers. You can use thawed frozen sofrito in place of fresh. \u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cfigure data-testid=\"Figure\"\u003e\u003cdiv\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003eCredit: Photo: Alex Lepe; Food Styling: Spencer Richards\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/div\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cp data-testid=\"base-html\"\u003e\u003ch2\u003eHow to Make Pasteles\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003col\u003e\n\u003cli\u003e\u003cstrong\u003ePrep your banana leaves and twine.\u003c/strong\u003e Using scissors, trim your leaves and cut into rectangles. Wipe with a damp paper towel, and warm over a low gas flame (if you don’t have a gas stove, you can place them in a low oven). Cut your butcher’s twine. \u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eMake the annatto oil.\u003c/strong\u003e Heat vegetable oil and annatto seeds together until almost simmering, then let sit for 10 minutes to infuse with flavor. Strain into a heatproof bowl and let cool completely. \u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eStew your pork. \u003c/strong\u003eCook\u003cstrong\u003e \u003c/strong\u003ecubed pork with\u003cstrong\u003e \u003c/strong\u003etomato paste, annatto oil, sofrito, minced garlic, garlic power, onion powder, kosher salt, black pepper, dried oregano, and water. After simmering for 30 minutes, add chickpeas and olives. Let cool to room temperature.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eMake the masa. \u003c/strong\u003ePeel all of your root vegetables and place them into a food processor. Doing this saves so much time versus grating them by hand. Stir in some annatto oil, cooking liquid from the stewed pork, minced garlic cloves, and olive brine.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eAssemble your pasteles.\u003c/strong\u003e Brush a banana leaf with annatto oil, then spread masa followed by pork filling, and finish with a sliver of a roasted red pepper on top. Fold the banana leaf around the filling to enclose, tucking the ends underneath. Wrap the pastel in parchment or pastel paper and tie with twine.  \u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eCook the pasteles\u003c/strong\u003e. Bring a large pot of water to a boil, and stir in kosher salt until dissolved. Add the pasteles and boil for 45 minutes. To serve, cut and remove the kitchen twine, then unwrap and remove the parchment followed by the banana leaf.\u003c/li\u003e\n\u003c/ol\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cp data-testid=\"base-html\"\u003e\u003ch2\u003eHelpful Swaps \u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cul\u003e\n\u003cli\u003eYou can use 2 1/4 teaspoons of \u003ca href=\"https://www.amazon.com/Loisa-SALT-FREE-Seasoning-Preservatives-Artificial/dp/B09QQV5WTK/?asc_campaign=KT-23695937\u0026amp;asc_refurl=https%3A%2F%2Fwww.thekitchn.com%2Fpasteles-recipe-23695937\u0026amp;asc_source=%7BREFERRAL_SOURCE%7D\u0026amp;tag=kitchn-20\" data-product-id=\"TextLinkProduct:5624116519370752\" data-link-type=\"product\" rel=\"noopener nofollow sponsored\" target=\"_blank\" data-gtm-teaser-product-id=\"TextLinkProduct:5624116519370752\" data-gtm-teaser-product-name=\"[PLACEHOLDER NAME]\" data-gtm-teaser-product-retailers=\"Amazon\" data-gtm-teaser-product-url=\"https://www.amazon.com/Loisa-SALT-FREE-Seasoning-Preservatives-Artificial/dp/B09QQV5WTK/\" data-gtm-product-id=\"TextLinkProduct:5624116519370752\" data-gtm-product-name=\"[PLACEHOLDER NAME]\" data-gtm-product-retailers=\"Amazon\" data-gtm-product-url=\"https://www.amazon.com/Loisa-SALT-FREE-Seasoning-Preservatives-Artificial/dp/B09QQV5WTK/\"\u003esalt-free adobo seasoning\u003c/a\u003e in place of the garlic powder, onion powder, and dried oregano in the filling.\u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cp data-testid=\"base-html\"\u003e\u003ch2\u003eStorage and Make-Ahead Tips \u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cul\u003e\n\u003cli\u003eThe pork filling, masa, and annatto oil can be made a day or two in advance. \u003c/li\u003e\n\n\n\n\u003cli\u003eAssembled, uncooked pasteles can be frozen for up to 2 months. Boil frozen for 1 hour.\u003c/li\u003e\n\n\n\n\u003cli\u003eCooked pasteles can be refrigerated (still in the banana leaf) for up to 4 days, or frozen for up to 2 months. Thaw overnight in the refrigerator. Reheat by simmering for 15 minutes\u003cstrong\u003e.\u003c/strong\u003e\u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cp data-testid=\"base-html\"\u003e\u003ch2\u003eWhat to Serve with Pasteles\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"Post__item\"\u003e\u003cp\u003eYou can top your pastel with ketchup or pique, a vinegar-based hot sauce commonly eaten in Puerto Rico. Pique usually contains peppercorns, whole garlic cloves, culantro, aji caballero, bay leaves, vinegar, and water.\u003cstrong\u003e \u003c/strong\u003eAlthough you can eat them alone, pasteles are usually served with some of the dishes below during holiday meals. \u003c/p\u003e\u003c/div\u003e\u003cdiv data-porkchop-id=\"718800003\" data-testid=\"Post__item\" id=\"post-recipe-718800003\"\u003e\u003cp\u003e\u003ca href=\"#comments-23695937\" data-gtm-placement=\"recipe\" data-gtm-social-network=\"community\"\u003eComments\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eUnwrapping one of these is the best gift you can give yourself.\u003c/p\u003e\u003cdiv data-testid=\"RecipeNutritionalGuide\"\u003e\u003ch4\u003eNutritional Info\u003c/h4\u003e\u003c/div\u003e\u003csection\u003e\u003ch3\u003eIngredients\u003c/h3\u003e\u003cdiv\u003e\u003cdiv\u003e\u003ch4 data-testid=\"group-name\"\u003eFor the annatto oil:\u003c/h4\u003e\u003cul\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e1 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003ecup \u003c/span\u003e\u003cspan\u003e\u003cp\u003evegetable oil\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e3 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003etablespoons \u003c/span\u003e\u003cspan\u003e\u003cp\u003eannatto seeds\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch4 data-testid=\"group-name\"\u003eFor the filling:\u003c/h4\u003e\u003cul\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e1 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003e\u003cp\u003e(6-ounce) can tomato paste\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e2 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003etablespoons \u003c/span\u003e\u003cspan\u003e\u003cp\u003eannatto oil (recipe above)\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e2 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003etablespoons \u003c/span\u003e\u003cspan\u003e\u003cp\u003e\u003cu\u003e\u003ca href=\"https://www.thekitchn.com/freezer-sofrito-tip-23433318\"\u003efresh sofrito\u003c/a\u003e\u003c/u\u003e or thawed frozen sofrito\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e2 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003epounds \u003c/span\u003e\u003cspan\u003e\u003cp\u003eboneless pork butt or pork shoulder, trimmed of excess fat and cut into 1-inch cubes\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e6 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003e\u003cp\u003elarge cloves garlic, minced\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e1 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003etablespoon \u003c/span\u003e\u003cspan\u003e\u003cp\u003egarlic powder\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e1 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003etablespoon \u003c/span\u003e\u003cspan\u003e\u003cp\u003eonion powder\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e1 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003etablespoon \u003c/span\u003e\u003cspan\u003e\u003cp\u003ekosher salt\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e1/2 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003eteaspoon \u003c/span\u003e\u003cspan\u003e\u003cp\u003efreshly ground black pepper\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e1/4 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003eteaspoon \u003c/span\u003e\u003cspan\u003e\u003cp\u003edried oregano\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e1 1/2 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003ecups \u003c/span\u003e\u003cspan\u003e\u003cp\u003ewater\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e1 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003e\u003cp\u003e(15-ounce) can chickpeas, drained and rinsed\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e1/4 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003ecup \u003c/span\u003e\u003cspan\u003e\u003cp\u003estuffed Spanish manzanilla olives (no pits), halved\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch4 data-testid=\"group-name\"\u003e For the masa:\u003c/h4\u003e\u003cul\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e5 to 6 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003epounds \u003c/span\u003e\u003cspan\u003e\u003cp\u003egreen bananas (guineos, 2 bunches), peeled and cut into 1-inch chunks\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e2 to 3 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003epounds \u003c/span\u003e\u003cspan\u003e\u003cp\u003eyautia, malanga, or cocoyam, peeled and cut into 1-inch chunks\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e2 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003epounds \u003c/span\u003e\u003cspan\u003e\u003cp\u003ekabocha squash (calabaza, about 1/2 medium), peeled and cut into 1-inch chunks\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e1 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003e\u003cp\u003emedium green plantain (6 to 10 ounces), peeled and cut into 1-inch chunks\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e2 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003etablespoons \u003c/span\u003e\u003cspan\u003e\u003cp\u003eannatto oil (recipe above)\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e4 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003e\u003cp\u003elarge cloves garlic, minced\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e2 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003etablespoons \u003c/span\u003e\u003cspan\u003e\u003cp\u003eolive brine (from the stuffed Spanish olives in the filling)\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e\u003cspan\u003e\u003cp\u003eKosher salt\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch4 data-testid=\"group-name\"\u003eFor assembling and cooking the pasteles:\u003c/h4\u003e\u003cul\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e16 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003eounces \u003c/span\u003e\u003cspan\u003e\u003cp\u003efrozen banana leaves, thawed\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e22 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003e\u003cp\u003e(12x18-inch) parchment paper sheets, or pastele paper\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e\u003cspan\u003e\u003cp\u003eAnnatto oil (recipe above)\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e22 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003e\u003cp\u003ethin slivers jarred roasted red peppers\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e22 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003e\u003cp\u003e(16-inch) pieces kitchen twine\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003cli data-testid=\"ingredient\"\u003e\u003cspan\u003e2 \u003c/span\u003e\u003cspan\u003e\u003cspan\u003etablespoons \u003c/span\u003e\u003cspan\u003e\u003cp\u003ekosher salt\u003c/p\u003e\u003c/span\u003e\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/section\u003e\u003cdiv\u003e\u003cdiv data-testid=\"Recipe__instructionsGroup\"\u003e\u003ch4\u003eMake the annatto oil:\u003c/h4\u003e\u003col\u003e\u003cli data-testid=\"Recipe__instructionStep\"\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eHeat 1 cup vegetable oil and 3 tablespoons annatto seeds in a small saucepan over low heat until almost simmering, then turn off the heat. Let sit for 10 minutes to infuse with flavor. Strain through a fine-mesh strainer into a heatproof bowl and let cool completely. Discard the contents of the strainer.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ol\u003e\u003c/div\u003e\u003cdiv data-testid=\"Recipe__instructionsGroup\"\u003e\u003ch4\u003eMake the filling:\u003c/h4\u003e\u003col\u003e\u003cli data-testid=\"Recipe__instructionStep\"\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eCook 1 (6-ounce) can tomato paste, 2 tablespoons annatto oil, and 2 tablespoons sofrito in a Dutch oven or large pot over low heat, stirring often, until the tomato paste darkens in color and the mixture is fragrant, about 3 minutes.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli data-testid=\"Recipe__instructionStep\"\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eIncrease the heat to medium. Stir in 2 pounds trimmed pork shoulder cubes until evenly coated with the tomato mixture. Stir in 6 minced large garlic cloves, 1 tablespoon garlic powder, 1 tablespoon onion powder, 1 tablespoon kosher salt, 1/2 teaspoon black pepper, and 1/4 teaspoon dried oregano. Cook until the pork begins to release its juices, 10 to 15 minutes.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli data-testid=\"Recipe__instructionStep\"\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eStir in 1 1/2 cups water and scrape up any browned bits from the bottom of the pot. Return to a simmer. Reduce the heat to low, cover, and simmer for 30 minutes. (This is a good time to start the masa.)\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli data-testid=\"Recipe__instructionStep\"\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eStir in 1 (15-ounce) can drained and rinsed chickpeas. Cover and simmer until the pork is tender, about 1 hour more. Stir in 1/4 cup halved Spanish olives. Turn off the heat. Skim off and discard the fat from the surface. Let cool until room temperature, about 45 minutes. Meanwhile, start the masa.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ol\u003e\u003c/div\u003e\u003cdiv data-testid=\"Recipe__instructionsGroup\"\u003e\u003ch4\u003eStart the masa:\u003c/h4\u003e\u003col\u003e\u003cli data-testid=\"Recipe__instructionStep\"\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eWorking in 4 batches and using a combination each time, pulse the chunks of green bananas, yautia, kabocha squash, and plantain in a food processor into small pieces, then process continually into a purée. Transfer to the same large bowl after each batch. Stir in 2 tablespoons annatto oil.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ol\u003e\u003c/div\u003e\u003cdiv data-testid=\"Recipe__instructionsGroup\"\u003e\u003ch4\u003eAssemble the pasteles:\u003c/h4\u003e\u003col\u003e\u003cli data-testid=\"Recipe__instructionStep\"\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eTransfer about 1/2 cup of the pork cooking liquid to the masa. Add 4 minced large garlic cloves and 2 tablespoons olive brine to the masa, and stir until combined.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli data-testid=\"Recipe__instructionStep\"\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003ePrepare 16 ounces thawed frozen banana leaves: Trim the edges with kitchen shears. Wipe each leaf gently with a damp cloth or paper towel, working in the direction of the veins so as to not tear the leaf. Warm each leaf by placing it over a low gas flame, flipping often with tongs every few seconds, until the bright green color starts to dull. (If you don’t have a gas stove, place in a 250ºF oven for a few minutes.) Cut the leaves into 8x9-inch rectangles until you have 22.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli data-testid=\"Recipe__instructionStep\"\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eAssemble the pasteles one at a time: Arrange a 12x18-inch sheet of parchment paper on a work surface with a long side closer to you. Place a banana leaf on the parchment with a long side closer to you. Spread or brush about 1 teaspoon of the annatto oil onto the banana leaf into a 4x5-inch rectangle with a long side closer to you. Scoop about 1/2 cup of the masa onto the annatto oil and spread into a 3 1/2 x 6-inch rectangle with a long side closer to you. Use a slotted spoon to scoop up 2 to 3 tablespoons of the pork filling, then place down the center of the masa. Top the filling with a thin slice of roasted red pepper.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli data-testid=\"Recipe__instructionStep\"\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eLift the top of the banana leaf up and over the filling with one hand, then hold a flexible spatula in the other hand and use it to nudge the masa over the filling. Place the top of the leaf back down. Repeat with lifting up the bottom of the banana leaf over the filling and nudging the masa. Use the spatula to make sure the masa covers the filling.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli data-testid=\"Recipe__instructionStep\"\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eLift the bottom and top of the banana leaf up at the same time to meet in the middle over the pastele, then press them together and fold vertically down to seal in the pastele. Fold the two open ends underneath the pastele. The pastele should now be neatly wrapped up in the banana leaf.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli data-testid=\"Recipe__instructionStep\"\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eMake sure the pastele is in the center of the parchment. Repeat wrapping the pastele in parchment like you did in the banana leaf. Everything should now be neatly wrapped up in parchment.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli data-testid=\"Recipe__instructionStep\"\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eWrap a 16-inch long piece of kitchen twine around the pastele both the long and short way (like putting ribbon on a gift), then tie a knot to hold the twine in place. Repeat assembling the remaining pasteles.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli data-testid=\"Recipe__instructionStep\"\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eBring a large pot of water to a boil over medium-high heat. Stir in 2 tablespoons kosher salt until dissolved. Add the pasteles and boil for 45 minutes. Transfer to a strainer and drain well (hot water will be in the packages). To serve, cut and remove the kitchen twine, then unwrap and remove the parchment. Unwrap by opening up the banana leaf before eating (do not eat the leaf).\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ol\u003e\u003c/div\u003e\u003c/div\u003e\u003csection\u003e\u003ch3\u003eRecipe Notes\u003c/h3\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eMake ahead: \u003c/strong\u003eThe masa can be made up to 1 day ahead and refrigerated in an airtight container. Alternatively, the assembled, uncooked pasteles can be frozen for up to 2 months. Boil frozen for 1 hour.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eStorage:\u003c/strong\u003e Leftover annatto oil can be refrigerated in an airtight container for up to a few weeks. Cooked pasteles can be refrigerated (still in the banana leaf) for up to 4 days, or frozen for up to 2 months. Thaw overnight in the refrigerator. Reheat by simmering for 15 minutes\u003cstrong\u003e.\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e\u003c/div\u003e\u003csection data-testid=\"Post__item\"\u003e\u003ch2\u003eForever Cookies\u003c/h2\u003e\u003cp\u003eMeet the cookies that\u0026#39;ll forever change your holiday baking. From the beloved recipes our families have made for decades to clever twists on classics, these are the keepers we turn to year after year.\u003c/p\u003e\u003c/section\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": null,
  "modifiedTime": null
}
