{
  "id": "33bbf58b-a1a7-45a3-878f-574474554712",
  "title": "25 of My Current Home Favorites.",
  "link": "https://www.howsweeteats.com/2025/02/25-of-my-current-home-favorites/",
  "description": "Today we’re talking home favorites!! Now that we’ve been in our new home for over a year, I’m sharing some of the things I have, love and/or use daily (or multiple times a day!). I LOVE seeing posts like this from others, especially when it comes to home/cleaning/functional/useful items that are worth it. I try […] The post 25 of My Current Home Favorites. appeared first on How Sweet Eats.",
  "author": "Jessica",
  "published": "Thu, 20 Feb 2025 10:30:39 +0000",
  "source": "https://www.howsweeteats.com/feed/",
  "categories": [
    "Crumbs",
    "Favorites"
  ],
  "byline": "Jessica",
  "length": 7342,
  "excerpt": "Today we’re talking home favorites!! Now that we’ve been in our new home for over a year, I’m sharing some of the things I have, love and/or use daily (or multiple times a day!). I LOVE seeing posts like this from others, especially when it comes to home/cleaning/functional/useful items that are worth it. I try […]",
  "siteName": "How Sweet Eats",
  "favicon": "https://www.howsweeteats.com/wp-content/themes/howsweeteats2020/favicon/apple-touch-icon.png",
  "text": "Today we’re talking home favorites!! Now that we’ve been in our new home for over a year, I’m sharing some of the things I have, love and/or use daily (or multiple times a day!). I LOVE seeing posts like this from others, especially when it comes to home/cleaning/functional/useful items that are worth it. I try a ton of things that aren’t worth it at all (hello, shark steam mops), but these are a few of the things that are must haves in our house. Almost everything on this list is something I bought well over a year ago (or more!) so it’s been used over and over. Current Home Favorites House of Noa kitchen mats. I bought four of these when we moved in. I LOVE THEM. They are so incredibly squishy and so pretty. I have two in my kitchen and two in my pantry. They are excellent standing mats and everyone comments on how great they feel. They are super easy to keep clean too. I love how they add something extra to the kitchen without being a rug that I constantly have to pick up and move. Our Place Titanium Always Pan Pro. This is my current favorite pan. So easy to use. Super simple, easy to clean, lasts and is high quality. Our Place Perfect Pot. I use this pot at least once every single day. It is so lightweight and just EASY to use. Now, of course I use my le creuset and staub a ton as well. But when it comes to moving easily through the kitchen, quickly for weeknight meals, etc – this is my go to. I have three of them. I love them! Souper Cubes freezing molds. I freeze soup constantly, mostly for myself for lunches. I love how the portions are perfect and so easy to thaw. This is one thing I use easily every single week. Glisten garbage disposal cleaner. Funny, but necessary. I use this every week to clean my garbage disposal. I love it! Yes, I use the lemon/salt trick sometimes too. But I use this without fail every week and it’s excellent. Divided snack box. A year later, I still use this constantly. I’m not sure why it makes my kids want to eat all the things, but it’s foolproof. I pack it up for activities and it’s great. Sometimes it’s just snacks, sometimes it’s full of dinner. Flat USB-C multi charger. This is an excellent charger if you have multiple phones, ipads, etc – and want it to look sleek too. Wireless charging stand dock. This is the charger that I have on my nightstand that I LOVE. The fact that the phone sits up and I can see the time, etc – it’s perfect. Also, I never lose my airpods now. Refrigerator Deodorizer. This is so much easier than throwing a new box of baking soda in the fridge every month. It lasts! Crevice cleaning brush. I don’t know how I lived so long without this. All the corners near my oven – done. This cleans SO many tiny spaces in my kitchen that it is a miracle. Under bathroom sink organizers. Finding these for under my sink gave us SO much more space. Basically allowing two layers of storage has been a game changer. Eureka Rapidclean Pro. Okay, you’re going to think I’m a vacuum psycho. And I am. This is the small stick vacuum that lives in my kitchen for crumbs. I’ve used this for a million years. I use this multiple times a day. I cannot live without it. It is so easy and simple and the kids can use it too. It’s not for regular full on vacuuming – but the crumbs, yes! And with kids… that’s all day. Tineco iFloor 3 Breeze. Next up, you’ve heard me rave about this for a year now. This cleans my floors like no other. This vacuum mop gets my floors SO clean – it’s so satisfying and easy to use. I have used it daily before. Totally worth it and I love it. Tineco Floor One S7. I bought this tineco for my first floor because it’s mostly bare floor. I needed a bigger water tank + battery life. It is equally as great as the one above, just lasts longer while vac mopping before I have to switch things, clean and refill. I do the self clean on these EVERY time I use them and take excellent care of them, and they are just as good as when I first bought them. Mattress vacuum cleaner. I love using this even more than I thought. I probably use it once a month. Again, I can’t believe how long I went without using something like this. Bissel little green upholstery cleaner. And finally, another “sort of” vacuum. Check this box of what I didn’t know I would need with kids. This is a miracle worked and cleans furniture and carpet so, so, so well. It’s small and easy to store in a closet and even easier to use. It’s SO gross to see what it brings up, but um… necessary. Method citron all-purpose cleaner. This is a funny one, but I LOVE the scent of this cleaner. It’s like a lemon + pine sol + super clean scent and I can’t get enough. Everyday (multiple times a day!) when I use this, I just love how fresh and clean the kitchen smells. Gianna glass dish with lid. This is something I always have out that is SO pretty – you can fill it with snacks, candy, decor, it is just so nice to look at! I’ve also gifted quite a few of these too. Glass snack bowls with marble. These are the two little bowls I put out the most for easy entertaining, last minute snacks, etc. Even a small snack before dinner. They are really pretty and easy to clean! Fabric shaver. Nothing is more satisfying. Perfect for sweaters but I use this the most on furniture!! Makes our linen couch look brand new. Lola blankets. I sound like a broken record, but these are by far our favorite blankets and I have gifted so many. I have tried many of the other similar ones (cozy earth, anthro, etc) and NONE of them compare. The lola ones are just so stretchy, but soft, but light, but warm at the same time. I don’t know how they do it. Gorilla grip bathmats. We have these in our bathrooms and love them. Very easy to clean, which is key! Sleep Crown classic pillow. I’ve had my sleep crown pillow now for two years and I can’t sleep without it. I don’t use it as intended – I don’t put it on my face. But I sleep ON it. If you have ever struggled with neck/tension issues and sleeping, this may change your life. I got one for my mom too and she is blown away. It is so incredibly comfortable to sleep on. I can’t recommend it enough! Canopy humidifiers. We started using humidifiers in all of our bedrooms when Emilia was 6 months old. Meaning that I have used one in my room for seven years now! I can’t sleep without it. We went through multiple crane ones, even the dyson one years ago. Then in 2023 I bought the canopy ones. I like that you can put them in the dishwasher and that the filter gets changed every few weeks or so. It’s been our go-to for so long now that I can’t imagine changing. I have the filters on auto-ship and it’s just super easy! Air Doctor air purifiers. When we moved in, I knew I wanted a few air purifiers because it was new construction and we still had some going on in our basement. We’ve had a few of these around the house since 2023 and they work great! So easy to change and definitely seem to make a difference. LG Stand by Me TV. Finally, this is a ridiculous item but I must express how much we love it. I looked at this for over a year before taking the plunge and ordering it. This moves anywhere with you, which is amazing if you need to use it for the kids, want to clean/work somewhere and would like a screen… I love it. A total luxury but one that is well worth it! (not sponsored, purchased everything myself!)",
  "image": "https://www.howsweeteats.com/wp-content/uploads/2025/02/home-faves.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://www.howsweeteats.com/wp-content/uploads/2025/02/home-faves.png\" alt=\"home favorites\" width=\"800\" height=\"1200\" data-jpibfi-post-excerpt=\"\" data-jpibfi-post-url=\"https://www.howsweeteats.com/2025/02/25-of-my-current-home-favorites/\" data-jpibfi-post-title=\"25 of My Current Home Favorites.\" data-jpibfi-src=\"https://www.howsweeteats.com/wp-content/uploads/2025/02/home-faves.png\" srcset=\"https://www.howsweeteats.com/wp-content/uploads/2025/02/home-faves.png 800w, https://www.howsweeteats.com/wp-content/uploads/2025/02/home-faves-728x1092.png 728w, https://www.howsweeteats.com/wp-content/uploads/2025/02/home-faves-768x1152.png 768w, https://www.howsweeteats.com/wp-content/uploads/2025/02/home-faves-150x225.png 150w\" sizes=\"(max-width: 800px) 100vw, 800px\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%20800%201200\u0026#39;%3E%3C/svg%3E\" data-lazy-srcset=\"https://www.howsweeteats.com/wp-content/uploads/2025/02/home-faves.png 800w, https://www.howsweeteats.com/wp-content/uploads/2025/02/home-faves-728x1092.png 728w, https://www.howsweeteats.com/wp-content/uploads/2025/02/home-faves-768x1152.png 768w, https://www.howsweeteats.com/wp-content/uploads/2025/02/home-faves-150x225.png 150w\" data-lazy-src=\"https://www.howsweeteats.com/wp-content/uploads/2025/02/home-faves.png\"/\u003e\u003c/p\u003e\n\u003cp\u003eToday we’re talking home favorites!!\u003c/p\u003e\n\u003cp\u003eNow that we’ve been in our new home for over a year, I’m sharing some of the things I have, love and/or use daily (or multiple times a day!). I LOVE seeing posts like this from others, especially when it comes to home/cleaning/functional/useful items that are worth it. I try a ton of things that aren’t worth it at all (hello, shark steam mops), but these are a few of the things that are must haves in our house. Almost everything on this list is something I bought well over a year ago (or more!) so it’s been used over and over.\u003c/p\u003e\n\u003ch2\u003eCurrent Home Favorites\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"https://bit.ly/3EKQttO\" target=\"_blank\" rel=\"noopener\"\u003eHouse of Noa kitchen mats\u003c/a\u003e. I bought four of these when we moved in. I LOVE THEM. They are so incredibly squishy and so pretty. I have two in my kitchen and two in my pantry. They are excellent standing mats and everyone comments on how great they feel. They are super easy to keep clean too. I love how they add something extra to the kitchen without being a rug that I constantly have to pick up and move.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/4k4Vz4g\" target=\"_blank\" rel=\"noopener\"\u003eOur Place Titanium Always Pan Pro\u003c/a\u003e. This is my current favorite pan. So easy to use. Super simple, easy to clean, lasts and is high quality.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://bit.ly/4jYAybk\" target=\"_blank\" rel=\"noopener\"\u003eOur Place Perfect Pot\u003c/a\u003e. I use this pot at least once every single day. It is so lightweight and just EASY to use. Now, of course I use my le creuset and staub a ton as well. But when it comes to moving easily through the kitchen, quickly for weeknight meals, etc – this is my go to. I have three of them. I love them!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/4beYnb6\" target=\"_blank\" rel=\"noopener\"\u003eSouper Cubes freezing molds\u003c/a\u003e. I freeze soup constantly, mostly for myself for lunches. I love how the portions are perfect and so easy to thaw. This is one thing I use easily every single week.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/3CKk0TW\" target=\"_blank\" rel=\"noopener\"\u003eGlisten garbage disposal cleaner\u003c/a\u003e. Funny, but necessary. I use this every week to clean my garbage disposal. I love it! Yes, I use the lemon/salt trick sometimes too. But I use this without fail every week and it’s excellent.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/3Xa4J5z\" target=\"_blank\" rel=\"noopener\"\u003eDivided snack box\u003c/a\u003e. A year later, I still use this constantly. I’m not sure why it makes my kids want to eat all the things, but it’s foolproof. I pack it up for activities and it’s great. Sometimes it’s just snacks, sometimes it’s full of dinner.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/41o6jn8\" target=\"_blank\" rel=\"noopener\"\u003eFlat USB-C multi charger\u003c/a\u003e. This is an excellent charger if you have multiple phones, ipads, etc – and want it to look sleek too.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/4b9oQa3\" target=\"_blank\" rel=\"noopener\"\u003eWireless charging stand dock\u003c/a\u003e. This is the charger that I have on my nightstand that I LOVE. The fact that the phone sits up and I can see the time, etc – it’s perfect. Also, I never lose my airpods now.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/41lLxnP\" target=\"_blank\" rel=\"noopener\"\u003eRefrigerator Deodorizer\u003c/a\u003e. This is so much easier than throwing a new box of baking soda in the fridge every month. It lasts!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/3EIg3zr\" target=\"_blank\" rel=\"noopener\"\u003eCrevice cleaning brush\u003c/a\u003e. I don’t know how I lived so long without this. All the corners near my oven – done. This cleans SO many tiny spaces in my kitchen that it is a miracle.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/3EMfzZe\" target=\"_blank\" rel=\"noopener\"\u003eUnder bathroom sink organizers\u003c/a\u003e. Finding these for under my sink gave us SO much more space. Basically allowing two layers of storage has been a game changer.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/412kWep\" target=\"_blank\" rel=\"noopener\"\u003eEureka Rapidclean Pro\u003c/a\u003e. Okay, you’re going to think I’m a vacuum psycho. And I am. This is the small stick vacuum that lives in my kitchen for crumbs. I’ve used this for a million years. I use this multiple times a day. I cannot live without it. It is so easy and simple and the kids can use it too. It’s not for regular full on vacuuming – but the crumbs, yes! And with kids… that’s all day.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/4gQGyQy\" target=\"_blank\" rel=\"noopener\"\u003eTineco iFloor 3 Breeze\u003c/a\u003e. Next up, you’ve heard me rave about this for a year now. This cleans my floors like no other. This vacuum mop gets my floors SO clean – it’s so satisfying and easy to use. I have used it daily before. Totally worth it and I love it.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/414Rjcg\" target=\"_blank\" rel=\"noopener\"\u003eTineco Floor One S7\u003c/a\u003e. I bought this tineco for my first floor because it’s mostly bare floor. I needed a bigger water tank + battery life. It is equally as great as the one above, just lasts longer while vac mopping before I have to switch things, clean and refill. I do the self clean on these EVERY time I use them and take excellent care of them, and they are just as good as when I first bought them.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/3X2W5Wn\" target=\"_blank\" rel=\"noopener\"\u003eMattress vacuum cleaner\u003c/a\u003e. I love using this even more than I thought. I probably use it once a month. Again, I can’t believe how long I went without using something like this.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/3CY2wDs\" target=\"_blank\" rel=\"noopener\"\u003eBissel little green upholstery cleaner\u003c/a\u003e. And finally, another “sort of” vacuum. Check this box of what I didn’t know I would need with kids. This is a miracle worked and cleans furniture and carpet so, so, so well. It’s small and easy to store in a closet and even easier to use. It’s SO gross to see what it brings up, but um… necessary.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/3CNvXbr\" target=\"_blank\" rel=\"noopener\"\u003eMethod citron all-purpose cleaner\u003c/a\u003e. This is a funny one, but I LOVE the scent of this cleaner. It’s like a lemon + pine sol + super clean scent and I can’t get enough. Everyday (multiple times a day!) when I use this, I just love how fresh and clean the kitchen smells.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://bit.ly/3QqUC8P\" target=\"_blank\" rel=\"noopener\"\u003eGianna glass dish with lid\u003c/a\u003e. This is something I always have out that is SO pretty – you can fill it with snacks, candy, decor, it is just so nice to look at! I’ve also gifted quite a few of these too.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://bit.ly/4i32zgc\" target=\"_blank\" rel=\"noopener\"\u003eGlass snack bowls with marble\u003c/a\u003e. These are the two little bowls I put out the most for easy entertaining, last minute snacks, etc. Even a small snack before dinner. They are really pretty and easy to clean!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/4i7Dgd1\" target=\"_blank\" rel=\"noopener\"\u003eFabric shaver\u003c/a\u003e. Nothing is more satisfying. Perfect for sweaters but I use this the most on furniture!! Makes our linen couch look brand new.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://bit.ly/414mRPE\" target=\"_blank\" rel=\"noopener\"\u003eLola blankets\u003c/a\u003e. I sound like a broken record, but these are by far our favorite blankets and I have gifted so many. I have tried many of the other similar ones (cozy earth, anthro, etc) and NONE of them compare. The lola ones are just so stretchy, but soft, but light, but warm at the same time. I don’t know how they do it.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/4gRlY2F\" target=\"_blank\" rel=\"noopener\"\u003eGorilla grip bathmats\u003c/a\u003e. We have these in our bathrooms and love them. Very easy to clean, which is key!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.sleepcrown.com/online-store/Sleep-Crown-Classic-p91750460\" target=\"_blank\" rel=\"noopener\"\u003eSleep Crown classic pillow\u003c/a\u003e. I’ve had my sleep crown pillow now for two years and I can’t sleep without it. I don’t use it as intended – I don’t put it on my face. But I sleep ON it. If you have ever struggled with neck/tension issues and sleeping, this may change your life. I got one for my mom too and she is blown away. It is so incredibly comfortable to sleep on. I can’t recommend it enough!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/4hICm6F\" target=\"_blank\" rel=\"noopener\"\u003eCanopy humidifiers\u003c/a\u003e. We started using humidifiers in all of our bedrooms when Emilia was 6 months old. Meaning that I have used one in my room for seven years now! I can’t sleep without it. We went through multiple crane ones, even the dyson one years ago. Then in 2023 I bought the canopy ones. I like that you can put them in the dishwasher and that the filter gets changed every few weeks or so. It’s been our go-to for so long now that I can’t imagine changing. I have the filters on auto-ship and it’s just super easy!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/4khxyqS\" target=\"_blank\" rel=\"noopener\"\u003eAir Doctor air purifiers\u003c/a\u003e. When we moved in, I knew I wanted a few air purifiers because it was new construction and we still had some going on in our basement. We’ve had a few of these around the house since 2023 and they work great! So easy to change and definitely seem to make a difference.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://amzn.to/3Xbjwgj\" target=\"_blank\" rel=\"noopener\"\u003eLG Stand by Me TV\u003c/a\u003e. Finally, this is a ridiculous item but I must express how much we love it. I looked at this for over a year before taking the plunge and ordering it. This moves anywhere with you, which is amazing if you need to use it for the kids, want to clean/work somewhere and would like a screen… I love it. A total luxury but one that is well worth it!\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e(not sponsored, purchased everything myself!) \u003c/em\u003e\u003c/p\u003e\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-02-20T10:30:39Z",
  "modifiedTime": null
}
