{
  "id": "3c9c01dc-22f2-43d6-aed7-524d57f61ede",
  "title": "18 Hands-Off Slow Cooker Recipes For the Big Game",
  "link": "https://food52.com/blog/28656-slow-cooker-super-bowl-recipes",
  "description": "Even if you don’t know a first-down from a fumble, you can still enjoy Super Bowl Sunday for what we think is its best part of the day: the food. And what’s better than a lineup of slow-cooker recipes that practically cook themselves while you stay glued to the screen—whether for the game, the commercials, or a Taylor Swift cameo? We’ve rounded up our best slow-cooker recipes for a crowd, from fall-off-the-bone ribs and smoky pulled pork to queso, chili, and even a deep dish chocolate chip cookie. These hands-off game-day appetizers and snacks make hosting and potluck appearances breeze. Simply set, forget, and serve. With these 18 recipes, even if your team doesn’t win, your spread will. From Our Shop GreenPan Ceramic Nonstick 6-Quart Slow Cooker $250 More Colors Staub Induction Multi-Cooker $40–$250 More Options Sale! Staub Multi-Use Braiser With Lid, 3.5QT $359.99–$471 $179.99–$379.99 More Options 1. Slow Cooker Honey BBQ Ribs Sticky, sweet, and fall-off-the-bone tender, these ribs do all the work while you kick back. Read More \u003e\u003e",
  "author": "Julia Youman",
  "published": "Thu, 30 Jan 2025 10:59:54 -0500",
  "source": "http://feeds.feedburner.com/food52-TheAandMBlog",
  "categories": [
    "What to Cook",
    "Super Bowl",
    "Game Day",
    "Slow Cooker",
    "Low \u0026 Slow",
    "Instant Pot",
    "Chili",
    "Chicken",
    "Pork",
    "Pork Tenderloin",
    "Backyard BBQ",
    "Potluck",
    "Party"
  ],
  "byline": "Julia Youman",
  "length": 5324,
  "excerpt": "These slow-cooker Super Bowl recipes, from chili to queso, make game-day hosting easy—just set, forget, and enjoy the party.",
  "siteName": "Food52",
  "favicon": "https://food52.com/assets/apple-touch-icon/180x180-4f0fc96f9ea242e3851f664c372adcd208dcae1d81b182add1cc5695bf192f57.png",
  "text": "Even if you don’t know a first-down from a fumble, you can still enjoy Super Bowl Sunday for what we think is its best part of the day: the food. And what’s better than a lineup of slow-cooker recipes that practically cook themselves while you stay glued to the screen—whether for the game, the commercials, or a Taylor Swift cameo? We’ve rounded up our best slow-cooker recipes for a crowd, from fall-off-the-bone ribs and smoky pulled pork to queso, chili, and even a deep dish chocolate chip cookie. These hands-off game-day appetizers and snacks make hosting and potluck appearances breeze. Simply set, forget, and serve. With these 18 recipes, even if your team doesn’t win, your spread will. 1. Slow Cooker Honey BBQ Ribs Sticky, sweet, and fall-off-the-bone tender, these ribs do all the work while you kick back. 2. Slow Cooker Bourbon BBQ Wings These wings are all about deep, smoky sweetness, thanks to a bourbon-spiked BBQ sauce that gets even better as it simmers. 3. Grape Jelly Meatballs The retro party classic that never misses (don’t knock it till you try it) —these meatballs are tangy, sweet, and so easy that you might start making them year-round. 4. Slow Cooker Carolina BBQ Pulled Pork Low and slow is the secret to this ultra-tender pork, packed with vinegar-based Carolina BBQ tang in every bite. Add it to sandwiches, bowls, soups, or basically any dish at the party. 5. Slow Cooker Chocolate Chip Cookie Because dessert should be just as effortless, this giant cookie stays soft in the center and crispy at the edges, with pockets of gooey chocolate throughout. We wouldn’t say no to a scoop of ice cream either while we wait for it to cool down. 6. Brown Sugar \u0026 Balsamic Glaze Pork Shoulder Savory, sweet, and deeply caramelized, this pork shoulder takes on rich balsamic glaze as it slow-cooks to perfection. 7. Slow Cooker Shrimp Boil A fitting New Orleans staple, this shrimp boil achieves all the classic flavors without the fuss of a giant stockpot. It’s the perfect mix of smoky sausage, sweet corn, and Old Bay-seasoned shrimp. 8. Texas Queso Creamy, spicy, and packed with some Tex-Mex flair, this queso is the ultimate dip for chips, wings, or even just a spoon. 9. Instant Pot Chili A deep, smoky chili that’s ready in record time if you have an Instant Pot. But, don’t worry, there’s also a slow cooker variation for an even more hands-off approach. 10. Martha Stewart’s Braised Pork Shoulder Martha-approved and packed with Italian-inspired flavors, this fork-tender pork shoulder is perfect over polenta or piled into sandwiches. 11. Slow Cooker Hoisin-Glazed Wings A sticky, umami-packed glaze makes these wings extra addictive. While Buffalo or garlic Parmesan are more classic choices, you might as well bring this variation because let’s be real: you can never have too many wings at a Super Bowl party. 12. Slow Cooker Beef Tacos Rich, tender beef infused with spices and citrus? You’ll definitely want to pile these into warm tortillas and top with everything in sight. 13. Crockpot Beef Stew Classic comfort food at its best, this stew has tender chunks of beef, hearty veggies, and a delicious broth that pairs great with crusty bread. 14. Slow Cooker Rotisserie Chicken All the juicy, seasoned goodness of a classic rotisserie chicken, but made right at home—and without even stepping foot in the grocery store. 15. Slow Cooker Pork Tenderloin Lean, juicy, and coated in a balsamic-brown sugar glaze, this pork tenderloin is just as good for meal prep as it is for game day. It makes a bit less than the pork shoulder, but it takes on the same exact flavors. 16. Crockpot Taco Soup If you’re not in the mood for assembling individual tacos, this slow cooker taco soup is the answer. Loaded with beans, tomatoes, and just the right amount of spice, this soup is just as filling, if not more. 17. Slow Cooker Irish Stout Sliders These sliders get their rich, malty depth from a bottle of stout, making them the ultimate pub-style snack for game day. They’re also great If you want to graze on a bunch of appetizers and try a little bit of everything. 18. Slow Cooker Bolognese A true Sunday sauce, this version is meaty, rich, and pairs perfectly with pappardelle noodles (or any noodle you have on hand). What are your game day must-haves? Let us know what you’re cooking up in the comments.",
  "image": "https://images.food52.com/NvXUhmjTFsba9npT8Wo5ym0rmHA=/fit-in/1200x1200/e2a53222-2932-4dc0-90f1-0f7d68fa3f5a--2020-0303_our-best-pulled-pork_3x2_ty-mecham.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \u003cp\u003eEven if you don’t know a first-down from a fumble, you can still enjoy \u003ca href=\"https://food52.com/recipes/super-bowl\"\u003eSuper Bowl Sunday\u003c/a\u003e for what we think is its best part of the day: the food. And what’s better than a lineup of \u003ca href=\"https://food52.com/recipes/slow-cook\"\u003eslow-cooker recipes\u003c/a\u003e that practically cook themselves while you stay glued to the screen—whether for the game, the commercials, or a Taylor Swift cameo?\nWe’ve rounded up our best slow-cooker recipes for a crowd, from \u003ca href=\"https://food52.com/recipes/81580-slow-cooker-honey-bbq-ribs\"\u003efall-off-the-bone ribs\u003c/a\u003e and \u003ca href=\"https://food52.com/recipes/81363-slow-cooker-carolina-pulled-pork-barbecue\"\u003esmoky pulled pork\u003c/a\u003e to \u003ca href=\"https://food52.com/recipes/73529-austin-diner-style-queso\"\u003equeso\u003c/a\u003e, \u003ca href=\"https://food52.com/recipes/78029-melissa-clark-s-instant-pot-chili\"\u003echili\u003c/a\u003e, and even a \u003ca href=\"https://food52.com/recipes/82340-slow-cooker-chocolate-chip-cookie-recipe\"\u003edeep dish chocolate chip cookie\u003c/a\u003e. These hands-off game-day appetizers and snacks make hosting and potluck appearances breeze. Simply set, forget, and serve. With these 18 recipes, even if your team doesn’t win, your spread will.\u003c/p\u003e\n              \u003chr/\u003e\n\n              \n\n\n  \n\n              \u003ch3\u003e1. \u003ca href=\"https://food52.com/recipes/81580-slow-cooker-honey-bbq-ribs\"\u003eSlow Cooker Honey BBQ Ribs\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eSticky, sweet, and fall-off-the-bone tender, these ribs do all the work while you kick back.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e2. \u003ca href=\"https://food52.com/recipes/81361-slow-cooker-bourbon-bbq-chicken-drumsticks\"\u003eSlow Cooker Bourbon BBQ Wings\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eThese wings are all about deep, smoky sweetness, thanks to a bourbon-spiked BBQ sauce that gets even better as it simmers.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e3. \u003ca href=\"https://food52.com/recipes/83085-grape-jelly-meatballs-recipe\"\u003eGrape Jelly Meatballs\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eThe retro party classic that never misses (don’t knock it till you try it) —these meatballs are tangy, sweet, and so easy that you might start making them year-round.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e4. \u003ca href=\"https://food52.com/recipes/81363-slow-cooker-carolina-pulled-pork-barbecue\"\u003eSlow Cooker Carolina BBQ Pulled Pork\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eLow and slow is the secret to this ultra-tender pork, packed with vinegar-based Carolina BBQ tang in every bite. Add it to sandwiches, bowls, soups, or basically any dish at the party.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e5. \u003ca href=\"https://food52.com/recipes/82340-slow-cooker-chocolate-chip-cookie-recipe\"\u003eSlow Cooker Chocolate Chip Cookie\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eBecause dessert should be just as effortless, this giant cookie stays soft in the center and crispy at the edges, with pockets of gooey chocolate throughout. We wouldn’t say no to a scoop of ice cream either while we wait for it to cool down.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e6. \u003ca href=\"https://food52.com/recipes/78178-slow-cooker-pork-shoulder-with-brown-sugar-balsamic-glaze\"\u003eBrown Sugar \u0026amp; Balsamic Glaze Pork Shoulder\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eSavory, sweet, and deeply caramelized, this pork shoulder takes on rich balsamic glaze as it slow-cooks to perfection.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e7. \u003ca href=\"https://food52.com/recipes/81370-slow-cooker-low-country-shrimp-boil\"\u003eSlow Cooker Shrimp Boil\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eA fitting New Orleans staple, this shrimp boil achieves all the classic flavors without the fuss of a giant stockpot. It’s the perfect mix of smoky sausage, sweet corn, and Old Bay-seasoned shrimp.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e8. \u003ca href=\"https://food52.com/recipes/73529-austin-diner-style-queso\"\u003eTexas Queso\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eCreamy, spicy, and packed with some Tex-Mex flair, this queso is the ultimate dip for chips, wings, or even just a spoon.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e9. \u003ca href=\"https://food52.com/recipes/78029-melissa-clark-s-instant-pot-chili\"\u003eInstant Pot Chili\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eA deep, smoky chili that’s ready in record time if you have an Instant Pot. But, don’t worry, there’s also a slow cooker variation for an even more hands-off approach.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e10. \u003ca href=\"https://food52.com/recipes/77789-martha-stewart-s-slow-cooker-italian-braised-pork\"\u003eMartha Stewart’s Braised Pork Shoulder\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eMartha-approved and packed with Italian-inspired flavors, this fork-tender pork shoulder is perfect over polenta or piled into sandwiches.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e11. \u003ca href=\"https://food52.com/recipes/81364-slow-cooker-hoisin-glazed-chicken-wings\"\u003eSlow Cooker Hoisin-Glazed Wings\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eA sticky, umami-packed glaze makes these wings extra addictive. While Buffalo or garlic Parmesan are more classic choices, you might as well bring this variation because let’s be real: you can never have too many wings at a Super Bowl party.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e12. \u003ca href=\"https://food52.com/recipes/81362-slow-cooker-shredded-beef-tacos\"\u003eSlow Cooker Beef Tacos\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eRich, tender beef infused with spices and citrus? You’ll definitely want to pile these into warm tortillas and top with everything in sight.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e13. \u003ca href=\"https://food52.com/recipes/82267-beef-stew-crockpot-recipe\"\u003eCrockpot Beef Stew\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eClassic comfort food at its best, this stew has tender chunks of beef, hearty veggies, and a delicious broth that pairs great with crusty bread.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e14. \u003ca href=\"https://food52.com/recipes/82439-crockpot-rotisserie-chicken-recipe\"\u003eSlow Cooker Rotisserie Chicken\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eAll the juicy, seasoned goodness of a classic rotisserie chicken, but made right at home—and without even stepping foot in the grocery store.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e15. \u003ca href=\"https://food52.com/recipes/22841-crock-pot-brown-sugar-balsamic-glazed-pork-tenderloin\"\u003eSlow Cooker Pork Tenderloin\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eLean, juicy, and coated in a balsamic-brown sugar glaze, this pork tenderloin is just as good for meal prep as it is for game day. It makes a bit less than the pork shoulder, but it takes on the same exact flavors.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e16. \u003ca href=\"https://food52.com/recipes/64162-crock-pot-taco-soup\"\u003eCrockpot Taco Soup\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eIf you’re not in the mood for assembling individual tacos, this slow cooker taco soup is the answer. Loaded with beans, tomatoes, and just the right amount of spice, this soup is just as filling, if not more.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e17. \u003ca href=\"https://food52.com/recipes/80680-slow-cooker-irish-stout-sliders\"\u003eSlow Cooker Irish Stout Sliders\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eThese sliders get their rich, malty depth from a bottle of stout, making them the ultimate pub-style snack for game day. They’re also great If you want to graze on a bunch of appetizers and try a little bit of everything.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e18. \u003ca href=\"https://food52.com/recipes/26755-slow-cooker-bolognese-sauce-with-pappardelle\"\u003eSlow Cooker Bolognese\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eA true Sunday sauce, this version is meaty, rich, and pairs perfectly with pappardelle noodles (or any noodle you have on hand).\u003c/p\u003e\n              \n  \n\n\n\n              \u003chr/\u003e\n\n              \n              \u003ccenter\u003e \u003cem\u003eWhat are your game day must-haves? Let us know what you’re cooking up in the comments.\u003c/em\u003e\n\u003c/center\u003e\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-01-30T10:59:54-05:00",
  "modifiedTime": "2025-01-30T10:59:58-05:00"
}
