{
  "id": "830f9449-badf-4eca-ba98-855b5264209d",
  "title": "7 Day High Protein Diet Meal Plan",
  "link": "https://www.skinnytaste.com/7-day-high-protein-diet-meal-plan-10/?adt_ei=*|EMAIL|*",
  "description": "A free, 7-day high protein diet meal plan including breakfast, lunch and dinner ideas and a shopping list. All recipes include macros and Weight Watchers points. 7 Day High Protein Diet Meal Plan I hope you have all been enjoying these high-protein meal plans and finding them helpful this month! My goal is to help […]",
  "author": "Gina",
  "published": "Sat, 18 Jan 2025 00:13:58 +0000",
  "source": "https://www.skinnytaste.com/feed/",
  "categories": [
    "Recipes"
  ],
  "byline": "Gina",
  "length": 9355,
  "excerpt": "A free, 7-day high protein diet meal plan including breakfast, lunch and dinner ideas and a shopping list. All recipes include macros. #highprotein #highproteindiet #mealplan",
  "siteName": "Skinnytaste",
  "favicon": "",
  "text": "This post may contain affiliate links. Read my disclosure policy.A free, 7-day high protein diet meal plan including breakfast, lunch and dinner ideas and a shopping list. All recipes include macros and Weight Watchers points. I hope you have all been enjoying these high-protein meal plans and finding them helpful this month! My goal is to help support you in meeting your daily protein targets and contributed to your overall health and fitness goals. A high-protein meal plan can help boost muscle growth, promote fat loss, stabilize blood sugar, and keep you feeling fuller for longer throughout the day. I’d love to hear what aspects of these meal plans you’ve found most beneficial and if there’s anything you’d like to see adjusted to make them even more effective for you. Your feedback is always appreciated! Update About New WW Points PlanFor all my WW friends, WW added new 0 point foods (yay for oatmeal!) but it will take time for me to update my recipes. So far I have everything from 2025 to 2018 updated. The great news is every recipe on my site is linked to WW recipe builder (only works from your phone) so it will automatically give you the new points. Why High Protein? Those with kidney or liver disease, gout, specific metabolic disorders, or older adults with reduced kidney function may need to limit protein to avoid complications. It’s always best to consult a healthcare provider or dietitian before significantly increasing protein intake, especially if you have any underlying health conditions. Note Those with kidney or liver disease, gout, specific metabolic disorders, or older adults with reduced kidney function may need to limit protein to avoid complications. It’s always best to consult a healthcare provider or dietitian before significantly increasing protein intake, especially if you have any underlying health conditions. Lastly, if you’re on Facebook join my Skinnytaste Facebook Community where everyone’s sharing photos of recipes they are making, you can join here. I’m loving all the ideas everyone’s sharing! If you wish to get on the email list, you can subscribe here so you never miss a meal plan! Ultimate Skinnytaste Meal Planner Get the Skinnytaste Ultimate Meal Planner! The 52 week spiral bound meal planner has weekly meal planning grids you can tear out and put on your fridge if you wish, a 12-week meal plan, 30 (15 new) recipes, and tear-out grocery lists. I love starting my week with gratitude, affirmations and intentions, so I included a space for that as well. I hope you will love this as much as I do! Buy the Skinnytaste meal planner here: Amazon Barnes \u0026 Nobles Indie Bound High Protein Diet Meal Plan: Breakfast and lunch Monday-Friday, are designed to serve 1 while dinners and all meals on Saturday and Sunday are designed to serve a family of 4. Some recipes make enough leftovers for two nights or lunch the next day. The grocery list is comprehensive and includes everything you need to make all meals on the plan. Add some high protein snacks to help you reach your protein goals. MONDAY (1/20)B: Breakfast QuesadillaL: Salmon Nicoise Salad*D: Lasagna Roll Ups with Cottage Cheese and Arugula SaladTotal Calories: 1,397** Protein: 105.5g TUESDAY (1/21)B: Breakfast QuesadillaL: Salmon Nicoise SaladD: Carne Molida with ¾ cup rice and Quick Cabbage Slaw Total Calories: 1,443** Protein: 114g WEDNESDAY (1/22)B: Breakfast QuesadillaL: Tuna Egg Salad with 1 slice sourdough bread and 1 cup grapesD: Arroz con Pollo with Massaged Raw Kale Salad Total Calories: 1,350** Protein: 108.5g THURSDAY (1/23)B: High Protein Whipped Cottage Cheese Bowls (½ recipe)L: LEFTOVER Arroz con Pollo with 2 ounces avocadoD: Pork Tenderloin with Cherry Sauce with Buttermilk Mashed Potatoes and Shredded Brussels Sprouts with Pancetta (½ recipe) Total Calories: 1,298** Protein: 107.5g FRIDAY (1/24)B: High Protein Whipped Cottage Cheese Bowls (½ recipe)L: LEFTOVER Arroz con Pollo with 2 ounces avocadoD: Shrimp with Tuscan White Beans, Spinach and Feta  (recipe x 2) and Greek Orzo Salad (½ recipe) Total Calories: 1,283** Protein: 104.5g SATURDAY (1/25)B: Zucchini Oats (recipe x 4)L: LEFTOVER Shrimp with Tuscan White Beans, Spinach and Feta and Greek Orzo SaladD: DINNER OUT Total Calories: 896** Protein: 61.5g SUNDAY (1/26)B: High Protein Scrambled Eggs with Cottage Cheese (recipe x 2) with 1 slice sourdough bread, 2 chicken sausage links and 1 cup grapesL: BBQ Chicken Tenders in Air Fryer with 8 baby carrots and Low Fat Buttermilk Ranch DressingD: Mediterranean Meatballs Total Calories: 1,277** Protein: 105 *This is just a guide, women should aim for around 1500 calories per day. Here’s a helpful calculator to estimate your calorie needs. I’ve left plenty of wiggle room for you to add more food such as coffee, beverages, fruits, snacks, dessert, wine, etc.**Prep Sunday night, if desired. #Freeze any leftover you/your family won’t eat. *Google doc Shopping list Produce 2 medium bananas 2 pounds seedless red or green grapes 1 (12-ounce) package strawberries 1 (6-ounce) package blueberries 1 (6-ounce) package berries (your choice) 2 medium PLUS 1 large lemons 1 small (5-ounce) Hass avocado 2 medium English cucumbers 1 ¾ pounds zucchini 1 medium PLUS 1 large red bell pepper 1 medium orange bell pepper 2 large cubanelle peppers ½ pound green beans ¾ pound baby yellow potatoes 2 pounds Yukon Gold potatoes 1 pound Brussels sprouts 2 large heads garlic 1 small bag baby carrots 1 large bunch scallions 1 small bunch/container fresh chives 1 small bunch/container fresh dill 1 small bunch/container fresh oregano (optional garnish for Greek Orzo Salad) 1 small bunch/container fresh sage 1 small bunch/container fresh thyme 1 medium bunch fresh Italian parsley 1 small PLUS 1 large bunch cilantro 1 medium bunch culantro (if you can find it. Optional, for Sofrito) 1 medium bunch Lacinato kale 1 medium head Bibb/Butter lettuce 1 (5-ounce) clamshell/bag baby arugula 1 (1-pound) clamshell/bag baby spinach ½ small head green cabbage 2 medium vine-ripened tomatoes 1 dry pint cherry or grape tomatoes 1 small red onion 1 small PLUS 4 medium yellow onions Meat, Poultry and Fish 1 to 2 packages chicken breakfast sausage (you need 14 links. Can buy frozen, if desired) 2 pounds large peeled and deveined shrimp ½ pound (2) salmon skinless salmon fillets 2 pounds pork tenderloin 1 small package pancetta (if buying from deli, you need 1 ounce) 1 ½ pounds (12) boneless, skinless chicken tenderloins 8 boneless, skinless chicken thighs or bone-in drumsticks 1 pound 93% lean ground turkey 1 ½ pounds 90% lean ground turkey, beef or bison (your choice) Condiments and Spices Extra virgin olive oil Canola oil Cooking spray Olive oil spray (or get a Misto oil mister) Kosher salt (I like Diamond Crystal) Pepper grinder (or fresh peppercorns) Cinnamon Onion powder Whole grain mustard White wine vinegar White balsamic vinegar Balsamic vinegar White vinegar Red wine vinegar Apple cider vinegar Regular or light mayonnaise BBQ sauce Cayenne pepper Garlic powder Cumin Sazon seasoning Bay leaves Adobo seasoning Oregano Vanilla extract or vanilla bean paste Dairy \u0026 Misc. Refrigerated Items 1 18-pack large eggs 1 pint liquid egg whites 1 small tub whipped butter 1 small tub nonfat sour cream 3 (16-ounce) container low fat cottage cheese (I like Good Culture) 1 (16-ounce) container nonfat plain Greek yogurt 1 quart low fat buttermilk 1 pint milk (your choice, for Zucchini Oats) 1 (8-ounce) bag shredded cheddar cheese 1 (8-ounce) bag part-skim mozzarella cheese 1 (8-ounce) chunk regular or reduced fat feta cheese 1 large wedge fresh Parmesan cheese Grains* 1 package (7-inch) low carb tortillas (I like Mission Whole Wheat Carb Balance) 1 small loaf sliced sourdough bread 1 small package quick oats 1 package seasoned breadcrumbs 1 package seasoned panko breadcrumbs (can use plain and season yourself, if desired) 1 package plain panko breadcrumbs 1 (16-ounce) package lasagna noodles (NOT no boil) 1 (16-ounce) package orzo pasta 1 package Israeli (pearled) couscous 1 medium package dry long grain white rice, such as Carolina Canned and Jarred 1 small jar reduced sugar cherry preserves 1 small jar pesto (or ingredients to make your own) 1 jar marinara sauce (or ingredients to make your own) 1 (8-ounce) can tomato sauce 1 small jar salsa (optional, for Breakfast Quesadilla) 1 small jar pitted Kalamata olives 1 small jar pitted green olives or alcaparrado 1 small jar/can marinated artichoke hearts 2 (15-ounce) cans no salt added cannellini beans (such as Eden Organic) 1 (32-ounce) carton reduced or low sodium chicken broth 1 (2.6-ounce) packet light tuna in water Misc. Dry Goods Monk fruit sweetener (or honey or maple syrup) 1 small package slivered almonds (if buying from bulk bin, you need about about 3/4 cup) 1 package chicken bouillon cubes *You can buy gluten free, if desired",
  "image": "https://www.skinnytaste.com/wp-content/uploads/2025/01/Week_472_Jan-20-Jan-26_HP.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-ast-blocks-layout=\"true\"\u003e\n\n\t\t\n\t\t\n\u003cdiv\u003e\u003cp\u003eThis post may contain affiliate links. Read my \u003ca href=\"https://www.skinnytaste.com/legal/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003edisclosure policy\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003cp\u003eA free, 7-day \u003ca href=\"https://www.skinnytaste.com/high-protein/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003ehigh protein\u003c/a\u003e diet meal plan including \u003ca href=\"https://www.skinnytaste.com/recipes/breakfast-brunch/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003ebreakfast\u003c/a\u003e, \u003ca href=\"https://www.skinnytaste.com/recipes/lunch/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003elunch\u003c/a\u003e and \u003ca href=\"https://www.skinnytaste.com/recipes/dinner-recipes/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003edinner ideas\u003c/a\u003e and a shopping list. All recipes include \u003ca href=\"https://www.skinnytaste.com/what-are-macros/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003emacros\u003c/a\u003e and \u003ca href=\"https://www.skinnytaste.com/smart-points/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eWeight Watchers\u003c/a\u003e points.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1200\" height=\"1500\" fetchpriority=\"high\" data-pin-description=\"A free, 7-day high protein diet meal plan including breakfast, lunch and dinner ideas and a shopping list. All recipes include macros. #highprotein #highproteindiet #mealplan\" data-pin-title=\"7 Day High Protein Diet Meal Plan\" src=\"https://www.skinnytaste.com/wp-content/uploads/2025/01/Week_472_Jan-20-Jan-26_HP.jpg\" alt=\"meal plan images for the week\" srcset=\"https://www.skinnytaste.com/wp-content/uploads/2025/01/Week_472_Jan-20-Jan-26_HP.jpg 1200w, https://www.skinnytaste.com/wp-content/uploads/2025/01/Week_472_Jan-20-Jan-26_HP-500x625.jpg 500w, https://www.skinnytaste.com/wp-content/uploads/2025/01/Week_472_Jan-20-Jan-26_HP-550x688.jpg 550w, https://www.skinnytaste.com/wp-content/uploads/2025/01/Week_472_Jan-20-Jan-26_HP-600x750.jpg 600w, https://www.skinnytaste.com/wp-content/uploads/2025/01/Week_472_Jan-20-Jan-26_HP-150x188.jpg 150w\" sizes=\"(max-width: 1200px) 100vw, 1200px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://amzn.to/3GozIlz\" target=\"_blank\" rel=\"noopener nofollow sponsored external\" data-wpel-link=\"external\"\u003e\u003cimg width=\"1200\" height=\"518\" src=\"https://www.skinnytaste.com/wp-content/uploads/2023/11/skinnytaste-simple-promo-banner.png\" alt=\"Skinnytaste Simple promo banner\" data-pin-nopin=\"true\" srcset=\"https://www.skinnytaste.com/wp-content/uploads/2023/11/skinnytaste-simple-promo-banner.png 1200w, https://www.skinnytaste.com/wp-content/uploads/2023/11/skinnytaste-simple-promo-banner-500x216.png 500w, https://www.skinnytaste.com/wp-content/uploads/2023/11/skinnytaste-simple-promo-banner-550x237.png 550w, https://www.skinnytaste.com/wp-content/uploads/2023/11/skinnytaste-simple-promo-banner-600x259.png 600w, https://www.skinnytaste.com/wp-content/uploads/2023/11/skinnytaste-simple-promo-banner-150x65.png 150w\" sizes=\"(max-width: 1200px) 100vw, 1200px\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eI hope you have all been enjoying these \u003ca href=\"https://www.skinnytaste.com/meal-plans/high-protein-diet-meal-plan/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003ehigh-protein meal plans\u003c/a\u003e and finding them helpful this month! My goal is to help support you in meeting your daily protein targets and contributed to your overall health and fitness goals. A high-protein meal plan can help boost muscle growth, promote fat loss, stabilize blood sugar, and keep you feeling fuller for longer throughout the day.\u003c/p\u003e\n\n\n\n\u003cp\u003eI’d love to hear what aspects of these meal plans you’ve found most beneficial and if there’s anything you’d like to see adjusted to make them even more effective for you. Your feedback is always appreciated!\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1200\" height=\"1800\" data-pin-description=\"A free, 7-day high protein diet meal plan including breakfast, lunch and dinner ideas and a shopping list. All recipes include macros. #highprotein #highproteindiet #mealplan\" data-pin-title=\"7 Day High Protein Diet Meal Plan\" src=\"https://www.skinnytaste.com/wp-content/uploads/2025/01/meal-plan8.png\" alt=\"\" srcset=\"https://www.skinnytaste.com/wp-content/uploads/2025/01/meal-plan8.png 1200w, https://www.skinnytaste.com/wp-content/uploads/2025/01/meal-plan8-500x750.png 500w, https://www.skinnytaste.com/wp-content/uploads/2025/01/meal-plan8-550x825.png 550w, https://www.skinnytaste.com/wp-content/uploads/2025/01/meal-plan8-170x255.png 170w, https://www.skinnytaste.com/wp-content/uploads/2025/01/meal-plan8-1024x1536.png 1024w, https://www.skinnytaste.com/wp-content/uploads/2025/01/meal-plan8-400x600.png 400w, https://www.skinnytaste.com/wp-content/uploads/2025/01/meal-plan8-800x1200.png 800w, https://www.skinnytaste.com/wp-content/uploads/2025/01/meal-plan8-600x900.png 600w, https://www.skinnytaste.com/wp-content/uploads/2025/01/meal-plan8-260x390.png 260w, https://www.skinnytaste.com/wp-content/uploads/2025/01/meal-plan8-150x225.png 150w\" sizes=\"(max-width: 1200px) 100vw, 1200px\"/\u003e\u003c/figure\u003e\n\n\n\u003cdiv id=\"callout-box-block_0cb5e14f145a169d5aee8e6f91012719\"\u003e\u003cp\u003e\u003ch2\u003eUpdate About New WW Points Plan\u003c/h2\u003e\u003c/p\u003e\u003cp\u003eFor all my WW friends, WW added new 0 point foods (yay for oatmeal!) but it will take time for me to update my recipes. So far I have everything from 2025 to 2018 updated. The great news is every recipe on my site is linked to WW recipe builder (only works from your phone) so it will automatically give you the new points.\u003c/p\u003e\u003c/div\u003e\n\n\n\u003ch2\u003eWhy High Protein?\u003c/h2\u003e\n\n\n\n\u003cp\u003eThose with kidney or liver disease, gout, specific metabolic disorders, or older adults with reduced kidney function may need to limit protein to avoid complications. It’s always best to consult a healthcare provider or dietitian before significantly increasing protein intake, especially if you have any underlying health conditions.\u003c/p\u003e\n\n\n\n\u003ch2\u003eNote\u003c/h2\u003e\n\n\n\n\u003cp\u003eThose with kidney or liver disease, gout, specific metabolic disorders, or older adults with reduced kidney function may need to limit protein to avoid complications. It’s always best to consult a healthcare provider or dietitian before significantly increasing protein intake, especially if you have any underlying health conditions.\u003c/p\u003e\n\n\n\n\u003cp\u003eLastly, if you’re on Facebook join my \u003ca href=\"https://www.facebook.com/groups/1934885496754505/\" target=\"_blank\" rel=\"noopener nofollow external\" data-wpel-link=\"external\"\u003eSkinnytaste Facebook Community\u003c/a\u003e where everyone’s sharing photos of recipes they are making, you can join here. I’m loving all the ideas everyone’s sharing! If you wish to get on the email list, you can subscribe here so you never miss a meal plan!\u003c/p\u003e\n\n\n\u003cdiv id=\"callout-box-block_5e86d5054a0a03439e4e645393b7aaf2\"\u003e\u003cp\u003e\u003ch3\u003e\u003cspan\u003e\u003c/span\u003e Ultimate Skinnytaste Meal Planner\u003c/h3\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.skinnytaste.com/wp-content/uploads/2021/08/Skinnytaste-UltimateMealPlanner-125.png\" alt=\"Skinnytaste Ultimate Meal Planner\" width=\"125\" height=\"139\"/\u003e\u003c/p\u003e\n\u003cp\u003eGet the Skinnytaste Ultimate Meal Planner! The 52 week spiral bound meal planner has weekly meal planning grids you can tear out and put on your fridge if you wish, a 12-week meal plan, 30 (15 new) recipes, and tear-out grocery lists. I love starting my week with gratitude, affirmations and intentions, so I included a space for that as well. I hope you will love this as much as I do!\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"2560\" height=\"1920\" src=\"https://www.skinnytaste.com/wp-content/uploads/2023/10/image-scaled.jpeg\" alt=\"Skinnytaste Ultimate Meal Planner\" srcset=\"https://www.skinnytaste.com/wp-content/uploads/2023/10/image-scaled.jpeg 2560w, https://www.skinnytaste.com/wp-content/uploads/2023/10/image-500x375.jpeg 500w, https://www.skinnytaste.com/wp-content/uploads/2023/10/image-550x412.jpeg 550w, https://www.skinnytaste.com/wp-content/uploads/2023/10/image-1536x1152.jpeg 1536w, https://www.skinnytaste.com/wp-content/uploads/2023/10/image-2048x1536.jpeg 2048w, https://www.skinnytaste.com/wp-content/uploads/2023/10/image-600x450.jpeg 600w, https://www.skinnytaste.com/wp-content/uploads/2023/10/image-1200x900.jpeg 1200w, https://www.skinnytaste.com/wp-content/uploads/2023/10/image-150x112.jpeg 150w\" sizes=\"(max-width: 2560px) 100vw, 2560px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003ch2\u003eBuy the Skinnytaste meal planner here:\u003c/h2\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://amzn.to/3CQ70Hi\" target=\"_blank\" rel=\"nofollow sponsored noopener external\" data-wpel-link=\"external\"\u003eAmazon \u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.barnesandnoble.com/w/the-skinnytaste-ultimate-meal-planner-gina-homolka/1139415928\" target=\"_blank\" rel=\"noopener nofollow external\" data-wpel-link=\"external\"\u003eBarnes \u0026amp; Nobles \u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.indiebound.org/book/9780593234723\" target=\"_blank\" rel=\"noopener nofollow external\" data-wpel-link=\"external\"\u003eIndie Bound\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch2\u003eHigh Protein Diet Meal Plan:\u003c/h2\u003e\n\n\n\n\u003cp\u003eBreakfast and lunch Monday-Friday, are designed to serve 1 while dinners and all meals on Saturday and Sunday are designed to serve a family of 4. Some recipes make enough leftovers for two nights or lunch the next day. The grocery list is comprehensive and includes everything you need to make all meals on the plan. Add some \u003ca href=\"https://www.skinnytaste.com/high-protein-snacks/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003ehigh protein snacks\u003c/a\u003e to help you reach your protein goals.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eMONDAY (1/20)\u003c/strong\u003e\u003cbr/\u003eB: \u003ca href=\"https://www.skinnytaste.com/breakfast-quesadilla/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eBreakfast Quesadilla\u003c/a\u003e\u003cbr/\u003eL: \u003ca href=\"https://www.skinnytaste.com/nicoise-salad/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eSalmon Nicoise Salad\u003c/a\u003e*\u003cbr/\u003eD: \u003ca href=\"https://www.skinnytaste.com/lasagna-roll-ups-with-cottage-cheese/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eLasagna Roll Ups with Cottage Cheese\u003c/a\u003e and \u003ca href=\"https://www.skinnytaste.com/arugula-salad/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eArugula Salad\u003c/a\u003e\u003cbr/\u003eTotal Calories: 1,397** Protein: 105.5g\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eTUESDAY (1/21\u003c/strong\u003e)\u003cbr/\u003eB: \u003ca href=\"https://www.skinnytaste.com/breakfast-quesadilla/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eBreakfast Quesadilla\u003c/a\u003e\u003cbr/\u003eL: \u003ca href=\"https://www.skinnytaste.com/nicoise-salad/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eSalmon Nicoise Salad\u003c/a\u003e\u003cbr/\u003eD: \u003ca href=\"https://www.skinnytaste.com/carne-molida/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eCarne Molida\u003c/a\u003e with ¾ cup rice and \u003ca href=\"https://www.skinnytaste.com/quick-cabbage-slaw/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eQuick Cabbage Slaw\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eTotal Calories: 1,443** Protein: 114g\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWEDNESDAY (1/22)\u003c/strong\u003e\u003cbr/\u003eB: \u003ca href=\"https://www.skinnytaste.com/breakfast-quesadilla/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eBreakfast Quesadilla\u003c/a\u003e\u003cbr/\u003eL: \u003ca href=\"https://www.skinnytaste.com/tuna-egg-salad/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eTuna Egg Salad\u003c/a\u003e with 1 slice sourdough bread and 1 cup grapes\u003cbr/\u003eD: \u003ca href=\"https://www.skinnytaste.com/arroz-con-pollo-lightened-up/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eArroz con Pollo\u003c/a\u003e with \u003ca href=\"https://www.skinnytaste.com/massaged-raw-kale-salad/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eMassaged Raw Kale Salad\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eTotal Calories: 1,350** Protein: 108.5g\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eTHURSDAY (1/23)\u003c/strong\u003e\u003cbr/\u003eB: \u003ca href=\"https://www.skinnytaste.com/high-protein-whipped-cottage-cheese-bowls/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eHigh Protein Whipped Cottage Cheese Bowls\u003c/a\u003e (½ recipe)\u003cbr/\u003eL: LEFTOVER \u003ca href=\"https://www.skinnytaste.com/arroz-con-pollo-lightened-up/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eArroz con Pollo\u003c/a\u003e with 2 ounces avocado\u003cbr/\u003eD: \u003ca href=\"https://www.skinnytaste.com/pork-tenderloin-with-cherry-sauce/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003ePork Tenderloin with Cherry Sauce\u003c/a\u003e with \u003ca href=\"https://www.skinnytaste.com/skinny-buttermilk-mashed-potatoes-with/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eButtermilk Mashed Potatoes\u003c/a\u003e and \u003ca href=\"https://www.skinnytaste.com/sauteed-brussels-sprouts-with-pancetta/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eShredded Brussels Sprouts with Pancetta\u003c/a\u003e (½ recipe)\u003c/p\u003e\n\n\n\n\u003cp\u003eTotal Calories: 1,298** Protein: 107.5g\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eFRIDAY (1/24)\u003c/strong\u003e\u003cbr/\u003eB: \u003ca href=\"https://www.skinnytaste.com/high-protein-whipped-cottage-cheese-bowls/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eHigh Protein Whipped Cottage Cheese Bowls\u003c/a\u003e (½ recipe)\u003cbr/\u003eL: LEFTOVER \u003ca href=\"https://www.skinnytaste.com/arroz-con-pollo-lightened-up/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eArroz con Pollo\u003c/a\u003e with 2 ounces avocado\u003cbr/\u003eD: \u003ca href=\"https://www.skinnytaste.com/tuscan-white-beans-with-spinach-shrimp/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eShrimp with Tuscan White Beans, Spinach and Feta\u003c/a\u003e  (recipe x 2) and \u003ca href=\"https://www.skinnytaste.com/greek-orzo-salad/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eGreek Orzo Salad\u003c/a\u003e (½ recipe)\u003c/p\u003e\n\n\n\n\u003cp\u003eTotal Calories: 1,283** Protein: 104.5g\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eSATURDAY (1/25)\u003c/strong\u003e\u003cbr/\u003eB: \u003ca href=\"https://www.skinnytaste.com/zoats-or-zucchini-oats/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eZucchini Oats\u003c/a\u003e (recipe x 4)\u003cbr/\u003eL: LEFTOVER \u003ca href=\"https://www.skinnytaste.com/tuscan-white-beans-with-spinach-shrimp/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eShrimp with Tuscan White Beans, Spinach and Feta\u003c/a\u003e and \u003ca href=\"https://www.skinnytaste.com/greek-orzo-salad/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eGreek Orzo Salad\u003c/a\u003e\u003cbr/\u003eD: DINNER OUT\u003c/p\u003e\n\n\n\n\u003cp\u003eTotal Calories: 896** Protein: 61.5g\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eSUNDAY (1/26)\u003c/strong\u003e\u003cbr/\u003eB: \u003ca href=\"https://www.skinnytaste.com/high-protein-scrambled-eggs-with-cottage-cheese/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eHigh Protein Scrambled Eggs with Cottage Cheese\u003c/a\u003e (recipe x 2) with 1 slice sourdough bread, 2 chicken sausage links and 1 cup grapes\u003cbr/\u003eL: \u003ca href=\"https://www.skinnytaste.com/bbq-chicken-tenders-in-air-fryer/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eBBQ Chicken Tenders in Air Fryer\u003c/a\u003e with 8 baby carrots and \u003ca href=\"https://www.skinnytaste.com/low-fat-buttermilk-ranch-dressing/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eLow Fat Buttermilk Ranch Dressing\u003c/a\u003e\u003cbr/\u003eD: \u003ca href=\"https://www.skinnytaste.com/mediterranean-meatballs/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eMediterranean Meatballs\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eTotal Calories: 1,277** Protein: 105\u003c/p\u003e\n\n\n\n\u003cp\u003e*This is just a guide, women should aim for around 1500 calories per day. \u003ca href=\"https://examine.com/guides/protein-intake/\" target=\"_blank\" data-wpel-link=\"external\" rel=\"nofollow external noopener\"\u003eHere’s a helpful calculator to estimate your calorie needs\u003c/a\u003e. I’ve left plenty of wiggle room for you to add more food such as coffee, beverages, fruits, snacks, dessert, wine, etc.\u003cbr/\u003e**Prep Sunday night, if desired.\u003c/p\u003e\n\n\n\n\u003cp\u003e#Freeze any leftover you/your family won’t eat.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"799\" height=\"476\" src=\"https://www.skinnytaste.com/wp-content/uploads/2025/01/Screenshot-2025-01-16-220233.png\" alt=\"\" srcset=\"https://www.skinnytaste.com/wp-content/uploads/2025/01/Screenshot-2025-01-16-220233.png 799w, https://www.skinnytaste.com/wp-content/uploads/2025/01/Screenshot-2025-01-16-220233-500x298.png 500w, https://www.skinnytaste.com/wp-content/uploads/2025/01/Screenshot-2025-01-16-220233-550x328.png 550w, https://www.skinnytaste.com/wp-content/uploads/2025/01/Screenshot-2025-01-16-220233-600x357.png 600w, https://www.skinnytaste.com/wp-content/uploads/2025/01/Screenshot-2025-01-16-220233-150x89.png 150w\" sizes=\"(max-width: 799px) 100vw, 799px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e*\u003ca href=\"https://docs.google.com/document/d/1GtpGW1JVtie7io-LXhnnmQzRpJK2eC_yqQClA7XADdA/edit?usp=sharing\" target=\"_blank\" data-wpel-link=\"external\" rel=\"nofollow external noopener\"\u003eGoogle doc\u003c/a\u003e\u003c/p\u003e\n\n\n\u003cdiv id=\"print_this_678af25eeed7e\"\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eShopping list\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eProduce\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e2 medium bananas\u003c/li\u003e\n\n\n\n\u003cli\u003e2 pounds seedless red or green grapes\u003c/li\u003e\n\n\n\n\u003cli\u003e1 (12-ounce) package strawberries\u003c/li\u003e\n\n\n\n\u003cli\u003e1 (6-ounce) package blueberries\u003c/li\u003e\n\n\n\n\u003cli\u003e1 (6-ounce) package berries (your choice)\u003c/li\u003e\n\n\n\n\u003cli\u003e2 medium PLUS 1 large lemons\u003c/li\u003e\n\n\n\n\u003cli\u003e1 small (5-ounce) Hass avocado\u003c/li\u003e\n\n\n\n\u003cli\u003e2 medium English cucumbers\u003c/li\u003e\n\n\n\n\u003cli\u003e1 ¾ pounds zucchini\u003c/li\u003e\n\n\n\n\u003cli\u003e1 medium PLUS 1 large red bell pepper\u003c/li\u003e\n\n\n\n\u003cli\u003e1 medium orange bell pepper\u003c/li\u003e\n\n\n\n\u003cli\u003e2 large cubanelle peppers\u003c/li\u003e\n\n\n\n\u003cli\u003e½ pound green beans\u003c/li\u003e\n\n\n\n\u003cli\u003e¾ pound baby yellow potatoes\u003c/li\u003e\n\n\n\n\u003cli\u003e2 pounds Yukon Gold potatoes\u003c/li\u003e\n\n\n\n\u003cli\u003e1 pound Brussels sprouts\u003c/li\u003e\n\n\n\n\u003cli\u003e2 large heads garlic\u003c/li\u003e\n\n\n\n\u003cli\u003e1 small bag baby carrots\u003c/li\u003e\n\n\n\n\u003cli\u003e1 large bunch scallions\u003c/li\u003e\n\n\n\n\u003cli\u003e1 small bunch/container fresh chives\u003c/li\u003e\n\n\n\n\u003cli\u003e1 small bunch/container fresh dill\u003c/li\u003e\n\n\n\n\u003cli\u003e1 small bunch/container fresh oregano (optional garnish for Greek Orzo Salad)\u003c/li\u003e\n\n\n\n\u003cli\u003e1 small bunch/container fresh sage\u003c/li\u003e\n\n\n\n\u003cli\u003e1 small bunch/container fresh thyme\u003c/li\u003e\n\n\n\n\u003cli\u003e1 medium bunch fresh Italian parsley\u003c/li\u003e\n\n\n\n\u003cli\u003e1 small PLUS 1 large bunch cilantro\u003c/li\u003e\n\n\n\n\u003cli\u003e1 medium bunch culantro (if you can find it. Optional, for Sofrito)\u003c/li\u003e\n\n\n\n\u003cli\u003e1 medium bunch Lacinato kale\u003c/li\u003e\n\n\n\n\u003cli\u003e1 medium head Bibb/Butter lettuce\u003c/li\u003e\n\n\n\n\u003cli\u003e1 (5-ounce) clamshell/bag baby arugula\u003c/li\u003e\n\n\n\n\u003cli\u003e1 (1-pound) clamshell/bag baby spinach\u003c/li\u003e\n\n\n\n\u003cli\u003e½ small head green cabbage\u003c/li\u003e\n\n\n\n\u003cli\u003e2 medium vine-ripened tomatoes\u003c/li\u003e\n\n\n\n\u003cli\u003e1 dry pint cherry or grape tomatoes\u003c/li\u003e\n\n\n\n\u003cli\u003e1 small red onion\u003c/li\u003e\n\n\n\n\u003cli\u003e1 small PLUS 4 medium yellow onions\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eMeat, Poultry and Fish\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e1 to 2 packages chicken breakfast sausage (you need 14 links. Can buy frozen, if desired)\u003c/li\u003e\n\n\n\n\u003cli\u003e2 pounds large peeled and deveined shrimp\u003c/li\u003e\n\n\n\n\u003cli\u003e½ pound (2) salmon skinless salmon fillets\u003c/li\u003e\n\n\n\n\u003cli\u003e2 pounds pork tenderloin\u003c/li\u003e\n\n\n\n\u003cli\u003e1 small package pancetta (if buying from deli, you need 1 ounce)\u003c/li\u003e\n\n\n\n\u003cli\u003e1 ½ pounds (12) boneless, skinless chicken tenderloins\u003c/li\u003e\n\n\n\n\u003cli\u003e8 boneless, skinless chicken thighs or bone-in drumsticks\u003c/li\u003e\n\n\n\n\u003cli\u003e1 pound 93% lean ground turkey\u003c/li\u003e\n\n\n\n\u003cli\u003e1 ½ pounds 90% lean ground turkey, beef or bison (your choice)\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eCondiments and Spices\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eExtra virgin olive oil\u003c/li\u003e\n\n\n\n\u003cli\u003eCanola oil\u003c/li\u003e\n\n\n\n\u003cli\u003eCooking spray\u003c/li\u003e\n\n\n\n\u003cli\u003eOlive oil spray (or get a \u003ca href=\"https://www.amazon.com/Misto-Brushed-Aluminum-Olive-Sprayer/dp/B00004SPZV/ref=sr_1_1?s=grocery\u0026amp;\u0026amp;ie=UTF8\u0026amp;\u0026amp;qid=1515181085\u0026amp;\u0026amp;sr=8-1\u0026amp;\u0026amp;keywords=misto\" target=\"_blank\" rel=\"nofollow sponsored external noopener\" data-wpel-link=\"external\"\u003eMisto\u003c/a\u003e oil mister)\u003c/li\u003e\n\n\n\n\u003cli\u003eKosher salt (I like \u003ca href=\"https://www.amazon.com/gp/product/B0011BPMUK/ref=as_li_qf_sp_asin_il_tl?ie=UTF8\u0026amp;tag=1094004-20\u0026amp;camp=1789\u0026amp;creative=9325\u0026amp;linkCode=as2\u0026amp;creativeASIN=B0011BPMUK\u0026amp;linkId=de126591a74a25f41428f89bbb2986da\" target=\"_blank\" rel=\"nofollow sponsored external noopener\" data-wpel-link=\"external\"\u003eDiamond Crystal\u003c/a\u003e)\u003c/li\u003e\n\n\n\n\u003cli\u003ePepper grinder (or fresh peppercorns)\u003c/li\u003e\n\n\n\n\u003cli\u003eCinnamon\u003c/li\u003e\n\n\n\n\u003cli\u003eOnion powder\u003c/li\u003e\n\n\n\n\u003cli\u003eWhole grain mustard\u003c/li\u003e\n\n\n\n\u003cli\u003eWhite wine vinegar\u003c/li\u003e\n\n\n\n\u003cli\u003eWhite balsamic vinegar\u003c/li\u003e\n\n\n\n\u003cli\u003eBalsamic vinegar\u003c/li\u003e\n\n\n\n\u003cli\u003eWhite vinegar\u003c/li\u003e\n\n\n\n\u003cli\u003eRed wine vinegar\u003c/li\u003e\n\n\n\n\u003cli\u003eApple cider vinegar\u003c/li\u003e\n\n\n\n\u003cli\u003eRegular or light mayonnaise\u003c/li\u003e\n\n\n\n\u003cli\u003eBBQ sauce\u003c/li\u003e\n\n\n\n\u003cli\u003eCayenne pepper\u003c/li\u003e\n\n\n\n\u003cli\u003eGarlic powder\u003c/li\u003e\n\n\n\n\u003cli\u003eCumin\u003c/li\u003e\n\n\n\n\u003cli\u003eSazon seasoning\u003c/li\u003e\n\n\n\n\u003cli\u003eBay leaves\u003c/li\u003e\n\n\n\n\u003cli\u003eAdobo seasoning\u003c/li\u003e\n\n\n\n\u003cli\u003eOregano\u003c/li\u003e\n\n\n\n\u003cli\u003eVanilla extract or vanilla bean paste\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eDairy \u0026amp; Misc. Refrigerated Items\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e1 18-pack large eggs\u003c/li\u003e\n\n\n\n\u003cli\u003e1 pint liquid egg whites\u003c/li\u003e\n\n\n\n\u003cli\u003e1 small tub whipped butter\u003c/li\u003e\n\n\n\n\u003cli\u003e1 small tub nonfat sour cream\u003c/li\u003e\n\n\n\n\u003cli\u003e3 (16-ounce) container low fat cottage cheese (I like Good Culture)\u003c/li\u003e\n\n\n\n\u003cli\u003e1 (16-ounce) container nonfat plain Greek yogurt\u003c/li\u003e\n\n\n\n\u003cli\u003e1 quart low fat buttermilk\u003c/li\u003e\n\n\n\n\u003cli\u003e1 pint milk (your choice, for Zucchini Oats)\u003c/li\u003e\n\n\n\n\u003cli\u003e1 (8-ounce) bag shredded cheddar cheese\u003c/li\u003e\n\n\n\n\u003cli\u003e1 (8-ounce) bag part-skim mozzarella cheese\u003c/li\u003e\n\n\n\n\u003cli\u003e1 (8-ounce) chunk regular or reduced fat feta cheese\u003c/li\u003e\n\n\n\n\u003cli\u003e1 large wedge fresh Parmesan cheese\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGrains*\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e1 package (7-inch) low carb tortillas (I like Mission Whole Wheat Carb Balance)\u003c/li\u003e\n\n\n\n\u003cli\u003e1 small loaf sliced sourdough bread\u003c/li\u003e\n\n\n\n\u003cli\u003e1 small package quick oats\u003c/li\u003e\n\n\n\n\u003cli\u003e1 package seasoned breadcrumbs\u003c/li\u003e\n\n\n\n\u003cli\u003e1 package seasoned panko breadcrumbs (can use plain and season yourself, if desired)\u003c/li\u003e\n\n\n\n\u003cli\u003e1 package plain panko breadcrumbs\u003c/li\u003e\n\n\n\n\u003cli\u003e1 (16-ounce) package lasagna noodles (NOT no boil)\u003c/li\u003e\n\n\n\n\u003cli\u003e1 (16-ounce) package orzo pasta\u003c/li\u003e\n\n\n\n\u003cli\u003e1 package Israeli (pearled) couscous\u003c/li\u003e\n\n\n\n\u003cli\u003e1 medium package dry long grain white rice, such as Carolina\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eCanned and Jarred\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e1 small jar \u003ca href=\"https://bonnemaman.ca/en/products/tartinade-plus-de-fruits-moins-de-sucre-cerise\" target=\"_blank\" data-wpel-link=\"external\" rel=\"nofollow external noopener\"\u003ereduced sugar cherry preserves\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e1 small jar pesto (or \u003ca href=\"https://www.skinnytaste.com/skinny-basil-pesto/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eingredients to make your own\u003c/a\u003e)\u003c/li\u003e\n\n\n\n\u003cli\u003e1 jar marinara sauce (or \u003ca href=\"https://www.skinnytaste.com/quick-marinara-sauce/\" data-wpel-link=\"internal\" target=\"_self\" rel=\"follow\"\u003eingredients to make your own\u003c/a\u003e)\u003c/li\u003e\n\n\n\n\u003cli\u003e1 (8-ounce) can tomato sauce\u003c/li\u003e\n\n\n\n\u003cli\u003e1 small jar salsa (optional, for Breakfast Quesadilla)\u003c/li\u003e\n\n\n\n\u003cli\u003e1 small jar pitted Kalamata olives\u003c/li\u003e\n\n\n\n\u003cli\u003e1 small jar pitted green olives or alcaparrado\u003c/li\u003e\n\n\n\n\u003cli\u003e1 small jar/can marinated artichoke hearts\u003c/li\u003e\n\n\n\n\u003cli\u003e2 (15-ounce) cans no salt added cannellini beans (such as Eden Organic)\u003c/li\u003e\n\n\n\n\u003cli\u003e1 (32-ounce) carton reduced or low sodium chicken broth\u003c/li\u003e\n\n\n\n\u003cli\u003e1 (2.6-ounce) packet light tuna in water\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eMisc. Dry Goods\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eMonk fruit sweetener (or honey or maple syrup)\u003c/li\u003e\n\n\n\n\u003cli\u003e1 small package slivered almonds (if buying from bulk bin, you need about about 3/4 cup)\u003c/li\u003e\n\n\n\n\u003cli\u003e1 package chicken bouillon cubes\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e*You can buy gluten free, if desired\u003c/p\u003e\n\n\n\n\u003c/div\u003e\n\n\n\t\t\n\t\t\n\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-01-18T00:13:58Z",
  "modifiedTime": "2025-01-17T19:14:02Z"
}
