{
  "id": "e497fe8b-695c-4fae-8a02-647ae1cd70c8",
  "title": "These Lemon-Poppy Seed Bars Are the Stuff of Dreams",
  "link": "https://www.nytimes.com/2025/07/23/dining/easy-lemon-poppy-seed-bars.html",
  "description": "These easy treats balance buttery shortbread and tangy curd.",
  "author": "Melissa Clark",
  "published": "Wed, 23 Jul 2025 18:44:46 +0000",
  "source": "https://rss.nytimes.com/services/xml/rss/nyt/DiningandWine.xml",
  "categories": [
    "Poppies",
    "Cakes",
    "Lemons",
    "Bakeries and Baked Products"
  ],
  "byline": "Melissa Clark",
  "length": 9280,
  "excerpt": "These easy treats balance buttery shortbread and tangy curd.",
  "siteName": "The New York Times",
  "favicon": "https://www.nytimes.com/vi-assets/static-assets/ios-ipad-144x144-28865b72953380a40aa43318108876cb.png",
  "text": "AdvertisementSKIP ADVERTISEMENTA Good AppetiteThese easy treats balance buttery shortbread and tangy curd.The best part of these easy bars are arguably the edges, where the lemon curd hits the pan and caramelizes.Credit...Linda Xiao for The New York Times. Food Stylist: Monica PieriniJuly 23, 2025, 2:44 p.m. ETGrowing up with poppy seed bagels, hamantaschen and muffins, I never realized that those little specks stuck in my teeth had anything to do with the louche haze of opium dens or the soporific scarlet fields of Oz. I figured there must be different poppies — one the stuff of muffins and cake, the other for trapping little girls like Dorothy in morphine oblivion. But they are one and the same.Recipe: Lemon Poppy Seed BarsIt’s one of nature’s clever little metaphors that the seed pods of Papaver somniferum, as the opium poppy is known scientifically, ooze a sticky, intoxicating latex when young and green, yet shed their narcotic properties entirely as they ripen and mature. That’s when the tiny blue-black seeds are harvested, without so much as a hint of their younger, dreamier selves.I’d sometimes wonder about Dorothy’s poppies when my grandmother and I made hamantaschen for Purim, grinding the seeds into an inky, oily paste. Stuffed into tricorn cookies, they were hard to tell apart from the similarly black prune-filled ones. I’d nibble a tiny smudge of filling before committing to a whole cookie, hoping for the seeds’ dusky, bittersweet flavor.VideotranscripttranscriptLemon Poppy Seed Bars“So I’m going to use my little offset spatula and the bench press, and I’m going to show you a trick for getting it in there.” “Bench scraper?” “What did I say?” “Bench press.” “Oh, bench scraper.” [LAUGHS] [MUSIC PLAYING] “Hi, I’m Melissa Clark. I’m a food reporter for ‘The New York Times,’ and we’re here at the NYT Cooking Kitchen Studio, because I’m going to make you a recipe for lemon poppy seed bars. It takes the best of lemon bars, like a lemon curd bard, and crosses it with a lemon poppy seed poundcake, and you get this wonderful bar cookie that is chewy, it’s citrusy, it’s flecked with nutty poppy seeds, and it’s really easy to make. I love these bars for picnics. They’re like the perfect picnic snack. Another great thing about these, you can make them in advance. They keep really, really well, and they freeze well, too. Not that you’re going to have any leftover, but just in case. First thing we’re going to do is we’re going to make the dough. I have the zest of two lemons. It’s a lot of lemon zest. I mean, look at that. But that’s what gives it its intense citrusy flavor. And then this is just sugar, and just regular salt. So the first thing I’m going to do is I’m actually going to mix the lemon zest into the sugar. I’m releasing the oils, the lemon oils, that are in the zest. So if you skip this step, you’re going to be losing some of that lemon flavor. This just brings it out. You can also do this with your hands and just, like, kind of rub the zest into the sugar. And it’s aromatherapy, and it is fabulous. Although this is also aromatherapy if you just breathe deep. And you see, it just looks like sand, looks like yellow sand. And now, you want to add your butter. This is basically making a shortbread. Most lemon bars have a shortbread crust. So we’re going to beat the butter in until it’s all combined. Save these guys. Fold them over, because look at all that butter, and then pop them in the freezer, and then use these to grease your pan. No waste. And then once that looks nice and smooth, you want to just add your flour — all-purpose flour — and vanilla extract and poppy seeds. So I’m going to mix this until it’s a little shy of being a solid brick of dough, because I want to pull some of it out, and that’s going to be our streusel topping. So you don’t have to make a separate streusel. It’s all part of the same recipe, which is very easy and very good. And it’s delicious that way. When I was developing this recipe, I was trying to come up with different ways to put the topping on the bars. I was like, should I do a lattice? Should I make it fancy? And I was like, streusel is just easier, and it has such great texture, too, because it’s a little bit crumbly. So that’s going to be for topping. So I’m going to press the rest of this into the bottom of the pan. This is just an 8-inch pan. Parchment paper — grease the pan, put the parchment paper on, and then this is going to help you lift it out later — help me lift it out later. And you, when you do it at home. It’s a little bit sticky, this dough, but that is also what helps keep it tender. And then the trick is, I’m not going to try to use my fingers to press it into the pan, because it would really make a mess. So I’m going to use my little offset spatula and a bench scraper. [LAUGHS] So these bars are incredibly versatile. You can use the same dough, but instead of lemon curd in the middle, you can use jam, which is so good. Raspberry jam is delicious. You can use a caramel, a dulce de leche. Just anything sweet and sticky is going to be really good in these bars. But my favorite is a lemon curd, because the lemon curd just gives it that brightness. And this is already a rich cookie, and so this just cuts a little bit. So I’m trying to get this in an even layer. It doesn’t have to be pretty on top, but you do want it even, so that everybody gets the same amount of cookie. Otherwise, somebody’s going to get more cookie, and someone’s going to get less cookie. So be good to your people and make it nice and even. You don’t need to do this, but it makes it really nice. If you just take this, it just helps get it into the corners nicely and onto the sides nicely. I just learned this myself. This is a food stylist trick. O.K., so lemon curd. This lemon curd is a homemade recipe that I have at NYT Cooking. If you want to find it, I think it’s called something like, ‘The Easiest Lemon Curd’ in the world, and you do it in the microwave. It comes together in five minutes, and it is so good. But otherwise, buy lemon curd. You can buy it. You can make whatever recipe you like. So, there’s lots of ways to get the lemon curd. By the way, the reason this looks a little bit light in color for lemon curd is because part of the recipe calls for putting it in the blender, which aerates it ever so slightly. It doesn’t affect the flavor at all. It’s just a slightly fluffier texture, slightly lighter color. And that is it. So, you want to cover most of the surface area, but you still want to leave some gaps so that the lemon curd can bubble through — and then that looks really pretty — and gets a little brown. It’s really nice. O.K. Wash my hands. Put in the oven. Really, lick my fingers. Who am I kidding? So I’ve preheated the oven to 350, and then, this bakes for 40 to 50 minutes.” [BEEPING] “So what you’re looking for — you know these are done — should be golden brown. I mean, you’ll just see that the curd looks set. It looks a little bit shiny. It looks set. If you jiggle the pan, it’s not moving. And then, you just let it sit for about an hour and a half, at least. You can let it sit for a few hours. It needs to really solidify before you cut it. Otherwise, the curd is just going to run all over the place, so just let it hang out for a few. And the best part of every video is where I get to eat the thing I just made. I love lemon bars so much, and I love poppy seed, so these are just my dream cookie. Pro tip, take one with the brown bit on the edge. That little caramely bit is where the lemon curd hit the pan and got chewy and caramelized, and it is the best bite. It’s so good. The whole thing is so good. These are perfect. They’re like my perfect cookie. You can find the recipe for these and for all the other recipes that we have at NYT Cooking at NYT Cooking, or click the link below. They’re there for you. Cheers.”Muffins came later, in high school, along with slices of glazed lemon poppy seed pound cake. The seeds work differently in these desserts; instead of clumping into a sticky paste, they stay discrete — a crunchy stippling in yellow crumb. They taste different, too, with the lemon’s acidity brightening the seed’s concentrated earthiness.I considered all of this as I was creating these poppy seed-speckled lemon bars, striving to combine the crispness of hamantaschen with the moistness of cake.It turns out that using the same shortbread dough for the crust and topping does the trick, conveniently yielding cookies that are buttery-crisp on the bottom and soft in the center, where a layer of lemon curd meets the dough.But the best bit is where the curd meets the edges of the pan, caramelizing into puckery candy. If you want to make the curd, I have a very easy recipe that can be done in about 7 minutes in the microwave. But jarred curd works just as well. Or if you like you can substitute jam, which gives these bars a fruity snap, the kind that yields their own very good dreams.Melissa Clark has been writing her column, A Good Appetite, for The Times’s Food section since 2007. She creates recipes for New York Times Cooking, makes videos and reports on food trends. She is the author of 45 cookbooks, and counting.Related ContentAdvertisementSKIP ADVERTISEMENT",
  "image": "https://static01.nyt.com/images/2025/07/30/multimedia/30FD-appe-lemon-poppyseed-bars-hwgc/23FD-appe-lemon-poppyseed-bars-hwgc-facebookJumbo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"site-content\"\u003e\u003carticle id=\"story\"\u003e\u003cdiv id=\"top-wrapper\"\u003e\u003cp\u003eAdvertisement\u003c/p\u003e\u003cp\u003e\u003ca href=\"#after-top\"\u003eSKIP ADVERTISEMENT\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cheader\u003e\u003cp\u003eA Good Appetite\u003c/p\u003e\u003cp id=\"article-summary\"\u003eThese easy treats balance buttery shortbread and tangy curd.\u003c/p\u003e\u003cdiv data-testid=\"imageblock-wrapper\"\u003e\u003cfigure aria-label=\"media\" role=\"group\"\u003e\u003cdiv data-testid=\"imageContainer-children-Image\"\u003e\u003cpicture\u003e\u003csource media=\"(max-width: 599px) and (min-device-pixel-ratio: 3),(max-width: 599px) and (min-resolution: 3dppx),(max-width: 599px) and (min-resolution: 288dpi)\" srcset=\"https://static01.nyt.com/images/2025/07/30/multimedia/30FD-appe-lemon-poppyseed-bars-hwgc/23FD-appe-lemon-poppyseed-bars-hwgc-mobileMasterAt3x.jpg?quality=75\u0026amp;auto=webp\u0026amp;disable=upscale\u0026amp;width=1800\"/\u003e\u003csource media=\"(max-width: 599px) and (min-device-pixel-ratio: 2),(max-width: 599px) and (min-resolution: 2dppx),(max-width: 599px) and (min-resolution: 192dpi)\" srcset=\"https://static01.nyt.com/images/2025/07/30/multimedia/30FD-appe-lemon-poppyseed-bars-hwgc/23FD-appe-lemon-poppyseed-bars-hwgc-mobileMasterAt3x.jpg?quality=75\u0026amp;auto=webp\u0026amp;disable=upscale\u0026amp;width=1200\"/\u003e\u003csource media=\"(max-width: 599px) and (min-device-pixel-ratio: 1),(max-width: 599px) and (min-resolution: 1dppx),(max-width: 599px) and (min-resolution: 96dpi)\" srcset=\"https://static01.nyt.com/images/2025/07/30/multimedia/30FD-appe-lemon-poppyseed-bars-hwgc/23FD-appe-lemon-poppyseed-bars-hwgc-mobileMasterAt3x.jpg?quality=75\u0026amp;auto=webp\u0026amp;disable=upscale\u0026amp;width=600\"/\u003e\u003cimg alt=\"A side image of lemon-poppy seed bars.\" src=\"https://static01.nyt.com/images/2025/07/30/multimedia/30FD-appe-lemon-poppyseed-bars-hwgc/23FD-appe-lemon-poppyseed-bars-hwgc-articleLarge.jpg?quality=75\u0026amp;auto=webp\u0026amp;disable=upscale\" srcset=\"https://static01.nyt.com/images/2025/07/30/multimedia/30FD-appe-lemon-poppyseed-bars-hwgc/23FD-appe-lemon-poppyseed-bars-hwgc-articleLarge.jpg?quality=75\u0026amp;auto=webp 600w,https://static01.nyt.com/images/2025/07/30/multimedia/30FD-appe-lemon-poppyseed-bars-hwgc/23FD-appe-lemon-poppyseed-bars-hwgc-jumbo.jpg?quality=75\u0026amp;auto=webp 1024w,https://static01.nyt.com/images/2025/07/30/multimedia/30FD-appe-lemon-poppyseed-bars-hwgc/23FD-appe-lemon-poppyseed-bars-hwgc-superJumbo.jpg?quality=75\u0026amp;auto=webp 2048w\" sizes=\"((min-width: 600px) and (max-width: 1004px)) 84vw, (min-width: 1005px) 80vw, 100vw\" decoding=\"async\" width=\"600\" height=\"400\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-testid=\"photoviewer-children-ImageCaption\"\u003e\u003cspan\u003eThe best part of these easy bars are arguably the edges, where the lemon curd hits the pan and caramelizes.\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eCredit...\u003c/span\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003eLinda Xiao for The New York Times. Food Stylist: Monica Pierini\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003e\u003ctime datetime=\"2025-07-23T14:44:46-04:00\"\u003eJuly 23, 2025, \u003cspan\u003e2:44 p.m. ET\u003c/span\u003e\u003c/time\u003e\u003c/p\u003e\u003c/header\u003e\u003csection name=\"articleBody\"\u003e\u003cdiv data-testid=\"companionColumn-0\"\u003e\u003cp\u003eGrowing up with poppy seed bagels, \u003ca href=\"https://cooking.nytimes.com/recipes/1014146-hamantaschen-with-poppy-seed-filling\" title=\"\"\u003ehamantaschen\u003c/a\u003e and muffins, I never realized that those little specks stuck in my teeth had anything to do with the louche haze of opium dens or the soporific scarlet fields of Oz. I figured there must be different poppies — one the stuff of muffins and cake, the other for trapping little girls like Dorothy in morphine oblivion. But they are one and the same.\u003c/p\u003e\u003chr/\u003e\u003ch2 id=\"link-3cf23e88\"\u003eRecipe: \u003ca href=\"https://cooking.nytimes.com/recipes/1026985-lemon-poppy-seed-bars\" title=\"\"\u003eLemon Poppy Seed Bars\u003c/a\u003e\u003c/h2\u003e\u003chr/\u003e\u003cp\u003eIt’s one of nature’s clever little metaphors that the seed pods of Papaver somniferum, as the opium poppy is known scientifically, ooze a sticky, intoxicating latex when young and green, yet shed their narcotic properties entirely as they ripen and mature. That’s when the tiny blue-black seeds are harvested, without so much as a hint of their younger, dreamier selves.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"companionColumn-1\"\u003e\u003cp\u003eI’d sometimes wonder about Dorothy’s poppies when my grandmother and I made hamantaschen for Purim, grinding the seeds into an inky, oily paste. Stuffed into tricorn cookies, they were hard to tell apart from the similarly black prune-filled ones. I’d nibble a tiny smudge of filling before committing to a whole cookie, hoping for the seeds’ dusky, bittersweet flavor.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"VideoBlock-3\"\u003e\u003cfigure aria-label=\"media\" data-testid=\"VideoBlock\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eVideo\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cdiv aria-labelledby=\"modal-title\" role=\"region\"\u003e\u003cheader\u003e\u003cp\u003etranscript\u003c/p\u003e\u003c/header\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003etranscript\u003c/p\u003e\u003ch2\u003eLemon Poppy Seed Bars\u003c/h2\u003e\u003c/div\u003e\u003cdl\u003e\u003cdt\u003e\u003c/dt\u003e\u003cdd\u003e\u003cp\u003e“So I’m going to use my little offset spatula and the bench press, and I’m going to show you a trick for getting it in there.” “Bench scraper?” “What did I say?” “Bench press.” “Oh, bench scraper.” [LAUGHS] [MUSIC PLAYING] “Hi, I’m Melissa Clark. I’m a food reporter for ‘The New York Times,’ and we’re here at the NYT Cooking Kitchen Studio, because I’m going to make you a recipe for lemon poppy seed bars. It takes the best of lemon bars, like a lemon curd bard, and crosses it with a lemon poppy seed poundcake, and you get this wonderful bar cookie that is chewy, it’s citrusy, it’s flecked with nutty poppy seeds, and it’s really easy to make. I love these bars for picnics. They’re like the perfect picnic snack. Another great thing about these, you can make them in advance. They keep really, really well, and they freeze well, too. Not that you’re going to have any leftover, but just in case. First thing we’re going to do is we’re going to make the dough. I have the zest of two lemons. It’s a lot of lemon zest. I mean, look at that. But that’s what gives it its intense citrusy flavor. And then this is just sugar, and just regular salt. So the first thing I’m going to do is I’m actually going to mix the lemon zest into the sugar. I’m releasing the oils, the lemon oils, that are in the zest. So if you skip this step, you’re going to be losing some of that lemon flavor. This just brings it out. You can also do this with your hands and just, like, kind of rub the zest into the sugar. And it’s aromatherapy, and it is fabulous. Although this is also aromatherapy if you just breathe deep. And you see, it just looks like sand, looks like yellow sand. And now, you want to add your butter. This is basically making a shortbread. Most lemon bars have a shortbread crust. So we’re going to beat the butter in until it’s all combined. Save these guys. Fold them over, because look at all that butter, and then pop them in the freezer, and then use these to grease your pan. No waste. And then once that looks nice and smooth, you want to just add your flour — all-purpose flour — and vanilla extract and poppy seeds. So I’m going to mix this until it’s a little shy of being a solid brick of dough, because I want to pull some of it out, and that’s going to be our streusel topping. So you don’t have to make a separate streusel. It’s all part of the same recipe, which is very easy and very good. And it’s delicious that way. When I was developing this recipe, I was trying to come up with different ways to put the topping on the bars. I was like, should I do a lattice? Should I make it fancy? And I was like, streusel is just easier, and it has such great texture, too, because it’s a little bit crumbly. So that’s going to be for topping. So I’m going to press the rest of this into the bottom of the pan. This is just an 8-inch pan. Parchment paper — grease the pan, put the parchment paper on, and then this is going to help you lift it out later — help me lift it out later. And you, when you do it at home. It’s a little bit sticky, this dough, but that is also what helps keep it tender. And then the trick is, I’m not going to try to use my fingers to press it into the pan, because it would really make a mess. So I’m going to use my little offset spatula and a bench scraper. [LAUGHS] So these bars are incredibly versatile. You can use the same dough, but instead of lemon curd in the middle, you can use jam, which is so good. Raspberry jam is delicious. You can use a caramel, a dulce de leche. Just anything sweet and sticky is going to be really good in these bars. But my favorite is a lemon curd, because the lemon curd just gives it that brightness. And this is already a rich cookie, and so this just cuts a little bit. So I’m trying to get this in an even layer. It doesn’t have to be pretty on top, but you do want it even, so that everybody gets the same amount of cookie. Otherwise, somebody’s going to get more cookie, and someone’s going to get less cookie. So be good to your people and make it nice and even. You don’t need to do this, but it makes it really nice. If you just take this, it just helps get it into the corners nicely and onto the sides nicely. I just learned this myself. This is a food stylist trick. O.K., so lemon curd. This lemon curd is a homemade recipe that I have at NYT Cooking. If you want to find it, I think it’s called something like, ‘The Easiest Lemon Curd’ in the world, and you do it in the microwave. It comes together in five minutes, and it is so good. But otherwise, buy lemon curd. You can buy it. You can make whatever recipe you like. So, there’s lots of ways to get the lemon curd. By the way, the reason this looks a little bit light in color for lemon curd is because part of the recipe calls for putting it in the blender, which aerates it ever so slightly. It doesn’t affect the flavor at all. It’s just a slightly fluffier texture, slightly lighter color. And that is it. So, you want to cover most of the surface area, but you still want to leave some gaps so that the lemon curd can bubble through — and then that looks really pretty — and gets a little brown. It’s really nice. O.K. Wash my hands. Put in the oven. Really, lick my fingers. Who am I kidding? So I’ve preheated the oven to 350, and then, this bakes for 40 to 50 minutes.” [BEEPING] “So what you’re looking for — you know these are done — should be golden brown. I mean, you’ll just see that the curd looks set. It looks a little bit shiny. It looks set. If you jiggle the pan, it’s not moving. And then, you just let it sit for about an hour and a half, at least. You can let it sit for a few hours. It needs to really solidify before you cut it. Otherwise, the curd is just going to run all over the place, so just let it hang out for a few. And the best part of every video is where I get to eat the thing I just made. I love lemon bars so much, and I love poppy seed, so these are just my dream cookie. Pro tip, take one with the brown bit on the edge. That little caramely bit is where the lemon curd hit the pan and got chewy and caramelized, and it is the best bite. It’s so good. The whole thing is so good. These are perfect. They’re like my perfect cookie. You can find the recipe for these and for all the other recipes that we have at NYT Cooking at NYT Cooking, or click the link below. They’re there for you. Cheers.”\u003c/p\u003e\u003c/dd\u003e\u003c/dl\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://static01.nyt.com/images/2025/07/23/arts/melissa-poppy-seed-2/melissa-poppy-seed-2-videoSixteenByNine1050.png\" alt=\"Video player loading\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-testid=\"companionColumn-2\"\u003e\u003cp\u003eMuffins came later, in high school, along with slices of glazed lemon poppy seed pound cake. The seeds work differently in these desserts; instead of clumping into a sticky paste, they stay discrete — a crunchy stippling in yellow crumb. They taste different, too, with the lemon’s acidity brightening the seed’s concentrated earthiness.\u003c/p\u003e\u003cp\u003eI considered all of this as I was creating these poppy seed-speckled lemon bars, striving to combine the crispness of hamantaschen with the moistness of cake.\u003c/p\u003e\u003cp\u003eIt turns out that using the same shortbread dough for the crust and topping does the trick, conveniently yielding cookies that are buttery-crisp on the bottom and soft in the center, where a layer of lemon curd meets the dough.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"companionColumn-3\"\u003e\u003cp\u003eBut the best bit is where the curd meets the edges of the pan, caramelizing into puckery candy. If you want to make the curd, I have a \u003ca href=\"https://cooking.nytimes.com/recipes/1022279-the-easiest-lemon-curd?algo=identity\u0026amp;fellback=true\u0026amp;imp_id=2311322374997740\u0026amp;req_id=5865326918222855\u0026amp;surface=cooking-search-web\u0026amp;variant=holdout_best_cooking-search\" title=\"\"\u003every easy recipe\u003c/a\u003e that can be done in about 7 minutes in the microwave. But jarred curd works just as well. Or if you like you can substitute jam, which gives these bars a fruity snap, the kind that yields their own very good dreams.\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003cdiv\u003e\u003cp\u003eMelissa Clark has been writing her column, \u003ca href=\"https://www.nytimes.com/column/a-good-appetite\"\u003eA Good Appetite\u003c/a\u003e, for The Times’s Food section since 2007. She \u003ca href=\"https://cooking.nytimes.com/ourcooks/melissa-clark\"\u003ecreates recipes\u003c/a\u003e for New York Times Cooking, makes videos and reports on food trends. She is the author of 45 cookbooks, and counting.\u003c/p\u003e\u003c/div\u003e\u003csection aria-labelledby=\"recirculation-title-placeholder\" data-testid=\"recirculation-placeholder\" id=\"bottom-sheet-sensor\"\u003e\u003ch2 id=\"recirculation-title-placeholder\"\u003eRelated Content\u003c/h2\u003e\u003c/section\u003e\u003cdiv id=\"bottom-wrapper\"\u003e\u003cp\u003eAdvertisement\u003c/p\u003e\u003cp\u003e\u003ca href=\"#after-bottom\"\u003eSKIP ADVERTISEMENT\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-07-23T18:44:46.861Z",
  "modifiedTime": "2025-07-23T18:44:46.861Z"
}
