{
  "id": "e6b17164-6dc9-4bf7-9726-ec849ea3840f",
  "title": "27 Mother's Day Brunch Ideas That Look Restaurant-Worthy",
  "link": "https://food52.com/blog/27940-20-mothers-day-brunch-recipes-that-mom-will-love",
  "description": "Spring has arrived, and that means Mother’s Day is just around the corner! While booking an overpriced prix fixe brunch might seem tempting, there’s something extra special about staying home—creating a cozy, personalized atmosphere that feels uniquely yours. Hosting a Mother’s Day brunch at home doesn’t have to be stressful. Whether you’re searching for easy sweet brunch recipes, savory brunch ideas, or crowd-pleasing cocktail recipes, we've got you covered. From make-ahead brunch dishes to expert hosting tips, we’re here to help make your Mother’s Day celebration delicious, memorable, and stress-free. Whether you’re planning a casual Mother’s Day breakfast in bed or a full sit-down brunch spread, these recipes have you covered. From bakery-worthy baked goods like cinnamon rolls to fresh salads, savory egg dishes, and bubbly cocktails, this list is filled with sweet and savory brunch recipes that feel special without being stressful. Bonus: We’ve also included easy table-setting ideas for Mother’s Day and clever store-bought hacks to help you pull off a beautiful brunch effortlessly. Read More \u003e\u003e",
  "author": "Paul Hagopian",
  "published": "Tue, 22 Apr 2025 14:58:10 -0400",
  "source": "http://feeds.feedburner.com/food52-TheAandMBlog",
  "categories": [
    "What to Cook",
    "Brunch",
    "Mother's Day"
  ],
  "byline": "Paul Hagopian",
  "length": 11747,
  "excerpt": "We've gathered the best homemade dishes any Mother deserves including cinnamon rolls, quiche, and batched mimosas.",
  "siteName": "Food52",
  "favicon": "https://food52.com/assets/apple-touch-icon/180x180-4f0fc96f9ea242e3851f664c372adcd208dcae1d81b182add1cc5695bf192f57.png",
  "text": "Spring has arrived, and that means Mother’s Day is just around the corner! While booking an overpriced prix fixe brunch might seem tempting, there’s something extra special about staying home—creating a cozy, personalized atmosphere that feels uniquely yours. Hosting a Mother’s Day brunch at home doesn’t have to be stressful. Whether you’re searching for easy sweet brunch recipes, savory brunch ideas, or crowd-pleasing cocktail recipes, we've got you covered. From make-ahead brunch dishes to expert hosting tips, we’re here to help make your Mother’s Day celebration delicious, memorable, and stress-free. Whether you’re planning a casual Mother’s Day breakfast in bed or a full sit-down brunch spread, these recipes have you covered. From bakery-worthy baked goods like cinnamon rolls to fresh salads, savory egg dishes, and bubbly cocktails, this list is filled with sweet and savory brunch recipes that feel special without being stressful. Bonus: We’ve also included easy table-setting ideas for Mother’s Day and clever store-bought hacks to help you pull off a beautiful brunch effortlessly. Tips for Hosting a Mother's Day Brunch at Home Whether you’re a first-time host or a seasoned brunch pro, here are a few ways to make the day feel special (and stress-free). Table Styling Ideas Dress up your table with colorful cloth napkins, a few fresh flowers from Trader Joe’s, and some mismatched plates or vintage glassware for that effortlessly thrown-together vibe. We love these Schoolhouse cocktail napkins, the Five Two linen ones, and this classic placemat for layering. Make-Ahead Moves A successful brunch is all about prepping in advance. Go for overnight cinnamon rolls, zucchini loaf baked the day before, and batched cocktails like punch or mimosas (we love adding edible glitter for a little wow moment). Bonus points for recipes you can just reheat and serve. Semi-Homemade, Totally Delicious Because sometimes shortcuts taste just as good: Use store-bought cinnamon rolls, but pour heavy cream over them before baking. It makes them puff up and caramelize beautifully. Puff pastry = instant danishes. Add cream cheese and jam and bake. Boxed pancake mix? Add ricotta or lemon zest to zhuzh it up. Make a fruit salad dressing with lime juice, honey, and flaky salt. Top frozen waffles with whipped cream, berries, or sprinkles for a quick waffle bar. Spread yogurt on toast, drizzle olive oil, and add herbs and jam—it’s shockingly chic. Use pizza dough for semi-homemade cinnamon rolls—roll, slice, bake, done. Sweet Mother's Day Brunch Recipes 1. Kamut Dutch Baby with Strawberries \u0026 Thyme This Dutch baby is all about contrast. The soft, sweet center complements crisp, risen edges, while bright strawberries are mellowed by thyme. Even more important: This dish looks cool and is easy to make. If you're in need of a last-minute brunch option, look no further. 2. Make-Ahead Cinnamon Rolls Erin McDowell, our Resident Baking BFF, says it best: “If you want someone to fall in love with you, make these cinnamon rolls and a really good cup of coffee on a Sunday morning. Then sit back and act like it was no big deal while they melt in front of you.” 3. French Toast Sticks Make these for the table and they’ll be the brunch equivalent of chips and salsa. 4. Lemony Cream Cheese Pancakes with Blueberries Whipped cream cheese permeates the interior of these lemon pancakes, making them fluffier, saltier, and creamier than the standard flapjack. With syrup and blueberries offering a pop of sweetness, the flavor of these pancakes is wonderfully balanced. 5. Bakery-Style Blueberry Muffins Want your blueberry muffins to look and taste like they came from a corner bakery? Lean into the topping. A buttery streusel, a handful of coarse sparkling sugar, or even a quick toasted oat crumble will give you that golden, craggy lid we all love. Bonus points for using those tulip-style brown parchment liners—they make any homemade muffin feel extra special. 6. Aretha Frankenstein's Waffles of Insane Greatness Everyone likes waffles. As they should—waffles are perfect and delicious and nostalgic and designed to be bathed in maple syrup. If you’re going to make waffles, make these; they’re silky on the inside, golden on the edges, and have been positively reviewed by over 100 of our community members. 7. Dark Chocolate \u0026 Walnut Zucchini Bread Although this quick zucchini bread looks like one big chocolate bar, it’s surprisingly not that sweet. With zucchini offering moisture and walnut giving a more savory crunch, this chocolate loaf is rich in complex flavor. 8. Burnt Miso Pound Cake From Milk Bar’s Christina Tosi, this pound cake is all about the triumvirate of savory miso, rich sour cream, and bright apples. Serve with coffee and mimosas and you’ll begin Mother’s Day on a high note. 9. Martha Stewart's Lemon Pound Cake Because no brunch table is complete without a loaf cake. This bright, citrusy version uses a whole lemon—yes, even the pith—and is topped with a glossy pomegranate glaze for a festive twist. It’s one of those easy bakes you can make the night before, and it’ll taste even better the next day Savory Mother's Day Brunch Recipes 10. The Best Quiche Lorraine This Quiche Lorraine with a Buckwheat Crust offers a nutty, earthy twist on the classic. The buckwheat crust pairs perfectly with the creamy custard, smoky bacon, and cheese, making it a savory, satisfying dish for the morning. 11. The BLT Benedict This benedict combines some of life’s greatest culinary treasures: the BLT, poached eggs, and Eric Ripert’s fool-proof Hollandaise. If you’re going for a traditional brunch, a well-made benedict will never let you down. 12. Cheesy Sausage \u0026 Mushroom Strata This Cheesy Sausage \u0026 Mushroom Strata is a comforting, crowd-pleasing dish. Serve it warm with a side of salad greens and lemon wedges for a balanced, flavorful experience. 13. Shakshuka Focaccia A cross between shakshuka and eggs-in a-hole, this focaccia packs nostalgic flavors into a playful aesthetic. Finished in the oven and enough to feed eight people, this dish makes serving a large group manageable. 14. Smoked Salmon Red Onion and Feta Cheese Fritatta The combination of smoked salmon, tangy feta, and caramelized red onion creates a rich flavor profile, while the eggs provide a creamy base. It's easy to prepare and versatile. 15. Potato, Chorizo, and Cheddar Breakfast Tacos The breakfast taco is truly greater than the sum of its parts—and that says a lot when the “parts” are chorizo, breakfast potatoes, and scrambled eggs. While this recipe calls for corn tortillas, flour would work well here. 16. Magnus Nilsson's Gravlax While definitely a project (you’ll need to start at least 24 hours prior to serving), salt-curing your own salmon is an impressive—and surprisingly easy—endeavor that yields consistently delicious fish. Serve with your favorite assortment of bagels, toasts, and spreads. 17. Simple Sicilian-Style Grilled Steak Hanger is my preferred cut of steak to pair with eggs as it’s flavorful but never overpowering. This particular hanger steak is marinated with salmoriglio (a Sicilian sauce similar to a chimichurri), grilled over high heat, and sliced. 18. Spring Salad with Asparagus \u0026 Soft-Boiled Eggs If you’re looking for something lighter, a brightly dressed salad with (in-season) asparagus and soft-boiled eggs is the way to go. The combination of briny feta, rich yolk, and acidic vinaigrette is tough to beat. 19. Huevos Rancheros With Chorizo \u0026 Porky Refried Beans This recipe from Food52 Resident Rick Martinez is quick to put together (30 minutes start to finish), loaded with chorizo (always good), and great for a big crowd (serves six). If you’re already committed to the breakfast tacos from earlier, the salsa included in this recipe would make a great pairing. 20. Asparagus, Leek \u0026 Ricotta Quiche According to Erin McDowell, this is “the perfect quiche for spring” and we entirely agree. It’s bright—both visually and in flavor—and reliant on two of the season’s greatest bounties: leeks and asparagus. 21. Jasper White’s World-Famous Lobster Rolls Some reasons to make lobster rolls for brunch: One, these lobster rolls are served cold, so you can make them well in advance. Two, lobster makes any meal feel like an occasion. Three, lobster is, was, has been, and always will be delicious. 22. Shirred Eggs These Shirred Eggs are a simple yet elegant breakfast or brunch option. Eggs are baked in a dish with a splash of cream and a sprinkle of Parmesan until the whites are set and the yolks remain slightly soft. Brunch Cocktail Recipes 23. Our Best Classic Mimosa For a traditional touch, use Champagne, or opt for more affordable sparkling wines like Cava or Prosecco. customize by swapping in other fruit juices like grapefruit, pomegranate, or mango, or adding a splash of liqueur such as Cointreau or St-Germain. 24. Spring Sangria with Strawberries \u0026Mint I’m happy to report that—unlike most of the sangria I’ve suffered through—this recipe isn’t cloying. Dry, balanced, and herbal, this is a sangria you’ll want to sip on throughout the day. Bonus: You can make this the night before so it’s ready to go whenever brunch begins. 25. Cold Brew Negroni Seeing two of my favorite drinks get along this well makes me smile. While from a distance the pair may seem a bit strange, there’s just a lot of chemistry here: The sweet vermouth mellows cold brew’s bitterness, while the coffee flavor adds an earthy twist. 26. Zingy Michelada With Celery Salt If you’re into Bloody Mary’s, by all means, make as many as your heart desires. However, if you’re like me, and prefer something a bit more refreshing, give the beer-based Michelada a try. 27. Gin Spritz A spring brunch should be a lot like gin—bright and floral. This spritz is all of those things packaged into a pretty little glass. Which of these recipes will you be making this Mother’s Day? Let us know in the comments below! Editor's Note: This article was updated in April 2025 with even more delicious recipes.",
  "image": "https://images.food52.com/dNKVVF-vTmSn1n0ecKqGRgGfT4o=/fit-in/1200x1200/1b9bc3a5-51ac-4e1d-802a-b258eb5507f0--2023-0323_mothers-day-brunch_lifestyle-table_convivial-dinnerware-hawkins-linens_coffee-pour-food_3x2_mark-weinberg_0152.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \u003cp\u003eSpring has arrived, and that means \u003cstrong\u003eMother’s Day\u003c/strong\u003e is just around the corner! While booking an overpriced prix fixe brunch might seem tempting, there’s something extra special about staying home—creating a cozy, personalized atmosphere that feels uniquely yours. \u003cstrong\u003eHosting a Mother’s Day brunch at home\u003c/strong\u003e doesn’t have to be stressful. Whether you’re searching for easy sweet brunch recipes, savory brunch ideas, or crowd-pleasing cocktail recipes, we\u0026#39;ve got you covered. From \u003cstrong\u003emake-ahead brunch dishes\u003c/strong\u003e to expert hosting tips, we’re here to help make your Mother’s Day celebration delicious, memorable, and stress-free.\u003c/p\u003e\n              \u003cp\u003eWhether you’re planning a casual Mother’s Day breakfast in bed or a full sit-down brunch spread, these recipes have you covered. From bakery-worthy baked goods like cinnamon rolls to fresh salads, savory egg dishes, and bubbly cocktails, this list is filled with sweet and savory brunch recipes that feel special without being stressful. Bonus: We’ve also included \u003cstrong\u003eeasy table-setting ideas\u003c/strong\u003e for Mother’s Day and clever store-bought hacks to help you pull off a beautiful brunch effortlessly.\u003c/p\u003e\n              \n              \u003ch2 id=\"tips-for-hosting-a-mothers-day-brunch-at-home\"\u003eTips for Hosting a Mother\u0026#39;s Day Brunch at Home\u003c/h2\u003e\n              \u003cp\u003eWhether you’re a first-time host or a seasoned brunch pro, here are a few ways to make the day feel special (and stress-free).\u003c/p\u003e\n              \u003ch3\u003eTable Styling Ideas\u003c/h3\u003e\n              \u003cp\u003eDress up your table with \u003cstrong\u003ecolorful cloth napkins\u003c/strong\u003e, a few fresh \u003cstrong\u003eflowers from Trader Joe’s\u003c/strong\u003e, and some \u003cstrong\u003emismatched plates or vintage glassware\u003c/strong\u003e for that effortlessly thrown-together vibe. We love these \u003ca href=\"https://schoolhouse.com/products/scallop-trim-cocktail-napkin-set-of-4?variant=41843710591020\" target=\"_blank\"\u003eSchoolhouse cocktail napkins\u003c/a\u003e, the \u003ca href=\"https://food52.com/shop/products/7438-five-two-everyday-soft-cotton-napkins?srsltid=AfmBOoo8D2A10O0OySBVHio6BOnLy2MeC7OMin9Mi-xiBKvsEp23FhSZ\"\u003eFive Two linen ones\u003c/a\u003e, and this \u003ca href=\"https://food52.com/shop/products/9073-five-two-everyday-soft-cotton-placemats\"\u003eclassic placemat\u003c/a\u003e for layering.\u003c/p\u003e\n              \u003ch3\u003eMake-Ahead Moves\u003c/h3\u003e\n              \u003cp\u003eA successful brunch is all about prepping in advance. Go for \u003cstrong\u003eovernight cinnamon rolls\u003c/strong\u003e, \u003cstrong\u003ezucchini loaf\u003c/strong\u003e baked the day before, and \u003cstrong\u003ebatched cocktails\u003c/strong\u003e like punch or mimosas (we love adding \u003ca href=\"=%22https://www.amazon.com/NiHome-Metallic-Decorating-Restaurant-Allergen-Free/dp/B0BFLJ2W4T/ref=sr_1_3_sspa%22\" target=\"_blank\"\u003eedible glitter\u003c/a\u003e for a little wow moment). Bonus points for recipes you can just reheat and serve.\u003c/p\u003e\n              \u003ch3\u003eSemi-Homemade, Totally Delicious\u003c/h3\u003e\n              \u003cp\u003eBecause sometimes shortcuts taste just as good:\u003c/p\u003e\n              \u003cul\u003e\n  \u003cli\u003eUse \u003cstrong\u003estore-bought cinnamon rolls\u003c/strong\u003e, but pour heavy cream over them before baking. It makes them puff up and caramelize beautifully.\u003c/li\u003e\n  \u003cli\u003e\n\u003cstrong\u003ePuff pastry = instant danishes.\u003c/strong\u003e Add cream cheese and jam and bake.\u003c/li\u003e\n  \u003cli\u003e\n\u003cstrong\u003eBoxed pancake mix?\u003c/strong\u003e Add ricotta or lemon zest to zhuzh it up.\u003c/li\u003e\n  \u003cli\u003eMake a \u003cstrong\u003efruit salad dressing\u003c/strong\u003e with lime juice, honey, and flaky salt.\u003c/li\u003e\n  \u003cli\u003eTop \u003cstrong\u003efrozen waffles\u003c/strong\u003e with whipped cream, berries, or sprinkles for a quick waffle bar.\u003c/li\u003e\n  \u003cli\u003eSpread \u003cstrong\u003eyogurt on toast\u003c/strong\u003e, drizzle olive oil, and add herbs and jam—it’s \u003cem\u003eshockingly\u003c/em\u003e chic.\u003c/li\u003e\n  \u003cli\u003eUse \u003cstrong\u003epizza dough for semi-homemade cinnamon rolls\u003c/strong\u003e—roll, slice, bake, done.\u003c/li\u003e\n\u003c/ul\u003e\n              \n\n\n  \n\n              \u003chr/\u003e\n\n              \u003ch2 id=\"sweet-recipes\"\u003e\u003ccenter\u003eSweet Mother\u0026#39;s Day Brunch Recipes\u003c/center\u003e\u003c/h2\u003e\n              \u003ch3\u003e1. \u003ca href=\"https://food52.com/recipes/76897-kamut-dutch-baby-with-strawberries-and-thyme\"\u003eKamut Dutch Baby with Strawberries \u0026amp; Thyme\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eThis Dutch baby is all about contrast. The soft, sweet center complements crisp, risen edges, while bright strawberries are mellowed by thyme. Even more important: This dish looks cool and is easy to make. If you\u0026#39;re in need of a last-minute brunch option, look no further.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e2. \u003ca href=\"https://food52.com/recipes/35301-cinnamon-rolls\"\u003eMake-Ahead Cinnamon Rolls\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003e\u003ca href=\"https://food52.com/users/3572-erin-jeanne-mcdowell/recipes\"\u003eErin McDowell\u003c/a\u003e, our Resident Baking BFF, says it best: “If you want someone to fall in love with you, make these cinnamon rolls and a really good cup of coffee on a Sunday morning. Then sit back and act like it was no big deal while they melt in front of you.”\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e3. \u003ca href=\"https://food52.com/recipes/38606-french-toast-sticks\"\u003eFrench Toast Sticks\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eMake these for the table and they’ll be the brunch equivalent of chips and salsa.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e4. \u003ca href=\"https://food52.com/recipes/1843-lemony-cream-cheese-pancakes-with-blueberries\"\u003eLemony Cream Cheese Pancakes with Blueberries\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eWhipped cream cheese permeates the interior of these lemon pancakes, making them fluffier, saltier, and creamier than the standard flapjack. With syrup and blueberries offering a pop of sweetness, the flavor of these pancakes is wonderfully balanced.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e5. \u003ca href=\"https://food52.com/recipes/36765-perfect-blueberry-streusel-muffins\"\u003eBakery-Style Blueberry Muffins\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eWant your blueberry muffins to look and taste like they came from a corner bakery? Lean into the topping. A buttery streusel, a handful of coarse sparkling sugar, or even a quick toasted oat crumble will give you that golden, craggy lid we all love. Bonus points for using those tulip-style brown parchment liners—they make any homemade muffin feel extra special.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e6. \u003ca href=\"https://food52.com/recipes/13871-aretha-frankenstein-s-waffles-of-insane-greatness\"\u003eAretha Frankenstein\u0026#39;s Waffles of Insane Greatness\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eEveryone likes waffles. As they should—waffles are perfect and delicious and nostalgic and designed to be bathed  in maple syrup. If you’re going to make waffles, make these; they’re silky on the inside, golden on the edges, and have been positively reviewed by over 100 of our community members.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e7. \u003ca href=\"https://food52.com/recipes/37842-dark-chocolate-and-walnut-zucchini-bread\"\u003eDark Chocolate \u0026amp; Walnut Zucchini Bread\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eAlthough this quick zucchini bread looks like one big chocolate bar, it’s surprisingly not that sweet. With zucchini offering moisture and walnut giving a more savory crunch, this chocolate loaf is rich in complex flavor.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e8. \u003ca href=\"https://food52.com/recipes/78036-burnt-miso-pound-cake\"\u003eBurnt Miso Pound Cake\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eFrom Milk Bar’s \u003ca href=\"https://food52.com/users/135870-christina-tosi/recipes\"\u003eChristina Tosi\u003c/a\u003e, this pound cake is all about the triumvirate of savory miso, rich sour cream, and bright apples. Serve with coffee and mimosas and you’ll begin Mother’s Day on a high note.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e9. \u003ca href=\"https://food52.com/recipes/86607-martha-stewarts-whole-lemon-pound-cake-with-pomegranate-glaze-recipe\"\u003eMartha Stewart\u0026#39;s Lemon Pound Cake\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eBecause no brunch table is complete without a loaf cake. This bright, citrusy version uses a whole lemon—yes, even the pith—and is topped with a glossy pomegranate glaze for a festive twist. It’s one of those easy bakes you can make the night before, and it’ll taste even better the next day\u003c/p\u003e\n              \n  \n\n\n\n              \u003chr/\u003e\n\n              \u003ch2 id=\"savory-recipes\"\u003e\u003ccenter\u003eSavory Mother\u0026#39;s Day Brunch Recipes\u003c/center\u003e\u003c/h2\u003e\n              \u003ch3\u003e10. \u003ca href=\"https://food52.com/recipes/85082-best-quiche-lorraine-recipe\"\u003eThe Best Quiche Lorraine\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eThis Quiche Lorraine with a Buckwheat Crust offers a nutty, earthy twist on the classic. The buckwheat crust pairs perfectly with the creamy custard, smoky bacon, and cheese, making it a savory, satisfying dish for the morning.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e11. \u003ca href=\"https://food52.com/recipes/36321-the-blt-benedict\"\u003eThe BLT Benedict\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eThis benedict combines some of life’s greatest culinary treasures: the BLT, poached eggs, and Eric Ripert’s \u003ca href=\"https://food52.com/recipes/76748-eric-ripert-s-blender-hollandaise-sauce\"\u003efool-proof Hollandaise\u003c/a\u003e. If you’re going for a traditional brunch, a well-made benedict will never let you down.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e12. \u003ca href=\"https://food52.com/recipes/87787-best-sausage-strata\"\u003eCheesy Sausage \u0026amp; Mushroom Strata\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eThis Cheesy Sausage \u0026amp; Mushroom Strata is a comforting, crowd-pleasing dish. Serve it warm with a side of salad greens and lemon wedges for a balanced, flavorful experience.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e13. \u003ca href=\"https://food52.com/recipes/40363-shakshuka-focaccia\"\u003eShakshuka Focaccia\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eA cross between shakshuka and eggs-in a-hole, this focaccia packs nostalgic flavors into a playful aesthetic. Finished in the oven and enough to feed eight people, this dish makes serving a large group manageable.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e14. \u003ca href=\"https://food52.com/recipes/25841-smoked-salmon-red-onion-and-feta-cheese-fritatta\"\u003eSmoked Salmon Red Onion and Feta Cheese Fritatta\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eThe combination of smoked salmon, tangy feta, and caramelized red onion creates a rich flavor profile, while the eggs provide a creamy base. It\u0026#39;s easy to prepare and versatile.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e15. \u003ca href=\"https://food52.com/recipes/76747-potato-chorizo-and-cheddar-breakfast-tacos\"\u003ePotato, Chorizo, and Cheddar Breakfast Tacos\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eThe breakfast taco is truly greater than the sum of its parts—and that says a lot when the “parts” are chorizo, breakfast potatoes, and scrambled eggs. While this recipe calls for corn tortillas, flour would work well here.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e16. \u003ca href=\"https://food52.com/recipes/38381-magnus-nilsson-s-gravlax\"\u003eMagnus Nilsson\u0026#39;s Gravlax\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eWhile definitely a project (you’ll need to start at least 24 hours prior to serving), salt-curing your own salmon is an impressive—and surprisingly easy—endeavor that yields consistently delicious fish. Serve with your favorite assortment of bagels, toasts, and spreads.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e17. \u003ca href=\"https://food52.com/recipes/13444-simple-sicilian-style-grilled-steak\"\u003eSimple Sicilian-Style Grilled Steak\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eHanger is my preferred cut of steak to pair with eggs as it’s flavorful but never overpowering. This particular hanger steak is marinated with salmoriglio (a Sicilian sauce similar to a chimichurri), grilled over high heat, and sliced.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e18. \u003ca href=\"https://food52.com/recipes/17091-spring-salad-with-asparagus-and-soft-boiled-eggs\"\u003eSpring Salad with Asparagus \u0026amp; Soft-Boiled Eggs\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eIf you’re looking for something lighter, a brightly dressed salad with (in-season) asparagus and soft-boiled eggs is the way to go. The combination of briny feta, rich yolk, and acidic vinaigrette is tough to beat.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e19. \u003ca href=\"https://food52.com/recipes/85574-huevos-rancheros-recipe-with-chorizo-refried-beans\"\u003eHuevos Rancheros With Chorizo \u0026amp; Porky Refried Beans\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eThis recipe from Food52 Resident \u003ca href=\"https://food52.com/users/2142769-rick-martinez/recipes\"\u003eRick Martinez\u003c/a\u003e is quick to put together (30 minutes start to finish), loaded with chorizo (always good), and great for a big crowd (serves six). If you’re already committed to the \u003ca href=\"https://food52.com/recipes/76747-potato-chorizo-and-cheddar-breakfast-tacos\"\u003ebreakfast tacos\u003c/a\u003e from earlier, the salsa included in this recipe would make a great pairing.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e20. \u003ca href=\"https://food52.com/recipes/46368-asparagus-leek-and-ricotta-quiche\"\u003eAsparagus, Leek \u0026amp; Ricotta Quiche\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eAccording to \u003ca href=\"https://food52.com/users/3572-erin-jeanne-mcdowell/recipes\"\u003eErin McDowell\u003c/a\u003e, this is “the perfect quiche for spring” and we entirely agree. It’s bright—both visually and in flavor—and reliant on two of the season’s greatest bounties: leeks and asparagus.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e21. \u003ca href=\"https://food52.com/recipes/77210-jasper-white-s-world-famous-lobster-rolls\"\u003eJasper White’s World-Famous Lobster Rolls\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eSome reasons to make lobster rolls for brunch: One, these lobster rolls are served cold, so you can make them well in advance. Two, lobster makes any meal feel like an \u003cem\u003eoccasion\u003c/em\u003e. Three, lobster is, was, has been, and always will be delicious.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e22. \u003ca href=\"https://food52.com/recipes/75576-shirred-eggs\"\u003eShirred Eggs\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eThese Shirred Eggs are a simple yet elegant breakfast or brunch option. Eggs are baked in a dish with a splash of cream and a sprinkle of Parmesan until the whites are set and the yolks remain slightly soft.\u003c/p\u003e\n              \n  \n\n\n\n              \u003chr/\u003e\n\n              \u003ch2 id=\"cocktail-recipes\"\u003e\u003ccenter\u003eBrunch Cocktail Recipes\u003c/center\u003e\u003c/h2\u003e\n              \u003ch3\u003e23. \u003ca href=\"https://food52.com/recipes/82186-best-mimosa-recipe\"\u003eOur Best Classic Mimosa\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eFor a traditional touch, use Champagne, or opt for more affordable sparkling wines like Cava or Prosecco. customize by swapping in other fruit juices like grapefruit, pomegranate, or mango, or adding a splash of liqueur such as Cointreau or St-Germain.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e24. \u003ca href=\"https://food52.com/recipes/75833-spring-sangria-with-strawberries-and-mint\"\u003eSpring Sangria with Strawberries \u0026amp;Mint\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eI’m happy to report that—unlike most of the sangria I’ve suffered through—this recipe isn’t cloying. Dry, balanced, and herbal, this is a sangria you’ll want to sip on throughout the day. Bonus: You can make this the night before so it’s ready to go whenever brunch begins.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e25. \u003ca href=\"https://food52.com/recipes/72771-cold-brew-negroni\"\u003eCold Brew Negroni\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eSeeing two of my favorite drinks get along this well makes me smile. While from a distance the pair may seem a bit strange, there’s just a lot of chemistry here: The sweet vermouth mellows cold brew’s bitterness, while the coffee flavor adds an earthy twist.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e26. \u003ca href=\"https://food52.com/recipes/420-michelada-a-k-a-bloody-beer\"\u003eZingy Michelada With Celery Salt\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eIf you’re into \u003ca href=\"https://food52.com/recipes/36087-a-very-good-bloody-mary\"\u003eBloody Mary’s\u003c/a\u003e, by all means, make as many as your heart desires. However, if you’re like me, and prefer something a bit more refreshing, give the beer-based Michelada a try.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch3\u003e27. \u003ca href=\"https://food52.com/recipes/4175-gin-spritz\"\u003eGin Spritz\u003c/a\u003e\n\u003c/h3\u003e\n              \u003cp\u003eA spring brunch should be a lot like gin—bright and floral. This spritz is all of those things packaged into a pretty little glass.\u003c/p\u003e\n              \n  \n\n\n\n              \u003chr/\u003e\n\n              \n              \u003ccenter\u003e\n\u003cem\u003eWhich of these recipes will you be making this Mother’s Day? Let us know in the comments below!\u003c/em\u003e\n\u003c/center\u003e\n              \u003cp\u003eEditor\u0026#39;s Note: This article was updated in April 2025 with even more delicious recipes.\u003c/p\u003e\n              \n  \n\n\n\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": "2025-04-22T14:58:10-04:00",
  "modifiedTime": "2025-04-22T16:19:14-04:00"
}
