{
  "id": "ec017411-b3d2-4a79-85a9-43bc1669ae77",
  "title": "Sweet Potato, Aubergine \u0026 Tahini Salad",
  "link": "https://greenkitchenstories.com/sweet-potato-aubergine-tahini-salad-2/",
  "description": "Here is a salad we made for my sister's birthday. It's packed with flavor and perfectly combines crunchy (lettuce, nuts, cucumber) with creamy (tahini and roasted vegetables). A salad that is more than a salad.",
  "author": "Green Kitchen Stories",
  "published": "Mon, 18 Mar 2024 17:54:27 +0000",
  "source": "https://greenkitchenstories.com/feed/",
  "categories": [
    "Mains",
    "Salads",
    "Vegan",
    "gluten free"
  ],
  "byline": "Green Kitchen Stories",
  "length": 2725,
  "excerpt": "Here is a salad we made for my sister's birthday. It's packed with flavor and perfectly combines crunchy (lettuce, nuts, cucumber) with creamy (tahini and roasted vegetables). A salad that is more than a salad.",
  "siteName": "Green Kitchen Stories",
  "favicon": "https://greenkitchenstories.com/wp-content/uploads/2019/03/cropped-gks-favicon-192x192.png",
  "text": "SALAD Here is a salad we made for my sister's birthday celebration this week. It's packed with flavor and perfectly combines crunchy (lettuce, nuts, cucumber) with creamy (tahini and roasted vegetables). A salad that is more than a salad. Hi!Haven't posted a recipe on here in ages (literally). Not sure why it happened today but I was editing this salad recipe for instagram and got a flashback from when we used to write recipes here and thought: \"Heck, l'll post it on here as well\". Maybe it's a one time thing or a new (old) tradition. We'll see…Every time we have big family gathering – Christmas, birthdays or summer parties – we are asked the same question: \"You are so good at salads, can't you please bring one of your nourishing salads for dinner\". So we have become semi-pros at making big salads that we bring with us. They often contain a roasted element, regularly feature kale and always have some fruit, grains and nuts. Many salads go on repeat but this weekend I made a salad for my sister's 40th birthday (Happy Birthday Johanna!) and I kind of made this on whim and it turned out really tasty and also quite pretty.Hope you like it!  INGREDIENTS Salad Ingredients2 aubergines 2 sweet potatoes2 cups cooked quinoa 2 romaine lettuce 1 cucumber 1 handful parsley, finely chopped 1 pomegranate, seeded 1 handful almond flakes, toastedMarinade3 tbsp olive oil1 tbsp apple cider vinegar1 tsp cumin1/2 tsp ground paprika 1/2 tsp ground coriander 1 pinch ground chili 1 pinch saltTahini Dressing4 tbsp tahini 4 tbsp olive oil 1 tbsp maple syrup Juice from 1 lemon PREPARATION 1. Cut the aubergines and sweet potatoes in dices, place on a baking tray, drizzle with olive oil and salt and roast at 200C for approx 30 mins. 2. To make the marinade, add olive oil and apple cider vinegar to a jar along with the ground paprika, cumin, coriander, chili and a good pinch salt. Add a lid and shake.3. When the vegetables are done roasting, pour over the marinade, toss and let cool. 4. Make the tahini dressing in a large bowl by stirring together tahini, olive oil, maple syrup and lemon juice. 5. Add the cooked quinoa to the bowl. Chop the romaine and cucumber coarsely and add to the same bowl. Toss! 6. Plate the salad. Start with the quinoa, romaine and cucumber, then add the roasted veggies and top with parsley, pomegranate seeds and toasted almond flakes. Enjoy!",
  "image": "https://greenkitchenstories.com/wp-content/uploads/2024/03/IMG_1775_VSCO-1000x1333.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n\t\u003carticle id=\"post-22574\"\u003e\n\n\t\t\t\t\t\t\t\n\t\t\n\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-height=\"\" id=\"Intro\" data-index=\"0\"\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\u003cp\u003e\n\t\u003ch6\u003eSALAD\u003c/h6\u003e\n\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\t\n\u003cp\u003e\n\t\u003ch5\u003eHere is a salad we made for my sister\u0026#39;s birthday celebration this week. It\u0026#39;s packed with flavor and perfectly combines crunchy (lettuce, nuts, cucumber) with creamy (tahini and roasted vegetables). A salad that is more than a salad.\u003c/h5\u003e\n\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-height=\"\" id=\"Blog\" data-index=\"1\"\u003e\u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\tHi!\u003cbr/\u003eHaven\u0026#39;t posted a recipe on here in ages (literally). Not sure why it happened today but I was editing this salad recipe for \u003ca href=\"http://instagram.com/gkstories\"\u003einstagram\u003c/a\u003e and got a flashback from when we used to write recipes here and thought: \u0026#34;Heck, l\u0026#39;ll post it on here as well\u0026#34;. Maybe it\u0026#39;s a one time thing or a new (old) tradition. We\u0026#39;ll see…\u003c/p\u003e\u003cp\u003eEvery time we have big family gathering – Christmas, birthdays or summer parties – we are asked the same question: \u003cspan\u003e\u0026#34;You are so good at salads, can\u0026#39;t you please bring one of your nourishing salads for dinner\u0026#34;\u003c/span\u003e. So we have become semi-pros at making big salads that we bring with us. They often contain a roasted element, regularly feature kale and always have some fruit, grains and nuts. Many salads go on repeat but this weekend I made a salad for my sister\u0026#39;s 40th birthday (Happy Birthday Johanna!) and I kind of made this on whim and it turned out really tasty and also quite pretty.\u003cbr/\u003eHope you like it! \t\t\t\t\t\t\t\t\t\u003c/p\u003e\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\u003cdiv id=\"Recipe\" data-index=\"2\"\u003e\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\u003cdiv data-height=\"\" data-pinned=\"#3\"\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\u003cp\u003e\n\t\u003ch6\u003eINGREDIENTS\u003c/h6\u003e\n\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\t\n\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cspan\u003eSalad Ingredients\u003c/span\u003e\u003cbr/\u003e2 aubergines\n\u003cbr/\u003e2 sweet potatoes\u003cbr/\u003e2 cups cooked quinoa\n\u003cbr/\u003e2 romaine lettuce \u003cbr/\u003e\n1 cucumber \u003cbr/\u003e\n1 handful parsley, finely chopped \u003cbr/\u003e\n1 pomegranate, seeded \u003cbr/\u003e1 handful almond flakes, toasted\u003c/p\u003e\u003cp\u003e\u003cspan\u003eMarinade\u003c/span\u003e\u003cbr/\u003e3 tbsp olive oil\u003cbr/\u003e1 tbsp apple cider vinegar\u003cbr/\u003e1 tsp cumin\u003cbr/\u003e1/2 tsp ground paprika \u003cbr/\u003e1/2 tsp ground coriander\n\u003cbr/\u003e1 pinch ground chili\u003cbr/\u003e\n1 pinch salt\u003c/p\u003e\u003cp\u003e\u003cspan\u003eTahini Dressing\u003c/span\u003e\u003cbr/\u003e4 tbsp tahini\n\u003cbr/\u003e4 tbsp olive oil\n\u003cbr/\u003e1 tbsp maple syrup\n\u003cbr/\u003eJuice from 1 lemon\u003c/p\u003e\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\u003cdiv data-height=\"\" id=\"3\"\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\u003cp\u003e\n\t\u003ch6\u003ePREPARATION\u003c/h6\u003e\n\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\t\n\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t1. Cut the aubergines and sweet potatoes in dices, place on a baking tray, drizzle with olive oil and salt and roast at 200C for approx 30 mins.\n\u003cbr/\u003e2. To make the marinade, add olive oil and apple cider vinegar to a jar along with the ground paprika, cumin, coriander, chili and a good pinch salt. Add a lid and shake.\u003cbr/\u003e3. When the vegetables are done roasting, pour over the marinade, toss and let cool.\n\u003cbr/\u003e4. Make the tahini dressing in a large bowl by stirring together tahini, olive oil, maple syrup and lemon juice. \u003cbr/\u003e\n5. Add the cooked quinoa to the bowl. Chop the romaine and cucumber coarsely and add to the same bowl. Toss!\n\u003cbr/\u003e6. Plate the salad. Start with the quinoa, romaine and cucumber, then add the roasted veggies and top with parsley, pomegranate seeds and toasted almond flakes. \u003cbr/\u003e\nEnjoy!\u003cbr/\u003e\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\u003c/div\u003e\n\n\t\t\n\t\u003c/article\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-03-18T18:54:27+01:00",
  "modifiedTime": "2024-03-18T23:45:41Z"
}
