{
  "id": "00a12e4d-de25-49cb-a9e1-d289d04a9baf",
  "title": "Jade: A Fun Action B Movie That's a Calling Card for Shaina West",
  "link": "https://bleedingcool.com/movies/jade-a-fun-action-b-movie-thats-a-calling-card-for-shaina-west/",
  "description": "Jade is a fun B action movie that calls back to classics like Foxy Brown and Cleopatra Jones that introduces Shaina West as a new talent",
  "author": "Adi Tantimedh",
  "published": "Sat, 22 Feb 2025 18:18:10 -0600",
  "source": "https://www.bleedingcool.com/movies/feed/",
  "categories": [
    "Movies",
    "Review",
    "Streaming",
    "action movie",
    "arrow",
    "b movie",
    "cleopatra jones",
    "Coffy",
    "Foxy Brown",
    "Jade",
    "James Bamford",
    "Katherine McNamara",
    "Mark Dacascos",
    "martial arts",
    "mickey rourke",
    "shaina west"
  ],
  "byline": "Adi Tantimedh",
  "length": 5292,
  "excerpt": "Jade is that increasingly rare thing: an unfussy, unpretentious low budget indie action movie that recalls 1970s B movies like Coffy, Foxy Brown, and Cleopatra Jones with 21st Century slickness and a new female action star who's the real thing. Shaina West is a London stunt performer with an aspirational real-life story that could make […]",
  "siteName": "Bleeding Cool News",
  "favicon": "",
  "text": "Posted in: Movies, Review, Streaming | Tagged: action movie, arrow, b movie, cleopatra jones, Coffy, Foxy Brown, Jade, James Bamford, Katherine McNamara, Mark Dacascos, martial arts, mickey rourke, shaina westJade is a fun B action movie that calls back to classics like Foxy Brown and Cleopatra Jones that introduces Shaina West as a new talentArticle Summary Shaina West shines in indie action movie \"Jade,\" showcasing martial arts prowess without need for a stunt double. Plot pits West's Jade against Mickey Rourke's villain in a thrilling quest involving a must-have hard drive. Director James Bamford, known for Arrow, expertly crafts intense action sequences with a 1970s B movie flair. With action star potential, West's charisma and skill hint at bigger future roles in martial arts cinema. Jade is that increasingly rare thing: an unfussy, unpretentious low budget indie action movie that recalls 1970s B movies like Coffy, Foxy Brown, and Cleopatra Jones with 21st Century slickness and a new female action star who's the real thing. Shaina West is a London stunt performer with an aspirational real-life story that could make a good movie in itself, but this is a perfectly good showcase for her skills and range. \"Jade\" poster art: Well Go USA The plot is just serviceable enough without being dumb: after her brother's untimely and accidental death at her own hands, Jade (West) swore she'd never pick up another gun. But when she unknowingly comes between powerful businessman \"Tork\" (Mickey Rourke) and her former gang leader in their urgent search for a valuable hard drive that could single-handedly take down Interpol, she may not have a choice. With the guidance of Reese (Mark Dacascos), an old friend at Interpol, Jade must come to terms with all she's faced in the past and present to safeguard her growing family's future. Still: Well Go USA James Bamford is a prolific action director who has worked on many CW DC superhero series such as Arrow, so he knows how to stage action and where to point the camera, move, and edit when it happens, which already puts him ahead of a lot of other directors of action. Jade is an example of what critic Manny Farber called \"Termite Art,\" which is a form of low art that's seemingly disposable but offers surprising and subversive pleasures not found in more prestigious A-list productions. Despite an overlong animated prologue with voiceover explaining how Londoner Jade ended up in America that could have been done with just a couple of lines of dialogue during the movie itself, the movie wastes no time racing through the plot to do what this kind of movie does best: get to the next fight as soon as possible. Bamford fashioned the movie as a showcase for West and surrounds her with seasoned actors like Mickey Rourke, Mark Dacascos, and Arrow's Katherine McNamara to provide the acting heavy-lifting. Still, the script doesn't set out to stretch West's acting range. However, she's good at projecting attitude and delivering a quip before we get what we're here to see: her full-on authentic martial arts moves that combine several different forms and schools of fight that she taught herself and put together on her own, and she delivers. She can shoot, spin-kick, and slice with a katana for realsies and doesn't need a stunt double – it's all her, and she has the right kind of charisma to deliver a performance. The twinkle in her eye shows she's having an absolute ball, and she acts better than many martial arts performers who became straight-to-video action stars. Scott Atkins is the current reigning king of indie martial arts actioners whose stoicism and sardonic humour have made him his own brand. Shaina West could become another in that school or more because she's fun to watch and a rare new female action star. Jade is not a world-changing piece of cinema. It's just fun action that introduces a fun new star who might be getting more and bigger movies after this, and sometimes, that's all we want for now. Jade will be out exclusively on VOD starting on February 18th and on Blu-Ray starting on March 25th via Well Go USA. Jade Review by Adi Tantimedh 7/10 A B movie that recalls 1970s action movies such as Coffy and Cleopatra Jones but really a showcase for rising star Shaina West, who not only brings real flare for her self-taught martial arts and stunt work but also has the London sass, personality and charisma that distinguishes her from most other martial arts actors. This is not world-changing cinema but an introduction to a fun and charismatic new action star with authentic skills and charisma who could go places. Enjoyed this? Please share on social media! Stay up-to-date and support the site by following Bleeding Cool on Google News today! About Adi TantimedhAdi Tantimedh is a filmmaker, screenwriter and novelist. He wrote radio plays for the BBC Radio, “JLA: Age of Wonder” for DC Comics, “Blackshirt” for Moonstone Books, and “La Muse” for Big Head Press. Most recently, he wrote “Her Nightly Embrace”, “Her Beautiful Monster” and “Her Fugitive Heart”, a trilogy of novels featuring a British-Indian private eye published by Atria Books, a division Simon \u0026 Schuster.",
  "image": "https://bleedingcool.com/wp-content/uploads/2025/02/JADE-812x12001-1-2000x1125.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"wrapper\"\u003e\u003carticle id=\"article\" data-post-id=\"2167909\" itemscope=\"\" itemtype=\"http://schema.org/Article\"\u003e\u003cp\u003ePosted in: \u003ca href=\"https://bleedingcool.com/movies/\" rel=\"category\"\u003eMovies\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/movies/review-movies/\" rel=\"category\"\u003eReview\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/movies/streaming-movies-2/\" rel=\"category\"\u003eStreaming\u003c/a\u003e | Tagged: \u003ca href=\"https://bleedingcool.com/tag/action-movie/\" rel=\"tag\"\u003eaction movie\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/arrow/\" rel=\"tag\"\u003earrow\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/b-movie/\" rel=\"tag\"\u003eb movie\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/cleopatra-jones/\" rel=\"tag\"\u003ecleopatra jones\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/coffy/\" rel=\"tag\"\u003eCoffy\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/foxy-brown/\" rel=\"tag\"\u003eFoxy Brown\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/jade/\" rel=\"tag\"\u003eJade\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/james-bamford/\" rel=\"tag\"\u003eJames Bamford\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/katherine-mcnamara/\" rel=\"tag\"\u003eKatherine McNamara\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/mark-dacascos/\" rel=\"tag\"\u003eMark Dacascos\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/martial-arts/\" rel=\"tag\"\u003emartial arts\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/mickey-rourke/\" rel=\"tag\"\u003emickey rourke\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/shaina-west/\" rel=\"tag\"\u003eshaina west\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\u003cp\u003eJade is a fun B action movie that calls back to classics like Foxy Brown and Cleopatra Jones that introduces Shaina West as a new talent\u003c/p\u003e\u003chr/\u003e\u003chr/\u003e\u003cdiv id=\"post_summary\"\u003e\u003ch2\u003eArticle Summary\u003c/h2\u003e\u003cul\u003e\n\u003cli\u003eShaina West shines in indie action movie \u0026#34;Jade,\u0026#34; showcasing martial arts prowess without need for a stunt double.\u003c/li\u003e\n\u003cli\u003ePlot pits West\u0026#39;s Jade against Mickey Rourke\u0026#39;s villain in a thrilling quest involving a must-have hard drive.\u003c/li\u003e\n\u003cli\u003eDirector James Bamford, known for Arrow, expertly crafts intense action sequences with a 1970s B movie flair.\u003c/li\u003e\n\u003cli\u003eWith action star potential, West\u0026#39;s charisma and skill hint at bigger future roles in martial arts cinema.\u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003chr/\u003e\u003cp\u003e\u003ciframe width=\"1170\" height=\"658\" srcdoc=\"\u0026lt;style\u0026gt;*{padding:0;margin:0;overflow:hidden}html,body{height:100%}img,span{position:absolute;width:100%;top:0;bottom:0;margin:auto}span{height:1.5em;text-align:center;font:48px/1.5 sans-serif;color:white;text-shadow:0 0 0.5em black}\u0026lt;/style\u0026gt;\u0026lt;a href=https://www.youtube.com/embed/FCdbJLHUNE0?feature=oembed?autoplay=1\u0026gt;\u0026lt;img src=https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://img.youtube.com/vi/FCdbJLHUNE0/hqdefault.jpg loading=\u0026#34;lazy\u0026#34; alt=\u0026#34;Link to play video.\u0026#34;\u0026gt;\u0026lt;span\u0026gt;▶\u0026lt;/span\u0026gt;\u0026lt;/a\u0026gt;\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture; fullscreen;\" loading=\"lazy\" src=\"https://www.youtube.com/embed/FCdbJLHUNE0?feature=oembed\" title=\"Youtube Video\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eJade\u003c/em\u003e is that increasingly rare thing: an unfussy, unpretentious low budget indie action movie that recalls 1970s B movies like \u003cem\u003eCoffy\u003c/em\u003e, \u003cem\u003eFoxy Brown,\u003c/em\u003e and \u003cem\u003eCleopatra Jones\u003c/em\u003e with 21st Century slickness and a new female action star who\u0026#39;s the real thing. \u003cstrong\u003eShaina West\u003c/strong\u003e is a London stunt performer with an aspirational real-life story that could make a good movie in itself, but this is a perfectly good showcase for her skills and range.\u003c/p\u003e\n\u003cfigure id=\"attachment_2167927\" aria-describedby=\"caption-attachment-2167927\"\u003e\u003ca href=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://bleedingcool.com/wp-content/uploads/2025/02/JADE-812x12001-1.jpg\"\u003e\u003cimg src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:887/q:75/https://bleedingcool.com/wp-content/uploads/2025/02/JADE-812x12001-1.jpg\" alt=\"Jade: A Fun Action B Movie That\u0026#39;s a Calling Card for Shaina West\" width=\"600\" height=\"887\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:887/q:75/https://bleedingcool.com/wp-content/uploads/2025/02/JADE-812x12001-1.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20600%20887%22%20width%3D%22600%22%20height%3D%22887%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2167927\"\u003e\u0026#34;Jade\u0026#34; poster art: Well Go USA\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eThe plot is just serviceable enough without being dumb: after her brother\u0026#39;s untimely and accidental death at her own hands, \u003cspan\u003eJade\u003c/span\u003e (West) swore she\u0026#39;d never pick up another gun. But when she unknowingly comes between powerful businessman \u0026#34;Tork\u0026#34; (\u003cstrong\u003eMickey Rourke\u003c/strong\u003e) and her former gang leader in their urgent search for a valuable hard drive that could single-handedly take down Interpol, she may not have a choice. With the guidance of Reese (\u003cstrong\u003eMark Dacascos\u003c/strong\u003e), an old friend at Interpol, \u003cspan\u003eJade\u003c/span\u003e must come to terms with all she\u0026#39;s faced in the past and present to safeguard her growing family\u0026#39;s future.\u003c/p\u003e\n\u003cfigure id=\"attachment_2167928\" aria-describedby=\"caption-attachment-2167928\"\u003e\u003ca href=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://bleedingcool.com/wp-content/uploads/2025/02/JADE-Still1-1340x754-1.jpg\"\u003e\u003cimg src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:338/q:75/https://bleedingcool.com/wp-content/uploads/2025/02/JADE-Still1-1340x754-1.jpg\" alt=\"Jade: A Fun Action B Movie That\u0026#39;s a Calling Card for Shaina West\" width=\"600\" height=\"338\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:338/q:75/https://bleedingcool.com/wp-content/uploads/2025/02/JADE-Still1-1340x754-1.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20600%20338%22%20width%3D%22600%22%20height%3D%22338%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2167928\"\u003eStill: Well Go USA\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\u003cstrong\u003eJames Bamford\u003c/strong\u003e is a prolific action director who has worked on many CW DC superhero series such as Arrow, so he knows how to stage action and where to point the camera, move, and edit when it happens, which already puts him ahead of a lot of other directors of action. \u003cem\u003eJade\u003c/em\u003e is an example of what critic \u003cstrong\u003eManny Farber\u003c/strong\u003e called \u0026#34;Termite Art,\u0026#34; which is a form of low art that\u0026#39;s seemingly disposable but offers surprising and subversive pleasures not found in more prestigious A-list productions. Despite an overlong animated prologue with voiceover explaining how Londoner Jade ended up in America that could have been done with just a couple of lines of dialogue during the movie itself, the movie wastes no time racing through the plot to do what this kind of movie does best: get to the next fight as soon as possible.\u003c/p\u003e\n\u003cp\u003eBamford fashioned the movie as a showcase for West and surrounds her with seasoned actors like Mickey Rourke, \u003cstrong\u003eMark Dacascos,\u003c/strong\u003e and Arrow\u0026#39;s \u003cstrong\u003eKatherine McNamara\u003c/strong\u003e to provide the acting heavy-lifting. Still, the script doesn\u0026#39;t set out to stretch West\u0026#39;s acting range. However, she\u0026#39;s good at projecting attitude and delivering a quip before we get what we\u0026#39;re here to see: her full-on authentic martial arts moves that combine several different forms and schools of fight that she taught herself and put together on her own, and she delivers. She can shoot, spin-kick, and slice with a katana for realsies and doesn\u0026#39;t need a stunt double – it\u0026#39;s all her, and she has the right kind of charisma to deliver a performance. The twinkle in her eye shows she\u0026#39;s having an absolute ball, and she acts better than many martial arts performers who became straight-to-video action stars. \u003cstrong\u003eScott Atkins\u003c/strong\u003e is the current reigning king of indie martial arts actioners whose stoicism and sardonic humour have made him his own brand. Shaina West could become another in that school or more because she\u0026#39;s fun to watch and a rare new female action star.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eJade\u003c/em\u003e is not a world-changing piece of cinema. It\u0026#39;s just fun action that introduces a fun new star who might be getting more and bigger movies after this, and sometimes, that\u0026#39;s all we want for now.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eJade\u003c/em\u003e will be out exclusively on VOD starting on February 18th and on Blu-Ray starting on March 25th via \u003ca href=\"https://wellgousa.com/films/jade\"\u003eWell Go USA\u003c/a\u003e.\u003c/p\u003e\n\u003cdiv id=\"review_box\" vocab=\"https://schema.org/\" typeof=\"Review\"\u003e\n  \u003cdiv property=\"itemReviewed\" typeof=\"Movie\"\u003e\n    \u003cp\u003e\u003cspan property=\"name\"\u003eJade\u003c/span\u003e\u003c/p\u003e\n    \u003chr/\u003e\n    \u003cp\u003e\u003cimg property=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:887/q:75/https://bleedingcool.com/wp-content/uploads/2025/02/JADE-812x12001-1-600x887.jpg\" alt=\"Jade: A Fun Action B Movie That\u0026#39;s a Calling Card for Shaina West\" width=\"600\" height=\"887\"/\u003e\n    \u003c/p\u003e\n  \u003c/div\u003e\n  \u003cdiv id=\"review_data\"\u003e\n    \u003cp\u003eReview by \u003cspan property=\"name\"\u003eAdi Tantimedh\u003c/span\u003e\u003c/p\u003e\n    \u003chr/\u003e\n    \u003cp\u003e\u003cspan property=\"ratingValue\"\u003e7\u003c/span\u003e/\u003cspan property=\"bestRating\"\u003e10\u003c/span\u003e\u003c/p\u003e\n    \u003cp\u003eA B movie that recalls 1970s action movies such as Coffy and Cleopatra Jones but really a showcase for rising star Shaina West, who not only brings real flare for her self-taught martial arts and stunt work but also has the London sass, personality and charisma that distinguishes her from most other martial arts actors. This is not world-changing cinema but an introduction to a fun and charismatic new action star with authentic skills and charisma who could go places. \u003c/p\u003e\n  \u003c/div\u003e\n\u003c/div\u003e\n\u003chr/\u003e\u003cdiv id=\"bc_sharing_is_caring\"\u003e\u003ccenter\u003e\u003cp\u003e\u003cstrong\u003eEnjoyed this? Please share on social media!\u003c/strong\u003e\u003c/p\u003e\u003ca href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fjade-a-fun-action-b-movie-thats-a-calling-card-for-shaina-west%2F\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://twitter.com/share?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fjade-a-fun-action-b-movie-thats-a-calling-card-for-shaina-west%2F\u0026amp;text=Jade%3A+A+Fun+Action+B+Movie+That%27s+a+Calling+Card+for+Shaina+West\u0026amp;via=bleedingcool\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"http://pinterest.com/pin/create/button/?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fjade-a-fun-action-b-movie-thats-a-calling-card-for-shaina-west%2F\u0026amp;description=Jade%3A+A+Fun+Action+B+Movie+That%27s+a+Calling+Card+for+Shaina+West\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://reddit.com/submit?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fjade-a-fun-action-b-movie-thats-a-calling-card-for-shaina-west%2F\u0026amp;title=Jade%3A+A+Fun+Action+B+Movie+That%27s+a+Calling+Card+for+Shaina+West\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003c/center\u003e\u003c/div\u003e\n    \u003ca id=\"google_follow\" href=\"https://news.google.com/publications/CAAqBwgKMPHflgsw1IauAw?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n        \u003cp\u003e\u003cimg width=\"100\" height=\"81\u0026#34;\" src=\"https://bleedingcool.com/Google_News_icon.png\"/\u003e\n        \u003c/p\u003e\n        \u003cp\u003e\n            Stay up-to-date and support the site by following Bleeding Cool on Google News today!\n        \u003c/p\u003e\n    \u003c/a\u003e\u003c/article\u003e\u003csection\u003e\u003ch2\u003e\u003cimg data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:150/h:150/q:75/https://www.gravatar.com/avatar/75770923c20d3c0ae86ec09aecb5b97e?s=150\" src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20150%20150%22%20width%3D%22150%22%20height%3D%22150%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\" width=\"150px\" height=\"150px\" alt=\"Adi Tantimedh\"/\u003eAbout \u003ca href=\"https://bleedingcool.com/author/aditantimedh/\"\u003eAdi Tantimedh\u003c/a\u003e\u003c/h2\u003eAdi Tantimedh is a filmmaker, screenwriter and novelist. He wrote radio plays for the BBC Radio, “JLA: Age of Wonder” for DC Comics, “Blackshirt” for Moonstone Books, and “La Muse” for Big Head Press. Most recently, he wrote “Her Nightly Embrace”, “Her Beautiful Monster” and “Her Fugitive Heart”, a trilogy of novels featuring a British-Indian private eye published by Atria Books, a division Simon \u0026amp; Schuster.\u003c/section\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-02-22T18:18:10-06:00",
  "modifiedTime": "2025-02-22T18:18:10-06:00"
}
