{
  "id": "0bc4bd56-3a71-45fd-b6ee-daa8e4a6530e",
  "title": "Who Is Hawkeye's Wife? Everything We Know About Laura Barton (A.K.A. Agent 19)",
  "link": "https://www.slashfilm.com/1808755/hawkeye-wife-laura-barton-agent-19-marvel-details/",
  "description": "Linda Cardellini's Laura Barton first appeared in the MCU in Avengers: Age of Ultron. But her backstory is much more intriguing than just being Hawkeye's wife.",
  "author": "Nick Staniforth",
  "published": "Wed, 19 Mar 2025 00:00:00 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Action \u0026 Adventure Movies",
    "Superhero Movies",
    "Superhero Shows"
  ],
  "byline": "Nick Staniforth",
  "length": 8619,
  "excerpt": "Linda Cardellini's Laura Barton first appeared in the MCU in Avengers: Age of Ultron. But her backstory is much more intriguing than just being Hawkeye's wife.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slash-film-favicon-448x448.png",
  "text": "Static Media They say behind every good Avenger is a lifelong partner who's okay with them heading off to save the world from Norse gods, angry robots, or glove-obsessed purple tyrants. In the case of Clint Barton, aka Hawkeye, that person is his devoted wife and mother to his three children, Laura Barton (Linda Cardellini, who had more than one role in the MCU voicing Lylla from \"Guardians of the Galaxy Vol. 3\"). Sticking with the avenging archer through thick and thin and sharing a love so strong Clint crossed time and space to bring it back, it's safe to say that Laura Barton truly was one of the good ones. But just what is her history in the MCU, and how much of it comes from the comics? It turns out Laura Barton's history is as surprising as her entrance into the world of super soldiers and iron men. It's a past that, while simple for casual viewers, actually gets a bit more confusing the deeper you dive into this franchise that's spanned over 17 years. Look close enough and you'll find sprinkled in amongst it another character with whom she shares a history but somehow never crossed paths with in the MCU machine. Before we get to that, though, let's break down where Laura Barton appeared in the Marvel Cinematic Universe and the odds of her returning further down the line with a completely different Hawkeye taking shots instead. Linda Cardellini made her debut as Laura Barton in Avengers: Age of Ultron Marvel Studios In what might be one of the most human and heartwarming moments in the MCU, Linda Cardellini unexpectedly appeared to Earth's Mightiest Heroes during their second major adventure together in \"Avengers: Age of Ultron.\" After being overpowered by a man-made monster that concluded man wasn't needed anymore, the team sought refuge in Clint's hidden home, where his wife and children awaited him. It was revealed that as part of Hawkeye's arrangement with S.H.I.E.L.D., the Barton family could live off the grid, away from the dangers their dear old Dad regularly faced. At the time, the only person who knew of the Barton family's existence besides Clint was his good friend Natasha Romanoff, aka Black Widow (Scarlett Johansson), who had been clearly close to Hawkeye's family for some time. What was even more surprising was just how chill Laura was about her husband's work environment and how accepting she was of her very human husband going off to fight alongside enhanced individuals to take down an evil artificial intelligence. As her beau rightfully pointed out in Sokovia, none of this made sense. That is, until it was revealed in Clint's standalone Disney+ story that Laura wasn't clueless about the action he regularly found himself in — she had actually once been a part of it herself. Laura revealed herself as Agent 19 in Marvel's Hawkeye Marvel Studios As the weeks passed during the festive bit of fun that was Marvel's \"Hawkeye\" series, fans suspected that the watch Clint was so set on retrieving in the underground auction at the start of the show belonged to his wife. Engraved with the number 19 on the face, all fingers (or hands) pointed to his beloved wife, Laura, as the owner. The item was either a retirement gift for her years in the service of S.H.I.E.L.D. or a reference to her former alias. In the comics, Agent 19 was a codename given to the real Marvel character, Barbara \"Bobbi\" Morse. Handed the title in \"Astonishing Tales\" #18 in 1973, she also went by the name Mockingbird, her more popular superhero title she carried as a member of S.H.I.E.L.D.. Just like Mrs. Barton, Bobbi had no superpowers but wielded a lethal set of skills more in line with Black Widow and her husband's, which explains why, in the MCU, her live-action iteration was so clued into her husband's way of work and why, in the \"Hawkeye\" season finale, Clint gives her a casual ribbing, advising that she needs to keep a closer eye on her things. The only issue about all of this is that Laura Barton wasn't the only Agent 19 in the MCU. There was another character elsewhere that was getting in on the action who was actually closer to the original Marvel character, and only avoided complication by having her and other heroes almost phased out of the MCU entirely. Agent 19 had an alias that was already taken in the MCU Marvel Studios A year before Laura Barton appeared, Bobbi Morse made her debut in \"Agents of S.H.I.E.L.D.\" The MCU spin-off series saw Clark Gregg reprise his role as Agent Coulson, tackling top-secret missions while Earth's Mightiest Heroes dealt with their own issues. Arriving in the second season of the show, Morse was played by Adrianne Palicki and was much closer to the comic book version of the character than what Cardellini was eventually revealed to be. Deceptive, lethal, and even wielding the character's signature staves, she quickly became a fan favorite and beloved iteration of Mockingbird. However, she never took on the title of Agent 19, avoiding at least a little bit of confusion as a result. As the show progressed, though, the story of this small band of secret agents, which had often been interwoven with major events in the MCU, eventually veered off on its own path until the series' cancellation in 2020. By that point, the Mockingbird and Laura Barton mix-up was no longer an issue. Nevertheless, the two characters' sharing similar comic book identities transformed a major story element of Clint Barton's backstory, altering his history with one of these two lethal ladies altogether. Laura Barton did exist in the comics, but suffered a terrible and shocking fate Marvel Comics Besides Laura Barton being Agent 19 of the MCU, she also stole the love interest of the Mockingbird in the same universe. In the comics, Bobbi Morse was briefly married to Hawkeye, but their tumultuous relationship ended in divorce. Since then, the two have remained close but went on to date other people. As far as the connection between Palicki's Mockingbird and Renner's Hawkeye go, it was revealed that the two did work together. As for Laura Barton, there was a comic book version of the character in the Ultimate Universe (Earth-1610) who lived a similar life to the one in the MCU. Tucked out of the way and getting regular calls from Clint before every mission, the pair even had three children together: Callum, Lewis, and Nicole (the latter named after their godfather, Nick Fury). Sadly, tragedy struck the Ultimate comics version of the Barton home when assassins killed Laura and the children, and Clint was captured following the incident. After escaping, he found out the person responsible for the attack was none other than the Black Widow, Natasha Romanoff, and Clint killed her to get revenge for the murder of his family. Thankfully, the MCU's Hawkeye hasn't had to endure the same loss and the Bartons are still one big happy arrow-firing family who hopefully have a few more appearances in the cinematic universe. Also, now that Kate Bishop (Hailee Steinfeld) has taken up the title of Hawkeye from here on out, perhaps her stay with the Bartons could even demand Laura get back in on some action, as well.",
  "image": "https://www.slashfilm.com/img/gallery/who-is-hawkeyes-wife-everything-we-know-about-laura-barton-a-k-a-agent-19/l-intro-1741708467.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n    \n                \u003cdiv\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1808755/hawkeye-wife-laura-barton-agent-19-marvel-details/\" data-post-title=\"Who Is Hawkeye\u0026#39;s Wife? Everything We Know About Laura Barton (A.K.A. Agent 19)\" data-slide-num=\"0\" data-post-id=\"1808755\"\u003e\n                                             \u003cpicture id=\"pb393da42ea8b09692dd4a62132b327b5\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/who-is-hawkeyes-wife-everything-we-know-about-laura-barton-a-k-a-agent-19/intro-1741708467.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/who-is-hawkeyes-wife-everything-we-know-about-laura-barton-a-k-a-agent-19/intro-1741708467.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/who-is-hawkeyes-wife-everything-we-know-about-laura-barton-a-k-a-agent-19/intro-1741708467.jpg\" data-slide-url=\"https://www.slashfilm.com/1808755/hawkeye-wife-laura-barton-agent-19-marvel-details/\" data-post-id=\"1808755\" data-slide-num=\"0\" data-slide-title=\"Who Is Hawkeye\u0026#39;s Wife? Everything We Know About Laura Barton (A.K.A. Agent 19): \" width=\"780\" height=\"438\" alt=\"Mockingbird and Agent 19, Laura Barton\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eStatic Media\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eThey say behind every good Avenger is a lifelong partner who\u0026#39;s okay with them heading off to save the world from Norse gods, angry robots, or glove-obsessed purple tyrants. In the case of Clint Barton, aka Hawkeye, that person is his devoted wife and mother to his three children, Laura Barton \u003ca href=\"https://www.slashfilm.com/1279162/every-actor-more-than-one-role-mcu/\" target=\"_blank\"\u003e(Linda Cardellini, who had more than one role in the MCU voicing Lylla from \u0026#34;Guardians of the Galaxy Vol. 3\u0026#34;)\u003c/a\u003e. Sticking with the avenging archer through thick and thin and sharing a love so strong Clint crossed time and space to bring it back, it\u0026#39;s safe to say that Laura Barton truly was one of the good ones. But just what is her history in the MCU, and how much of it comes from the comics?\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eIt turns out Laura Barton\u0026#39;s history is as surprising as her entrance into the world of super soldiers and iron men. It\u0026#39;s a past that, while simple for casual viewers, actually gets a bit more confusing the deeper you dive into this franchise that\u0026#39;s spanned over 17 years. Look close enough and you\u0026#39;ll find sprinkled in amongst it another character with whom she shares a history but somehow never crossed paths with in the MCU machine. Before we get to that, though, let\u0026#39;s break down where Laura Barton appeared in the Marvel Cinematic Universe and the odds of her returning further down the line with a completely different Hawkeye taking shots instead.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eLinda Cardellini made her debut as Laura Barton in Avengers: Age of Ultron\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1808755/hawkeye-wife-laura-barton-agent-19-marvel-details/\" data-post-title=\"Who Is Hawkeye\u0026#39;s Wife? Everything We Know About Laura Barton (A.K.A. Agent 19)\" data-slide-num=\"1\" data-post-id=\"1808755\"\u003e\n                                             \u003cpicture id=\"p9425193cdf66fd26c1c9aeb5058d886f\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/who-is-hawkeyes-wife-everything-we-know-about-laura-barton-a-k-a-agent-19/linda-cardellini-made-her-debut-as-laura-barton-in-avengers-age-of-ultron-1741708468.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/who-is-hawkeyes-wife-everything-we-know-about-laura-barton-a-k-a-agent-19/linda-cardellini-made-her-debut-as-laura-barton-in-avengers-age-of-ultron-1741708468.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/who-is-hawkeyes-wife-everything-we-know-about-laura-barton-a-k-a-agent-19/linda-cardellini-made-her-debut-as-laura-barton-in-avengers-age-of-ultron-1741708468.jpg\" data-slide-url=\"https://www.slashfilm.com/1808755/hawkeye-wife-laura-barton-agent-19-marvel-details/\" data-post-id=\"1808755\" data-slide-num=\"1\" data-slide-title=\"Who Is Hawkeye\u0026#39;s Wife? Everything We Know About Laura Barton (A.K.A. Agent 19): Linda Cardellini made her debut as Laura Barton in Avengers: Age of Ultron\" width=\"780\" height=\"438\" alt=\"Laura and Clint Barton at home\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eMarvel Studios\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eIn what might be one of the most human and heartwarming moments in the MCU, Linda Cardellini unexpectedly appeared to Earth\u0026#39;s Mightiest Heroes during their second major adventure together in \u0026#34;Avengers: Age of Ultron.\u0026#34; After being overpowered by a man-made monster that concluded man wasn\u0026#39;t needed anymore, the team sought refuge in Clint\u0026#39;s hidden home, where his wife and children awaited him. It was revealed that as part of Hawkeye\u0026#39;s arrangement with S.H.I.E.L.D., the Barton family could live off the grid, away from the dangers their dear old Dad regularly faced.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eAt the time, the only person who knew of the Barton family\u0026#39;s existence besides Clint was his good friend Natasha Romanoff, aka Black Widow (Scarlett Johansson), who had been clearly close to Hawkeye\u0026#39;s family for some time. What was even more surprising was just how chill Laura was about her husband\u0026#39;s work environment and how accepting she was of her very human husband going off to fight alongside enhanced individuals to take down an evil artificial intelligence. As her beau rightfully pointed out in Sokovia, none of this made sense. That is, until it was revealed in Clint\u0026#39;s standalone Disney+ story that Laura wasn\u0026#39;t clueless about the action he regularly found himself in — she had actually once been a part of it herself.\u003c/p\u003e\n\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eLaura revealed herself as Agent 19 in Marvel\u0026#39;s Hawkeye\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1808755/hawkeye-wife-laura-barton-agent-19-marvel-details/\" data-post-title=\"Who Is Hawkeye\u0026#39;s Wife? Everything We Know About Laura Barton (A.K.A. Agent 19)\" data-slide-num=\"2\" data-post-id=\"1808755\"\u003e\n                                             \u003cpicture id=\"p0a8b74b571e48b60dbe21f9a9fcefb25\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/who-is-hawkeyes-wife-everything-we-know-about-laura-barton-a-k-a-agent-19/laura-revealed-herself-as-agent-19-in-marvels-hawkeye-1741708469.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/who-is-hawkeyes-wife-everything-we-know-about-laura-barton-a-k-a-agent-19/laura-revealed-herself-as-agent-19-in-marvels-hawkeye-1741708469.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/who-is-hawkeyes-wife-everything-we-know-about-laura-barton-a-k-a-agent-19/laura-revealed-herself-as-agent-19-in-marvels-hawkeye-1741708469.jpg\" data-slide-url=\"https://www.slashfilm.com/1808755/hawkeye-wife-laura-barton-agent-19-marvel-details/\" data-post-id=\"1808755\" data-slide-num=\"2\" data-slide-title=\"Who Is Hawkeye\u0026#39;s Wife? Everything We Know About Laura Barton (A.K.A. Agent 19): Laura revealed herself as Agent 19 in Marvel\u0026#39;s Hawkeye\" width=\"780\" height=\"438\" alt=\"Laura Barton on the phone\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eMarvel Studios\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eAs the weeks passed during \u003ca href=\"https://www.slashfilm.com/668536/hawkeye-review-jeremy-renner-and-hailee-steinfeld-are-superb-in-marvels-street-level-superhero-series/\" target=\"_blank\"\u003ethe festive bit of fun that was Marvel\u0026#39;s \u0026#34;Hawkeye\u0026#34; series\u003c/a\u003e, fans suspected that the watch Clint was so set on retrieving in the underground auction at the start of the show belonged to his wife. Engraved with the number 19 on the face, all fingers (or hands) pointed to his beloved wife, Laura, as the owner. The item was either a retirement gift for her years in the service of S.H.I.E.L.D. or a reference to her former alias.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eIn the comics, Agent 19 was a codename given to the real Marvel character, Barbara \u0026#34;Bobbi\u0026#34; Morse. Handed the title in \u0026#34;Astonishing Tales\u0026#34; #18 in 1973, she also went by the name Mockingbird, her more popular superhero title she carried as a member of S.H.I.E.L.D.. Just like Mrs. Barton, Bobbi had no superpowers but wielded a lethal set of skills more in line with Black Widow and her husband\u0026#39;s, which explains why, in the MCU, her live-action iteration was so clued into her husband\u0026#39;s way of work and why, \u003ca href=\"https://www.slashfilm.com/715177/the-hawkeye-finale-finally-explained-whats-up-with-that-watch/\" target=\"_blank\"\u003ein the \u0026#34;Hawkeye\u0026#34; season finale\u003c/a\u003e, Clint gives her a casual ribbing, advising that she needs to keep a closer eye on her things.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eThe only issue about all of this is that Laura Barton wasn\u0026#39;t the only Agent 19 in the MCU. There was another character elsewhere that was getting in on the action who was actually closer to the original Marvel character, and only avoided complication by having her and other heroes almost phased out of the MCU entirely.\u003c/p\u003e\n\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eAgent 19 had an alias that was already taken in the MCU\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1808755/hawkeye-wife-laura-barton-agent-19-marvel-details/\" data-post-title=\"Who Is Hawkeye\u0026#39;s Wife? Everything We Know About Laura Barton (A.K.A. Agent 19)\" data-slide-num=\"3\" data-post-id=\"1808755\"\u003e\n                                             \u003cpicture id=\"p5fb2f74f44509fe718daa1d0a1051e89\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/who-is-hawkeyes-wife-everything-we-know-about-laura-barton-a-k-a-agent-19/agent-19-had-an-alias-that-was-already-taken-in-the-mcu-1741708469.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/who-is-hawkeyes-wife-everything-we-know-about-laura-barton-a-k-a-agent-19/agent-19-had-an-alias-that-was-already-taken-in-the-mcu-1741708469.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/who-is-hawkeyes-wife-everything-we-know-about-laura-barton-a-k-a-agent-19/agent-19-had-an-alias-that-was-already-taken-in-the-mcu-1741708469.jpg\" data-slide-url=\"https://www.slashfilm.com/1808755/hawkeye-wife-laura-barton-agent-19-marvel-details/\" data-post-id=\"1808755\" data-slide-num=\"3\" data-slide-title=\"Who Is Hawkeye\u0026#39;s Wife? Everything We Know About Laura Barton (A.K.A. Agent 19): Agent 19 had an alias that was already taken in the MCU\" width=\"780\" height=\"438\" alt=\"Mockingbird holding a gun\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eMarvel Studios\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eA year before Laura Barton appeared, Bobbi Morse made her debut in \u0026#34;Agents of S.H.I.E.L.D.\u0026#34; The MCU spin-off series saw Clark Gregg reprise his role as Agent Coulson, tackling top-secret missions while Earth\u0026#39;s Mightiest Heroes dealt with their own issues. Arriving in the second season of the show, \u003ca href=\"https://www.slashfilm.com/534490/first-look-agents-of-shield-mockingbird/\" target=\"_blank\"\u003eMorse was played by Adrianne Palicki and was much closer to the comic book version of the character\u003c/a\u003e than what Cardellini was eventually revealed to be. Deceptive, lethal, and even wielding the character\u0026#39;s signature staves, she quickly became a fan favorite and beloved iteration of Mockingbird. However, she never took on the title of Agent 19, avoiding at least a little bit of confusion as a result.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eAs the show progressed, though, the story of this small band of secret agents, which had often been interwoven with major events in the MCU, eventually veered off on its own path until the series\u0026#39; cancellation in 2020. By that point, the Mockingbird and Laura Barton mix-up was no longer an issue. Nevertheless, the two characters\u0026#39; sharing similar comic book identities transformed a major story element of Clint Barton\u0026#39;s backstory, altering his history with one of these two lethal ladies altogether.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eLaura Barton did exist in the comics, but suffered a terrible and shocking fate\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1808755/hawkeye-wife-laura-barton-agent-19-marvel-details/\" data-post-title=\"Who Is Hawkeye\u0026#39;s Wife? Everything We Know About Laura Barton (A.K.A. Agent 19)\" data-slide-num=\"4\" data-post-id=\"1808755\"\u003e\n                                             \u003cpicture id=\"p109f6ca2a890262dfc356cc0b4e32616\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/who-is-hawkeyes-wife-everything-we-know-about-laura-barton-a-k-a-agent-19/laura-barton-did-exist-in-the-comics-but-suffered-a-terrible-and-shocking-fate-1741708470.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/who-is-hawkeyes-wife-everything-we-know-about-laura-barton-a-k-a-agent-19/laura-barton-did-exist-in-the-comics-but-suffered-a-terrible-and-shocking-fate-1741708470.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/who-is-hawkeyes-wife-everything-we-know-about-laura-barton-a-k-a-agent-19/laura-barton-did-exist-in-the-comics-but-suffered-a-terrible-and-shocking-fate-1741708470.jpg\" loading=\"lazy\" data-slide-url=\"https://www.slashfilm.com/1808755/hawkeye-wife-laura-barton-agent-19-marvel-details/\" data-post-id=\"1808755\" data-slide-num=\"4\" data-slide-title=\"Who Is Hawkeye\u0026#39;s Wife? Everything We Know About Laura Barton (A.K.A. Agent 19): Laura Barton did exist in the comics, but suffered a terrible and shocking fate\" width=\"780\" height=\"438\" alt=\"Mockingbird and Laura Barton side by side\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eMarvel Comics\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eBesides Laura Barton being Agent 19 of the MCU, she also stole the love interest of the Mockingbird in the same universe. In the comics, Bobbi Morse was briefly married to Hawkeye, but their tumultuous relationship ended in divorce. Since then, the two have remained close but went on to date other people. As far as the connection between Palicki\u0026#39;s Mockingbird and Renner\u0026#39;s Hawkeye go, it was revealed that the two did work together. As for Laura Barton, there was a comic book version of the character in the Ultimate Universe (Earth-1610) who lived a similar life to the one in the MCU. Tucked out of the way and getting regular calls from Clint before every mission, the pair even had three children together: Callum, Lewis, and Nicole (the latter named after their godfather, Nick Fury).\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eSadly, tragedy struck the Ultimate comics version of the Barton home when assassins killed Laura and the children, and Clint was captured following the incident. After escaping, he found out the person responsible for the attack was none other than the Black Widow, Natasha Romanoff, and Clint killed her to get revenge for the murder of his family. Thankfully, the MCU\u0026#39;s Hawkeye hasn\u0026#39;t had to endure the same loss and the Bartons are still one big happy arrow-firing family who hopefully have a few more appearances in the cinematic universe. Also, now that Kate Bishop (Hailee Steinfeld) has taken up the title of Hawkeye from here on out, perhaps her stay with the Bartons could even demand Laura get back in on some action, as well. \u003c/p\u003e\n\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-03-19T00:00:00Z",
  "modifiedTime": "2025-03-19T00:00:00Z"
}
