{
  "id": "0d889c69-b30f-4eda-b32b-00d680e2a236",
  "title": "Katy Perry Named This Grotesque Horror Flick The Best Movie Of 2024",
  "link": "https://www.slashfilm.com/1710704/katy-perry-best-movie-2024-horror-the-substance/",
  "description": "Katy Perry might not be a likely source for movie opinions, but her favorite movie of 2024 is one of the best horror films of the year.",
  "author": "Jeremy Smith",
  "published": "Mon, 11 Nov 2024 23:43:20 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Horror Movies"
  ],
  "byline": "Jeremy Smith",
  "length": 3334,
  "excerpt": "Katy Perry might not be a likely source for movie opinions, but her favorite movie of 2024 is one of the best horror films of the year.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slash-film-favicon-448x448.png",
  "text": "Paramount Every year of late seems to be a great year for horror, so it's hardly a surprise that 2024 is holding its own in the scares department. As has been the case with the genre, the fun of this year's terror pictures have been how they attack our fears from unexpected angles while placing fresh spins on seemingly hoary forms. Think you're totally checked out on slasher flicks? Here's Chris Nash's \"In a Violent Nature\" to pull you back in. Feel like the serial killer procedural has aped \"The Silence of the Lambs\" into hideous self-parody? Oz Perkins has a little number called \"Longlegs\" that injects that formula with an unsettlingly atmospheric and just plain bizarre energy (that last element coming courtesy of Nicolas Cage who wanders through the film shrieking like a banshee). Done with vampires? The \"Ready or Not\" duo of Matt Bettinelli-Olpin and Tyler Gillett have a kidnapping-thriller gone horribly wrong in the infectiously fun \"Abigail.\" And who knew we needed a found-footage demonic possession riff set against the backdrop of a talk show? Colin and Cameron Cairnes did with \"Late Night with the Devil.\" There's so much subversion out there, that you might find yourself puzzling over where to start. What provocation do you need to jab in your veins tonight? It's times like these that we turn to multi-platinum pop star Katy Perry for guidance. No one asked for her thoughts on horror, but she gave them, and we can at least be thankful that she seemingly has good taste in the body horror department. The Substance has Katy Perry seeing fireworks Working Title At 3:08 AM EST on November 11, 2024, Katy Perry took to X/Twitter (why not Bluesky?) to declare \"'The Substance' — best film this year.\" Okay then. The buzzy sophomore effort from French filmmaker Coralie Fargeat is a shockingly grotesque piece of body horror that shook up a male Universal executive so much that the indie distributor MUBI had to handle the film's release in the United States and the United Kingdom. That's detestably garbage treatment from a studio that made its name on monsters like Frankenstein, Dracula, and the Wolf Man. Horror should always have a home at Universal. Fortunately, it now has a home in your living room via MUBI, so you can take in this hot-button horror movie about a fading movie star (Demi Moore) who's given the chance to create a younger version of herself (Margaret Qualley) via the title product. Sound like this is just another take on \"The Portrait of Dorian Gray?\" It is to a degree before it presses into areas that would've made Oscar Wilde ... oh, let's be real, he would've loved the delectably untoward hell out of this movie. \"The Substance\" may not end up being for you, but you owe it to yourself, and Katy Perry, to give it a shot. If nothing else, you'll be able to tell your friends and family why Demi Moore absolutely deserves the 2024 Academy Award for Best Actress.",
  "image": "https://www.slashfilm.com/img/gallery/katy-perry-named-this-grotesque-horror-flick-the-best-movie-of-2024/l-intro-1731368100.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n                        \n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n    \n                \u003cdiv\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1710704/katy-perry-best-movie-2024-horror-the-substance/\" data-post-title=\"Katy Perry Named This Grotesque Horror Flick The Best Movie Of 2024\" data-slide-num=\"0\" data-post-id=\"1710704\"\u003e\n                                             \u003cpicture id=\"p2d5b1775e3dbe1d367d4d4307e05394c\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/katy-perry-named-this-grotesque-horror-flick-the-best-movie-of-2024/intro-1731368100.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/katy-perry-named-this-grotesque-horror-flick-the-best-movie-of-2024/intro-1731368100.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/katy-perry-named-this-grotesque-horror-flick-the-best-movie-of-2024/intro-1731368100.jpg\" data-slide-url=\"https://www.slashfilm.com/1710704/katy-perry-best-movie-2024-horror-the-substance/\" data-post-id=\"1710704\" data-slide-num=\"0\" data-slide-title=\"Katy Perry Named This Grotesque Horror Flick The Best Movie Of 2024: \" width=\"780\" height=\"438\" alt=\"Katy Perry beams in Katy Perry Part of Me\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eParamount\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eEvery year of late seems to be a great year for horror, so it\u0026#39;s hardly a surprise that 2024 is holding its own in the scares department. As has been the case with the genre, the fun of this year\u0026#39;s terror pictures have been how they attack our fears from unexpected angles while placing fresh spins on seemingly hoary forms. Think you\u0026#39;re totally checked out on slasher flicks? \u003ca href=\"https://www.slashfilm.com/1557706/in-a-violent-nature-review/\" target=\"_blank\"\u003eHere\u0026#39;s Chris Nash\u0026#39;s \u0026#34;In a Violent Nature\u0026#34;\u003c/a\u003e to pull you back in. Feel like the serial killer procedural has aped \u0026#34;The Silence of the Lambs\u0026#34; into hideous self-parody? \u003ca href=\"https://www.slashfilm.com/1582538/longlegs-review-osgood-perkins-maika-monroe-nicolas-cage-horror-movie/\" target=\"_blank\"\u003eOz Perkins has a little number called \u0026#34;Longlegs\u0026#34;\u003c/a\u003e that injects that formula with an unsettlingly atmospheric and just plain bizarre energy (that last element coming courtesy of Nicolas Cage who wanders through the film shrieking like a banshee). Done with vampires? The \u0026#34;Ready or Not\u0026#34; duo of Matt Bettinelli-Olpin and Tyler Gillett have a kidnapping-thriller gone horribly wrong in \u003ca href=\"https://www.slashfilm.com/1556898/abigail-review-ballerina-vampire-bloodbath-perfect-horror-movie/\" target=\"_blank\"\u003ethe infectiously fun \u0026#34;Abigail.\u0026#34;\u003c/a\u003e And who knew we needed a found-footage demonic possession riff set against the backdrop of a talk show? Colin and Cameron Cairnes did with \u0026#34;Late Night with the Devil.\u0026#34;\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eThere\u0026#39;s so much subversion out there, that you might find yourself puzzling over where to start. What provocation do you need to jab in your veins tonight? It\u0026#39;s times like these that we turn to multi-platinum pop star Katy Perry for guidance. No one asked for her thoughts on horror, but she gave them, and we can at least be thankful that she seemingly has good taste in the body horror department.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \u003ch2\u003eThe Substance has Katy Perry seeing fireworks\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1710704/katy-perry-best-movie-2024-horror-the-substance/\" data-post-title=\"Katy Perry Named This Grotesque Horror Flick The Best Movie Of 2024\" data-slide-num=\"1\" data-post-id=\"1710704\"\u003e\n                                             \u003cpicture id=\"p48c08b9ecf6dbc967878ec0dd3ab7e52\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/katy-perry-named-this-grotesque-horror-flick-the-best-movie-of-2024/the-substance-has-katy-perry-seeing-fireworks-1731368100.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/katy-perry-named-this-grotesque-horror-flick-the-best-movie-of-2024/the-substance-has-katy-perry-seeing-fireworks-1731368100.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/katy-perry-named-this-grotesque-horror-flick-the-best-movie-of-2024/the-substance-has-katy-perry-seeing-fireworks-1731368100.jpg\" data-slide-url=\"https://www.slashfilm.com/1710704/katy-perry-best-movie-2024-horror-the-substance/\" data-post-id=\"1710704\" data-slide-num=\"1\" data-slide-title=\"Katy Perry Named This Grotesque Horror Flick The Best Movie Of 2024: The Substance has Katy Perry seeing fireworks\" width=\"780\" height=\"438\" alt=\"Demi Moore sees a dark reflection in The Substance\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eWorking Title\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eAt 3:08 AM EST on November 11, 2024, \u003ca href=\"https://x.com/katyperry/status/1855885332908269587\" target=\"_blank\"\u003eKaty Perry took to X/Twitter\u003c/a\u003e (why not Bluesky?) to declare \u0026#34;\u0026#39;The Substance\u0026#39; — best film this year.\u0026#34; Okay then.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eThe buzzy sophomore effort from French filmmaker Coralie Fargeat is a shockingly grotesque piece of body horror that shook up a male Universal executive so much that the indie distributor MUBI had to handle the film\u0026#39;s release in the United States and the United Kingdom. That\u0026#39;s detestably garbage treatment from a studio that made its name on monsters like Frankenstein, Dracula, and the Wolf Man. Horror should always have a home at Universal.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eFortunately, it now has a home \u003ca href=\"https://mubi.com/en/us/films/the-substance\" target=\"_blank\"\u003ein your living room via MUBI\u003c/a\u003e, so you can take in this hot-button horror movie about a fading movie star (Demi Moore) who\u0026#39;s given the chance to create a younger version of herself (Margaret Qualley) via the title product. Sound like this is just another take on \u0026#34;The Portrait of Dorian Gray?\u0026#34; It is to a degree before it presses into areas that would\u0026#39;ve made Oscar Wilde ... oh, let\u0026#39;s be real, he would\u0026#39;ve loved the delectably untoward hell out of this movie.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003e\u0026#34;The Substance\u0026#34; may not end up being for you, but you owe it to yourself, and Katy Perry, to give it a shot. If nothing else, you\u0026#39;ll be able to tell your friends and family why Demi Moore absolutely deserves the 2024 Academy Award for Best Actress.\u003c/p\u003e\n\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-11T23:43:20Z",
  "modifiedTime": "2024-11-11T23:43:20Z"
}
