{
  "id": "10c5aa38-bffc-4962-9129-fc0ae8339e00",
  "title": "Who Is Michelle Wu’s Husband? Conor Pewarski’s Job \u0026 Kids",
  "link": "https://www.comingsoon.net/guides/news/1905610-michelle-wu-husband-conor-pewarski-job-kids",
  "description": "Curious about Michelle Wu’s husband and kids? The Democratic politician and the Mayor of Boston assumed the mayoral office in the city in 2021. Wu is currently in the news after the birth of her new baby and refiling a property tax bill. This has also prompted people to wonder about her personal life, especially […] The post Who Is Michelle Wu’s Husband? Conor Pewarski’s Job \u0026 Kids appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
  "author": "Tamal Kundu",
  "published": "Thu, 16 Jan 2025 00:55:56 +0000",
  "source": "https://www.comingsoon.net/feed",
  "categories": [
    "Guides",
    "Michelle Wu",
    "Pop Culture"
  ],
  "byline": "Tamal Kundu",
  "length": 2358,
  "excerpt": "Want to know about Boston Mayor Michelle Wu's husband? Here's everything to know about the couple, including how they met and their kids.",
  "siteName": "ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More",
  "favicon": "https://www.comingsoon.net/wp-content/uploads/sites/3/2022/12/cs_ico_144x144.png?w=144",
  "text": "Curious about Michelle Wu’s husband and kids? The Democratic politician and the Mayor of Boston assumed the mayoral office in the city in 2021. Wu is currently in the news after the birth of her new baby and refiling a property tax bill. This has also prompted people to wonder about her personal life, especially her family. So, here’s everything to know about Wu’s spouse, the couple’s relationship, as well as their kids. Who is Michelle Wu married to? Michelle Wu’s husband is Conor Pewarski. Originally from Massachusetts, Pewarski attended Yale University and met Wu through mutual friends at a Harvard–Yale football game party hosted by the latter. The couple initially had a long-distance relationship. Eventually, Pewarski relocated to Chicago to help Wu with her family crisis. When she returned to Massachusetts to attend Harvard Law School, he also accompanied her. (via The Boston Globe) Michele Wu and Conor Pewarski got engaged in the Cambridge Common Park in Cambridge, Massachusetts, and tied the knot on September 8, 2012. What is Conor Pewarski’s job? While Conor Pewarski is a banker, he has been a stay-at-home parent since Michele Wu became the mayor. Furthermore, he holds the ceremonial title of the first gentleman of Boston. Per The Boston Globe, when Pewarski was in his early 20s, he pursued a career as a film producer in Hollywood. But, as mentioned above, he relocated to Chicago to help his wife with her family. According to his LinkedIn page, Conor Pewarski previously worked for Wells Fargo from June 2010 to April 2013. He then joined East Boston Savings Bank and was employed there until November 2021. How many kids do Michelle Wu and Conor Pewarski have? Michelle Wu and her husband Conor Pewarski have three children together. The couple’s eldest, a son they named Blaise, was born in 2014. They welcomed their second son, Cass, in 2017. In January 2025, Wu gave birth to her and Pewarski’s third child, a daughter they named Mira. “Mom and baby are in good health, and the Mayor is in touch with her senior staff,” a statement released by Wu’s office read. “Mayor Wu wishes to express her deepest gratitude to the nurses, doctors, and healthcare staff who made this possible for her family and who work every day to support so many families across the city.” (via CBS News)",
  "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/01/MixCollage-16-Jan-2025-06-14-AM-5384.jpg?resize=1200,630",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eCurious about \u003cstrong\u003e\u003ca href=\"https://www.comingsoon.net/tag/michelle-wu\"\u003eMichelle Wu’s\u003c/a\u003e husband and kids\u003c/strong\u003e? The Democratic politician and the Mayor of Boston assumed the mayoral office in the city in 2021. Wu is currently in the news after the birth of her new baby and refiling a property tax bill. This has also prompted people to wonder about her personal life, especially her family.\u003c/p\u003e\n\n\n\n\u003cp\u003eSo, here’s everything to know about Wu’s spouse, the couple’s relationship, as well as their kids.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-who-is-michelle-wu-married-to\"\u003eWho is Michelle Wu married to? \u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eMichelle Wu’s husband is Conor Pewarski. \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eOriginally from Massachusetts, Pewarski attended Yale University and met Wu through mutual friends at a Harvard–Yale football game party hosted by the latter. The couple initially had a long-distance relationship. Eventually, Pewarski relocated to Chicago to help Wu with her family crisis. When she returned to Massachusetts to attend Harvard Law School, he also accompanied her. (via \u003ca href=\"https://www.bostonglobe.com/2021/11/20/metro/first-gentleman-is-also-first/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eThe Boston Globe\u003c/a\u003e)\u003c/p\u003e\n\n\n\n\u003cp\u003eMichele Wu and Conor Pewarski got engaged in the Cambridge Common Park in Cambridge, Massachusetts, and tied the knot on September 8, 2012.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-what-is-conor-pewarski-s-job\"\u003eWhat is Conor Pewarski’s job?\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWhile Conor Pewarski is a banker, he has been a stay-at-home parent since Michele Wu became the mayor. Furthermore, he holds the ceremonial title of the first gentleman of Boston. \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003ePer The Boston Globe, when Pewarski was in his early 20s, he pursued a career as a film producer in Hollywood. But, as mentioned above, he relocated to Chicago to help his wife with her family. \u003c/p\u003e\n\n\n\n\u003cp\u003eAccording to his \u003ca href=\"https://www.linkedin.com/in/cwpewarski\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eLinkedIn page\u003c/a\u003e, Conor Pewarski previously worked for Wells Fargo from June 2010 to April 2013. He then joined East Boston Savings Bank and was employed there until November 2021.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-how-many-kids-do-michelle-wu-and-conor-pewarski-have\"\u003eHow many kids do Michelle Wu and Conor Pewarski have?\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eMichelle Wu and her husband Conor Pewarski have three children together. \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe couple’s eldest, a son they named Blaise, was born in 2014. They welcomed their second son, Cass, in 2017. In January 2025, Wu gave birth to her and Pewarski’s third child, a daughter they named Mira.\u003c/p\u003e\n\n\n\n\u003cp\u003e“Mom and baby are in good health, and the Mayor is in touch with her senior staff,” a statement released by Wu’s office read. “Mayor Wu wishes to express her deepest gratitude to the nurses, doctors, and healthcare staff who made this possible for her family and who work every day to support so many families across the city.” (via \u003ca href=\"https://www.cbsnews.com/boston/news/boston-mayor-michelle-wu-gives-birth/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eCBS News\u003c/a\u003e)\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-16T00:55:56Z",
  "modifiedTime": "2025-01-16T00:56:22Z"
}
