{
  "id": "12a82932-4bda-4247-bc6a-f7754cee5a3c",
  "title": "Lebron James \u0026 Son Bronny’s Alleged 2022 Car Crash Case Explained",
  "link": "https://www.comingsoon.net/guides/news/1870206-lebron-james-son-bronny-car-crash-case-sue-explained",
  "description": "LeBron \u0026 Bronny James face a lawsuit over a 2022 car crash. Explore the case's potential impact on their legacy. The post Lebron James \u0026 Son Bronny’s Alleged 2022 Car Crash Case Explained appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
  "author": "Vritti Johar",
  "published": "Sun, 27 Oct 2024 00:57:49 +0000",
  "source": "https://www.comingsoon.net/feed",
  "categories": [
    "Guides",
    "LeBron James",
    "Pop Culture"
  ],
  "byline": "Vritti Johar",
  "length": 2215,
  "excerpt": "Uncover the legal challenges facing LeBron James and his son, Bronny, after an alleged car accident. How might this impact their legacy?",
  "siteName": "ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More",
  "favicon": "https://www.comingsoon.net/wp-content/uploads/sites/3/2022/12/cs_ico_144x144.png?w=144",
  "text": "LeBron James and his son, Bronny, are now facing legal scrutiny, capturing fans’ attention. Just hours after the historic moment of the father-son duo sharing the NBA court, news broke of a lawsuit against them. This lawsuit is tied to a 2022 car accident. Their bond is celebrated on and off the court, but this unexpected twist has left many eager to learn more about the alleged incident and its impact on the James family. So, what are the details of this case, and how might it affect their legacy? Let’s explore the story further. Lebron James and son Bronny sued over 2022 car crash case LeBron James and his son, Bronny, now face legal challenges off the court with a lawsuit stemming from an alleged car accident in November 2022 in Littlerock, California. Filed in Los Angeles County Superior Court, the lawsuit claims that LeBron and Bronny’s handling of a vehicle led to a crash. This incident allegedly injured plaintiffs Kiara McGillen and April Lopez and damaged their car (via LA Times). McGillen and Lopez, represented by the Law Offices of Larry H. Parker, seek compensation for unspecified damages. They cite medical expenses, physical discomfort, and lost income due to their injuries. According to the plaintiffs, the incident occurred on Pearblossom Highway near 87th Street. However, the California Highway Patrol did not file a report. The plaintiffs submitted this lawsuit just hours before LeBron and Bronny made history as the first father-son duo to play together in the NBA. It now brings new scrutiny to their off-court lives. The court has scheduled a hearing for February 19, 2025, giving the James family time to respond to the claims. LeBron, now in his 22nd NBA season and the league’s all-time leading scorer, faces a legal matter that complicates his celebrated legacy. After sharing a memorable moment on the court with Bronny as Lakers teammates, LeBron expressed his gratitude for the experience. He described it as a cherished memory that he will hold onto forever. As their family story now includes professional milestones and legal hurdles. The case’s resolution could significantly impact LeBron and Bronny as they face this new challenge together.",
  "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2024/10/MixCollage-27-Oct-2024-11-57-AM-4304.jpg?resize=1200,630",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.comingsoon.net/tag/lebron-james\"\u003eLeBron James\u003c/a\u003e and his son, Bronny,\u003c/strong\u003e are now facing \u003cstrong\u003elegal scrutiny\u003c/strong\u003e, capturing fans’ attention. Just hours after the historic moment of the father-son duo sharing the NBA court, news broke of a lawsuit against them. This lawsuit is tied to a 2022 car accident. Their bond is celebrated on and off the court, but this unexpected twist has left many eager to learn more about the alleged incident and its impact on the James family.\u003c/p\u003e\n\n\n\n\u003cp\u003eSo, what are the details of this case, and how might it affect their legacy? Let’s explore the story further.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-lebron-james-and-son-bronny-sued-over-2022-car-crash-case\"\u003eLebron James and son Bronny sued over 2022 car crash case\u003c/h2\u003e\n\n\n\n\u003cp\u003eLeBron James and his son, Bronny, now face legal challenges off the court with a lawsuit stemming from an alleged car accident in November 2022 in Littlerock, California. \u003c/p\u003e\n\n\n\n\u003cp\u003eFiled in Los Angeles County Superior Court, the lawsuit claims that LeBron and Bronny’s handling of a vehicle led to a crash. This incident allegedly injured plaintiffs Kiara McGillen and April Lopez and damaged their car (via \u003ca href=\"https://www.latimes.com/sports/lakers/story/2024-10-24/lebron-james-bronny-car-accident-lawsuit\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eLA Times\u003c/a\u003e). McGillen and Lopez, represented by the Law Offices of Larry H. Parker, seek compensation for unspecified damages. They cite medical expenses, physical discomfort, and lost income due to their injuries.\u003c/p\u003e\n\n\n\n\u003cp\u003eAccording to the plaintiffs, the incident occurred on Pearblossom Highway near 87th Street. However, the California Highway Patrol did not file a report. The plaintiffs submitted this lawsuit just hours before LeBron and Bronny made history as the first father-son duo to play together in the NBA. It now brings new scrutiny to their off-court lives. The court has scheduled a hearing for February 19, 2025, giving the James family time to respond to the claims.\u003c/p\u003e\n\n\n\n\u003cp\u003eLeBron, now in his 22nd NBA season and the league’s all-time leading scorer, faces a legal matter that complicates his celebrated legacy. After sharing a memorable moment on the court with Bronny as Lakers teammates, LeBron expressed his gratitude for the experience. He described it as a cherished memory that he will hold onto forever.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs their family story now includes professional milestones and legal hurdles. The case’s resolution could significantly impact LeBron and Bronny as they face this new challenge together.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-27T00:57:49Z",
  "modifiedTime": "2024-10-27T00:58:05Z"
}
