{
  "id": "17658d09-56f3-4919-b0a0-dd3b57c41a3c",
  "title": "Lily-Rose Depp Defends Sam Levinson and Their Collaboration On ‘The Idol’: He ‘Always Knew It Was Going to Be Controversial’",
  "link": "https://variety.com/2025/tv/news/lily-rose-depp-defends-sam-levinson-idol-hbo-1236265587/",
  "description": "Lily-Rose Depp is standing up for Sam Levinson and their collaboration on HBO’s “The Idol.” During an appearance on the “Happy Sad Confused” podcast, Depp defended Levinson against the backlash for his one-season HBO drama “The Idol,” which was panned by critics and viewers alike. Depp, who starred in the series as up-and-coming pop star […]",
  "author": "Jack Dunn",
  "published": "Sun, 05 Jan 2025 00:42:58 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Lily-Rose Depp",
    "Sam Levinson",
    "The Idol",
    "The Weekend"
  ],
  "byline": "Jack Dunn",
  "length": 2091,
  "excerpt": "Lily-Rose Depp is standing up for Sam Levinson and their collaboration on HBO's 'The Idol.'",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "Lily-Rose Depp is standing up for Sam Levinson and their collaboration on HBO’s “The Idol.” During an appearance on the “Happy Sad Confused” podcast, Depp defended Levinson against the backlash for his one-season HBO drama “The Idol,” which was panned by critics and viewers alike. Depp, who starred in the series as up-and-coming pop star Jocelyn, said Levinson “always knew it was going to be controversial” but carried on since he is “interested in that kind of work.” “I think the thing that sucked about that was to have people talking shit about Sam [Levinson], who is a great friend of mine and somebody that I consider family,” Depp said. “I’m super close with him and Ashley — his wife who’s a producer on the show — and they are such wonderful people, so incredible, so kind, and really kind of took me under their wing in a way.” Popular on Variety Despite the show’s poor reception and the negative press following the sudden departure of director Amy Seimetz, Depp said the only bad part of the experience was “people talking negatively about [Sam Levinson] because the things that they said about him, particularly, as a filmmaker, just couldn’t be further from the truth than from, at least, my experience working with him. So that sucks. You just never want to hear people talking shit about your friend.” Depp went on to say that she personally “loved” the show and her character and felt proud she remained “steadfast” in the face of criticism. “That was a period in my life where I feel like I learned so much,” Depp said. “I was pushed so far out of my comfort zone, in the most beautiful way, and it gave me so much growth that I will always look back on that as one of the most special times of my life.” “The Idol” followed Depp’s Jocelyn who becomes romantically involved with a shady self-help guru (The Weekend) after a nervous breakdown sidetracks her career. After extensive reshoots and the exit of Seimetz, the episode order of “The Idol” was reduced to five and news of the show’s cancellation shortly followed.",
  "image": "https://variety.com/wp-content/uploads/2025/01/GettyImages-1257489790.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\t\u003ca href=\"https://variety.com/t/lily-rose-depp-2/\" id=\"auto-tag_lily-rose-depp-2\" data-tag=\"lily-rose-depp-2\"\u003eLily-Rose Depp\u003c/a\u003e is standing up for \u003ca href=\"https://variety.com/t/sam-levinson/\" id=\"auto-tag_sam-levinson\" data-tag=\"sam-levinson\"\u003eSam Levinson\u003c/a\u003e and their collaboration on HBO’s “\u003ca href=\"https://variety.com/t/the-idol/\" id=\"auto-tag_the-idol\" data-tag=\"the-idol\"\u003eThe Idol\u003c/a\u003e.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tDuring an appearance on the \u003ca href=\"https://www.youtube.com/watch?v=Ai7ieVFwSbw\u0026amp;list=PLU2P19sDJ0j8rpRlj8W4dedQcQacEb4d8\" data-type=\"link\" data-id=\"https://www.youtube.com/watch?v=Ai7ieVFwSbw\u0026amp;list=PLU2P19sDJ0j8rpRlj8W4dedQcQacEb4d8\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"\u003e“Happy Sad Confused” podcast\u003c/a\u003e, Depp defended Levinson against the backlash for his one-season HBO drama “The Idol,” which was panned by critics and viewers alike. Depp, who starred in the series as up-and-coming pop star Jocelyn, said Levinson “always knew it was going to be controversial” but carried on since he is “interested in that kind of work.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“I think the thing that sucked about that was to have people talking shit about Sam [Levinson], who is a great friend of mine and somebody that I consider family,” Depp said. “I’m super close with him and Ashley — his wife who’s a producer on the show — and they are such wonderful people, so incredible, so kind, and really kind of took me under their wing in a way.”\n\n\t\u003c/p\u003e\n\n\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tDespite the show’s poor reception and the negative press following the sudden departure of director Amy Seimetz, Depp said the only bad part of the experience was “people talking negatively about [Sam Levinson] because the things that they said about him, particularly, as a filmmaker, just couldn’t be further from the truth than from, at least, my experience working with him. So that sucks. You just never want to hear people talking shit about your friend.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tDepp went on to say that she personally “loved” the show and her character and felt proud she remained “steadfast” in the face of criticism. “That was a period in my life where I feel like I learned so much,” Depp said. “I was pushed so far out of my comfort zone, in the most beautiful way, and it gave me so much growth that I will always look back on that as one of the most special times of my life.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“The Idol” followed Depp’s Jocelyn who becomes romantically involved with a shady self-help guru (\u003ca href=\"https://variety.com/t/the-weekend/\" id=\"auto-tag_the-weekend\" data-tag=\"the-weekend\"\u003eThe Weekend\u003c/a\u003e) after a nervous breakdown sidetracks her career. After extensive reshoots and the exit of Seimetz, the episode order of “The Idol” was reduced to five and news of the \u003ca rel=\"noreferrer noopener\" data-id=\"https://variety.com/2023/tv/news/the-idol-canceled-the-weeknd-hbo-season-2-1235706540/\" target=\"_blank\" data-type=\"link\" href=\"https://variety.com/2023/tv/news/the-idol-canceled-the-weeknd-hbo-season-2-1235706540/\"\u003eshow’s cancellation\u003c/a\u003e shortly followed.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-05T00:42:58Z",
  "modifiedTime": "2025-01-05T00:43:07Z"
}
