{
  "id": "17882b95-3a43-4e4c-8063-cecb77946b63",
  "title": "Commandos on an Alien Spacecraft in 'Osiris' Action Thriller Trailer",
  "link": "https://www.firstshowing.net/2025/commandos-on-an-alien-spacecraft-in-osiris-action-thriller-trailer/",
  "description": "\"What are they after?\" \"They're hungry...\" Vertical has revealed an official trailer for an action movie called Osiris, a sci-fi thriller about a group of soldiers trying to survive on a hostile alien spacecraft. It's directed by filmmaker William Kaufman, a former US Army Calvary Scout, who has made a bunch of action movies over the last decade most people haven't seen. In this movie, a team of Special Forces commandos are in the middle of an operation when they are abducted by a mysterious spacecraft. When they wake up aboard the extraterrestrial spaceship, they soon discover they are being hunted as prey by a merciless alien race. Uh oh. The full cast includes Max Martini, Brianna Hildebrand, LaMonica Garrett, Michael Irby, David B. Meadows, Linds Edwards, Tyler Galpin, Jaren Mitchell, Dawson Towery, and Stanley White Jr. Plus the OG Terminator badass heroine Linda Hamilton. Reminds me of Predator, of course, but with different kinds of aliens who just want to eat all these humans as food. Not sure if this will end up any good. Here's the official trailer (+ poster) for William Kaufman's sci-fi thriller Osiris, direct from YouTube: A team of Special Forces commandos wake up on […]",
  "author": "Alex Billington",
  "published": "Mon, 16 Jun 2025 20:53:43 +0000",
  "source": "https://www.firstshowing.net/feed/",
  "categories": [
    "Sci-Fi",
    "To Watch",
    "Trailer"
  ],
  "byline": "Alex Billington",
  "length": 2081,
  "excerpt": "\"What are they after?\" \"They're hungry...\" Vertical has revealed an official trailer for an action movie called Osiris, a sci-fi thriller about a group of soldiers trying to survive on a hostile alien spacecraft. It's directed by filmmaker William Kaufman, a former US Army Calvary Scout, who has made a bunch of action movies over",
  "siteName": "FirstShowing.net",
  "favicon": "https://www.firstshowing.net/favicon-32x32.png",
  "text": "by June 16, 2025Source: YouTube \"What are they after?\" \"They're hungry...\" Vertical has revealed an official trailer for an action movie called Osiris, a sci-fi thriller about a group of soldiers trying to survive on a hostile alien spacecraft. It's directed by filmmaker William Kaufman, a former US Army Calvary Scout, who has made a bunch of action movies over the last decade most people haven't seen. In this movie, a team of Special Forces commandos are in the middle of an operation when they are abducted by a mysterious spacecraft. When they wake up aboard the extraterrestrial spaceship, they soon discover they are being hunted as prey by a merciless alien race. Uh oh. The full cast includes Max Martini, Brianna Hildebrand, LaMonica Garrett, Michael Irby, David B. Meadows, Linds Edwards, Tyler Galpin, Jaren Mitchell, Dawson Towery, and Stanley White Jr. Plus the OG Terminator badass heroine Linda Hamilton. Reminds me of Predator, of course, but with different kinds of aliens who just want to eat all these humans as food. Not sure if this will end up any good. Here's the official trailer (+ poster) for William Kaufman's sci-fi thriller Osiris, direct from YouTube: A team of Special Forces commandos wake up on an alien spacecraft with no memory of how they arrived. They horrifically discover they are being hunted by a relentless Alien race. Osiris is directed by American action filmmaker William Kaufman, director of the films The Prodigy, Saints and Sinners, The Hit List, One in the Chamber, The Marine 4, Jarhead 3, Daylight's End, The Brave, Warhorse One, The Channel, and Shrapnel previously. The screenplay is written by William Kaufman and Paul Reichelt. Produced by Jon Wroblewski, Christian Sosa, Andrew Lewis, Isaac Lewis, Max Martini. Executive produced by Paul Reichelt. This hasn't premiered at any festivals or elsewhere, as far as we know. Vertical will debut Kaufman's Osiris film in select US theaters + on VOD starting July 25th, 2025 this summer. Anyone into this? Looks good? Find more posts in: Sci-Fi, To Watch, Trailer",
  "image": "https://media2.firstshowing.net/firstshowing/img17/OsirisPostermainredbigimgTW2.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\n\t\t\t\u003cp\u003eby \t\t\u003cbr/\u003eJune 16, 2025\u003cbr/\u003e\u003cem\u003eSource:\u003c/em\u003e \u003ca href=\"https://www.youtube.com/watch?v=NX8xhgrMvdc\" rel=\"noopener nofollow\" target=\"_blank\"\u003eYouTube\u003c/a\u003e\u003cbr/\u003e\u003c/p\u003e\n\t\t\u003cp\u003e\u003ca href=\"https://www.firstshowing.net/2025/commandos-on-an-alien-spacecraft-in-osiris-action-thriller-trailer/\"\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img17/OsirisPostermainredbigimgTsr2.jpg\" alt=\"Osiris Trailer\" width=\"350\" height=\"168\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u0026#34;What are they after?\u0026#34; \u0026#34;They\u0026#39;re hungry...\u0026#34;\u003c/em\u003e Vertical has revealed an official trailer for an action movie called \u003cstrong\u003e\u003cem\u003eOsiris\u003c/em\u003e\u003c/strong\u003e, a sci-fi thriller about a group of soldiers trying to survive on a hostile alien spacecraft. It\u0026#39;s directed by filmmaker William Kaufman, a former US Army Calvary Scout, who has made a bunch of action movies over the last decade most people haven\u0026#39;t seen. In this movie, a team of Special Forces commandos are in the middle of an operation when they are abducted by a mysterious spacecraft. When they wake up aboard the extraterrestrial spaceship, they soon discover they are being hunted as prey by a merciless alien race. Uh oh. The full cast includes \u003cstrong\u003eMax Martini\u003c/strong\u003e, \u003cstrong\u003eBrianna Hildebrand\u003c/strong\u003e, \u003cstrong\u003eLaMonica Garrett\u003c/strong\u003e, \u003cstrong\u003eMichael Irby\u003c/strong\u003e, \u003cstrong\u003eDavid B. Meadows\u003c/strong\u003e, \u003cstrong\u003eLinds Edwards\u003c/strong\u003e, \u003cstrong\u003eTyler Galpin\u003c/strong\u003e, \u003cstrong\u003eJaren Mitchell\u003c/strong\u003e, \u003cstrong\u003eDawson Towery\u003c/strong\u003e, and \u003cstrong\u003eStanley White Jr\u003c/strong\u003e. Plus the OG \u003cem\u003eTerminator\u003c/em\u003e badass heroine \u003cstrong\u003eLinda Hamilton\u003c/strong\u003e. Reminds me of \u003cem\u003ePredator\u003c/em\u003e, of course, but with different kinds of aliens who just want to eat all these humans as food. Not sure if this will end up any good.\u003cspan id=\"more-744294\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eHere\u0026#39;s the official trailer (+ poster) for William Kaufman\u0026#39;s sci-fi thriller \u003cstrong\u003e\u003cem\u003eOsiris\u003c/em\u003e\u003c/strong\u003e, direct from \u003ca href=\"https://www.youtube.com/watch?v=NX8xhgrMvdc\" rel=\"noopener\" target=\"_blank\"\u003eYouTube\u003c/a\u003e:\u003c/p\u003e\n\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img17/OsirisPostermainredbigimg5991.jpg\" alt=\"Osiris Poster\" width=\"599\" height=\"868\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eA team of Special Forces commandos wake up on an alien spacecraft with no memory of how they arrived. They horrifically discover they are being hunted by a relentless Alien race.\u003c/em\u003e \u003cem\u003eOsiris\u003c/em\u003e is directed by American action filmmaker \u003ca href=\"https://www.imdb.com/name/nm0442287/\" rel=\"noopener\" target=\"_blank\"\u003e\u003cstrong\u003eWilliam Kaufman\u003c/strong\u003e\u003c/a\u003e, director of the films \u003cem\u003eThe Prodigy, Saints and Sinners, The Hit List, One in the Chamber, The Marine 4, Jarhead 3, Daylight\u0026#39;s End, The Brave, Warhorse One, The Channel\u003c/em\u003e, and \u003cem\u003eShrapnel\u003c/em\u003e previously. The screenplay is written by William Kaufman and Paul Reichelt. Produced by Jon Wroblewski, Christian Sosa, Andrew Lewis, Isaac Lewis, Max Martini. Executive produced by Paul Reichelt. This hasn\u0026#39;t premiered at any festivals or elsewhere, as far as we know. Vertical will debut Kaufman\u0026#39;s \u003cem\u003eOsiris\u003c/em\u003e film in select US theaters + on VOD starting \u003ca href=\"https://www.firstshowing.net/schedule2025/#jul\"\u003e\u003cstrong\u003eJuly 25th, 2025\u003c/strong\u003e\u003c/a\u003e this summer. \u003cem\u003eAnyone into this? Looks good?\u003c/em\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eFind more posts in:\u003c/strong\u003e \u003ca href=\"https://www.firstshowing.net/category/sci-fi/\" rel=\"category tag\"\u003eSci-Fi\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/worthwatching/\" rel=\"category tag\"\u003eTo Watch\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/trailers/\" rel=\"category tag\"\u003eTrailer\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-06-16T16:53:43-04:00",
  "modifiedTime": null
}
