{
  "id": "1c962e39-b2f7-428b-9a41-d5a8c7b90d82",
  "title": "Why Yuri Sardarov's Otis Exited Chicago Fire In Season 8",
  "link": "https://www.slashfilm.com/1768933/yuri-sardanov-otis-chicago-fire-exit-death-explained/",
  "description": "Why did Chicago Fire's Otis leave the show in season 8? Here's the answer and a bunch of context, including what the actor thought about the decision.",
  "author": "Valerie Ettenhofer",
  "published": "Thu, 23 Jan 2025 23:00:37 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Drama Shows"
  ],
  "byline": "Valerie Ettenhofer",
  "length": 8712,
  "excerpt": "When does Otis die in Chicago Fire? Here's the answer, plus a bunch of context about the decision, what the actor thought about the death, and more.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slash-film-favicon-448x448.png",
  "text": "NBC It is a truth universally acknowledged that every good network drama must kill off at least one fan-favorite character in an extremely bleak, cry-until-you're-dehydrated way at least once every few seasons. When it comes to \"Chicago Fire,\" one of the biggest major character deaths came in the very first moments of season 8, which claimed the life of Brian \"Otis\" Zvonecek. Judging by the heaps of online comments memorializing Otis like he's a real person (seriously, check out any YouTube video featuring the guy), the character who was with Truck 81 since the show's pilot is perhaps the most beloved \"Chicago Fire\" character ever. The child of Russian immigrants was funny and sometimes underestimated, and he worked his way up to a much-coveted engineer position over time. He also had deep ties to plenty of other key characters, so when the powers that be decided \"Chicago Fire\" needed to up the ante with real, deadly stakes, Otis ended up biting the dust. When and how does Otis die on Chicago Fire? NBC At the end of \"Chicago Fire\" season 7, it's clear that someone is on the chopping block. The season concludes with a major cliffhanger as the firehouse crew battle an out-of-control blaze at a mattress factory. When season 8 returned, the show didn't waste much time revealing that its high-stakes storyline had a heartbreaking casualty: Yuri Sardarov's Otis. The team is shown pulling him out of the burning factory after a boiler explosion, and it's pretty clear from the way the sequence is filmed — and the shock and grief on his coworkers' faces — that Otis likely won't be recovering. Otis later dies in the hospital after an emotional Joe Cruz (Joe Minoso) pleads with him, asking Otis to leave a spot in heaven open for his best friend. Otis' last words are to Cruz: \"Brother, I will be with you always.\" In season 10, Cruz's wife Chloe (Kristen Gutoskie) has a baby named Brian, but the pair decide to call him Otis in memory of the man who was like a brother to Cruz. It's all extremely sad in the way that only long-running network procedurals about first responders can be. Writers killed off Otis for maximum emotional impact NBC In an interview with TVLine in 2019, series co-creator Derek Haas said that he and the show's writers' room wanted to kill off a character after the firehouse crew spent so many seasons escaping near-death experiences with their lives. \"We gotta put some teeth back into the show, and we gotta show that the dangers are real,\" Haas remembered telling head writers Michael Gilvary and Andrea Newman during a summer hiatus. Haas admitted that he didn't initially know who, if anyone, would die in the mattress factory fire when he wrote the end of season 7, but he spent about an hour speaking to executive producers Dick Wolf and Peter Jankowski about the idea of killing off Otis. \"Dick, who draws on more experience than anyone in the world, said, 'As long as you're honest with the storytelling, the audience will go with you,'\" Haas told TVLine. He also said the writers at one point considered the idea of killing Darren Ritter (Daniel Kyri) instead, but wanted it to be a core cast member rather than a relatively new addition who could be perceived as being doomed from the start for the sake of good TV. \"We just decided it would be Otis because he lives with Cruz and Brett, and he's on Casey's truck, and he's in Boden's house, and he's best friends with Mouch, and owns a bar with Herrmann,\" Haas explained, implying that the fan-favorite is one of the only characters whose death would impact every other character and ripple out across future seasons. Haas told TVLine that he personally broke the news to Sardarov, who'd been his friend since before their \"Chicago Fire\" days. \"From a personal standpoint, it's really difficult as a showrunner to tell an actor, 'Hey, this is what we're thinking,' when you not only know them as a really great actor, but also as just a good person and friend,\" Haas said, but he also said Sardarov was \"professional\" and \"gracious\" — in part because he, too, is a writer who understands the idea of doing something in service of a good story. Who replaced Otis on Chicago Fire? NBC Otis' death episode included a three-month time jump that both allowed his coworkers to try to move on and revealed just how vital he was to Firehouse 51. An episode later, audiences meet Blake Gallo (Alberto Rosende), a new firefighter with a tragic backstory and a willingness to dive straight into any rescue situation, regardless of the danger. While it takes a while for the crew to get used to Gallo and he doesn't serve as a 1 to 1 replacement for Otis, the character eventually becomes part of the team. Gallo sticks around for 80 episodes of \"Chicago Fire\" (almost exactly half as many episodes as Otis) and eventually moved to Michigan to connect with his newly discovered extended family. Rosende told Deadline that he decided to move on from the show. Though Gallo is the most obvious replacement for Otis in terms of timing, the most recent seasons of \"Chicago Fire\" have introduced a number of new recruits, some of whom have become fan favorites in their own right. Daniel Kyri's Ritter stuck around after his season 7 debut (and became half of a dynamic duo with Gallo), and Sam Carver (Jake Lockett) also joined the squad. This season, \"My Best Friend's Wedding Actor\" and secretly super-talented cellist Dermot Mulroney came on board as the new Chief of Firehouse 51, while Adriyan Rae, Jocelyn Hudon, and Hanako Greensmith have all played paramedics since Otis died in season 8. Yuri Sardarov was also ready to move on to other projects NBC It's worth noting that while series co-creator Derek Haas takes responsibility for killing off Otis, Sardarov has also indicated that he was ready to move on from the show after years spent on one project. In an interview with Tell Tale TV in 2019, he admitted: \"It was difficult, but it was also necessary. It was a combination of me wanting to move on and them needing something akin to what's going to happen. And I think those two things met at the perfect time.\" Sardarov recalled speaking to Haas, who he said he first worked with when he was in college, at the end of season 7. From the sounds of it, he floated the idea that he was okay leaving in the same conversation in which Haas pitched Otis as the character who could give season 8 its big, weighty premiere death. \"We had a discussion about the character and where he was headed, and I was very upfront with him about the fact that it's been eight years, and I started when I was 22, and now I'm 31,\" he said. \"The communication was very open and honest, and we both walked away from it feeling really good.\" \"He's at the beginning of his career, and this isn't his swan song by any stretch,\" Haas told TVLine when speaking positively of Sardarov. It's true: Since leaving \"Chicago Fire,\" the actor has already taken on other roles, including guest spots on \"The Rookie\" and \"FBI: International\" and roles in the films \"Adam,\" \"Daddy,\" and \"Amy and Peter are Getting Divorced.\" Plus, Haas was right about the tear jerking twist — six years later, it remains one of the show's most-discussed moments.",
  "image": "https://www.slashfilm.com/img/gallery/why-yuri-sardarovs-otis-exited-chicago-fire-in-season-8/l-intro-1737577022.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n    \n                \u003cdiv\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1768933/yuri-sardanov-otis-chicago-fire-exit-death-explained/\" data-post-title=\"Why Yuri Sardarov\u0026#39;s Otis Exited Chicago Fire In Season 8\" data-slide-num=\"0\" data-post-id=\"1768933\"\u003e\n                                             \u003cpicture id=\"p74477a6c6dc37d4bfd7910a99464f9dc\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-yuri-sardarovs-otis-exited-chicago-fire-in-season-8/intro-1737577022.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-yuri-sardarovs-otis-exited-chicago-fire-in-season-8/intro-1737577022.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/why-yuri-sardarovs-otis-exited-chicago-fire-in-season-8/intro-1737577022.jpg\" data-slide-url=\"https://www.slashfilm.com/1768933/yuri-sardanov-otis-chicago-fire-exit-death-explained/\" data-post-id=\"1768933\" data-slide-num=\"0\" data-slide-title=\"Why Yuri Sardarov\u0026#39;s Otis Exited Chicago Fire In Season 8: \" width=\"780\" height=\"438\" alt=\"Yuri Sardarov\u0026#39;s Otis looks to his right while standing in front of two people in Chicago Fire\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eNBC\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eIt is a truth universally acknowledged that every good network drama must kill off at least one fan-favorite character in \u003ca href=\"https://www.slashfilm.com/1674586/why-greys-anatomy-season-11-killed-patrick-dempsey-derek-shepherd/\" target=\"_blank\"\u003ean extremely bleak, cry-until-you\u0026#39;re-dehydrated way\u003c/a\u003e at least once every few seasons. When it comes to \u0026#34;Chicago Fire,\u0026#34; one of the biggest major character deaths came in the very first moments of season 8, which claimed the life of Brian \u0026#34;Otis\u0026#34; Zvonecek.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eJudging by the heaps of online comments memorializing Otis like he\u0026#39;s a real person (seriously, check out any YouTube video featuring the guy), the character who was with Truck 81 since the show\u0026#39;s pilot is perhaps the most beloved \u0026#34;Chicago Fire\u0026#34; character ever. The child of Russian immigrants was funny and sometimes underestimated, and he worked his way up to a much-coveted engineer position over time. He also had deep ties to plenty of other key characters, so when the powers that be decided \u0026#34;Chicago Fire\u0026#34; needed to up the ante with real, deadly stakes, Otis ended up biting the dust.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eWhen and how does Otis die on Chicago Fire?\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1768933/yuri-sardanov-otis-chicago-fire-exit-death-explained/\" data-post-title=\"Why Yuri Sardarov\u0026#39;s Otis Exited Chicago Fire In Season 8\" data-slide-num=\"1\" data-post-id=\"1768933\"\u003e\n                                             \u003cpicture id=\"pda00b768dd366c42e6fe6114f26f8b35\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-yuri-sardarovs-otis-exited-chicago-fire-in-season-8/when-and-how-does-otis-die-on-chicago-fire-1737577023.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-yuri-sardarovs-otis-exited-chicago-fire-in-season-8/when-and-how-does-otis-die-on-chicago-fire-1737577023.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/why-yuri-sardarovs-otis-exited-chicago-fire-in-season-8/when-and-how-does-otis-die-on-chicago-fire-1737577023.jpg\" data-slide-url=\"https://www.slashfilm.com/1768933/yuri-sardanov-otis-chicago-fire-exit-death-explained/\" data-post-id=\"1768933\" data-slide-num=\"1\" data-slide-title=\"Why Yuri Sardarov\u0026#39;s Otis Exited Chicago Fire In Season 8: When and how does Otis die on Chicago Fire?\" width=\"780\" height=\"438\" alt=\"Joe Minoso\u0026#39;s Cruz cries by the hospital bed of Yuri Sardarov\u0026#39;s Otis in Chicago Fire\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eNBC\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eAt the end of \u0026#34;Chicago Fire\u0026#34; season 7, it\u0026#39;s clear that someone is on the chopping block. The season concludes with a major cliffhanger as the firehouse crew battle an out-of-control blaze at a mattress factory. When season 8 returned, the show didn\u0026#39;t waste much time revealing that its high-stakes storyline had a heartbreaking casualty: Yuri Sardarov\u0026#39;s Otis. The team is shown pulling him out of the burning factory after a boiler explosion, and it\u0026#39;s pretty clear from the way the sequence is filmed — and the shock and grief on his coworkers\u0026#39; faces — that Otis likely won\u0026#39;t be recovering.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eOtis later dies in the hospital after an emotional Joe Cruz (Joe Minoso) pleads with him, asking Otis to leave a spot in heaven open for his best friend. Otis\u0026#39; last words are to Cruz: \u0026#34;Brother, I will be with you always.\u0026#34; In season 10, Cruz\u0026#39;s wife Chloe (Kristen Gutoskie) has a baby named Brian, but the pair decide to call him Otis in memory of the man who was like a brother to Cruz. It\u0026#39;s all extremely sad in the way that only long-running network procedurals about first responders can be.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eWriters killed off Otis for maximum emotional impact\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1768933/yuri-sardanov-otis-chicago-fire-exit-death-explained/\" data-post-title=\"Why Yuri Sardarov\u0026#39;s Otis Exited Chicago Fire In Season 8\" data-slide-num=\"2\" data-post-id=\"1768933\"\u003e\n                                             \u003cpicture id=\"pae81e6f6878d9c11e54d99768c585a0c\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-yuri-sardarovs-otis-exited-chicago-fire-in-season-8/writers-killed-off-otis-for-maximum-emotional-impact-1737577024.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-yuri-sardarovs-otis-exited-chicago-fire-in-season-8/writers-killed-off-otis-for-maximum-emotional-impact-1737577024.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/why-yuri-sardarovs-otis-exited-chicago-fire-in-season-8/writers-killed-off-otis-for-maximum-emotional-impact-1737577024.jpg\" data-slide-url=\"https://www.slashfilm.com/1768933/yuri-sardanov-otis-chicago-fire-exit-death-explained/\" data-post-id=\"1768933\" data-slide-num=\"2\" data-slide-title=\"Why Yuri Sardarov\u0026#39;s Otis Exited Chicago Fire In Season 8: Writers killed off Otis for maximum emotional impact\" width=\"780\" height=\"438\" alt=\"Yuri Sardarov\u0026#39;s Otis helps a woman in a neck brace in Chicago Fire\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eNBC\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eIn \u003ca href=\"https://tvline.com/news/chicago-fire-recap-season-8-episode-1-otis-dead-1101704/\" target=\"_blank\"\u003ean interview with TVLine in 2019\u003c/a\u003e, series co-creator Derek Haas said that he and the show\u0026#39;s writers\u0026#39; room wanted to kill off a character after the firehouse crew \u003ca href=\"https://www.slashfilm.com/1193531/every-chicago-fire-season-ranked-worst-to-best/\" target=\"_blank\"\u003espent so many seasons\u003c/a\u003e escaping near-death experiences with their lives. \u0026#34;We gotta put some teeth back into the show, and we gotta show that the dangers are real,\u0026#34; Haas remembered telling head writers Michael Gilvary and Andrea Newman during a summer hiatus. Haas admitted that he didn\u0026#39;t initially know who, if anyone, would die in the mattress factory fire when he wrote the end of season 7, but he spent about an hour speaking to executive producers Dick Wolf and Peter Jankowski about the idea of killing off Otis.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u0026#34;Dick, who draws on more experience than anyone in the world, said, \u0026#39;As long as you\u0026#39;re honest with the storytelling, the audience will go with you,\u0026#39;\u0026#34; Haas told TVLine. He also said the writers at one point considered the idea of killing Darren Ritter (Daniel Kyri) instead, but wanted it to be a core cast member rather than a relatively new addition who could be perceived as being doomed from the start for the sake of good TV. \u0026#34;We just decided it would be Otis because he lives with Cruz and Brett, and he\u0026#39;s on Casey\u0026#39;s truck, and he\u0026#39;s in Boden\u0026#39;s house, and he\u0026#39;s best friends with Mouch, and owns a bar with Herrmann,\u0026#34; Haas explained, implying that the fan-favorite is one of the only characters whose death would impact every other character and ripple out across future seasons.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eHaas told TVLine that he personally broke the news to Sardarov, who\u0026#39;d been his friend since before their \u0026#34;Chicago Fire\u0026#34; days. \u0026#34;From a personal standpoint, it\u0026#39;s really difficult as a showrunner to tell an actor, \u0026#39;Hey, this is what we\u0026#39;re thinking,\u0026#39; when you not only know them as a really great actor, but also as just a good person and friend,\u0026#34; Haas said, but he also said Sardarov was \u0026#34;professional\u0026#34; and \u0026#34;gracious\u0026#34; — in part because he, too, is a writer who understands the idea of doing something in service of a good story.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eWho replaced Otis on Chicago Fire?\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1768933/yuri-sardanov-otis-chicago-fire-exit-death-explained/\" data-post-title=\"Why Yuri Sardarov\u0026#39;s Otis Exited Chicago Fire In Season 8\" data-slide-num=\"3\" data-post-id=\"1768933\"\u003e\n                                             \u003cpicture id=\"p91c7b56190e5d8420eca4c424db65fc2\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-yuri-sardarovs-otis-exited-chicago-fire-in-season-8/who-replaced-otis-on-chicago-fire-1737577024.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-yuri-sardarovs-otis-exited-chicago-fire-in-season-8/who-replaced-otis-on-chicago-fire-1737577024.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/why-yuri-sardarovs-otis-exited-chicago-fire-in-season-8/who-replaced-otis-on-chicago-fire-1737577024.jpg\" data-slide-url=\"https://www.slashfilm.com/1768933/yuri-sardanov-otis-chicago-fire-exit-death-explained/\" data-post-id=\"1768933\" data-slide-num=\"3\" data-slide-title=\"Why Yuri Sardarov\u0026#39;s Otis Exited Chicago Fire In Season 8: Who replaced Otis on Chicago Fire?\" width=\"780\" height=\"438\" alt=\"Alberto Rosende\u0026#39;s Gallo and Daniel Kyri\u0026#39;s Ritter look apprehensive in Chicago Fire\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eNBC\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eOtis\u0026#39; death episode included a three-month time jump that both allowed his coworkers to try to move on and revealed just how vital he was to Firehouse 51. An episode later, audiences meet Blake Gallo (Alberto Rosende), a new firefighter with a tragic backstory and a willingness to dive straight into any rescue situation, regardless of the danger. While it takes a while for the crew to get used to Gallo and he doesn\u0026#39;t serve as a 1 to 1 replacement for Otis, the character eventually becomes part of the team. Gallo sticks around for 80 episodes of \u0026#34;Chicago Fire\u0026#34; (almost exactly half as many episodes as Otis) and eventually moved to Michigan to connect with his newly discovered extended family. \u003ca href=\"https://deadline.com/2023/12/alberto-rosende-decision-to-leave-chicago-fire-1235649953/\" target=\"_blank\"\u003eRosende told Deadline\u003c/a\u003e that he decided to move on from the show.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eThough Gallo is the most obvious replacement for Otis in terms of timing, the most recent seasons of \u0026#34;Chicago Fire\u0026#34; have introduced a number of new recruits, some of whom have become fan favorites in their own right. Daniel Kyri\u0026#39;s Ritter stuck around after his season 7 debut (and became half of a dynamic duo with Gallo), and Sam Carver (Jake Lockett) also joined the squad. This season, \u0026#34;My Best Friend\u0026#39;s Wedding Actor\u0026#34; and \u003ca href=\"https://www.slashfilm.com/1339921/dermot-mulroney-plays-cello-for-blockbuster-scores-spider-man-far-from-home/\" target=\"_blank\"\u003esecretly super-talented cellist\u003c/a\u003e Dermot Mulroney came on board as the new Chief of Firehouse 51, while Adriyan Rae, Jocelyn Hudon, and Hanako Greensmith have all played paramedics since Otis died in season 8.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eYuri Sardarov was also ready to move on to other projects\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1768933/yuri-sardanov-otis-chicago-fire-exit-death-explained/\" data-post-title=\"Why Yuri Sardarov\u0026#39;s Otis Exited Chicago Fire In Season 8\" data-slide-num=\"4\" data-post-id=\"1768933\"\u003e\n                                             \u003cpicture id=\"paf618a8cc1c69fc559906dd0f7ab006b\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-yuri-sardarovs-otis-exited-chicago-fire-in-season-8/yuri-sardarov-was-also-ready-to-move-on-to-other-projects-1737577025.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-yuri-sardarovs-otis-exited-chicago-fire-in-season-8/yuri-sardarov-was-also-ready-to-move-on-to-other-projects-1737577025.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/why-yuri-sardarovs-otis-exited-chicago-fire-in-season-8/yuri-sardarov-was-also-ready-to-move-on-to-other-projects-1737577025.jpg\" loading=\"lazy\" data-slide-url=\"https://www.slashfilm.com/1768933/yuri-sardanov-otis-chicago-fire-exit-death-explained/\" data-post-id=\"1768933\" data-slide-num=\"4\" data-slide-title=\"Why Yuri Sardarov\u0026#39;s Otis Exited Chicago Fire In Season 8: Yuri Sardarov was also ready to move on to other projects\" width=\"780\" height=\"438\" alt=\"Yuri Sardarov\u0026#39;s Otis speaks to someone offscreen in Chicago Fire\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eNBC\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eIt\u0026#39;s worth noting that while series co-creator Derek Haas takes responsibility for killing off Otis, Sardarov has also indicated that he was ready to move on from the show after years spent on one project. In \u003ca href=\"https://telltaletv.com/2019/09/yuriy-sardarov-opens-up-about-that-devastating-chicago-fire-season-8-premiere-and-why-it-was-necessary-exclusive-interview/\" target=\"_blank\"\u003ean interview with Tell Tale TV\u003c/a\u003e in 2019, he admitted: \u0026#34;It was difficult, but it was also necessary. It was a combination of me wanting to move on and them needing something akin to what\u0026#39;s going to happen. And I think those two things met at the perfect time.\u0026#34;\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eSardarov recalled speaking to Haas, who he said he first worked with when he was in college, at the end of season 7. From the sounds of it, he floated the idea that he was okay leaving in the same conversation in which Haas pitched Otis as the character who could give season 8 its big, weighty premiere death. \u0026#34;We had a discussion about the character and where he was headed, and I was very upfront with him about the fact that it\u0026#39;s been eight years, and I started when I was 22, and now I\u0026#39;m 31,\u0026#34; he said. \u0026#34;The communication was very open and honest, and we both walked away from it feeling really good.\u0026#34;\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003e\u0026#34;He\u0026#39;s at the beginning of his career, and this isn\u0026#39;t his swan song by any stretch,\u0026#34; Haas told TVLine when speaking positively of Sardarov. It\u0026#39;s true: Since leaving \u0026#34;Chicago Fire,\u0026#34; the actor has already taken on other roles, including guest spots on \u0026#34;The Rookie\u0026#34; and \u0026#34;FBI: International\u0026#34; and roles in the films \u0026#34;Adam,\u0026#34; \u0026#34;Daddy,\u0026#34; and \u0026#34;Amy and Peter are Getting Divorced.\u0026#34; Plus, Haas was right about the tear jerking twist — six years later, it remains one of the show\u0026#39;s most-discussed moments.\u003c/p\u003e\n\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-01-23T23:00:37Z",
  "modifiedTime": "2025-01-23T23:00:37Z"
}
