{
  "id": "2665265c-02c9-4700-8cbb-4dbb5f590f4a",
  "title": "Lithuanian Drama ‘Toxic’ Wins Top Prize at 55th International Film Festival of India",
  "link": "https://variety.com/2024/film/news/iffi-goa-2024-winners-toxic-1236226082/",
  "description": "Lithuanian filmmaker Saulė Bliuvaitė’s “Toxic” took home the best film award at the 55th International Film Festival of India (IFFI) in Goa. The jury, headed by Indian director Ashutosh Gowariker, recognized the film for its portrayal of adolescence and economic hardship. Previously, at Locarno, “Toxic” won not only the Golden Leopard for Best Film in […]",
  "author": "Sahasranaman Ramachandran",
  "published": "Fri, 29 Nov 2024 00:42:34 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "Asia",
    "Global",
    "Markets \u0026 Festivals",
    "News",
    "IFFI",
    "Toxic"
  ],
  "byline": "Naman Ramachandran",
  "length": 2605,
  "excerpt": "Lithuanian filmmaker Saulė Bliuvaitė's 'Toxic' took home the best film award at the 55th International Film Festival of India in Goa.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "Lithuanian filmmaker Saulė Bliuvaitė’s “Toxic” took home the best film award at the 55th International Film Festival of India (IFFI) in Goa. The jury, headed by Indian director Ashutosh Gowariker, recognized the film for its portrayal of adolescence and economic hardship. Previously, at Locarno, “Toxic” won not only the Golden Leopard for Best Film in the fest’s premier International Competition — from a jury chaired by Austrian auteur Jessica Hausner — but also, in an unusual double, the top prize in the separately juried First Feature Competition.  Variety‘s positive review of “Toxic” described the film as “sobering but not without glimmers of tenderness and humor as female friendship takes root in a hopeless place,” adding that its “alternation between chilly composure and kinetic movement roughly corresponds with [the protagonist’s] wavering sense of self.” Popular on Variety Romanian director Bogdan Muresanu nabbed the best director prize for “The New Year That Never Came,” a multi-narrative feature set during a revolution. The jury cited his skill in crafting a tragicomedy against the backdrop of social upheaval. The best actor award went to Clément Faveau for the French film “Holy Cow,” by Louise Courvoisier, with a special mention for Adam Bessa’s performance in the Tunisian-French-Canadian co-production “Who Do I Belong To?” In a notable joint win, “Toxic” stars Vesta Matulytė and Ieva Rupeikaitė shared the best actress prize for their debut roles. “Holy Cow” also received the Special Jury Award, while Sarah Friedland’s “Familiar Touch” was honored as best debut feature. The ICFT International Film Prize with UNESCO Gandhi Medal was presented to Levan Akin’s “Crossing,” which follows an elderly Georgian woman’s journey to Istanbul in search of her missing niece. The international jury included filmmaker Anthony Chen, producers Elizabeth Karlsen and Fran Borgia, and editor Jill Bilcock alongside chair Gowariker. Navjyot Bandiwadekar won the Best Debut Director of an Indian Feature Film Award for his Marathi-language film “Gharat Ganpati.” Acclaimed Australian filmmaker Phillip Noyce received the IFFI Satyajit Ray Lifetime Achievement Award. SonyLIV‘s “Lampan,” Nipun Dharmadhikari’s rural coming-of-age narrative, won IFFI’s Best Web Series award. The festival, organized by India’s Ministry of Information and Broadcasting and the National Film Development Corporation of India (NFDC), concluded its 2024 edition on Nov. 28. Concurrent project market Film Bazaar ran Nov. 20-24.",
  "image": "https://variety.com/wp-content/uploads/2024/07/Toxic.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tLithuanian filmmaker Saulė Bliuvaitė’s “\u003ca href=\"https://variety.com/t/toxic/\" id=\"auto-tag_toxic\" data-tag=\"toxic\"\u003eToxic\u003c/a\u003e” took home the best film award at the 55th International Film Festival of India (\u003ca href=\"https://variety.com/t/iffi/\" id=\"auto-tag_iffi\" data-tag=\"iffi\"\u003eIFFI\u003c/a\u003e) in Goa. The jury, headed by Indian director Ashutosh Gowariker, recognized the film for its portrayal of adolescence and economic hardship.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tPreviously, at Locarno, \u003ca href=\"https://variety.com/2024/film/news/lithuanian-teen-drama-toxic-wins-at-locarno-film-festival-1236109849/\"\u003e“Toxic” won not only the Golden Leopard for Best Film\u003c/a\u003e in the fest’s premier International Competition — from a jury chaired by Austrian auteur \u003ca href=\"https://variety.com/t/jessica-hausner/\"\u003eJessica Hausner\u003c/a\u003e — but also, in an unusual double, the top prize in the separately juried First Feature Competition. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cem\u003eVariety\u003c/em\u003e‘s \u003ca href=\"https://variety.com/2024/film/reviews/toxic-review-1236109377/\"\u003epositive review of “Toxic”\u003c/a\u003e described the film as “sobering but not without glimmers of tenderness and humor as female friendship takes root in a hopeless place,” adding that its “alternation between chilly composure and kinetic movement roughly corresponds with [the protagonist’s] wavering sense of self.”\n\n\t\u003c/p\u003e\n\n\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tRomanian director Bogdan Muresanu nabbed the best director prize for “The New Year That Never Came,” a multi-narrative feature set during a revolution. The jury cited his skill in crafting a tragicomedy against the backdrop of social upheaval.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe best actor award went to Clément Faveau for the French film “Holy Cow,” by Louise Courvoisier, with a special mention for Adam Bessa’s performance in the Tunisian-French-Canadian co-production “Who Do I Belong To?” In a notable joint win, “Toxic” stars Vesta Matulytė and Ieva Rupeikaitė shared the best actress prize for their debut roles.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Holy Cow” also received the Special Jury Award, while Sarah Friedland’s “Familiar Touch” was honored as best debut feature. The ICFT International Film Prize with UNESCO Gandhi Medal was presented to Levan Akin’s “Crossing,” which follows an elderly Georgian woman’s journey to Istanbul in search of her missing niece.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe international jury included filmmaker Anthony Chen, producers Elizabeth Karlsen and Fran Borgia, and editor Jill Bilcock alongside chair Gowariker.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tNavjyot Bandiwadekar won the Best Debut Director of an Indian Feature Film Award for his Marathi-language film “Gharat Ganpati.” \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAcclaimed Australian filmmaker Phillip Noyce received the IFFI Satyajit Ray Lifetime Achievement Award.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSonyLIV‘s “Lampan,” Nipun Dharmadhikari’s rural coming-of-age narrative, won IFFI’s Best Web Series award. \n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tThe festival, organized by India’s Ministry of Information and Broadcasting and the National Film Development Corporation of India (NFDC), concluded its 2024 edition on Nov. 28. Concurrent project market Film Bazaar ran Nov. 20-24. \u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-29T00:42:34Z",
  "modifiedTime": "2024-11-29T00:42:48Z"
}
