{
  "id": "31b992e5-683a-4949-84b5-363099de69e0",
  "title": "Mayor Karen Bass Implements Curfew in Downtown L.A. Amid Ongoing Protests",
  "link": "https://variety.com/2025/politics/news/curfew-in-downtown-la-karen-bass-protests-1236425478/",
  "description": "After four days of protests against ICE raids, Los Angeles mayor Karen Bass announced that a one square mile area of downtown will be under curfew starting at 8 p.m. Tuesday. “I have declared a local emergency,” Bass said, “and declared a curfew to stop the vandalism, to stop the looting.” “Last night there were […]",
  "author": "Pat Saperstein",
  "published": "Wed, 11 Jun 2025 01:10:46 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Karen Bass"
  ],
  "byline": "Pat Saperstein",
  "length": 1010,
  "excerpt": "After days of protests against ICE raids, L.A. mayor Karen Bass announced that an area of downtown will be under curfew starting at 8 p.m. Tuesday.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "After four days of protests against ICE raids, Los Angeles mayor Karen Bass announced that a one square mile area of downtown will be under curfew starting at 8 p.m. Tuesday. “I have declared a local emergency,” Bass said, “and declared a curfew to stop the vandalism, to stop the looting.” “Last night there were 23 businesses that were looted,” she continued. “If you do not live or work in downtown L.A., avoid the area. Bass said she expected the curfew, which lasts until 6 a.m., to last several days. Popular on Variety But she emphasized that the vandalism was not widespread. “It is extremely important to know that what is happening in this one square mile is not affecting the city. Some of the imagery of the protests gives the appearance that this is a citywide crisis, and it is not.” The curfew area covers the central part of the downtown area from the 110 freeway to the 5 freeway, stretching to the 10 freeway to the south. more to come…",
  "image": "https://variety.com/wp-content/uploads/2025/06/GettyImages-2219552544.jpg?crop=0px%2C834px%2C8368px%2C4707px\u0026resize=1000%2C563",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tAfter four days of protests against ICE raids, Los Angeles mayor \u003ca href=\"https://variety.com/t/karen-bass/\" id=\"auto-tag_karen-bass\" data-tag=\"karen-bass\"\u003eKaren Bass\u003c/a\u003e announced that a one square mile area of downtown will be under curfew starting at 8 p.m. Tuesday. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“I have declared a local emergency,” Bass said, “and declared a curfew to stop the vandalism, to stop the looting.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Last night there were 23 businesses that were looted,” she continued. “If you do not live or work in downtown L.A., avoid the area. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tBass said she expected the curfew, which lasts until 6 a.m., to last several days. \n\n\t\u003c/p\u003e\n\n\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tBut she emphasized that the vandalism was not widespread. “It is extremely important to know that what is happening in this one square mile is not affecting the city. Some of the imagery of the protests gives the appearance that this is a citywide crisis, and it is not.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe curfew area covers the central part of the downtown area from the 110 freeway to the 5 freeway, stretching to the 10 freeway to the south. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cem\u003emore to come…\u003c/em\u003e\u003cbr/\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-06-11T01:10:46Z",
  "modifiedTime": "2025-06-11T01:10:58Z"
}
