{
  "id": "3e145ad0-daa3-49ec-a07d-40b10fbeb913",
  "title": "Why Ben Stiller Doesn't Act In Severance",
  "link": "https://www.slashfilm.com/1855868/why-ben-stiller-doesnt-act-severance/",
  "description": "Ben Stiller only directs Severance without acting in it (unlike many of his previous projects), but he has a specific reason for taking that approach.",
  "author": "Rusteen Honardoost",
  "published": "Sat, 17 May 2025 22:20:00 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Comedy Shows",
    "Drama Shows",
    "Science Fiction Shows"
  ],
  "byline": "Rusteen Honardoost",
  "length": 3892,
  "excerpt": "Ben Stiller only directs Severance without acting in it (unlike many of his previous projects), but he has a specific reason for taking that approach.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slashfilm-favicon.png",
  "text": "Apple TV+ For as long as we've known him, Ben Stiller has been a writer and director as much as he's been an actor. The son of famed comedians Jerry Stiller and Anne Meara, Ben Stiller made a name for himself first by creating the short-lived but influential comedy series \"The Ben Stiller Show,\" then by directing, co-writing and starring in the Gen-X film staple \"Reality Bites.\" Advertisement From that point on, Stiller starred in everything from hit comedies like \"Meet the Parents\" to cult classics like \"Zoolander\" and emotionally grounded dramedies like \"Brad's Status.\" Many of his most iconic roles were in his own movies, including the gloriously slow-witted Derek Zoolander and the prima donna action movie star Tugg Speedman in \"Tropic Thunder.\" Then, a one-two punch of underperforming films (first his self-serious \"The Secret Life of Walter Mitty\" and then the much anticipated but little seen \"Zoolander 2\") led Stiller to return to working in television and, eventually, bring his biggest success to life with Apple TV+'s \"Severance,\" with Stiller having directed many of the show's best episodes. With the series having recently concluded its second season in dramatic fashion, many viewers have wondered whether Stiller might be saving a role for himself in the hotly anticipated \"Severance\" season 3. Advertisement But don't hold your breath — because, according to Stiller himself, that's not going to happen any time soon. Severance is 'a big part' of Stiller's directing legacy Apple TV+ When Stiller and his cast took the stage at a recent \"Severance\" panel (via GoldDerby), moderator Conan O'Brien spoke on the topic of Stiller appearing in the show, saying, \"There might be people that would think, 'Oh, Ben's gonna peek in or pop up as a character,' and no, you're just very much interested in this being a big part of your directing legacy.\" Advertisement To which Stiller replied: \"It's very clear to me that that's my job on the show ... The most fun for me when we're making the show is being able to just watch these performances and be the first audience for it.\" It's not hard to imagine why he'd feel this way: The cast of \"Severance\" is delivering some of the best performances on television right now, so getting to be their very first audience is a special treat. In an interview with Yahoo! for season 1, Stiller elaborated that pulling back from acting helped him to maintain a healthier work-life balance: \"For a long time I would direct and act in the same project over the years, and I really decided recently, or probably about five years ago, that I didn't wanna do that anymore and just do one thing at a time. And, lately, I've been exploring projects [and] making things as a director and producer, and I've been very happy with that.\" Advertisement This shouldn't come as too much of a shocker to anyone who knows how seriously Stiller takes his job as a director. He famously has a \"no phones on set\" rule to help keep all the cast and crew locked in on their work. There is one small caveat to all this, however: Stiller did perform a small, uncredited cameo in season 1 voicing a cartoon of Lumon's founder Kier Eagan, although star Britt Lower called it more of an Easter egg. Maybe this cartoon will make a return in season 3, but until then, the next time you'll see Stiller on screen will be in the upcoming \"Happy Gilmore 2.\" Both seasons of \"Severance\" are streaming on Apple TV+.",
  "image": "https://www.slashfilm.com/img/gallery/why-ben-stiller-doesnt-act-in-severance/l-intro-1746820875.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                                \n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1855868/why-ben-stiller-doesnt-act-severance/\" data-post-title=\"Why Ben Stiller Doesn\u0026#39;t Act In Severance\" data-slide-num=\"0\" data-post-id=\"1855868\"\u003e\n                                             \u003cpicture id=\"pd6a405726fc948cde389a2140b396af5\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-ben-stiller-doesnt-act-in-severance/intro-1746820875.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-ben-stiller-doesnt-act-in-severance/intro-1746820875.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/why-ben-stiller-doesnt-act-in-severance/intro-1746820875.jpg\" data-slide-url=\"https://www.slashfilm.com/1855868/why-ben-stiller-doesnt-act-severance/\" data-post-id=\"1855868\" data-slide-num=\"0\" data-slide-title=\"Why Ben Stiller Doesn\u0026#39;t Act In Severance: \" width=\"780\" height=\"438\" alt=\"Ben Stiller speaking in a behind-the-scenes video for Severance\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eApple TV+\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n                \n                \n\u003cp dir=\"ltr\"\u003eFor as long as we\u0026#39;ve known him, Ben Stiller has been a writer and director as much as he\u0026#39;s been an actor. The son of famed comedians Jerry Stiller and Anne Meara, Ben Stiller made a name for himself first by creating the short-lived but influential comedy series \u0026#34;The Ben Stiller Show,\u0026#34; then by directing, co-writing and starring in the Gen-X film staple \u0026#34;Reality Bites.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eFrom that point on, \u003ca href=\"https://www.slashfilm.com/1112363/the-best-ben-stiller-movies-ranked/\" target=\"_blank\"\u003eStiller starred in everything from hit comedies\u003c/a\u003e like \u0026#34;Meet the Parents\u0026#34; to cult classics like \u0026#34;Zoolander\u0026#34; and emotionally grounded dramedies like \u0026#34;Brad\u0026#39;s Status.\u0026#34; Many of his most iconic roles were in his own movies, including the gloriously slow-witted Derek Zoolander and the prima donna action movie star Tugg Speedman in \u0026#34;Tropic Thunder.\u0026#34;\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eThen, a one-two punch of underperforming films (first \u003ca href=\"https://www.slashfilm.com/1784542/ben-stiller-box-office-misfire-the-secret-life-of-walter-mitty-paved-way-severance/\" target=\"_blank\"\u003ehis self-serious \u0026#34;The Secret Life of Walter Mitty\u0026#34;\u003c/a\u003e and then the \u003ca href=\"https://www.slashfilm.com/1569062/zoolander-2-box-office-flop-ben-still-questioning-his-career/\" target=\"_blank\"\u003emuch anticipated but little seen \u0026#34;Zoolander 2\u0026#34;\u003c/a\u003e) led Stiller to return to working in television and, eventually, bring his biggest success to life with Apple TV+\u0026#39;s \u0026#34;Severance,\u0026#34; with Stiller having directed many of the show\u0026#39;s best episodes. With the series having recently concluded its second season in dramatic fashion, many viewers have wondered whether Stiller might be saving a role for himself in \u003ca href=\"https://www.slashfilm.com/1816086/severance-season-3-details/\" target=\"_blank\"\u003ethe hotly anticipated \u0026#34;Severance\u0026#34; season 3.\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eBut don\u0026#39;t hold your breath — because, according to Stiller himself, that\u0026#39;s not going to happen any time soon.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eSeverance is \u0026#39;a big part\u0026#39; of Stiller\u0026#39;s directing legacy\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1855868/why-ben-stiller-doesnt-act-severance/\" data-post-title=\"Why Ben Stiller Doesn\u0026#39;t Act In Severance\" data-slide-num=\"1\" data-post-id=\"1855868\"\u003e\n                                             \u003cpicture id=\"pe218baf97d01ffef652782834f62172c\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-ben-stiller-doesnt-act-in-severance/severance-is-a-big-part-of-stillers-directing-legacy-1746820875.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-ben-stiller-doesnt-act-in-severance/severance-is-a-big-part-of-stillers-directing-legacy-1746820875.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/why-ben-stiller-doesnt-act-in-severance/severance-is-a-big-part-of-stillers-directing-legacy-1746820875.jpg\" data-slide-url=\"https://www.slashfilm.com/1855868/why-ben-stiller-doesnt-act-severance/\" data-post-id=\"1855868\" data-slide-num=\"1\" data-slide-title=\"Why Ben Stiller Doesn\u0026#39;t Act In Severance: Severance is \u0026#39;a big part\u0026#39; of Stiller\u0026#39;s directing legacy\" width=\"780\" height=\"438\" alt=\"Mark carrying balloons in \u0026#34;Severance\u0026#34;\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eApple TV+\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eWhen Stiller and his cast took the stage at a recent \u0026#34;Severance\u0026#34; panel (via \u003ca href=\"https://www.goldderby.com/article/2025/severance-season-2-fyc-event-conan-obrien/\" target=\"_blank\"\u003eGoldDerby\u003c/a\u003e), moderator Conan O\u0026#39;Brien spoke on the topic of Stiller appearing in the show, saying, \u0026#34;There might be people that would think, \u0026#39;Oh, Ben\u0026#39;s gonna peek in or pop up as a character,\u0026#39; and no, you\u0026#39;re just very much interested in this being a big part of your directing legacy.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eTo which Stiller replied:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e\u0026#34;It\u0026#39;s very clear to me that that\u0026#39;s my job on the show ... The most fun for me when we\u0026#39;re making the show is being able to just watch these performances and be the first audience for it.\u0026#34;\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp dir=\"ltr\"\u003eIt\u0026#39;s not hard to imagine why he\u0026#39;d feel this way: The cast of \u0026#34;Severance\u0026#34; is delivering some of the best performances on television right now, so getting to be their very first audience is a special treat. In an interview with \u003ca href=\"https://www.yahoo.com/entertainment/severance-ben-stiller-work-life-balance-stopped-acting-adam-scott-interview-160056542.html\" target=\"_blank\"\u003eYahoo! for season 1,\u003c/a\u003e Stiller elaborated that pulling back from acting helped him to maintain a healthier work-life balance:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e\u0026#34;For a long time I would direct and act in the same project over the years, and I really decided recently, or probably about five years ago, that I didn\u0026#39;t wanna do that anymore and just do one thing at a time. And, lately, I\u0026#39;ve been exploring projects [and] making things as a director and producer, and I\u0026#39;ve been very happy with that.\u0026#34;\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eThis shouldn\u0026#39;t come as too much of a shocker to anyone who knows how seriously Stiller takes his job as a director. He famously has a \u003ca href=\"https://www.slashfilm.com/1773650/ben-stiller-severance-rule-no-phones/\" target=\"_blank\"\u003e\u0026#34;no phones on set\u0026#34; rule\u003c/a\u003e to help keep all the cast and crew locked in on their work.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eThere is one small caveat to all this, however: Stiller did perform \u003ca href=\"https://www.slashfilm.com/1832306/ben-stiller-severance-season-1-cameo-explained/\" target=\"_blank\"\u003ea small, uncredited cameo in season 1\u003c/a\u003e voicing a cartoon of Lumon\u0026#39;s founder Kier Eagan, although star Britt Lower called it more of an Easter egg. Maybe this cartoon will make a return in season 3, but until then, the next time you\u0026#39;ll see Stiller on screen will be in the upcoming \u003ca href=\"https://www.slashfilm.com/1813765/adam-sandler-netflix-happy-gilmore-2-teaser-trailer/\" target=\"_blank\"\u003e\u0026#34;Happy Gilmore 2.\u0026#34;\u003c/a\u003e\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eBoth seasons of \u0026#34;Severance\u0026#34; are streaming on Apple TV+.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-05-17T22:20:00Z",
  "modifiedTime": "2025-05-17T22:20:00Z"
}
