{
  "id": "48f435ac-5828-49b4-bc02-9425d2fcf6a5",
  "title": "The Odyssey: Charlize Theron Will Be On Set For 2 Weeks",
  "link": "https://bleedingcool.com/movies/the-odyssey-charlize-theron-will-be-on-set-for-2-weeks/",
  "description": "Charlize Theron hasn't shot her scene for Christopher Nolan's The Odyssey yet, but revealed that she'll only spend two weeks on set.",
  "author": "Kaitlyn Booth",
  "published": "Thu, 03 Jul 2025 15:52:02 -0500",
  "source": "https://www.bleedingcool.com/movies/feed/",
  "categories": [
    "Movies",
    "Universal",
    "the odyssey"
  ],
  "byline": "Kaitlyn Booth",
  "length": 6701,
  "excerpt": "The first trailer for The Odyssey is in theaters, but the movie is very much still shooting. It's a massive story, it's not called an \"epic poem\" for nothing, with a ton of characters played by some of the biggest actors in Hollywood. That means trying to figure out when everyone can make it to set […]",
  "siteName": "Bleeding Cool News",
  "favicon": "",
  "text": "Posted in: Movies, Universal | Tagged: the odysseyCharlize Theron hasn't shot her scene for Christopher Nolan's The Odyssey yet, but revealed that she'll only spend two weeks on set.Article Summary Charlize Theron will play Circe and spend just two weeks filming her scenes for The Odyssey. Christopher Nolan continues production on his epic adaptation of Homer’s classic for Universal Pictures. The Odyssey boasts a star-studded cast and is set for a major theatrical release on July 17, 2026. Nolan’s partnership with Universal follows Oppenheimer’s box office and awards season success. The first trailer for The Odyssey is in theaters, but the movie is very much still shooting. It's a massive story, it's not called an \"epic poem\" for nothing, with a ton of characters played by some of the biggest actors in Hollywood. That means trying to figure out when everyone can make it to set would be quite the balancing act, but it sounds like director Christopher Nolan is bringing in the actors with smaller roles when they are between jobs or press tours. Charlize Theron is wrapping up press for The Old Guard 2, and it appears she is getting ready to head to the set. She recently confirmed that she is playing Circe, and in a long interview with The Hollywood Reporter, she was asked about the scope of the film compared to other projects she has been on. \"Well, I haven't been there yet,\" Theron revealed. \"Like you guys, I'm just hearing and seeing everything from afar. I'm leaving in three weeks or something like that, and I feel like I'm going to be the new kid on the block. I know it's epic from reading the script, but for myself, I'm only there for two weeks, I think. Chris is the kind of filmmaker who knows exactly what's in his head, and he knows the movie that he's making, so I am going to go with that. But doing Fury Road and shooting it for a hundred days, that was as epic as I've ever gone.\" London, United Kingdom- February 2, 2020: Charlize Theron attends the British Academy Film Awards at the Royal Albert Hall in London, UK. Editorial credit: Fred Duval / Shutterstock.com It says a lot about Mad Max: Fury Road  , not to mention the other massive productions Theron has been on over the years, that a Nolan-directed adaptation of one of the most famous stories isn't at the top of the list of the biggest productions she has been on. Christopher Nolan Returning To Universal For The Odyssey Makes Total Sense At the beginning of October 2024, it was officially announced that Christopher Nolan would be returning to Universal for his next film following the success of Oppenheimer. It seemed to be the final nail in the coffin for Nolan's relationship with Warner Bros. Universal, which appears to be giving him whatever he wants, which makes sense considering the whole Barbeheimer thing, the box office, and the awards season. Matt Damon, Tom Holland, Zendaya, Anne Hathaway, Lupita Nyong'o, Charlize Theron, Robert Pattinson, Jon Bernthal, Benny Safdie, Elliot Page, Himesh Patel, Bill Irwin, Samantha Morton, Iddo Goldberg, John Leguizamo, and Michael Vlamis have reportedly joined the cast, and the untitled film was given a prime-time release date of July 17, 2026. On December 24, 2024, it was announced on X/Twitter that Nolan would be adapting the classic, The Odyssey: \"Christopher Nolan's next film 'The Odyssey' is a mythic action epic shot across the world using brand new IMAX film technology. The film brings Homer's foundational saga to IMAX film screens for the first time and opens in theaters everywhere on July 17, 2026.\" Credit: Universal Pictures © Universal Studios. All Rights Reserved. What happened with Oppenheimer in the summer of 2023 was one of those beautiful and possibly once-in-a-lifetime moments. The way the world leaned into the Barbenheimer thing and proved that there was space for two excellent films to open simultaneously without cannibalizing each other was almost unheard of. People will try to make it happen again, but it was an organic thing that came about with no influence from studio marketing. Studio marketing and everyone involved decided that leaning in was the way to go, and it worked out well for everyone. Barbie ended up with a total box office of $1.45 billion and a place in the pop culture landscape that isn't going away anytime soon. Nolan's Oppenheimer walked away with a sweet $976 million, becoming the third highest-grossing R-rated movie of all time [at the time of writing] and securing its place in the pop culture conversation by becoming a slow-moving character piece that did numbers. Oppenheimer also won seven Academy Awards, including the coveted Best Picture, Best Director, Best Actor, and Best Supporting Actor. So it's not surprising that Universal happily courted Nolan again and is likely doing exactly what Warner Bros. did in the heyday of their partnership: writing him a blank check and setting him loose on a movie set. Enjoyed this? Please share on social media! Stay up-to-date and support the site by following Bleeding Cool on Google News today! About Kaitlyn BoothKaitlyn is the Editor-in-Chief at Bleeding Cool. Film critic and pop culture writer since 2013. Ace. Leftist. Nerd. Feminist. Writer. Replicant Translator. Cinephillic Virtue Signaler. She/Her. UFCA/GALECA Member. 🍅 Approved. Follow her Threads, Instagram, and Twitter @katiesmovies.Latest in MoviesThe Many Voices Of The Smufs Revealed In A New BTS FeaturetteParamount Pictures released a new behind-the-scenes featurette for the upcoming Smurfs, showing off the large and impressive voice cast.The Odyssey: Charlize Theron Will Be On Set For 2 WeeksCharlize Theron hasn't shot her scene for Christopher Nolan's The Odyssey yet, but revealed that she'll only spend two weeks on set.Jurassic World Rebirth Review: A Few Roaring Moments, A Rehashed PlotJurassic World Rebirth is ultimately one of the better entries in the modern Jurassic World series of films, but that bar is so low we could stub our toes on it, so it's not saying much. The Fantastic Four: First Steps – New BTS Featurette ReleasedMarvel released a new behind-the-scenes featurette for The Fantastic Four: First Steps, spotlighting some of the production's practical elements.Hell House LLC: Lineage Has A Brand New Trailer, Watch It HereA new trailer has been released for Hell House LLC: Lineage. The latest film in the horror franchise will be released in theaters on August 20.Jurassic World Rebirth Is The Best Of The New Sequels By Far {Review}Jurassic World Rebirth is the best World-branded film. Entertaining, scary in moments, and a thrilling time. Not perfect, but worth it.",
  "image": "https://bleedingcool.com/wp-content/uploads/2024/11/shutterstock_1635138103.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n\u003csection\u003e\u003carticle id=\"article\" data-post-id=\"2246952\" itemscope=\"\" itemtype=\"http://schema.org/Article\"\u003e\u003cp\u003ePosted in: \u003ca href=\"https://bleedingcool.com/movies/\" rel=\"category\"\u003eMovies\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/movies/universal/\" rel=\"category\"\u003eUniversal\u003c/a\u003e | Tagged: \u003ca href=\"https://bleedingcool.com/tag/the-odyssey/\" rel=\"tag\"\u003ethe odyssey\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\u003cp\u003eCharlize Theron hasn\u0026#39;t shot her scene for Christopher Nolan\u0026#39;s The Odyssey yet, but revealed that she\u0026#39;ll only spend two weeks on set.\u003c/p\u003e\u003chr/\u003e\u003chr/\u003e\u003cdiv id=\"post_summary\"\u003e\u003ch2\u003eArticle Summary\u003c/h2\u003e\u003cul\u003e\n\u003cli\u003eCharlize Theron will play Circe and spend just two weeks filming her scenes for The Odyssey.\u003c/li\u003e\n\u003cli\u003eChristopher Nolan continues production on his epic adaptation of Homer’s classic for Universal Pictures.\u003c/li\u003e\n\u003cli\u003eThe Odyssey boasts a star-studded cast and is set for a major theatrical release on July 17, 2026.\u003c/li\u003e\n\u003cli\u003eNolan’s partnership with Universal follows Oppenheimer’s box office and awards season success.\u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003chr/\u003e\u003cp\u003eThe first trailer for \u003cem\u003eThe Odyssey\u003c/em\u003e is \u003ca href=\"https://bleedingcool.com/movies/the-odyssey-the-first-poster-was-officially-released-today/\"\u003ein theaters\u003c/a\u003e, but the movie is very much still shooting. It\u0026#39;s a massive story, it\u0026#39;s not called an \u0026#34;epic poem\u0026#34; for nothing, with a ton of characters played by some of the biggest actors in Hollywood. That means trying to figure out when everyone can make it to set would be quite the balancing act, but it sounds like director \u003cstrong\u003eChristopher Nolan\u003c/strong\u003e is bringing in the actors with smaller roles when they are between jobs or press tours. \u003cstrong\u003eCharlize Theron\u003c/strong\u003e is wrapping up press for \u003cem\u003eThe Old Guard 2,\u003c/em\u003e and it appears she is getting ready to head to the set. She recently confirmed that she is playing Circe, and in a long interview with \u003ca href=\"https://www.hollywoodreporter.com/movies/movie-features/charlize-theron-old-guard-trilogy-odyssey-1236304226/?taid=6865a4f9db7b8a0001a41f20\u0026amp;utm_campaign=trueanthem\u0026amp;utm_medium=social\u0026amp;utm_source=twitter\"\u003eThe Hollywood Reporter\u003c/a\u003e, she was asked about the scope of the film compared to other projects she has been on.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Well, I haven\u0026#39;t been there yet,\u0026#34; Theron revealed. \u0026#34;Like you guys, I\u0026#39;m just hearing and seeing everything from afar. I\u0026#39;m leaving in three weeks or something like that, and I feel like I\u0026#39;m going to be the new kid on the block. I know it\u0026#39;s epic from reading the script, but for myself, I\u0026#39;m only there for two weeks, I think. Chris is the kind of filmmaker who knows exactly what\u0026#39;s in his head, and he knows the movie that he\u0026#39;s making, so I am going to go with that. But doing \u003cem\u003eFury\u003c/em\u003e \u003cem\u003eRoad\u003c/em\u003e and shooting it for a hundred days, that was as epic as I\u0026#39;ve ever gone.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"attachment_2125731\" aria-describedby=\"caption-attachment-2125731\"\u003e\u003ca href=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://bleedingcool.com/wp-content/uploads/2024/11/shutterstock_1635138103.jpg\"\u003e\u003cimg src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:400/q:75/https://bleedingcool.com/wp-content/uploads/2024/11/shutterstock_1635138103.jpg\" alt=\"Charlize Theron Has Joined The Cast Of Christopher Nolan\u0026#39;s New Film\" width=\"600\" height=\"400\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:400/q:75/https://bleedingcool.com/wp-content/uploads/2024/11/shutterstock_1635138103.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20600%20400%22%20width%3D%22600%22%20height%3D%22400%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2125731\"\u003eLondon, United Kingdom- February 2, 2020: Charlize Theron attends the British Academy Film Awards at the Royal Albert Hall in London, UK. Editorial credit: Fred Duval / Shutterstock.com\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eIt says a lot about \u003cem\u003eMad Max: Fury Road\u003cstrong\u003e \u003c/strong\u003e\u003c/em\u003e , not to mention the other massive productions Theron has been on over the years, that a Nolan-directed adaptation of one of the most famous stories isn\u0026#39;t at the top of the list of the biggest productions she has been on.\u003c/p\u003e\n\u003ch2\u003eChristopher Nolan Returning To Universal For \u003cem\u003eThe Odyssey\u003c/em\u003e Makes Total Sense\u003c/h2\u003e\n\u003cp\u003eAt the beginning of October 2024, \u003ca href=\"https://bleedingcool.com/movies/christopher-nolan-sets-his-next-film-for-july-2026-with-universal/\"\u003eit was officially announced\u003c/a\u003e that Christopher Nolan would be returning to Universal for his next film following the success of \u003cem\u003eOppenheimer\u003c/em\u003e. It seemed to be the final nail in the coffin for Nolan\u0026#39;s relationship with Warner Bros. Universal, which appears to be giving him whatever he wants\u003cspan\u003e, which makes sense considering the whole \u003cem\u003eBarbeheimer\u003c/em\u003e thing, the box office, and the awards season. \u003cstrong\u003eMatt Damon\u003c/strong\u003e, \u003cstrong\u003eTom Holland, Zendaya\u003c/strong\u003e, \u003cstrong\u003eAnne Hathaway, \u003c/strong\u003e\u003cstrong\u003eLupita Nyong\u0026#39;o, Charlize Theron, \u003c/strong\u003e\u003cstrong\u003eRobert Pattinson, Jon Bernthal, Benny Safdie, Elliot Page, Himesh Patel, Bill Irwin, \u003c/strong\u003e\u003cstrong\u003eSamantha Morton, Iddo Goldberg, John Leguizamo, \u003c/strong\u003eand\u003cstrong\u003e Michael Vlamis \u003c/strong\u003ehave reportedly joined the cast, and the untitled film was given a prime-time\u003c/span\u003e release date of July 17, 2026. On December 24, 2024, \u003ca href=\"https://bleedingcool.com/movies/christopher-nolans-new-film-is-an-adaptation-of-the-odyssey/\"\u003eit was announced\u003c/a\u003e on X/Twitter that Nolan would be adapting the classic, \u003cem\u003eThe Odyssey:\u003c/em\u003e \u0026#34;Christopher Nolan\u0026#39;s next film \u0026#39;The Odyssey\u0026#39; is a mythic action epic shot across the world using brand new IMAX film technology. The film brings Homer\u0026#39;s foundational saga to IMAX film screens for the first time and opens in theaters everywhere on July 17, 2026.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"attachment_2246445\" aria-describedby=\"caption-attachment-2246445\"\u003e\u003ca href=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://bleedingcool.com/wp-content/uploads/2025/07/odyssey_xxlg.jpg\"\u003e\u003cimg src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:950/q:75/https://bleedingcool.com/wp-content/uploads/2025/07/odyssey_xxlg.jpg\" alt=\"A promotional poster for the film \u0026#34;The Odyssey\u0026#34; by Christopher Nolan, featuring a close-up of a marble sculpture\u0026#39;s face against a dark background, with fiery sparks and the text \u0026#34;DEFY THE GODS\u0026#34; and release date \u0026#34;07.17.26.\u0026#34;\" width=\"600\" height=\"950\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:950/q:75/https://bleedingcool.com/wp-content/uploads/2025/07/odyssey_xxlg.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20600%20950%22%20width%3D%22600%22%20height%3D%22950%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2246445\"\u003eCredit: Universal Pictures © Universal Studios. All Rights Reserved.\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eWhat happened with \u003cem\u003eOppenheimer\u003c/em\u003e in the summer of 2023 was one of those beautiful and possibly once-in-a-lifetime moments. The way the world leaned into the \u003cem\u003eBarbenheimer\u003c/em\u003e thing and proved that there was space for two excellent films to open simultaneously without cannibalizing each other was almost unheard of. People will try to make it happen again, but it was an organic thing that came about with no influence from studio marketing. Studio marketing and everyone involved decided that leaning in was the way to go, and it worked out well for everyone.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eBarbie\u003c/em\u003e ended up with a total box office of $1.45 billion and a place in the pop culture landscape that isn\u0026#39;t going away anytime soon. Nolan\u0026#39;s \u003cem\u003eOppenheimer\u003c/em\u003e walked away with a sweet $976 million, becoming the third highest-grossing R-rated movie of all time [at the time of writing] and securing its place in the pop culture conversation by becoming a slow-moving character piece that did numbers. \u003cem\u003eOppenheimer\u003c/em\u003e also won seven Academy Awards, including the coveted Best Picture, Best Director, Best Actor, and Best Supporting Actor. So it\u0026#39;s not surprising that Universal happily courted Nolan again and is likely doing exactly what Warner Bros. did in the heyday of their partnership: writing him a blank check and setting him loose on a movie set.\u003c/p\u003e\n\u003chr/\u003e\u003cdiv id=\"bc_sharing_is_caring\"\u003e\u003ccenter\u003e\u003cp\u003e\u003cstrong\u003eEnjoyed this? Please share on social media!\u003c/strong\u003e\u003c/p\u003e\u003ca href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fthe-odyssey-charlize-theron-will-be-on-set-for-2-weeks%2F\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://twitter.com/share?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fthe-odyssey-charlize-theron-will-be-on-set-for-2-weeks%2F\u0026amp;text=The+Odyssey%3A+Charlize+Theron+Will+Be+On+Set+For+2+Weeks\u0026amp;via=bleedingcool\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"http://pinterest.com/pin/create/button/?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fthe-odyssey-charlize-theron-will-be-on-set-for-2-weeks%2F\u0026amp;description=The+Odyssey%3A+Charlize+Theron+Will+Be+On+Set+For+2+Weeks\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://reddit.com/submit?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fthe-odyssey-charlize-theron-will-be-on-set-for-2-weeks%2F\u0026amp;title=The+Odyssey%3A+Charlize+Theron+Will+Be+On+Set+For+2+Weeks\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003c/center\u003e\u003c/div\u003e\n    \u003ca id=\"google_follow\" href=\"https://news.google.com/publications/CAAqBwgKMPHflgsw1IauAw?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n        \u003cp\u003e\u003cimg width=\"100\" height=\"81\u0026#34;\" src=\"https://bleedingcool.com/Google_News_icon.png\"/\u003e\n        \u003c/p\u003e\n        \u003cp\u003e\n            Stay up-to-date and support the site by following Bleeding Cool on Google News today!\n        \u003c/p\u003e\n    \u003c/a\u003e\u003c/article\u003e\u003csection\u003e\u003ch2\u003e\u003cimg data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:150/h:150/q:75/https://www.gravatar.com/avatar/c6bcaa58a7b5119a6d358a10f6547af6?s=150\" src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20150%20150%22%20width%3D%22150%22%20height%3D%22150%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\" width=\"150px\" height=\"150px\" alt=\"Kaitlyn Booth\"/\u003eAbout \u003ca href=\"https://bleedingcool.com/author/kbooth/\"\u003eKaitlyn Booth\u003c/a\u003e\u003c/h2\u003eKaitlyn is the Editor-in-Chief at Bleeding Cool. Film critic and pop culture writer since 2013. Ace. Leftist. Nerd. Feminist. Writer. Replicant Translator. Cinephillic Virtue Signaler. She/Her. UFCA/GALECA Member. 🍅 Approved. Follow her Threads, Instagram, and Twitter @katiesmovies.\u003c/section\u003e\u003c/section\u003e\u003cdiv id=\"read_more\"\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca href=\"https://bleedingcool.com/movies/\" rel=\"bookmark\"\u003eLatest in Movies\u003c/a\u003e\u003c/h2\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/the-many-voices-of-the-smufs-revealed-in-a-new-bts-featurette/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/05/SMU-FF-060.jpg\" alt=\"A scene from the animated movie \u0026#34;Smurfs,\u0026#34; featuring the characters Smurfette, Brainy Smurf, and Ken. Smurfette has blonde hair and a worried expression, while Brainy Smurf looks concerned, set against a colorful background with other Smurf characters in the scene.\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/05/SMU-FF-060.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/the-many-voices-of-the-smufs-revealed-in-a-new-bts-featurette/\"\u003e\u003ch3 rel=\"bookmark\"\u003eThe Many Voices Of The Smufs Revealed In A New BTS Featurette\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eParamount Pictures released a new behind-the-scenes featurette for the upcoming Smurfs, showing off the large and impressive voice cast.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/the-odyssey-charlize-theron-will-be-on-set-for-2-weeks/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2024/11/shutterstock_1635138103.jpg\" alt=\"Charlize Theron Has Joined The Cast Of Christopher Nolan\u0026#39;s New Film\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2024/11/shutterstock_1635138103.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/the-odyssey-charlize-theron-will-be-on-set-for-2-weeks/\"\u003e\u003ch3 rel=\"bookmark\"\u003eThe Odyssey: Charlize Theron Will Be On Set For 2 Weeks\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eCharlize Theron hasn\u0026#39;t shot her scene for Christopher Nolan\u0026#39;s The Odyssey yet, but revealed that she\u0026#39;ll only spend two weeks on set.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/jurassic-world-rebirth-review-a-few-roaring-moments-a-rehashed-plot/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2024/08/400761-5_k1c-JW_FINAL_EDIT_SubTitle_sRGB.jpg\" alt=\"Jurassic World Rebirth: Summary, Images, And Title Treatment Revealed\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2024/08/400761-5_k1c-JW_FINAL_EDIT_SubTitle_sRGB.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/jurassic-world-rebirth-review-a-few-roaring-moments-a-rehashed-plot/\"\u003e\u003ch3 rel=\"bookmark\"\u003eJurassic World Rebirth Review: A Few Roaring Moments, A Rehashed Plot\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eJurassic World Rebirth is ultimately one of the better entries in the modern Jurassic World series of films, but that bar is so low we could stub our toes on it, so it\u0026#39;s not saying much. \u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/the-fantastic-four-first-steps-new-bts-featurette-released/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/07/BMN-04783_R.jpg\" alt=\"Director Matt Shakman talks with actors on the set of \u0026#39;The Fantastic Four: First Steps,\u0026#39; set in a studio environment, featuring crew members in the background.\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/07/BMN-04783_R.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/the-fantastic-four-first-steps-new-bts-featurette-released/\"\u003e\u003ch3 rel=\"bookmark\"\u003eThe Fantastic Four: First Steps – New BTS Featurette Released\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eMarvel released a new behind-the-scenes featurette for The Fantastic Four: First Steps, spotlighting some of the production\u0026#39;s practical elements.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/hell-house-llc-lineage-has-a-brand-new-trailer-watch-it-here/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/05/download-1-1-1.jpeg\" alt=\"Hell House LLC: Lineage Has A New Poster, Releases In August\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/05/download-1-1-1.jpeg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/hell-house-llc-lineage-has-a-brand-new-trailer-watch-it-here/\"\u003e\u003ch3 rel=\"bookmark\"\u003eHell House LLC: Lineage Has A Brand New Trailer, Watch It Here\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eA new trailer has been released for Hell House LLC: Lineage. The latest film in the horror franchise will be released in theaters on August 20.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/jurassic-world-rebirth-is-the-best-of-the-new-sequels-by-far-review/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/05/2583_TP_00055-4096x1716-fd56f6a.jpg\" alt=\"A tense scene from \u0026#39;Jurassic World Rebirth,\u0026#39; featuring a silhouetted figure in water, illuminated by a glowing object, with a menacing dinosaur emerging in the background, surrounded by dark foliage and smoke.\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/05/2583_TP_00055-4096x1716-fd56f6a.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/jurassic-world-rebirth-is-the-best-of-the-new-sequels-by-far-review/\"\u003e\u003ch3 rel=\"bookmark\"\u003eJurassic World Rebirth Is The Best Of The New Sequels By Far {Review}\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eJurassic World Rebirth is the best World-branded film. Entertaining, scary in moments, and a thrilling time. Not perfect, but worth it.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-07-03T15:52:02-05:00",
  "modifiedTime": "2025-07-03T15:52:02-05:00"
}
