{
  "id": "49177ca9-f9a2-43cc-afd5-2a66a43c6338",
  "title": "Marvel's Agatha All Along Season 2 – Will It Ever Happen?",
  "link": "https://www.slashfilm.com/1714160/agatha-all-along-season-2-marvel-updates/",
  "description": "Marvel's Agatha All Along developed a rabid fanbase and was met with critical acclaim, but will the witch of Westview get a season 2?",
  "author": "Witney Seibold",
  "published": "Fri, 15 Nov 2024 00:21:51 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Comedy Shows",
    "Horror Shows",
    "Superhero Shows"
  ],
  "byline": "Witney Seibold",
  "length": 6280,
  "excerpt": "Marvel's Agatha All Along developed a rabid fanbase and was met with critical acclaim, but will the witch of Westview get a season 2?",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slash-film-favicon-448x448.png",
  "text": "Marvel Studios This article contains spoilers for \"Agatha All Along.\" Jac Schaeffer's 2024 TV series \"Agatha All Along\" stars Kathryn Hahn as Agatha Harkness, a wicked sorceress who serves as a nemesis to the Scarlet Witch. The show is a direct spinoff of 2021's \"WandaVision,\" where the character was first introduced. The new series saw Agatha forming a new coven of witches so that they along with her new teenage sidekick Teen (Joe Locke) could face the trials of the Witches' Road, a mysterious process that grants its survivors any wish they want. Agatha lost her witch powers, so she very much would like to have them back. The series also featured Aubrey Plaza as the Rio Vidal aka Death (who was Agatha's ex-girlfriend), as well as living legend, Patti LuPone, Sasheer Zamata, Ali Ahn, and Debra Jo Rupp.  The shows from within the Marvel Cinematic Universe have been a little frustrating to viewers, as one can never be sure if they are meant to be long-running series with new seasons on the horizon, or if they were designed to be encapsulated miniseries with a definite endpoint. Often, a Marvel show won't be defined as a series or a miniseries until near the end of its first season, and even then, a curious seeker would have to look up its entry on Wikipedia just to be sure. As of this writing, \"Ironheart,\" \"Echo,\" \"Secret Invasion,\" \"She-Hulk: Attorney at Law,\" \"Ms. Marvel,\" \"Moon Knight,\" \"The Falcon and the Winter Soldier,\" and \"WandaVision\" are described as miniseries. Only \"Loki,\" \"What If...?,\" and \"Daredevil: Born Again\" count as ongoing shows. Other upcoming shows remain up in the air.  \"Agatha All Along\" was also declared a miniseries, implying that no \"second season\" will ever be nigh. This wasn't a \"season one.\" This was a nine-episode TV special. The miniseries was, however, well-received. \"Agatha All Along\" received generally positive reviews, with many responding cheerfully to the show's flippant humor and queerness. Some have even posited that the good reviews might lead to a new season or a miniseries sequel.  So far, however, a follow-up \"Agatha\" series remains in the realm of conjecture.  Why hasn't an announcement for a follow-up to 'Agatha All Along' happened? Marvel Studios The ratings for \"Agatha All Along\" were very high. Various rating reports stated that it was the highest-rated show on Disney+ when it was being released, and that social media engagement was high. It was also, unlike some other Marvel shows, popular all the way through, retaining the greatest number of viewers from the start. Everyone's social media feed is different, of course, so it's hard to accept a show has high social engagement if you don't personally see people talking about it, but the numbers were indeed there.  Critics also like \"Agatha All Along,\" and the show received an 83% approval rating on Rotten Tomatoes based on 207 reviews. That's a similar approval as \"The Falcon and the Winter Soldier\" and the original 1992 \"X-Men\" animated series. It's also a sight better than shows like \"Iron Fist,\" \"Secret Invasion,\" and \"Inhumans,\" which were all panned.  It's difficult to say what numbers Marvel executives need to greenlight second seasons, or what kind of abstract qualities a show must possess in order to be worthy of a follow-up, but whatever those are, \"Agatha All Along\" must not have it. The only hint audiences might have for a follow-up series is that the show's makers submitted \"Agatha All Along\" to various awards bodies as a \"series\" and not a \"limited series.\" The former term implies that the door is open for more, but it might be related to the fact this is a spin-off directly connected to \"WandaVision\" which makes the definition of \"limited series\" a bit messier. Without any announcement, though, that's all anyone has to go on.  What has Brad Winderbaum said about a follow-up to 'Agatha All Along?' Marvel Studios The head of streaming for Marvel Studios, a man named Brad Winderbaum, noted on Twitter/X that he would indeed be interested in a second go-round for \"Agatha All Along,\" saying that \"I think we all want to see more adventures in Westview,\" the town where \"Agatha\" takes place. Although he is in charge of streaming, it's not his job to greenlight new shows, so his statement was more an expression of interest than any kind of official statement.  Speculations have begun to rise, of course, positing that some of the show's supporting characters may turn up in future Marvel projects. Sadly, no one's contracts have been revealed, and no press releases have been given. Audiences are currently in the \"what if\" phase, allowing them to invent exciting new shows in their head. Although the Marvel Cinematic Universe is still planning on many films and TV shows for its future, there's a general sense that the party is over. Superhero movies are, in general, bombing more often than hitting, and the conversation isn't being led by the genre as much as it was about four or five years ago. Indeed, ever since \"Avengers: Endgame,\" more and more MCU movies have been tanking or merely getting bad reviews. The massive success of \"Deadpool \u0026 Wolverine\" is now the exception, not the rule. In such an environment, releasing \"Agatha All Along\" was a risk to begin with. The fact that it was mildly successful and relatively well-reviewed was a \"thank our lucky stars\" moment, and not a \"we need this to continue\" moment.  The atmosphere in general suggests that there will be no more Agatha, unless she appears in a different MCU project.",
  "image": "https://www.slashfilm.com/img/gallery/marvels-agatha-all-along-season-2-will-it-ever-happen/l-intro-1731629359.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n                        \n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n    \n                \u003cdiv\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1714160/agatha-all-along-season-2-marvel-updates/\" data-post-title=\"Marvel\u0026#39;s Agatha All Along Season 2 – Will It Ever Happen?\" data-slide-num=\"0\" data-post-id=\"1714160\"\u003e\n                                             \u003cpicture id=\"pbd1df9649c7e69df53e5779d47f509c8\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/marvels-agatha-all-along-season-2-will-it-ever-happen/intro-1731629359.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/marvels-agatha-all-along-season-2-will-it-ever-happen/intro-1731629359.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/marvels-agatha-all-along-season-2-will-it-ever-happen/intro-1731629359.jpg\" data-slide-url=\"https://www.slashfilm.com/1714160/agatha-all-along-season-2-marvel-updates/\" data-post-id=\"1714160\" data-slide-num=\"0\" data-slide-title=\"Marvel\u0026#39;s Agatha All Along Season 2 – Will It Ever Happen?: \" width=\"780\" height=\"438\" alt=\"Kathryn Hahn as Agatha Harkness casting a magic spell in the woods\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eMarvel Studios\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003e\u003cem\u003eThis article contains \u003cstrong\u003espoilers\u003c/strong\u003e for \u0026#34;Agatha All Along.\u0026#34;\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.slashfilm.com/1667525/agatha-all-along-review/\" target=\"_blank\"\u003eJac Schaeffer\u0026#39;s 2024 TV series \u0026#34;Agatha All Along\u0026#34;\u003c/a\u003e stars Kathryn Hahn as Agatha Harkness, a wicked sorceress who serves as a nemesis to the Scarlet Witch. The show is a direct spinoff of 2021\u0026#39;s \u0026#34;WandaVision,\u0026#34; where the character was first introduced. The new series saw Agatha forming a new coven of witches so that they along with her new teenage sidekick Teen (Joe Locke) could face the trials of the Witches\u0026#39; Road, a mysterious process that grants its survivors any wish they want. Agatha lost her witch powers, so she very much would like to have them back. The series also featured \u003ca href=\"https://www.slashfilm.com/1696469/aubrey-plaza-marvel-lady-death-agatha-all-along-episode-7-confirmed/\" target=\"_blank\"\u003eAubrey Plaza as the Rio Vidal aka Death\u003c/a\u003e (who was Agatha\u0026#39;s ex-girlfriend), as well as living legend, Patti LuPone, Sasheer Zamata, Ali Ahn, and Debra Jo Rupp. \u003c/p\u003e\n\n\u003cp\u003eThe shows from within the Marvel Cinematic Universe have been a little frustrating to viewers, as one can never be sure if they are meant to be long-running series with new seasons on the horizon, or if they were designed to be encapsulated miniseries with a definite endpoint. Often, a Marvel show won\u0026#39;t be defined as a series or a miniseries until near the end of its first season, and even then, a curious seeker would have to look up its entry on Wikipedia just to be sure. As of this writing, \u0026#34;Ironheart,\u0026#34; \u0026#34;Echo,\u0026#34; \u0026#34;Secret Invasion,\u0026#34; \u0026#34;She-Hulk: Attorney at Law,\u0026#34; \u0026#34;Ms. Marvel,\u0026#34; \u0026#34;Moon Knight,\u0026#34; \u0026#34;The Falcon and the Winter Soldier,\u0026#34; and \u0026#34;WandaVision\u0026#34; are described as miniseries. Only \u0026#34;Loki,\u0026#34; \u0026#34;What If...?,\u0026#34; and \u0026#34;Daredevil: Born Again\u0026#34; count as ongoing shows. Other upcoming shows remain up in the air. \u003c/p\u003e\n\n\u003cp\u003e\u0026#34;Agatha All Along\u0026#34; was also declared a miniseries, implying that no \u0026#34;second season\u0026#34; will ever be nigh. This wasn\u0026#39;t a \u0026#34;season one.\u0026#34; This was a nine-episode TV special. The miniseries was, however, well-received. \u0026#34;Agatha All Along\u0026#34; received generally positive reviews, with many responding cheerfully to the show\u0026#39;s flippant humor and queerness. Some have even posited that the good reviews might lead to a new season or a miniseries sequel. \u003c/p\u003e\n\u003cp\u003eSo far, however, a follow-up \u0026#34;Agatha\u0026#34; series remains in the realm of conjecture. \u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \u003ch2\u003eWhy hasn\u0026#39;t an announcement for a follow-up to \u0026#39;Agatha All Along\u0026#39; happened?\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1714160/agatha-all-along-season-2-marvel-updates/\" data-post-title=\"Marvel\u0026#39;s Agatha All Along Season 2 – Will It Ever Happen?\" data-slide-num=\"1\" data-post-id=\"1714160\"\u003e\n                                             \u003cpicture id=\"p5f2a930e6e17f6d2848e8516fb538e86\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/marvels-agatha-all-along-season-2-will-it-ever-happen/why-hasnt-an-announcement-for-a-follow-up-to-agatha-all-along-happened-1731629359.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/marvels-agatha-all-along-season-2-will-it-ever-happen/why-hasnt-an-announcement-for-a-follow-up-to-agatha-all-along-happened-1731629359.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/marvels-agatha-all-along-season-2-will-it-ever-happen/why-hasnt-an-announcement-for-a-follow-up-to-agatha-all-along-happened-1731629359.jpg\" data-slide-url=\"https://www.slashfilm.com/1714160/agatha-all-along-season-2-marvel-updates/\" data-post-id=\"1714160\" data-slide-num=\"1\" data-slide-title=\"Marvel\u0026#39;s Agatha All Along Season 2 – Will It Ever Happen?: Why hasn\u0026#39;t an announcement for a follow-up to \u0026#39;Agatha All Along\u0026#39; happened?\" width=\"780\" height=\"438\" alt=\"Agatha and her coven in a misty wood.\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eMarvel Studios\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eThe ratings for \u0026#34;Agatha All Along\u0026#34; were very high. Various rating reports stated that it was the highest-rated show on Disney+ when it was being released, and that social media engagement was high. It was also, unlike some other Marvel shows, popular all the way through, \u003ca href=\"https://www.cbr.com/agatha-all-along-least-expensive-mcu-show-by-design-brad-winderbaum/\" target=\"_blank\"\u003eretaining the greatest number of viewers\u003c/a\u003e from the start. Everyone\u0026#39;s social media feed is different, of course, so it\u0026#39;s hard to accept a show has high social engagement if you don\u0026#39;t personally see people talking about it, but the numbers were indeed there. \u003c/p\u003e\n\n\u003cp\u003eCritics also like \u0026#34;Agatha All Along,\u0026#34; and the show received an 83% approval rating on Rotten Tomatoes based on 207 reviews. That\u0026#39;s a similar approval as \u0026#34;The Falcon and the Winter Soldier\u0026#34; and the original 1992 \u0026#34;X-Men\u0026#34; animated series. It\u0026#39;s also a sight better than shows like \u0026#34;Iron Fist,\u0026#34; \u0026#34;Secret Invasion,\u0026#34; and \u003ca href=\"https://www.slashfilm.com/552720/inhumans-featurette/\" target=\"_blank\"\u003e\u0026#34;Inhumans,\u0026#34; which were all panned\u003c/a\u003e. \u003c/p\u003e\n\u003cp\u003eIt\u0026#39;s difficult to say what numbers Marvel executives need to greenlight second seasons, or what kind of abstract qualities a show must possess in order to be worthy of a follow-up, but whatever those are, \u0026#34;Agatha All Along\u0026#34; must not have it. The only hint audiences might have for a follow-up series is that the show\u0026#39;s makers submitted \u0026#34;Agatha All Along\u0026#34; to various awards bodies as a \u0026#34;series\u0026#34; and not a \u0026#34;limited series.\u0026#34; The former term implies that the door is open for more, but it might be related to the fact this is a spin-off directly connected to \u0026#34;WandaVision\u0026#34; which makes the definition of \u0026#34;limited series\u0026#34; a bit messier.\u003c/p\u003e\n\n\u003cp\u003eWithout any announcement, though, that\u0026#39;s all anyone has to go on. \u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \u003ch2\u003eWhat has Brad Winderbaum said about a follow-up to \u0026#39;Agatha All Along?\u0026#39;\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1714160/agatha-all-along-season-2-marvel-updates/\" data-post-title=\"Marvel\u0026#39;s Agatha All Along Season 2 – Will It Ever Happen?\" data-slide-num=\"2\" data-post-id=\"1714160\"\u003e\n                                             \u003cpicture id=\"pc4423a1bdfdb029cde24ce499b48cd2c\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/marvels-agatha-all-along-season-2-will-it-ever-happen/what-has-brad-winderbaum-said-about-a-follow-up-to-agatha-all-along-1731629359.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/marvels-agatha-all-along-season-2-will-it-ever-happen/what-has-brad-winderbaum-said-about-a-follow-up-to-agatha-all-along-1731629359.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/marvels-agatha-all-along-season-2-will-it-ever-happen/what-has-brad-winderbaum-said-about-a-follow-up-to-agatha-all-along-1731629359.jpg\" data-slide-url=\"https://www.slashfilm.com/1714160/agatha-all-along-season-2-marvel-updates/\" data-post-id=\"1714160\" data-slide-num=\"2\" data-slide-title=\"Marvel\u0026#39;s Agatha All Along Season 2 – Will It Ever Happen?: What has Brad Winderbaum said about a follow-up to \u0026#39;Agatha All Along?\u0026#39;\" width=\"780\" height=\"438\" alt=\"Agatha Harkness in her witch\u0026#39;s robes, outdoors in the suburbs.\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eMarvel Studios\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eThe head of streaming for Marvel Studios, a man named Brad Winderbaum, \u003ca href=\"https://x.com/ScarletWitchUpd/status/1855428102391730240\" target=\"_blank\"\u003enoted on Twitter/X\u003c/a\u003e that he would indeed be interested in a second go-round for \u0026#34;Agatha All Along,\u0026#34; saying that \u0026#34;I think we all want to see more adventures in Westview,\u0026#34; the town where \u0026#34;Agatha\u0026#34; takes place. Although he is in charge of streaming, it\u0026#39;s not his job to greenlight new shows, so his statement was more an expression of interest than any kind of official statement. \u003c/p\u003e\n\n\u003cp\u003eSpeculations have begun to rise, of course, positing that some of the show\u0026#39;s supporting characters may turn up in future Marvel projects. Sadly, no one\u0026#39;s contracts have been revealed, and no press releases have been given. Audiences are currently in the \u0026#34;what if\u0026#34; phase, allowing them to invent exciting new shows in their head.\u003c/p\u003e\n\u003cp\u003eAlthough the Marvel Cinematic Universe is still planning on many films and TV shows for its future, there\u0026#39;s a general sense that the party is over. Superhero movies are, in general, bombing more often than hitting, and the conversation isn\u0026#39;t being led by the genre as much as it was about four or five years ago. Indeed, ever since \u0026#34;Avengers: Endgame,\u0026#34; more and more MCU movies have been tanking \u003ca href=\"https://www.slashfilm.com/1657286/mcu-movies-after-endgame-ranked-rotten-tomatoes/\" target=\"_blank\"\u003eor merely getting bad reviews\u003c/a\u003e. The massive success of \u0026#34;Deadpool \u0026amp; Wolverine\u0026#34; is now the exception, not the rule. In such an environment, releasing \u0026#34;Agatha All Along\u0026#34; was a risk to begin with. The fact that it was mildly successful and relatively well-reviewed was a \u0026#34;thank our lucky stars\u0026#34; moment, and not a \u0026#34;we need this to continue\u0026#34; moment. \u003c/p\u003e\n\n\u003cp\u003eThe atmosphere in general suggests that there will be no more Agatha, unless she appears in a different MCU project.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-11-15T00:21:51Z",
  "modifiedTime": "2024-11-15T00:21:51Z"
}
