{
  "id": "4b668a55-9c16-4630-ac3a-a5c07294abb8",
  "title": "Thunderbolts*: Yelena Is \"A Completely Different Person\"",
  "link": "https://bleedingcool.com/movies/thunderbolts-yelena-is-a-completely-different-person/",
  "description": "Florence Pugh says that Yelena is a \"completely different person\" in Thunderbolts* because \"she's coming out of a few years of quite traumatic events.\"",
  "author": "Kaitlyn Booth",
  "published": "Tue, 11 Feb 2025 15:21:06 -0600",
  "source": "https://www.bleedingcool.com/movies/feed/",
  "categories": [
    "Marvel Studios",
    "Movies",
    "florench pugh",
    "thunderbolts"
  ],
  "byline": "Kaitlyn Booth",
  "length": 4075,
  "excerpt": "Now that Captain America: Brave New World is right around the corner, we're starting to learn more about Thunderbolts*. We got a new trailer during the Super Bowl and now some more previews and interviews are starting to drop that are giving us a better idea of what kind of movie we're in for. This movie is walking […]",
  "siteName": "Bleeding Cool News",
  "favicon": "",
  "text": "Posted in: Marvel Studios, Movies | Tagged: florench pugh, thunderboltsFlorence Pugh says that Yelena is a \"completely different person\" in Thunderbolts* because \"she's coming out of a few years of quite traumatic events.\"Article Summary Florence Pugh reveals Yelena's transformation due to major life changes in Thunderbolts*. Thunderbolts* offers more screen time to underutilized Marvel characters in a new light. Wyatt Russell discuss improvements in his character's costume design. The film promises an exciting antihero ensemble, releasing May 2, 2025. Now that Captain America: Brave New World is right around the corner, we're starting to learn more about Thunderbolts*. We got a new trailer during the Super Bowl and now some more previews and interviews are starting to drop that are giving us a better idea of what kind of movie we're in for. This movie is walking a different line from other films where it is taking characters [aside from Bucky] who have made sometimes multiple appearances but haven't had a ton of screentime and giving them the spotlight. So we're going to be learning more about these people as they are put in new situation. Yelena went through the wringer in Black Widow and we found out in Hawkeye that she was part of the Snap and finding out that she lost Natasha again was traumatic to say the least. Florence Pugh spoke to Empire and explained, \"She's a completely different person to the person that you'd assume she would be. She's coming out of a few years of quite traumatic events. Where does that leave a person?\" We're guessing as a bit of a mess. There are some things from comic books that don't translate as well to live-action and it might be time to accept that. In this case, it feels like half of the helmets we see people wearing look awkward or weird as hell and double so if they are a cowel where we can see half of their face. Anthony Mackie was so displeased by his look in The Falcon and the Winter Soldier that he insisted on a change for the new movie and he wasnn't the only one unhappy with their look from that show. Wyatt Russell also revealed that he wasn't exactly thrilled with the his look in the show, saying, \"I'm gonna be honest, I don't think I looked very cool.\" Things are different because in Thunderbolts* \"they made my helmet not look like the end of a penis.\" That's certainly an improvement. In general, Wyatt thinks the entire team looks \"fucking cool.\" Just make sure you all nail that superhero landing, that's half the job. Thunderbolts*: Summary, Cast List, Release Date In  Thunderbolts*,  Marvel Studios assembles an unconventional team of antiheroes — Yelena Belova, Bucky Barnes, Red Guardian, Ghost, Taskmaster and John Walker. After finding themselves ensnared in a death trap set by Valentina Allegra de Fontaine, these disillusioned castoffs must embark on a dangerous mission that will force them to confront the darkest corners of their pasts. Will this dysfunctional group tear themselves apart or find redemption and unite as something much more before it's too late? Returning to their Marvel Cinematic Universe roles are Florence Pugh, Sebastian Stan, David Harbour, Wyatt Russell, Olga Kurylenko, Hannah John-Kamen, and Julia Louis-Dreyfus. The cast also includes newcomers to the MCU—Lewis Pullman, Geraldine Viswanathan, Chris Bauer, and Wendell Edward Pierce. Jake Schreier directs Thunderbolts* with Kevin Feige producing. Louis D'Esposito, Brian Chapek, and Jason Tamez serve as executive producers. Marvel Studios' Thunderbolts* opens in U.S. theaters on May 2, 2025. Enjoyed this? Please share on social media! Stay up-to-date and support the site by following Bleeding Cool on Google News today! About Kaitlyn BoothKaitlyn is the Editor-in-Chief at Bleeding Cool. Film critic and pop culture writer since 2013. Ace. Leftist. Nerd. Feminist. Writer. Replicant Translator. Cinephillic Virtue Signaler. She/Her. UFCA/GALECA Member. 🍅 Approved. Follow her Threads, Instagram, and Twitter @katiesmovies.",
  "image": "https://bleedingcool.com/wp-content/uploads/2025/02/YAV1100_comp_FRM_v0105.1020_R-2000x1125.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"wrapper\"\u003e\u003carticle id=\"article\" data-post-id=\"2164711\" itemscope=\"\" itemtype=\"http://schema.org/Article\"\u003e\u003cp\u003ePosted in: \u003ca href=\"https://bleedingcool.com/movies/marvel-studios/\" rel=\"category\"\u003eMarvel Studios\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/movies/\" rel=\"category\"\u003eMovies\u003c/a\u003e | Tagged: \u003ca href=\"https://bleedingcool.com/tag/florench-pugh/\" rel=\"tag\"\u003eflorench pugh\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/thunderbolts/\" rel=\"tag\"\u003ethunderbolts\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\u003cp\u003eFlorence Pugh says that Yelena is a \u0026#34;completely different person\u0026#34; in Thunderbolts* because \u0026#34;she\u0026#39;s coming out of a few years of quite traumatic events.\u0026#34;\u003c/p\u003e\u003chr/\u003e\u003chr/\u003e\u003cdiv id=\"post_summary\"\u003e\u003ch2\u003eArticle Summary\u003c/h2\u003e\u003cul\u003e\n\u003cli\u003eFlorence Pugh reveals Yelena\u0026#39;s transformation due to major life changes in Thunderbolts*.\u003c/li\u003e\n\u003cli\u003eThunderbolts* offers more screen time to underutilized Marvel characters in a new light.\u003c/li\u003e\n\u003cli\u003eWyatt Russell discuss improvements in his character\u0026#39;s costume design.\u003c/li\u003e\n\u003cli\u003eThe film promises an exciting antihero ensemble, releasing May 2, 2025.\u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003chr/\u003e\u003cp\u003e\u003ciframe width=\"1170\" height=\"658\" srcdoc=\"\u0026lt;style\u0026gt;*{padding:0;margin:0;overflow:hidden}html,body{height:100%}img,span{position:absolute;width:100%;top:0;bottom:0;margin:auto}span{height:1.5em;text-align:center;font:48px/1.5 sans-serif;color:white;text-shadow:0 0 0.5em black}\u0026lt;/style\u0026gt;\u0026lt;a href=https://www.youtube.com/embed/hUUszE29jS0?feature=oembed?autoplay=1\u0026gt;\u0026lt;img src=https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://img.youtube.com/vi/hUUszE29jS0/hqdefault.jpg loading=\u0026#34;lazy\u0026#34; alt=\u0026#34;Link to play video.\u0026#34;\u0026gt;\u0026lt;span\u0026gt;▶\u0026lt;/span\u0026gt;\u0026lt;/a\u0026gt;\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture; fullscreen;\" loading=\"lazy\" src=\"https://www.youtube.com/embed/hUUszE29jS0?feature=oembed\" title=\"Youtube Video\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003cp\u003eNow that \u003cem\u003eCaptain America: Brave New World\u003c/em\u003e is right around the corner, we\u0026#39;re starting to learn more about \u003cem\u003eThunderbolts*. \u003c/em\u003eWe got a new trailer during the Super Bowl and now some more previews and interviews are starting to drop that are giving us a better idea of what kind of movie we\u0026#39;re in for. This movie is walking a different line from other films where it is taking characters [aside from Bucky] who have made sometimes multiple appearances but haven\u0026#39;t had a ton of screentime and giving them the spotlight. So we\u0026#39;re going to be learning more about these people as they are put in new situation.\u003c/p\u003e\n\u003cp\u003eYelena went through the wringer in \u003cem\u003eBlack Widow\u003c/em\u003e and we found out in \u003cem\u003eHawkeye\u003c/em\u003e that she was part of the Snap and finding out that she lost Natasha again was traumatic to say the least. \u003cstrong\u003eFlorence Pugh\u003c/strong\u003e spoke to \u003ca href=\"https://www.empireonline.com/movies/news/yelena-belova-thunderbolts-completely-different-person-marvel-florence-pugh-exclusive/\"\u003eEmpire\u003c/a\u003e and explained, \u0026#34;She\u0026#39;s a completely different person to the person that you\u0026#39;d assume she would be. She\u0026#39;s coming out of a few years of quite traumatic events. Where does that leave a person?\u0026#34; We\u0026#39;re guessing as a bit of a mess.\u003c/p\u003e\n\u003cp\u003eThere are some things from comic books that don\u0026#39;t translate as well to live-action and it might be time to accept that. In this case, it feels like half of the helmets we see people wearing look awkward or weird as hell and double so if they are a cowel where we can see half of their face. \u003cstrong\u003eAnthony Mackie\u003c/strong\u003e was so displeased by his look in \u003cem\u003eThe Falcon and the Winter Soldier\u003c/em\u003e that \u003ca href=\"https://x.com/IGN/status/1887970294561734811\"\u003ehe insisted on a change\u003c/a\u003e for the new movie and he wasnn\u0026#39;t the only one unhappy with their look from that show.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWyatt Russell \u003c/strong\u003e also revealed that he wasn\u0026#39;t exactly thrilled with the his look in the show, saying, \u0026#34;I\u0026#39;m gonna be honest, I don\u0026#39;t think I looked very cool.\u0026#34; Things are different because in \u003cem\u003eThunderbolts* \u003c/em\u003e\u0026#34;they made my helmet not look like the end of a penis.\u0026#34; That\u0026#39;s certainly an improvement. In general, Wyatt thinks the entire team looks \u0026#34;fucking cool.\u0026#34; Just make sure you all nail that superhero landing, that\u0026#39;s half the job.\u003c/p\u003e\n\n\t\t\n\t\t\n\n\u003ch2\u003e\u003cem\u003eThunderbolts*\u003c/em\u003e: Summary, Cast List, Release Date\u003c/h2\u003e\n\u003cp\u003eIn  \u003cem\u003eThunderbolts*,\u003c/em\u003e  Marvel Studios assembles an unconventional team of antiheroes — Yelena Belova, Bucky Barnes, Red Guardian, Ghost, Taskmaster and John Walker. After finding themselves ensnared in a death trap set by Valentina Allegra de Fontaine, these disillusioned castoffs must embark on a dangerous mission that will force them to confront the darkest corners of their pasts. Will this dysfunctional group tear themselves apart or find redemption and unite as something much more before it\u0026#39;s too late?\u003c/p\u003e\n\u003cp\u003eReturning to their Marvel Cinematic Universe roles are \u003cstrong\u003eFlorence Pugh, Sebastian Stan, David Harbour, Wyatt Russell, Olga Kurylenko, Hannah John-Kamen, \u003c/strong\u003eand \u003cstrong\u003eJulia Louis-Dreyfus\u003c/strong\u003e. The cast also includes newcomers to the MCU—\u003cstrong\u003eLewis Pullman, Geraldine Viswanathan, Chris Bauer, \u003c/strong\u003eand \u003cstrong\u003eWendell Edward Pierce\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eJake Schreier directs \u003cem\u003eThunderbolts* \u003c/em\u003ewith \u003cstrong\u003eKevin Feige\u003c/strong\u003e producing. \u003cstrong\u003eLouis D\u0026#39;Esposito, Brian Chapek, \u003c/strong\u003eand \u003cstrong\u003eJason Tamez\u003c/strong\u003e serve as executive producers.\u003c/p\u003e\n\u003cp\u003eMarvel Studios\u0026#39; \u003cem\u003eThunderbolts*\u003c/em\u003e opens in U.S. theaters on May 2, 2025.\u003c/p\u003e\n\u003chr/\u003e\u003cdiv id=\"bc_sharing_is_caring\"\u003e\u003ccenter\u003e\u003cp\u003e\u003cstrong\u003eEnjoyed this? Please share on social media!\u003c/strong\u003e\u003c/p\u003e\u003ca href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fthunderbolts-yelena-is-a-completely-different-person%2F\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://twitter.com/share?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fthunderbolts-yelena-is-a-completely-different-person%2F\u0026amp;text=Thunderbolts%2A%3A+Yelena+Is+%22A+Completely+Different+Person%22\u0026amp;via=bleedingcool\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"http://pinterest.com/pin/create/button/?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fthunderbolts-yelena-is-a-completely-different-person%2F\u0026amp;description=Thunderbolts%2A%3A+Yelena+Is+%22A+Completely+Different+Person%22\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://reddit.com/submit?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fthunderbolts-yelena-is-a-completely-different-person%2F\u0026amp;title=Thunderbolts%2A%3A+Yelena+Is+%22A+Completely+Different+Person%22\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003c/center\u003e\u003c/div\u003e\n    \u003ca id=\"google_follow\" href=\"https://news.google.com/publications/CAAqBwgKMPHflgsw1IauAw?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n        \u003cp\u003e\u003cimg width=\"100\" height=\"81\u0026#34;\" src=\"https://bleedingcool.com/Google_News_icon.png\"/\u003e\n        \u003c/p\u003e\n        \u003cp\u003e\n            Stay up-to-date and support the site by following Bleeding Cool on Google News today!\n        \u003c/p\u003e\n    \u003c/a\u003e\u003c/article\u003e\u003csection\u003e\u003ch2\u003e\u003cimg data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:150/h:150/q:75/https://www.gravatar.com/avatar/c6bcaa58a7b5119a6d358a10f6547af6?s=150\" src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20150%20150%22%20width%3D%22150%22%20height%3D%22150%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\" width=\"150px\" height=\"150px\" alt=\"Kaitlyn Booth\"/\u003eAbout \u003ca href=\"https://bleedingcool.com/author/kbooth/\"\u003eKaitlyn Booth\u003c/a\u003e\u003c/h2\u003eKaitlyn is the Editor-in-Chief at Bleeding Cool. Film critic and pop culture writer since 2013. Ace. Leftist. Nerd. Feminist. Writer. Replicant Translator. Cinephillic Virtue Signaler. She/Her. UFCA/GALECA Member. 🍅 Approved. Follow her Threads, Instagram, and Twitter @katiesmovies.\u003c/section\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-02-11T15:21:06-06:00",
  "modifiedTime": "2025-02-11T15:21:06-06:00"
}
