{
  "id": "4efa285c-8880-4c4f-b89d-e628c683a7d6",
  "title": "One Of Hollywood's Best Train Movies Has 100% On Rotten Tomatoes",
  "link": "https://www.slashfilm.com/1758647/best-train-movies-perfect-rotten-tomatoes-score-the-narrow-margin/",
  "description": "One of Hollywood's best train movies ever was shot over the course of just 13 days and managed to get a 100% rating on Rotten Tomatoes.",
  "author": "Ben Pearson",
  "published": "Thu, 06 Feb 2025 22:00:06 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Podcast",
    "Action \u0026 Adventure Movies",
    "Thriller Movies"
  ],
  "byline": "Ben Pearson",
  "length": 4058,
  "excerpt": "One of Hollywood's best train movies ever was shot over the course of just 13 days and managed to get a 100% rating on Rotten Tomatoes.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slash-film-favicon-448x448.png",
  "text": "RKO I'm far from the first person to point out that trains are inherently cinematic. There's built-in narrative momentum to any story that takes place on a train: A giant vehicle is in motion, zooming from one location to another, and unlike planes, A) a train travels close enough to the ground that people can jump or be thrown off (a huge plot point in Steve McQueen's recent \"Blitz\"), and B) there's still just enough room for dozens of passengers to get up, walk around, interact, and even brawl if the situation calls for it. (Thankfully, there are plenty of action movies where the situation does indeed call for it, like Sam Raimi's \"Spider-Man 2.\") Video essayist Patrick H. Willems has a great recent video about this that I recommend checking out, but today, I want to talk about one particular train movie — one of the best I've ever seen. The film, which came out in 1952, is called \"The Narrow Margin.\" Here's the premise: A couple of cops are tasked with accompanying a murdered gangster's widow on a cross-country train ride so she can testify against the gang, but the mobsters have sent assassins out to kill her before she can bring the whole organization down. Most of the movie — which is only 71 minutes long, by the way — takes place on a train, with the primary cop (played by Charles McGraw) begrudgingly protecting the sassy moll (played by Marie Windsor) from the hit men who are determined to end her life. Sounds awesome, right? It is — and I'm not the only one who thinks so. The Narrow Margin has a 100% rating on Rotten Tomatoes Rotten Tomatoes doesn't list many reviews from the era (most are from this century, looking back on the movie), so its 100% rating is admittedly not as impressive as a movie with 100-plus reviews. But \"The Narrow Margin\" did have one big-name defender: Francois Truffaut, a film critic who eventually became one of the key directors behind the French New Wave. In his essay \"From A to Z,\" which analyzes \"South Sea Sinner\" and \"The Narrow Margin,\" he writes that the latter \"is charged with very moral nitroglycerine but confers a grace that any sweaty driver of a heavy, slow-moving vehicle might envy.\" But more modern critics obviously appreciate the film, too: In fact, it ended up on /Film's list of underrated film noir movies just a few years ago. This is the type of film I love to recommend to people who are curious about older movies, but aren't sure where to start. Sure, it's important to check out the classics, but movies like this one — incredibly well-constructed thrillers without a hint of aspiration beyond their means — are what's kept this industry running for over a hundred years. There's something special about a simple B-movie with a humble budget executed to perfection, with characters who make smart decisions trying to out-wit each other and survive in tight quarters with a metaphorical ticking clock counting down the whole time. (The whole film was shot in just 13 days.) And without giving anything away, there ends up being a little more to \"The Narrow Margin\" than initially meets the eye, which makes it even more satisfying than a straightforward version of this story might've been. I know there are hundreds of memorable train-centric films, many of them big and flashy, but this unassuming little thriller is one of the very best Hollywood ever produced. I spoke a little about the film on today's episode of the /Film Daily podcast, which you can listen to below: You can subscribe to /Film Daily on Apple Podcasts, Overcast, Spotify, or wherever you get your podcasts, and send your feedback, questions, comments, concerns, and mailbag topics to us at bpearson@slashfilm.com. Please leave your name and general geographic location in case we mention your e-mail on the air.",
  "image": "https://www.slashfilm.com/img/gallery/one-of-hollywoods-best-train-movies-has-100-on-rotten-tomatoes/l-intro-1736545256.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n    \n                \u003cdiv\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1758647/best-train-movies-perfect-rotten-tomatoes-score-the-narrow-margin/\" data-post-title=\"One of Hollywood\u0026#39;s Best Train Movies Has 100% on Rotten Tomatoes\" data-slide-num=\"0\" data-post-id=\"1758647\"\u003e\n                                             \u003cpicture id=\"p41db566382c93941a2cfb64a9adc5970\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/one-of-hollywoods-best-train-movies-has-100-on-rotten-tomatoes/intro-1736545256.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/one-of-hollywoods-best-train-movies-has-100-on-rotten-tomatoes/intro-1736545256.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/one-of-hollywoods-best-train-movies-has-100-on-rotten-tomatoes/intro-1736545256.jpg\" data-slide-url=\"https://www.slashfilm.com/1758647/best-train-movies-perfect-rotten-tomatoes-score-the-narrow-margin/\" data-post-id=\"1758647\" data-slide-num=\"0\" data-slide-title=\"One of Hollywood\u0026#39;s Best Train Movies Has 100% on Rotten Tomatoes: \" width=\"780\" height=\"438\" alt=\"Detective Sgt. Brown and Sam Jennings look at a watch on board a train in The Narrow Margin\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eRKO\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eI\u0026#39;m far from the first person to point out that trains are inherently cinematic. There\u0026#39;s built-in narrative momentum to any story that takes place on a train: A giant vehicle is in motion, zooming from one location to another, and unlike planes, A) a train travels close enough to the ground that people can jump or be thrown off (a huge plot point in Steve McQueen\u0026#39;s recent \u0026#34;Blitz\u0026#34;), and B) there\u0026#39;s still \u003cem\u003ejust\u003c/em\u003e enough room for dozens of passengers to get up, walk around, interact, and even brawl if the situation calls for it. (Thankfully, there are plenty of action movies where the situation does indeed call for it, like \u003ca href=\"https://www.slashfilm.com/1550686/spider-man-2-train-scene-oral-history-marvel-sam-raimi/\" target=\"_blank\"\u003eSam Raimi\u0026#39;s \u0026#34;Spider-Man 2.\u0026#34;\u003c/a\u003e) Video essayist Patrick H. Willems has \u003ca href=\"https://www.youtube.com/watch?v=rjcx295mI2c\" target=\"_blank\"\u003ea great recent video about this\u003c/a\u003e that I recommend checking out, but today, I want to talk about one particular train movie — one of the best I\u0026#39;ve ever seen.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eThe film, which came out in 1952, is called \u0026#34;The Narrow Margin.\u0026#34; Here\u0026#39;s the premise: A couple of cops are tasked with accompanying a murdered gangster\u0026#39;s widow on a cross-country train ride so she can testify against the gang, but the mobsters have sent assassins out to kill her before she can bring the whole organization down. Most of the movie — which is only 71 minutes long, by the way — takes place on a train, with the primary cop (played by Charles McGraw) begrudgingly protecting the sassy moll (played by Marie Windsor) from the hit men who are determined to end her life. Sounds awesome, right? It is — and I\u0026#39;m not the only one who thinks so.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eThe Narrow Margin has a 100% rating on Rotten Tomatoes\u003c/h2\u003e\n                                \u003cp data-post-url=\"https://www.slashfilm.com/1758647/best-train-movies-perfect-rotten-tomatoes-score-the-narrow-margin/\" data-post-title=\"One of Hollywood\u0026#39;s Best Train Movies Has 100% on Rotten Tomatoes\" data-slide-num=\"1\" data-post-id=\"1758647\"\u003e\n                                         \u003ciframe src=\"https://www.youtube.com/embed/OZtFTnm8GnY?v=OZtFTnm8GnY\" frameborder=\"0\" allowfullscreen=\"\" data-slide-url=\"https://www.slashfilm.com/1758647/best-train-movies-perfect-rotten-tomatoes-score-the-narrow-margin/\" data-slide-num=\"1\" data-post-id=\"1758647\" data-slide-title=\"One of Hollywood\u0026#39;s Best Train Movies Has 100% on Rotten Tomatoes: The Narrow Margin has a 100% rating on Rotten Tomatoes\"\u003e\u003c/iframe\u003e\n                    \u003c/p\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003e\u003ca href=\"https://www.rottentomatoes.com/m/10004890-narrow_margin\" target=\"_blank\"\u003eRotten Tomatoes\u003c/a\u003e doesn\u0026#39;t list many reviews from the era (most are from this century, looking back on the movie), so its 100% rating is admittedly not as impressive as a movie with 100-plus reviews. But \u0026#34;The Narrow Margin\u0026#34; did have one big-name defender: Francois Truffaut, a film critic who eventually became one of the key directors behind the French New Wave. In \u003ca href=\"https://archive.org/details/earlyfilmcritici00truf/page/16/mode/2up\" target=\"_blank\"\u003ehis essay \u0026#34;From A to Z,\u0026#34;\u003c/a\u003e which analyzes \u0026#34;South Sea Sinner\u0026#34; and \u0026#34;The Narrow Margin,\u0026#34; he writes that the latter \u0026#34;is charged with very moral nitroglycerine but confers a grace that any sweaty driver of a heavy, slow-moving vehicle might envy.\u0026#34; But more modern critics obviously appreciate the film, too: In fact, it ended up on \u003ca href=\"https://www.slashfilm.com/702437/underrated-film-noirs/\" target=\"_blank\"\u003e/Film\u0026#39;s list of underrated film noir movies\u003c/a\u003e just a few years ago.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eThis is the type of film I love to recommend to people who are curious about older movies, but aren\u0026#39;t sure where to start. Sure, it\u0026#39;s important to check out the classics, but movies like this one — incredibly well-constructed thrillers without a hint of aspiration beyond their means — are what\u0026#39;s kept this industry running for over a hundred years. There\u0026#39;s something special about a simple B-movie with a humble budget executed to perfection, with characters who make smart decisions trying to out-wit each other and survive in tight quarters with a metaphorical ticking clock counting down the whole time. (The whole film was shot in just 13 days.) And without giving anything away, there ends up being a little more to \u0026#34;The Narrow Margin\u0026#34; than initially meets the eye, which makes it even more satisfying than a straightforward version of this story might\u0026#39;ve been. I know there are hundreds of \u003ca href=\"https://www.slashfilm.com/1177518/how-the-mission-impossible-team-pulled-off-the-films-climactic-train-scene/\" target=\"_blank\"\u003ememorable train-centric films\u003c/a\u003e, many of them big and flashy, but this unassuming little thriller is one of the very best Hollywood ever produced.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eI spoke a little about the film on today\u0026#39;s episode of the /Film Daily podcast, which you can listen to below:\u003c/p\u003e\n\n\n\u003cp dir=\"ltr\"\u003eYou can subscribe to /Film Daily on \u003ca href=\"https://itunes.apple.com/us/podcast/film-daily/id1254073246?mt=2\" target=\"_blank\"\u003eApple Podcasts\u003c/a\u003e, \u003ca href=\"https://overcast.fm/itunes1254073246/film-daily\" target=\"_blank\"\u003eOvercast\u003c/a\u003e, \u003ca href=\"https://u922627.ct.sendgrid.net/wf/click?upn=TvhtDiauxJVhRdbUMx2NHL6ODzLmx4MtfKCdFx-2FSGFQNyT19gu7suETHskKPLeObN63kZLIJaqHCutUuD2JSOw-3D-3D_Mf-2FCkfRivOmMK7O7F0Y-2FexQfRdP6nJdv0CvMHIllgbkxYonk7OFRtOKgc2RI2FTZjosX7Gy5-2F0LZYTCm1KUveJQurOXZQv5Dj2WhJrhmTrs0v3SJiEiBpyb-2F1L8jvr-2B-2BkxkiGeoPD1UieLppbdRBRhz-2BVOyI6R94uU85wuTnw695jKUkbDYkfDzQF2AmxCxzLBCpnE6CnunSfOnUc5T4w6Rt0VfqnTdL8n5IRPTbqCQRp1Xk2jliYNZ7ZDeIS9PTLnYnsWPYrfKEGJy8pKEuEg-3D-3D\" target=\"_blank\"\u003eSpotify\u003c/a\u003e, or wherever you get your podcasts, and send your feedback, questions, comments, concerns, and mailbag topics to us at bpearson@slashfilm.com. Please leave your name and general geographic location in case we mention your e-mail on the air.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-02-06T22:00:06Z",
  "modifiedTime": "2025-02-06T22:00:06Z"
}
