{
  "id": "51911319-181f-42cc-ba55-422d915544d7",
  "title": "The Hitcher 4K Review: Rutger Hauer Wows in Cult Classic",
  "link": "https://www.comingsoon.net/movies/reviews/1870260-the-hitcher-4k-review",
  "description": "The Hitcher — a horror thriller revolving around a murderous hitchhiker — wasn’t well received when it came out in 1986 but has found plenty of fans since then (enough for a sequel and remake decades afterward). Roger Ebert was famously not one of them, calling it “diseased and corrupt” and that it suffered from […] The post The Hitcher 4K Review: Rutger Hauer Wows in Cult Classic appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
  "author": "Tyler Treese",
  "published": "Sun, 27 Oct 2024 17:41:44 +0000",
  "source": "https://www.comingsoon.net/feed",
  "categories": [
    "Movies",
    "4K Reviews",
    "exclude_from_yahoo",
    "Movie Reviews",
    "The Hitcher"
  ],
  "byline": "Tyler Treese",
  "length": 3464,
  "excerpt": "ComingSoon's The Hitcher 4K review takes a look at the UHD release of the cult classic horror thriller starring Rutger Hauer.",
  "siteName": "ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More",
  "favicon": "https://www.comingsoon.net/wp-content/uploads/sites/3/2022/12/cs_ico_144x144.png?w=144",
  "text": "The Hitcher — a horror thriller revolving around a murderous hitchhiker — wasn’t well received when it came out in 1986 but has found plenty of fans since then (enough for a sequel and remake decades afterward). Roger Ebert was famously not one of them, calling it “diseased and corrupt” and that it suffered from a “deep sickness at the screenplay stage.” However, that deep sickness is exactly why the film rules, at least nearly 40 years later, and why The Hitcher 4K is worth picking up. “In this 1986 cult classic, director Robert Harmon thrills the viewer with the story of young Jim Halsey (C. Thomas Howell), who stops on the highway to pick up a hitchhiker, not knowing that by doing so, he opens the door to terrible evil. The mysterious hitcher, unforgettably portrayed by Rutger Hauer, is a relentless slaughterer, preying on those who invite him into their lives. Somewhat dismissed at the time of its original release, The Hitcher developed a rabid fan following in the ensuing years, now properly recognized as one of the most memorable and terrifying thrillers of the 1980s,” says the official description for The Hitcher 4K. The premise for The Hitcher is a simple one and based on a very believable fear. What if you pick up a hitchhiker, but he’s actually a murderer? It’s a solid start, but after the main character kicks the hitchhiker out of his car after the first 25 minutes of the movie, it should be over, right? Not at all. Instead, The Hitcher gives its villain almost supernatural abilities to keep popping back up as he toys with the main character, causing mass amounts of havoc along the way. It’s over-the-top and ridiculous, but in a thrill-ride way that makes it a total joy to watch. The Hitcher 4K looks a ton better than how the movie is currently streaming on Max (in poor quality and a 4:3 perspective). The finer quality really helps you appreciate the performances, as well, which is the element that makes the film really stand out from a lot of typical genre fare. While the handsome and baby-faced C. Thomas Howell is the film’s protagonist, who is likable despite making 50 dumb decisions that keep the story going; it’s really a showcase for Rutger Hauer. The Dutch actor is incredible as the serial killer villain and is immediately off-putting and unnerving as he makes any conversation tense. It’s a lot of small details in the performance, such as subtle gestures and movements, that really make him a stellar horror villain that will make you second-guess any hitchhiker you see in the future. There’s a lot to unpack about The Hitcher, including a gruesome scene with Jennifer Jason Leigh, which is why I was glad to see The Hitcher 4K come with a lot of meaningful special features. Not only is there a full commentary track by director Robert Harmon and writer Eric Red, but there’s also a 41-minute video interview with Harmon as well. It’s great hearing stories from the production, and it gives you a lot more context as to why this film has been able to find an audience over the years. The Hitcher 4K Review: Final Verdict The Hitcher 4K is a great home release, one that is leagues above the version of the film that is currently on streaming. With meaningful bonus features that give extra insight into how the film was made, it’s an easy recommendation for horror fans. Disclosure: ComingSoon received the product from the distributor for our The Hitcher 4K review.",
  "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2024/10/The-Hitcher-4k-review.jpg?resize=1200,630",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eThe Hitcher — a horror thriller revolving around a murderous hitchhiker — wasn’t well received when it came out in 1986 but has found plenty of fans since then (enough for a sequel and \u003ca href=\"https://www.comingsoon.net/movies/features/989545-10-horror-remakes-that-should-never-have-happened\"\u003eremake\u003c/a\u003e decades afterward). Roger Ebert was famously not one of them, calling it “diseased and corrupt” and that it suffered from a “deep sickness at the screenplay stage.” However, that deep sickness is exactly why \u003ca href=\"https://www.comingsoon.net/guides/news/1469664-the-hitcher-1986-streaming-watch-stream-online-via-hbo-max\"\u003ethe film\u003c/a\u003e rules, at least nearly 40 years later, and why The Hitcher 4K is worth picking up.\u003c/p\u003e\n\n\n\n\u003cp\u003e“In this 1986 cult classic, director Robert Harmon thrills the viewer with the story of young Jim Halsey (C. Thomas Howell), who stops on the highway to pick up a hitchhiker, not knowing that by doing so, he opens the door to terrible evil. The mysterious hitcher, unforgettably portrayed by Rutger Hauer, is a relentless slaughterer, preying on those who invite him into their lives. Somewhat dismissed at the time of its original release, The Hitcher developed a rabid fan following in the ensuing years, now properly recognized as one of the most memorable and terrifying thrillers of the 1980s,” says the official description for The Hitcher 4K.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003eThe premise for The Hitcher is a simple one and based on a very believable fear. What if you pick up a hitchhiker, but he’s actually a murderer? It’s a solid start, but after the main character kicks the hitchhiker out of his car after the first 25 minutes of the movie, it should be over, right? Not at all. Instead, The Hitcher gives its villain almost supernatural abilities to keep popping back up as he toys with the main character, causing mass amounts of havoc along the way. It’s over-the-top and ridiculous, but in a thrill-ride way that makes it a total joy to watch.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe Hitcher 4K looks a ton better than how the movie is currently streaming on Max (in poor quality and a 4:3 perspective). The finer quality really helps you appreciate the performances, as well, which is the element that makes the film really stand out from a lot of typical genre fare. While the handsome and baby-faced C. Thomas Howell is the film’s protagonist, who is likable despite making 50 dumb decisions that keep the story going; it’s really a showcase for Rutger Hauer. The Dutch actor is incredible as the serial killer villain and is immediately off-putting and unnerving as he makes any conversation tense. It’s a lot of small details in the performance, such as subtle gestures and movements, that really make him a stellar horror villain that will make you second-guess any hitchhiker you see in the future.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"The Hitcher (1986) Trailer\" width=\"720\" height=\"405\" src=\"https://www.youtube.com/embed/gaJRGK6XCVc?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThere’s a lot to unpack about The Hitcher, including a gruesome scene with \u003ca href=\"https://www.comingsoon.net/movies/features/1712328-poolman-interview-jennifer-jason-leigh-dewanda-wise\"\u003eJennifer Jason Leigh\u003c/a\u003e, which is why I was glad to see The Hitcher 4K come with a lot of meaningful special features. Not only is there a full commentary track by director Robert Harmon and writer Eric Red, but there’s also a 41-minute video interview with Harmon as well. It’s great hearing stories from the production, and it gives you a lot more context as to why this film has been able to find an audience over the years.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-the-hitcher-4k-review-final-verdict\"\u003eThe Hitcher 4K Review: Final Verdict\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe Hitcher 4K is a great home release, one that is leagues above the version of the film that is currently on streaming. With meaningful bonus features that give extra insight into how the film was made, it’s an easy recommendation for horror fans. \u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eDisclosure: ComingSoon received the product from the distributor for our The Hitcher 4K review.\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-27T17:41:44Z",
  "modifiedTime": "2024-10-27T17:42:03Z"
}
