{
  "id": "53913607-4461-499d-8242-6f2e8ef91a23",
  "title": "Jon Bernthal's Punisher Is Joining Spider-Man: Brand New Day, And That's Perfect For Peter Parker",
  "link": "https://www.slashfilm.com/1891728/jon-bernthal-punisher-joins-spider-man-4-marvel/",
  "description": "Frank Castle is finally making his way to the Marvel Cinematic Universe's big screen as Jon Bernthal's Punisher joins Spider-Man: Brand New Day.",
  "author": "Noah Villaverde",
  "published": "Fri, 20 Jun 2025 23:59:03 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Action \u0026 Adventure Movies",
    "Superhero Movies"
  ],
  "byline": "Noah Villaverde",
  "length": 6076,
  "excerpt": "Frank Castle is finally making his way to the Marvel Cinematic Universe's big screen as Jon Bernthal's Punisher joins Spider-Man: Brand New Day.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slashfilm-favicon.png",
  "text": "Jon Bernthal's Punisher Is Joining Spider-Man: Brand New Day, And That's Perfect For Peter Parker Marvel Television Although much of the attention for the future of the Marvel Cinematic Universe is on \"The Fantastic Four: First Steps\" hitting theaters on July 25, 2025, as well as \"Avengers: Doomsday\" currently in production, we just got perhaps the most intriguing update regarding \"Spider-Man: Brand New Day.\" The Hollywood Reporter has confirmed that Emmy-winner Jon Bernthal is set to make his big screen debut as Frank Castle/The Punisher in the upcoming film, set to be helmed by \"Shang-Chi\" director Destin Daniel Cretton. That's right. Jon Bernthal's Punisher will finally be making his first appearance in an MCU film, and most fittingly, it will be in a \"Spider-Man\" movie. While fans continue to speculate about whether or not \"Brand New Day\" will be the right story for Tom Holland's Peter Parker following the tectonic shift in his life after the events of \"No Way Home,\" the addition of Frank Castle provides some exciting avenues to explore. It also hints towards some uncharted territories for both Parker and Castle, as they are both in the midst of a major change within their grounded worlds. This is a full-circle moment for Frank Castle, given his history in the comics Marvel Comics Francis \"Frank\" Castle, aka The Punisher, was created by writer Gerry Conway and artists John Romita Sr. and Ross Andru. The character first appeared in \"The Amazing Spider-Man\" issue #129, which was published in February 1974 under the subtitle, \"The Punisher Strikes Twice.\" In his debut, The Punisher was initially established as a Spider-Man villain, but he became so popular amongst readers that his character eventually spawned his own series. The antihero has since been adapted into three different live-action films, including a forgotten 1989 cult film that starred Dolph Lundgren in the role, as well as two other iterations that starred Thomas Jane and Ray Stevenson. Eight years after the release of \"Punisher: War Zone,\" Marvel Television reintroduced the beloved antihero in \"Daredevil\" season 2, where Jon Bernthal made his debut as Frank Castle as he became an uneasy ally to Matt Murdock/Daredevil (Charlie Cox). His initial appearance in that series led to his own spinoff standalone show, \"The Punisher,\" which ran for two seasons before Netflix pulled the plug on its entire collaboration with Marvel Television. However, after years of anticipation, Bernthal made his triumphant return as part of the official MCU canon in the first season of \"Daredevil: Born Again,\" and even with few guest star appearances, his performance reignited excitement amongst fans, and his future was already looking bright, thanks to the announcement of a Marvel Special Presentation centered on the character. Why Frank Castle is the perfect addition to Peter Parker's world Sony Pictures Releasing/Marvel Studios Peter Parker already had his first onscreen encounter with the MCU's more grounded, street-level threats in \"Spider-Man: No Way Home,\" where he met Matt Murdock, Attorney at Law, who was looking to represent him following the public revelation of his identity. The jury is still out on whether or not he will encounter Matt Murdock's alter-ego in \"Brand New Day,\" but the addition of Frank Castle/The Punisher bodes well for that potential team-up. Given that the gritty criminal underworld of the MCU's New York City is being further established in the wake of \"Daredevil: Born Again,\" it is clear that Marvel Studios is looking to bring some of that darker realism to Tom Holland's Spidey, who has already had his fair share of fantastical adventures thanks to his experiences with the Avengers as well as teaming up with two Multiversal variants in his last standalone film. One of the major criticisms lobbed against Tom Holland's Spidey flicks is that he is always involved with another major MCU character in his story. Tony Stark/Iron Man (Robert Downey Jr.), Nick Fury (Samuel L. Jackson), and Stephen Strange/Doctor Strange (Benedict Cumberbatch) have all respectively played a major part in Peter's standalone films. While \"Brand New Day\" is shaping up to follow suit, and may even boast more MCU connections, the addition of Frank Castle is perhaps the most direct tease of the continuing maturation of our beloved webhead. Once you bring in arguably the darkest and most gutwrenchingly raw antihero in all of Marvel Comics into your film, it is clear that \"Brand New Day\" will not evoke the same lighthearted coming-of-age adventures of Jon Watts' trilogy of films. If nothing else, Peter is going to be further tested on his convictions and heroism once he meets Frank for the first time, and the prospect of Jon Bernthal's world-weariness coming face-to-face with Holland's Spidey is admittedly the most exciting development to come out of this new film. \"Spider-Man: Brand New Day\" will swing into theaters on July 31, 2026.",
  "image": "https://www.slashfilm.com/img/gallery/jon-bernthals-punisher-is-joining-spider-man-brand-new-day-and-thats-perfect-for-peter-parker/l-intro-1750463589.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n        \n\u003cmain id=\"main\" role=\"main\" data-post-type=\"articles\"\u003e\n    \u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \u003cp\u003e\n                \u003ch2 data-post-id=\"1891728\" id=\"title-gallery\" data-author=\"Noah Villaverde\" data-category=\"superheroes-movies\" data-content_type=\"Short Article\" data-mod_date=\"2025-06-20\" data-layout=\"Infinite\" data-post_id=\"1891728\" data-pub_date=\"2025-06-20\" data-day=\"Friday\" data-dayhour=\"Friday-7PM\" data-pubhour=\"7PM\" data-num_slides=\"3\" data-num_words=\"800\" data-pitcher=\"Noah Villaverde\" data-trello_board=\"News\" data-intent=\"evergreen\" data-ideation=\"editorial\" data-importanttopic=\"True\"\u003eJon Bernthal\u0026#39;s Punisher Is Joining Spider-Man: Brand New Day, And That\u0026#39;s Perfect For Peter Parker\u003c/h2\u003e\n            \u003c/p\u003e\n\n    \n                \u003cdiv\u003e\n                \n                                \n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1891728/jon-bernthal-punisher-joins-spider-man-4-marvel/\" data-post-title=\"Jon Bernthal\u0026#39;s Punisher Is Joining Spider-Man: Brand New Day, And That\u0026#39;s Perfect For Peter Parker\" data-slide-num=\"0\" data-post-id=\"1891728\"\u003e\n                                             \u003cpicture id=\"p49e092d78ce59b3e13e3751a7de8d92f\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/jon-bernthals-punisher-is-joining-spider-man-brand-new-day-and-thats-perfect-for-peter-parker/intro-1750463589.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/jon-bernthals-punisher-is-joining-spider-man-brand-new-day-and-thats-perfect-for-peter-parker/intro-1750463589.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/jon-bernthals-punisher-is-joining-spider-man-brand-new-day-and-thats-perfect-for-peter-parker/intro-1750463589.jpg\" data-slide-url=\"https://www.slashfilm.com/1891728/jon-bernthal-punisher-joins-spider-man-4-marvel/\" data-post-id=\"1891728\" data-slide-num=\"0\" data-slide-title=\"Jon Bernthal\u0026#39;s Punisher Is Joining Spider-Man: Brand New Day, And That\u0026#39;s Perfect For Peter Parker: \" width=\"780\" height=\"438\" alt=\"Frank Castle/The Punisher (Jon Bernthal) donning his uniform in \u0026#34;The Punisher\u0026#34;\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eMarvel Television\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n                \n                \n\u003cp dir=\"ltr\"\u003eAlthough much of the attention for the future of the Marvel Cinematic Universe is on \u0026#34;The Fantastic Four: First Steps\u0026#34; hitting theaters on July 25, 2025, as well as \u0026#34;Avengers: Doomsday\u0026#34; currently in production, we just got perhaps the most intriguing update regarding \u0026#34;Spider-Man: Brand New Day.\u0026#34; \u003ca href=\"https://www.hollywoodreporter.com/movies/movie-news/spider-man-brand-new-day-jon-bernthal-1236296073/\" target=\"_blank\"\u003eThe Hollywood Reporter\u003c/a\u003e has confirmed that Emmy-winner Jon Bernthal is set to make his big screen debut as Frank Castle/The Punisher in the upcoming film, set to be helmed by \u0026#34;Shang-Chi\u0026#34; director Destin Daniel Cretton.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eThat\u0026#39;s right. Jon Bernthal\u0026#39;s Punisher will finally be making his first appearance in an MCU film, and most fittingly, it will be in a \u0026#34;Spider-Man\u0026#34; movie. While fans continue to speculate about whether or not \u0026#34;Brand New Day\u0026#34; will be the right story for Tom Holland\u0026#39;s Peter Parker following the tectonic shift in his life after the events of \u0026#34;No Way Home,\u0026#34; the addition of Frank Castle provides some exciting avenues to explore. It also hints towards some uncharted territories for both Parker and Castle, as they are both in the midst of a major change within their grounded worlds.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eThis is a full-circle moment for Frank Castle, given his history in the comics\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1891728/jon-bernthal-punisher-joins-spider-man-4-marvel/\" data-post-title=\"Jon Bernthal\u0026#39;s Punisher Is Joining Spider-Man: Brand New Day, And That\u0026#39;s Perfect For Peter Parker\" data-slide-num=\"1\" data-post-id=\"1891728\"\u003e\n                                             \u003cpicture id=\"p90a31e8a6d0e1c6a6bef909886ae75a6\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/jon-bernthals-punisher-is-joining-spider-man-brand-new-day-and-thats-perfect-for-peter-parker/this-is-a-full-circle-moment-for-frank-castle-given-his-history-in-the-comics-1750463749.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/jon-bernthals-punisher-is-joining-spider-man-brand-new-day-and-thats-perfect-for-peter-parker/this-is-a-full-circle-moment-for-frank-castle-given-his-history-in-the-comics-1750463749.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/jon-bernthals-punisher-is-joining-spider-man-brand-new-day-and-thats-perfect-for-peter-parker/this-is-a-full-circle-moment-for-frank-castle-given-his-history-in-the-comics-1750463749.jpg\" data-slide-url=\"https://www.slashfilm.com/1891728/jon-bernthal-punisher-joins-spider-man-4-marvel/\" data-post-id=\"1891728\" data-slide-num=\"1\" data-slide-title=\"Jon Bernthal\u0026#39;s Punisher Is Joining Spider-Man: Brand New Day, And That\u0026#39;s Perfect For Peter Parker: This is a full-circle moment for Frank Castle, given his history in the comics\" width=\"780\" height=\"438\" alt=\"Frank Castle/The Punisher in a Marvel Comics panel\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eMarvel Comics\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eFrancis \u0026#34;Frank\u0026#34; Castle, aka The Punisher, was created by writer Gerry Conway and artists John Romita Sr. and Ross Andru. The character first appeared in \u0026#34;The Amazing Spider-Man\u0026#34; issue #129, which was published in February 1974 under the subtitle, \u0026#34;The Punisher Strikes Twice.\u0026#34; In his debut, The Punisher was initially established as a Spider-Man villain, but he became so popular amongst readers that his character eventually spawned his own series. \u003ca href=\"https://www.slashfilm.com/1776288/marvel-punisher-live-action-versions-ranked/\" target=\"_blank\"\u003eThe antihero has since been adapted into three different live-action films,\u003c/a\u003e including a forgotten 1989 cult film that starred Dolph Lundgren in the role, as well as two other iterations that starred Thomas Jane and Ray Stevenson.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eEight years after the release of \u0026#34;Punisher: War Zone,\u0026#34; Marvel Television reintroduced the beloved antihero in \u0026#34;Daredevil\u0026#34; season 2, where Jon Bernthal made his debut as Frank Castle as he became an uneasy ally to Matt Murdock/Daredevil (Charlie Cox). His initial appearance in that series led to his own spinoff standalone show, \u0026#34;The Punisher,\u0026#34; which ran for two seasons before Netflix pulled the plug on its entire collaboration with Marvel Television. However, after years of anticipation, \u003ca href=\"https://www.slashfilm.com/1224959/want-more-daredevil-vs-punisher-before-born-again-read-chip-zdarskys-daredevil/\" target=\"_blank\"\u003eBernthal made his triumphant return as part of the official MCU canon in the first season of \u0026#34;Daredevil: Born Again,\u0026#34;\u003c/a\u003e and even with few guest star appearances, his performance reignited excitement amongst fans, and his future was already looking bright, \u003ca href=\"https://www.slashfilm.com/1799137/marvel-jon-bernthal-the-punisher-mcu-special-presentation/\" target=\"_blank\"\u003ethanks to the announcement of a Marvel Special Presentation centered on the character.\u003c/a\u003e\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eWhy Frank Castle is the perfect addition to Peter Parker\u0026#39;s world\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1891728/jon-bernthal-punisher-joins-spider-man-4-marvel/\" data-post-title=\"Jon Bernthal\u0026#39;s Punisher Is Joining Spider-Man: Brand New Day, And That\u0026#39;s Perfect For Peter Parker\" data-slide-num=\"2\" data-post-id=\"1891728\"\u003e\n                                             \u003cpicture id=\"p0ae663551d7cbd8775db8ba70a777b37\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/jon-bernthals-punisher-is-joining-spider-man-brand-new-day-and-thats-perfect-for-peter-parker/why-frank-castle-is-the-perfect-addition-to-peter-parkers-world-1750463750.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/jon-bernthals-punisher-is-joining-spider-man-brand-new-day-and-thats-perfect-for-peter-parker/why-frank-castle-is-the-perfect-addition-to-peter-parkers-world-1750463750.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/jon-bernthals-punisher-is-joining-spider-man-brand-new-day-and-thats-perfect-for-peter-parker/why-frank-castle-is-the-perfect-addition-to-peter-parkers-world-1750463750.jpg\" data-slide-url=\"https://www.slashfilm.com/1891728/jon-bernthal-punisher-joins-spider-man-4-marvel/\" data-post-id=\"1891728\" data-slide-num=\"2\" data-slide-title=\"Jon Bernthal\u0026#39;s Punisher Is Joining Spider-Man: Brand New Day, And That\u0026#39;s Perfect For Peter Parker: Why Frank Castle is the perfect addition to Peter Parker\u0026#39;s world\" width=\"780\" height=\"438\" alt=\"Peter Parker (Tom Holland) prepares to fight the Green Goblin in \u0026#34;Spider-Man: No Way Home\u0026#34;\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eSony Pictures Releasing/Marvel Studios\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003ePeter Parker already had his first onscreen encounter with the MCU\u0026#39;s more grounded, street-level threats in \u0026#34;Spider-Man: No Way Home,\u0026#34; where he met Matt Murdock, Attorney at Law, who was looking to represent him following the public revelation of his identity. The jury is still out on whether or not he will encounter Matt Murdock\u0026#39;s alter-ego in \u0026#34;Brand New Day,\u0026#34; but the addition of Frank Castle/The Punisher bodes well for that potential team-up. Given that the gritty criminal underworld of the MCU\u0026#39;s New York City is being further established in the wake of \u0026#34;Daredevil: Born Again,\u0026#34; it is clear that Marvel Studios is looking to bring some of that darker realism to Tom Holland\u0026#39;s Spidey, who has already had his fair share of fantastical adventures thanks to his experiences with the Avengers as well as teaming up with two Multiversal variants in his last standalone film.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eOne of the major criticisms lobbed against Tom Holland\u0026#39;s Spidey flicks is that he is always involved with another major MCU character in his story. Tony Stark/Iron Man (Robert Downey Jr.), Nick Fury (Samuel L. Jackson), and Stephen Strange/Doctor Strange (Benedict Cumberbatch) have all respectively played a major part in Peter\u0026#39;s standalone films. While \u0026#34;Brand New Day\u0026#34; is shaping up to follow suit, and may even boast more MCU connections, the addition of Frank Castle is perhaps the most direct tease of the continuing maturation of our beloved webhead. Once you bring in arguably the darkest and most gutwrenchingly raw antihero in all of Marvel Comics into your film, it is clear that \u0026#34;Brand New Day\u0026#34; will not evoke the same lighthearted coming-of-age adventures of Jon Watts\u0026#39; trilogy of films. If nothing else, Peter is going to be further tested on his convictions and heroism once he meets Frank for the first time, and the prospect of Jon Bernthal\u0026#39;s world-weariness coming face-to-face with Holland\u0026#39;s Spidey is admittedly the most exciting development to come out of this new film.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003e\u0026#34;Spider-Man: Brand New Day\u0026#34; will swing into theaters on July 31, 2026.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\n    \n    \u003c/main\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-06-20T23:59:03Z",
  "modifiedTime": "2025-06-20T23:59:03Z"
}
