{
  "id": "61e52085-f218-4dea-b51e-7c4a8e23cca9",
  "title": "Paul Schrader Accused of Sexually Harassing Assistant and Reneging on Settlement",
  "link": "https://variety.com/2025/film/news/paul-schrader-sexual-harassment-assistant-jane-doe-1236360352/",
  "description": "Paul Schrader, the screenwriter of “Taxi Driver” and “Raging Bull,” has been accused in a legal filing of sexually harassing his former assistant, and of backing out of an agreement to pay her a settlement. The 26-year-old woman, identified only as Jane Doe, alleges that Schrader grabbed her and kissed her against her will while […]",
  "author": "Gmaddaus",
  "published": "Sat, 05 Apr 2025 00:12:06 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Paul Schrader"
  ],
  "byline": "Gene Maddaus",
  "length": 3129,
  "excerpt": "Paul Schrader has been accused of sexually assaulting and harassing his former assistant, and of reneging on a settlement agreement with her.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "Paul Schrader, the screenwriter of “Taxi Driver” and “Raging Bull,” has been accused in a legal filing of sexually harassing his former assistant, and of backing out of an agreement to pay her a settlement. The 26-year-old woman, identified only as Jane Doe, alleges that Schrader grabbed her and kissed her against her will while they were at the Cannes Film Festival last year for the premiere of his latest film, “Oh, Canada.” She protested and was able to free herself and flee the room, she alleges. Three days later, she alleges that Schrader, 78, summoned her to his hotel room, claiming that he was “dying,” and then exposed his penis to her. The woman’s attorneys allege that Schrader’s lawyers agreed to a monetary settlement, but that after some “soul searching” he backed out of the deal. They filed a motion in state court in New York to enforce the terms of the agreement, and to recover attorneys’ fees and costs. Popular on Variety Schrader’s lawyer, Philip Kessler, told Variety on Friday that since Schrader never signed the settlement, it cannot be enforced. “We regard this breach of contract claim as desperate, opportunistic and frivolous,” he said. Kessler also alleged that the account of the underlying harassment allegations is “loaded with inaccuracies” and “materially misleading.” He said that over the course of a three-and-a-half year working relationship, the assistant went to numerous dinners and festivals with Schrader. “In none of those instances did the plaintiff indicate anything other than enthusiasm about appearing with Mr. Schrader,” Kessler said. He also said that the woman had spoken favorably about Schrader on social media, and that the posts had been removed around the time her lawyers sent their initial demand letter. In the filing, the woman alleges that Schrader repeatedly professed his love for her and his desire to touch her, both verbally and in writing. The motion quotes from emails he allegedly sent to her. “I sense you are uncomfortable with my affection for you,” he wrote in May 2023, according to the court filing. “Sometimes I get the feeling (not today) that you are afraid I might touch you… I cringe at the thought you fear I might touch you.” During her employment, the woman alleges she had to put up with “near-constant inappropriate sexual questions and lewd and misogynistic commentary.” Her attorneys allege that she was fired in September because she refused to acquiesce to Schrader’s advances. In the subsequent months, her attorneys worked out an arrangement for Schrader to pay a confidential sum to resolve her allegations. However, they allege that Schrader put off signing the agreement. After a delay of several weeks, her attorneys claim, Schrader said he had gone through an illness and had decided that he “could not live with himself” if he accepted the agreement. The woman’s attorneys allege that the agreement was nevertheless binding. The “First Reformed” director was awarded a Venice Golden Lion for career achievement in 2022.",
  "image": "https://variety.com/wp-content/uploads/2024/05/paul.jpg?crop=0px%2C53px%2C1000px%2C562px\u0026resize=1000%2C563",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\t\u003ca href=\"https://variety.com/t/paul-schrader/\" id=\"auto-tag_paul-schrader\" data-tag=\"paul-schrader\"\u003ePaul Schrader\u003c/a\u003e, the screenwriter of “Taxi Driver” and “Raging Bull,” has been accused \u003ca href=\"https://iapps.courts.state.ny.us/nyscef/ViewDocument?docIndex=liBECVR9W8F5eDDCiE3E_PLUS_w==\" rel=\"nofollow\" target=\"_blank\"\u003ein a legal filing\u003c/a\u003e of sexually harassing his former assistant, and of backing out of an agreement to pay her a settlement.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe 26-year-old woman, identified only as Jane Doe, alleges that Schrader grabbed her and kissed her against her will while they were at the Cannes Film Festival last year for the premiere of his latest film, “Oh, Canada.” She protested and was able to free herself and flee the room, she alleges.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThree days later, she alleges that Schrader, 78, summoned her to his hotel room, claiming that he was “dying,” and then exposed his penis to her.\n\n\n\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tThe woman’s attorneys allege that Schrader’s lawyers agreed to a monetary settlement, but that after some “soul searching” he backed out of the deal. They filed a motion in state court in New York to enforce the terms of the agreement, and to recover attorneys’ fees and costs.\n\n\t\u003c/p\u003e\n\n\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tSchrader’s lawyer, Philip Kessler, told \u003cem\u003eVariety\u003c/em\u003e on Friday that since Schrader never signed the settlement, it cannot be enforced.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“We regard this breach of contract claim as desperate, opportunistic and frivolous,” he said.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tKessler also alleged that the account of the underlying harassment allegations is “loaded with inaccuracies” and “materially misleading.” He said that over the course of a three-and-a-half year working relationship, the assistant went to numerous dinners and festivals with Schrader.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“In none of those instances did the plaintiff indicate anything other than enthusiasm about appearing with Mr. Schrader,” Kessler said.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tHe also said that the woman had spoken favorably about Schrader on social media, and that the posts had been removed around the time her lawyers sent their initial demand letter.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn the filing, the woman alleges that Schrader repeatedly professed his love for her and his desire to touch her, both verbally and in writing. The motion quotes from emails he allegedly sent to her.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“I sense you are uncomfortable with my affection for you,” he wrote in May 2023, according to the court filing. “Sometimes I get the feeling (not today) that you are afraid I might touch you… I cringe at the thought you fear I might touch you.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tDuring her employment, the woman alleges she had to put up with “near-constant inappropriate sexual questions and lewd and misogynistic commentary.”\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tHer attorneys allege that she was fired in September because she refused to acquiesce to Schrader’s advances. In the subsequent months, her attorneys worked out an arrangement for Schrader to pay a confidential sum to resolve her allegations.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tHowever, they allege that Schrader put off signing the agreement. After a delay of several weeks, her attorneys claim, Schrader said he had gone through an illness and had decided that he “could not live with himself” if he accepted the agreement.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe woman’s attorneys allege that the agreement was nevertheless binding.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe “First Reformed” director was awarded a Venice Golden Lion for career achievement in 2022.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-05T00:12:06Z",
  "modifiedTime": "2025-04-05T00:12:19Z"
}
