{
  "id": "6817739d-ef03-44ac-bbf4-a5caf9cc3e4f",
  "title": "Timothée Chalamet Was Top of Mind for ‘Gladiator II’ — Then Ridley Scott Watched ‘Normal People’",
  "link": "https://www.indiewire.com/news/general-news/timothee-chalamet-almost-cast-in-gladiator-2-1235069387/",
  "description": "While it's clear the star had his hands full this year between \"Dune II,\" \"A Complete Unknown,\" and now Josh Safdie's \"Marty Supreme,\" for a time, Chalamet could've ended up in \"Gladiator II\" as well.",
  "author": "Harrison Richlin",
  "published": "Sun, 24 Nov 2024 22:00:00 +0000",
  "source": "https://www.indiewire.com/feed",
  "categories": [
    "General News",
    "News",
    "Film",
    "Gladiator II",
    "Paul Mescal",
    "Ridley Scott",
    "Timothée Chalamet"
  ],
  "byline": "Harrison Richlin",
  "length": 2867,
  "excerpt": "Before landing on Paul Mescal, Ridley Scott almost cast Timothée Chalamet in 'Gladiator II' and also considered Miles Teller.",
  "siteName": "IndieWire",
  "favicon": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=192",
  "text": "When you’re one of Hollywood’s few remaining movie stars, it’s not surprising for your name to be floated for every leading man role popping up around town. Such is the life for Timothée Chalamet, whose slate this year included the release of “Dune II,” shooting “A Complete Unknown,” leading into what is gearing up to be an awards campaign for Best Actor, and starting production on Josh Safdie’s “Marty Supreme.” As if this weren’t enough, Ridley Scott shared in a recent piece for The Hollywood Reporter that, for a time, Chalamet was considered for the part of Lucius, a role which ultimately went to Paul Mescal after the director saw his performance in “Normal People.” “Any studio would always prefer to have a known star,” said Scott’s producer, Doug Wick, to THR. Having only starred in indie features like “Aftersun” and “All of Us Strangers” and despite awards consideration for both, Mescal was not a known entity at the box office in the way Chalamet was. Ultimately though, after Paramount co-presidents of film Daria Cercek and Michael Ireland saw Mescal as Stanley Kowalski in a West End revival of “A Streetcar Named Desire” (coming to New York’s BAM in February), Wick said they both agreed “no other actor came close.” In a recent panel moderated by IndieWire’s Jim Hemphill, Scott detailed how he came across “Normal People” and was captured by the performances despite the material not grabbing him. “I need bedtime stories. Before I go to bed I always watch something. I caught ‘Normal People’ almost by accident,” said Scott. “It was not my kind of thing really, but I watched two and thought that both the guy and the girl were terrific. Then I binged eight hours.” Scott was positive Mescal was his guy after watching “Normal People” and Mescal didn’t hesitate to step into the arena with him. He recognized the implications something this major would have on his career, but felt it was the right type of project for his sensibilities. “I would’ve had a potential reticence around what the first big studio film was going to be, because it sets out your stall as an actor,” Mescal said to THR, acknowledging the potential of being typecast in the future as the action-hero. “[But] a film like ‘Gladiator II‘ is the dream in terms of studio, big-scale filmmaking because it’s in the hands of Ridley and rooted in human condition with a very clear emotional language.” Mescal has found a comfort with the director now after making the film together, as he plans to star in another project for Scott called “Dog Stars.” The script for the film is being adapted by Mark L. Smith based on the 2012 Apocalyptic thriller by Peter Heller and follows a pilot and an ex-marine as they try to survive in the aftermath of a pandemic that decimated American society. “Gladiator II” from Paramount Pictures is now in theaters.",
  "image": "https://www.indiewire.com/wp-content/uploads/2024/11/Untitled-design-12.jpg?w=650",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-alias=\"gutenberg-content__content\" data-social=\"true\" data-component=\"gutenberg-content\" data-template=\"article\" data-inner-width=\"content\"\u003e\u003cp\u003eWhen you’re one of Hollywood’s few remaining movie stars, it’s not surprising for your name to be floated for every leading man role popping up around town. Such is the life for \u003ca href=\"https://www.indiewire.com/t/timothee-chalamet-2/\" id=\"auto-tag_timothee-chalamet-2\" data-tag=\"timothee-chalamet-2\"\u003eTimothée Chalamet\u003c/a\u003e, whose slate this year included the release of “Dune II,” shooting “A Complete Unknown,”  leading into what is gearing up to be \u003ca href=\"https://www.indiewire.com/awards/consider-this/a-complete-unknown-oscars-predictions-timothee-chalamet-1235066680/\"\u003ean awards campaign\u003c/a\u003e for Best Actor, and starting production on Josh Safdie’s “Marty Supreme.” As if this weren’t enough, \u003ca href=\"https://www.indiewire.com/t/ridley-scott/\" id=\"auto-tag_ridley-scott\" data-tag=\"ridley-scott\"\u003eRidley Scott\u003c/a\u003e shared in \u003ca href=\"https://www.hollywoodreporter.com/movies/movie-features/making-of-gladiator-ii-ridley-scott-paul-mescal-1236066080/?utm_medium=social\u0026amp;utm_source=twitter\" target=\"_blank\"\u003ea recent piece for The Hollywood Reporter\u003c/a\u003e that, for a time, Chalamet was considered for the part of Lucius, a role which ultimately went to \u003ca href=\"https://www.indiewire.com/t/paul-mescal/\" id=\"auto-tag_paul-mescal\" data-tag=\"paul-mescal\"\u003ePaul Mescal\u003c/a\u003e after the director saw \u003ca href=\"https://www.indiewire.com/news/general-news/paul-mescal-normal-people-different-guy-1235058566/\"\u003ehis performance\u003c/a\u003e in “Normal People.”\n\n\u003c/p\u003e\u003cdiv data-alias=\"cards__inner\" data-component=\"cards-related-content\" data-collapse-to-xs=\"false\" data-layout=\"inline\" data-size=\"md\" data-spacing=\"s-3\" data-cards-spacing=\"s0\"\u003e \u003cdiv data-alias=\"card__inner\" data-post-id=\"1235069386\" data-component=\"card\" data-has-background=\"false\" data-has-overlay=\"false\" data-layout-size=\"xs\" data-layout=\"sidebar\" data-main-alignment=\"s0\" data-main-spacing=\"s0\" data-media-position=\"\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"sixteenByNine\" data-round=\"false\"\u003e\u003ca href=\"https://www.indiewire.com/news/general-news/cynthia-erivo-reflects-on-wicked-poster-backlash-1235069386/\" title=\"\" target=\"_self\" rel=\"\" data-card-index=\"0\" data-post-id=\"1235069386\"\u003e\u003cp\u003e\u003cimg src=\"https://www.indiewire.com/wp-content/uploads/2024/11/MCDWICK_UV060.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\" alt=\"\u0026#39;Wicked,\u0026#39; Cynthia Erivo\" height=\"168\" width=\"300\" srcset=\"https://www.indiewire.com/wp-content/uploads/2024/11/MCDWICK_UV060.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=600%2C337 600w, https://www.indiewire.com/wp-content/uploads/2024/11/MCDWICK_UV060.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=125%2C70 125w, https://www.indiewire.com/wp-content/uploads/2024/11/MCDWICK_UV060.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=660%2C370 660w, https://www.indiewire.com/wp-content/uploads/2024/11/MCDWICK_UV060.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=300%2C168 300w, https://www.indiewire.com/wp-content/uploads/2024/11/MCDWICK_UV060.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=1200%2C675 1200w\" sizes=\"(max-width: 300px) 100vw, 300px\" loading=\"lazy\" decoding=\"async\" fetchpriority=\"auto\" data-attachment-id=\"1235069394\" data-wp-size=\"nova_size__sixteenbynine_small_cropped\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e  \u003cdiv data-alias=\"card__inner\" data-post-id=\"1235069314\" data-component=\"card\" data-has-background=\"false\" data-has-overlay=\"false\" data-layout-size=\"xs\" data-layout=\"sidebar\" data-main-alignment=\"s0\" data-main-spacing=\"s0\" data-media-position=\"\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"sixteenByNine\" data-round=\"false\"\u003e\u003ca href=\"https://www.indiewire.com/news/box-office/wicked-gladiator-2-box-office-1235069314/\" title=\"\" target=\"_self\" rel=\"\" data-card-index=\"1\" data-post-id=\"1235069314\"\u003e\u003cp\u003e\u003cimg src=\"https://www.indiewire.com/wp-content/uploads/2024/09/MCDWICK_UV038.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\" alt=\"\u0026#39;WICKED\u0026#39;, from left: Cynthia Erivo, Ariana Grande, 2024.\" height=\"168\" width=\"300\" srcset=\"https://www.indiewire.com/wp-content/uploads/2024/09/MCDWICK_UV038.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=600%2C337 600w, https://www.indiewire.com/wp-content/uploads/2024/09/MCDWICK_UV038.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=125%2C70 125w, https://www.indiewire.com/wp-content/uploads/2024/09/MCDWICK_UV038.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=660%2C370 660w, https://www.indiewire.com/wp-content/uploads/2024/09/MCDWICK_UV038.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=300%2C168 300w, https://www.indiewire.com/wp-content/uploads/2024/09/MCDWICK_UV038.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=1200%2C675 1200w\" sizes=\"(max-width: 300px) 100vw, 300px\" loading=\"lazy\" decoding=\"async\" fetchpriority=\"auto\" data-attachment-id=\"1235069251\" data-wp-size=\"nova_size__sixteenbynine_small_cropped\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e \u003c/div\u003e\n\n\n\n\u003cp\u003e“Any studio would always prefer to have a known star,” said Scott’s producer, Doug Wick, to THR. Having only starred in indie features like “Aftersun” and “All of Us Strangers” and despite awards consideration for both, Mescal was not a known entity at the box office in the way Chalamet was. Ultimately though, after Paramount co-presidents of \u003ca href=\"https://www.indiewire.com/t/film/\" id=\"auto-tag_film\" data-tag=\"film\"\u003efilm\u003c/a\u003e Daria Cercek and Michael Ireland saw Mescal as Stanley Kowalski in a West End revival of “A Streetcar Named Desire” (coming to New York’s BAM in February), Wick said they both agreed “no other actor came close.”\u003c/p\u003e\n\n\n\n\u003cp\u003eIn \u003ca href=\"https://www.indiewire.com/features/craft/watch-ridley-scott-and-his-collaborators-talking-making-gladiator-2-1235068063/\"\u003ea recent panel moderated by IndieWire’s Jim Hemphill\u003c/a\u003e, Scott detailed how he came across “Normal People” and was captured by the performances despite the material not grabbing him.\u003c/p\u003e\n\n\n\n\u003cp\u003e“I need bedtime stories. Before I go to bed I always watch something. I caught ‘Normal People’ almost by accident,” said Scott. “It was not my kind of thing really, but I watched two and thought that both the guy and the girl were terrific. Then I binged eight hours.” \u003c/p\u003e\n\n\n\n\u003cp\u003eScott was positive Mescal was his guy after watching “Normal People” and Mescal didn’t hesitate to step into the arena with him. He recognized the implications something this major would have on his career, but felt it was the right type of project for his sensibilities. “I would’ve had a potential reticence around what the first big studio film was going to be, because it sets out your stall as an actor,” Mescal said to THR, acknowledging the potential of being typecast in the future as the action-hero. “[But] a film like ‘\u003ca href=\"https://www.indiewire.com/t/gladiator-ii/\" id=\"auto-tag_gladiator-ii\" data-tag=\"gladiator-ii\"\u003eGladiator II\u003c/a\u003e‘ is the dream in terms of studio, big-scale filmmaking because it’s in the hands of Ridley and rooted in human condition with a very clear emotional language.”\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eMescal has found a comfort with the director now after making the film together, as he plans to star in another project for Scott called “Dog Stars.” The script for the film is being adapted by Mark L. Smith based on the 2012 Apocalyptic thriller by Peter Heller and follows a pilot and an ex-marine as they try to survive in the aftermath of a pandemic that decimated American society.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e“Gladiator II” from Paramount Pictures is now in theaters.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-24T22:00:00Z",
  "modifiedTime": "2024-11-25T01:08:27Z"
}
