{
  "id": "6d32dc45-026d-48b6-84d9-036ab8f59942",
  "title": "Ben Stiller Likens ‘Severance’ To Hollywood Today: “Constriction And Choices That Are Safer”",
  "link": "https://deadline.com/2025/01/ben-stiller-severance-hollywood-industry-tough-environment-1236255091/",
  "description": "In the way that Lumon Industries is disconnected to its workers on Apple TV+’s Severance, so too is Hollywood perhaps disoriented about its creatives, Ben Stiller posits. Previewing the highly anticipated and delayed second season of the mystery-box thriller to the New York Times in a recent interview, the executive producer and director likened the […]",
  "author": "Natalie Oganesyan",
  "published": "Mon, 13 Jan 2025 00:54:49 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "News",
    "Apple TV+",
    "Ben Stiller",
    "Hollywood",
    "Severance"
  ],
  "byline": "Natalie Oganesyan",
  "length": 2320,
  "excerpt": "In the way that Lumon Industries is disconnected to its workers on 'Severance,' so too is Hollywood, Ben Stiller posits.",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "In the way that Lumon Industries is disconnected to its workers on Apple TV+‘s Severance, so too is Hollywood perhaps disoriented about its creatives, Ben Stiller posits. Previewing the highly anticipated and delayed second season of the mystery-box thriller to the New York Times in a recent interview, the executive producer and director likened the lack of control the series’ characters have to a similar floundering facing those in the entertainment industry. “At a certain point there’s always somebody making a decision who is not making it to your face or you don’t even know who that person is,” Stiller said, referencing the show’s unraveling of a group of workers who have chosen to surgically bifurcate their brains into work (aka innies) and home (outies) selves. Watch on Deadline In Severance Season 1, the eerie contentment of a fictional conglomerate — occupied by characters played by Adam Scott, John Turturro and Zach Cherry — is upended with the arrival of standout Britt Lower’s Helly, who questions the shadowy circumstances of their predicament. “Why a decision is made is never explained to the creative person,” Stiller continued the analogy. “Or, if it is, it’s usually not the truth. It’s a cliché in Hollywood, but it’s kind of true that everybody will say yes and it doesn’t mean yes. It means no or let me think about it — more than ever, honestly.” Stiller especially pointed to the exacerbation of the problem with the number of crises that have since rocked Hollywood (and now, the Los Angeles wildfires): “It’s a very tough environment now to get things made. The strike, post-Covid — it’s more expensive to make things, and I think the decision makers are trying to keep their jobs and trying to figure out how to make things work for them, which means constriction and choices that are safer.” Created, executive produced and written by Dan Erickson, Season 2 has added cast members Gwendoline Christie (Game of Thrones), Bob Balaban (The Chair), Merritt Wever (Godless), Alia Shawkat (Search Party), Robby Benson (Beauty and the Beast), Stefano Carannante (Mirabilia), Ólafur Darri Ólafsson (The Tourist) and John Noble (Fringe). Severance‘s 10-episode Season 2 descends on Apple TV+ Jan. 17, with weekly drops thereafter.",
  "image": "https://deadline.com/wp-content/uploads/2025/01/ben-stiller.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\n\tIn the way that Lumon Industries is disconnected to its workers on \u003ca href=\"https://deadline.com/tag/apple-tv-2/\" id=\"auto-tag_apple-tv-2\" data-tag=\"apple-tv-2\"\u003eApple TV+\u003c/a\u003e‘s \u003cem\u003e\u003ca href=\"https://deadline.com/tag/severance/\" id=\"auto-tag_severance\" data-tag=\"severance\"\u003eSeverance\u003c/a\u003e\u003c/em\u003e, so too is \u003ca href=\"https://deadline.com/tag/hollywood/\" id=\"auto-tag_hollywood\" data-tag=\"hollywood\"\u003eHollywood\u003c/a\u003e perhaps disoriented about its creatives, \u003ca href=\"https://deadline.com/tag/ben-stiller/\" id=\"auto-tag_ben-stiller\" data-tag=\"ben-stiller\"\u003eBen Stiller\u003c/a\u003e posits.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tPreviewing the \u003ca href=\"https://deadline.com/lists/2025-tv-shows/\"\u003ehighly anticipated\u003c/a\u003e and \u003ca href=\"https://deadline.com/2024/12/ben-stiller-dan-erickson-explain-severance-season-2-delays-1236194424/\"\u003edelayed\u003c/a\u003e second season of the mystery-box thriller to the \u003cem\u003e\u003ca rel=\"nofollow\" href=\"https://www.nytimes.com/2025/01/11/magazine/ben-stiller-interview.html\" target=\"_blank\"\u003eNew York Times\u003c/a\u003e \u003c/em\u003ein a recent interview, the executive producer and director likened the lack of control the series’ characters have to a similar floundering facing those in the entertainment industry. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“At a certain point there’s always somebody making a decision who is not making it to your face or you don’t even know who that person is,” Stiller said, referencing the show’s unraveling of a group of workers who have chosen to surgically bifurcate their brains into work (aka innies) and home (outies) selves.\n\n\t\u003c/p\u003e\n\n\u003cdiv data-pmc-adm-ad-id=\"1236046283\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\n\u003cp\u003e\n\tIn \u003cem\u003eSeverance\u003c/em\u003e Season 1, the eerie contentment of a fictional conglomerate — occupied by characters played by Adam Scott, John Turturro and Zach Cherry — is upended with the arrival of standout Britt Lower’s Helly, who questions the shadowy circumstances of their predicament. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Why a decision is made is never explained to the creative person,” Stiller continued the analogy. “Or, if it is, it’s usually not the truth. It’s a cliché in Hollywood, but it’s kind of true that everybody will say yes and it doesn’t mean yes. It means no or let me think about it — more than ever, honestly.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tStiller especially pointed to the exacerbation of the problem with the number of crises that have since rocked Hollywood (and now, the Los Angeles wildfires): “It’s a very tough environment now to get things made. The strike, post-Covid — it’s more expensive to make things, and I think the decision makers are trying to keep their jobs and trying to figure out how to make things work for them, which means constriction and choices that are safer.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tCreated, executive produced and written by Dan Erickson, \u003ca rel=\"noreferrer noopener\" target=\"_blank\" href=\"https://deadline.com/2022/10/severance-gwendoline-christie-bob-balaban-merritt-wever-alia-shawkat-cast-season-2-apple-series-1235159058/\"\u003eSeason 2 has added\u003c/a\u003e cast members Gwendoline Christie (\u003cem\u003eGame of Thrones\u003c/em\u003e), Bob Balaban (\u003cem\u003eThe Chair\u003c/em\u003e), Merritt Wever (\u003cem\u003eGodless\u003c/em\u003e), Alia Shawkat (\u003cem\u003eSearch Party\u003c/em\u003e), Robby Benson (\u003cem\u003eBeauty and the Beast\u003c/em\u003e), Stefano Carannante \u003cem\u003e(Mirabilia)\u003c/em\u003e, Ólafur Darri Ólafsson \u003cem\u003e(The Tourist)\u003c/em\u003e and John Noble \u003cem\u003e(Fringe).\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cem\u003eSeverance\u003c/em\u003e‘s \u003ca href=\"https://deadline.com/feature/severance-season-2-everything-we-know-1236006379/\"\u003e10-episode Season 2\u003c/a\u003e descends on Apple TV+ Jan. 17, with weekly drops thereafter.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-13T00:54:49Z",
  "modifiedTime": "2025-01-13T00:54:51Z"
}
