{
  "id": "6ddbf8d3-1f9a-418c-9dd2-7af1469cd0d1",
  "title": "‘The Piano Lesson’s Skylar Aleece Smith Signs With Cultivate Entertainment Partners",
  "link": "https://deadline.com/2024/12/the-piano-lesson-skylar-aleece-smith-signs-cultivate-entertainment-partners-1236194431/",
  "description": "EXCLUSIVE: The Piano Lesson breakout Skylar Aleece Smith has signed with Cultivate Entertainment Partners for representation. Smith plays the pivotal supporting role of Maretha in The Piano Lesson, an adaptation of August Wilson’s Pulitzer Prize-winning play, starring Samuel L. Jackson, John David Washington, Danielle Brooks, and Ray Fisher. Directed by Malcolm Washington, the film, which […]",
  "author": "Denise Petski",
  "published": "Thu, 05 Dec 2024 00:43:00 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "Agencies",
    "News",
    "Cultivate Entertainment Partners",
    "Skylar Aleece Smith",
    "The Piano Lesson"
  ],
  "byline": "Denise Petski",
  "length": 1075,
  "excerpt": "The Piano Lesson's Skylar Aleece Smith has signed with Cultivate Entertainment Partners for representation.",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "EXCLUSIVE: The Piano Lesson breakout Skylar Aleece Smith has signed with Cultivate Entertainment Partners for representation. Smith plays the pivotal supporting role of Maretha in The Piano Lesson, an adaptation of August Wilson’s Pulitzer Prize-winning play, starring Samuel L. Jackson, John David Washington, Danielle Brooks, and Ray Fisher. Directed by Malcolm Washington, the film, which received the Ensemble Tribute award at the Gothams earlier this week, explores family legacy and the weight of history. The film is produced by Academy Award winner Denzel Washington, Todd Black (Fences, Ma Rainey’s Black Bottom), and Katia Washington (Fences, A Journal for Jordan). Smith’s credits also include Antoine Fuqua’s harrowing drama feature Emancipation, starring Will Smith.  Watch on Deadline “Skylar Aleece Smith is a rare talent whose performances leave a lasting impact,” said Sean Butler \u0026 Patrick Strøm, founders of Cultivate. “With The Piano Lesson, she’s cemented her place as one of the brightest stars of her generation.”",
  "image": "https://deadline.com/wp-content/uploads/2024/12/Skylar-Aleece-Smith.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\n\t\u003cstrong\u003eEXCLUSIVE: \u003c/strong\u003e\u003cem\u003e\u003ca href=\"https://deadline.com/tag/the-piano-lesson/\" id=\"auto-tag_the-piano-lesson\" data-tag=\"the-piano-lesson\"\u003eThe Piano Lesson\u003c/a\u003e\u003c/em\u003e breakout \u003ca href=\"https://deadline.com/tag/skylar-aleece-smith/\" id=\"auto-tag_skylar-aleece-smith\" data-tag=\"skylar-aleece-smith\"\u003eSkylar Aleece Smith\u003c/a\u003e has signed with \u003ca href=\"https://deadline.com/tag/cultivate-entertainment-partners/\" id=\"auto-tag_cultivate-entertainment-partners\" data-tag=\"cultivate-entertainment-partners\"\u003eCultivate Entertainment Partners\u003c/a\u003e for representation.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSmith plays the pivotal supporting role of Maretha in \u003cem\u003eThe Piano Lesson, \u003c/em\u003ean adaptation of August Wilson’s Pulitzer Prize-winning play, starring Samuel L. Jackson, John David Washington, Danielle Brooks, and Ray Fisher. Directed by Malcolm Washington, the film, which received the Ensemble Tribute award at the Gothams earlier this week, explores family legacy and the weight of history. The film is produced by Academy Award winner Denzel Washington, Todd Black (\u003cem\u003eFences\u003c/em\u003e, \u003cem\u003eMa Rainey’s Black Bottom\u003c/em\u003e), and Katia Washington (\u003cem\u003eFences\u003c/em\u003e, \u003cem\u003eA Journal for Jordan\u003c/em\u003e).\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tSmith’s credits also include Antoine Fuqua’s harrowing drama feature \u003cem\u003eEmancipation,\u003c/em\u003e starring Will Smith. \n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234771711\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\t“Skylar Aleece Smith is a rare talent whose performances leave a lasting impact,” said Sean Butler \u0026amp; Patrick Strøm, founders of Cultivate. “With \u003cem\u003eThe Piano Lesson\u003c/em\u003e, she’s cemented her place as one of the brightest stars of her generation.” \u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-12-05T00:43:00Z",
  "modifiedTime": "2024-12-05T00:44:20Z"
}
