{
  "id": "6efdfe46-5414-46b4-bc0b-c7059fb5cdc2",
  "title": "‘Matlock’ Star Kathy Bates Admits She Scrolls Reddit For Fan Reactions – Contenders TV",
  "link": "https://deadline.com/2025/04/matlock-kathy-bates-interview-1236360835/",
  "description": "If you’re a Redditor commenting on the latest Matlock episodes, know that series star Kathy Bates might be reading. Bates was joined by showrunner and executive producer Jennie Snyder Urman on Saturday afternoon on a panel to discuss the hot CBS series at Deadline’s Contenders TV event, where she revealed she has read some fan […]",
  "author": "Rosy Cordero",
  "published": "Sun, 06 Apr 2025 00:24:49 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "News",
    "CBS Studios",
    "Contenders TV",
    "Jennie Snyder Urman",
    "Kathy Bates",
    "Matlock"
  ],
  "byline": "Rosy Cordero",
  "length": 3240,
  "excerpt": "If you're a Redditor commenting on the latest 'Matlock' episodes, know that star Kathy Bates might be reading. The Emmy winner interviewed for Contenders TV.",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "If you’re a Redditor commenting on the latest Matlock episodes, know that series star Kathy Bates might be reading. Bates was joined by showrunner and executive producer Jennie Snyder Urman on Saturday afternoon on a panel to discuss the hot CBS series at Deadline’s Contenders TV event, where she revealed she has read some fan reactions. “There was a comment on the Reddit board about last week’s episode,” the two-time Emmy winner and 14-time nominee began as the audience gasped that she peeks at the forum site. “I’m not allowed to read Instagram or Reddit because I could see a gazillion wonderful things, then I’ll see one negative thing, and that’s what I’ll pick up on. Although I hear that it’s very human, so it makes me feel better.” RELATED: Contenders TV — Deadline’s Complete Coverage Watch on Deadline She continued by referencing Snyder Urman, “there was [a comment] that she read about a woman who was on a jury, and last week’s episode had to do with the woman who had been on a jury and who was bullied so much that she ended up caving when the man really was innocent and had been in prison for 21 years. This woman on the Reddit board said it really hit her hard because she had the same experience of being on a jury like that. So as a result of that, when she goes in to be called for jury duty, she explains this, and they don’t take her.” Both Bates and Snyder Urman celebrated Skye P. Marshall, who plays Olympia Lawrence on the Thursday night series, for her excellent work and what she brings to the project both as a person and an actor. “I just love her,” said Bates. “We had chemistry read with about four actresses [for the Olympia role], and when she came in, she was just larger than life and gorgeous, and just very open and eager and of course, just brilliantly talented. I wish she were here because she’s had a long road to this magnificent explosion now with Matlock. It’s been so wonderful to see all of that happening for her.” She added, “But also the power [she brings] in the pilot. She has a big monologue, which has to do with this race-based case, and she calls Maddie on it. When we shot that, I was on the other side of that power coming from her. I just thought: ‘OK, now we’ve got a show. We’ve got two strong women who can duke it out and who can fall in love with each other. That’s what the series, I think, is. The nugget is this rare relationship that we celebrate.” In addition to sharing her social media habits, Bates revealed she will be directing an episode of Matlock next season, her first time in nearly 22 years, since she directed in the Season 3 episode of HBO’s hit drama Six Feet Under. “I’m very excited,” she shared. Bates stars as Madeline “Matty” Matlock, a brilliant septuagenarian who achieved success in her younger years and decides to rejoin the work force at a prestigious law firm where she uses her unassuming demeanor and wily tactics to win cases. Matty is assigned to Olympia, a senior attorney and key rainmaker with a thirst for justice. Olympia’s ex-husband, Julian (Jason Ritter), the son of the head of the firm (Bridges), is intrigued by Matty and her clever skills.",
  "image": "https://deadline.com/wp-content/uploads/2025/04/Antonia-Blyth-Kathy-Bates-Jennie-Snyder-Urman-Contenders-2025-Matlock.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tIf you’re a Redditor commenting on the latest \u003cem\u003e\u003ca href=\"https://deadline.com/tag/matlock/\" id=\"auto-tag_matlock\" data-tag=\"matlock\"\u003eMatlock\u003c/a\u003e\u003c/em\u003e episodes, know that series star \u003ca href=\"https://deadline.com/tag/kathy-bates/\" id=\"auto-tag_kathy-bates\" data-tag=\"kathy-bates\"\u003eKathy Bates\u003c/a\u003e might be reading. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tBates was joined by showrunner and executive producer \u003ca href=\"https://deadline.com/tag/jennie-snyder-urman/\" id=\"auto-tag_jennie-snyder-urman\" data-tag=\"jennie-snyder-urman\"\u003eJennie Snyder Urman\u003c/a\u003e on Saturday afternoon on a panel to discuss the hot CBS series at Deadline’s \u003ca href=\"https://deadline.com/tag/contenders-tv/\" id=\"auto-tag_contenders-tv\" data-tag=\"contenders-tv\"\u003eContenders TV\u003c/a\u003e event, where she revealed she has read some fan reactions.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\u003cp\u003e\n\t“There was a comment on the Reddit board about last week’s episode,” the two-time Emmy winner and 14-time nominee began as the audience gasped that she peeks at the forum site. “I’m not allowed to read Instagram or Reddit because I could see a gazillion wonderful things, then I’ll see one negative thing, and that’s what I’ll pick up on. Although I hear that it’s very human, so it makes me feel better.”\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eRELATED: \u003ca href=\"https://deadline.com/tag/contenders-tv\"\u003eContenders TV — Deadline’s Complete Coverage\u003c/a\u003e\u003c/strong\u003e\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234771711\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tShe continued by referencing Snyder Urman, “there was [a comment] that she read about a woman who was on a jury, and last week’s episode had to do with the woman who had been on a jury and who was bullied so much that she ended up caving when the man really was innocent and had been in prison for 21 years. This woman on the Reddit board said it really hit her hard because she had the same experience of being on a jury like that. So as a result of that, when she goes in to be called for jury duty, she explains this, and they don’t take her.”\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\n\tBoth Bates and Snyder Urman celebrated Skye P. Marshall, who plays Olympia Lawrence on the Thursday night series, for her excellent work and what she brings to the project both as a person and an actor.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“I just love her,” said Bates. “We had chemistry read with about four actresses [for the Olympia role], and when she came in, she was just larger than life and gorgeous, and just very open and eager and of course, just brilliantly talented. I wish she were here because she’s had a long road to this magnificent explosion now with \u003cem\u003eMatlock\u003c/em\u003e. It’s been so wonderful to see all of that happening for her.”\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\n\tShe added, “But also the power [she brings] in the pilot. She has a big monologue, which has to do with this race-based case, and she calls Maddie on it. When we shot that, I was on the other side of that power coming from her. I just thought: ‘OK, now we’ve got a show. We’ve got two strong women who can duke it out and who can fall in love with each other. That’s what the series, I think, is. The nugget is this rare relationship that we celebrate.”\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tIn addition to sharing her social media habits, Bates revealed she will be directing an episode of \u003cem\u003eMatlock\u003c/em\u003e next season, her first time in nearly 22 years, since she directed in the Season 3 episode of HBO’s hit drama \u003cem\u003eSix Feet Under\u003c/em\u003e. “I’m very excited,” she shared.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tBates stars as Madeline “Matty” Matlock, a brilliant septuagenarian who achieved success in her younger years and decides to rejoin the work force at a prestigious law firm where she uses her unassuming demeanor and wily tactics to win cases. Matty is assigned to Olympia, a senior attorney and key rainmaker with a thirst for justice. Olympia’s ex-husband, Julian (Jason Ritter), the son of the head of the firm (Bridges), is intrigued by Matty and her clever skills.\u003cbr/\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-06T00:24:49Z",
  "modifiedTime": "2025-04-06T00:24:50Z"
}
