{
  "id": "7e156544-137e-4622-af57-8496268a528d",
  "title": "Jamie Lee Curtis Interrupts Bowen Yang’s Interview, Fans React",
  "link": "https://www.comingsoon.net/pop-culture/news/2005670-jamie-lee-curtis-bowen-yang-interview-matt-rogers",
  "description": "Jamie Lee Curtis happens to be at the receiving end of a lot of backlash after she seemingly shushed Bowen Yang and Matt Rogers at their annual Las Culturistas Culture Awards in Los Angeles. The move has generated a lot of negative reactions online, and fans seem to be appalled by Curtis’ behavior. Jamie Lee […] The post Jamie Lee Curtis Interrupts Bowen Yang’s Interview, Fans React appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
  "author": "Sourav Chakraborty",
  "published": "Tue, 22 Jul 2025 00:56:12 +0000",
  "source": "https://www.comingsoon.net/feed",
  "categories": [
    "Pop Culture",
    "Bowen Yang",
    "Jamie Lee Curtis",
    "Matt Rogers",
    "Pop Culture News"
  ],
  "byline": "Sourav Chakraborty",
  "length": 1975,
  "excerpt": "Fans are criticizing Jamie Lee Curtis after she allegedly interrupted Bowen Yang and Matt Rogers during their interview. Read on for more.",
  "siteName": "ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More",
  "favicon": "https://www.comingsoon.net/wp-content/uploads/sites/3/2022/12/cs_ico_144x144.png?w=144",
  "text": "Jamie Lee Curtis happens to be at the receiving end of a lot of backlash after she seemingly shushed Bowen Yang and Matt Rogers at their annual Las Culturistas Culture Awards in Los Angeles. The move has generated a lot of negative reactions online, and fans seem to be appalled by Curtis’ behavior. Jamie Lee Curtis interrupting Bowen Yang prompts fan reaction The baffling incident took place at the Las Culturistas Culture Awards in Los Angeles, where hosts Bowen Yang and Matt Rogers were asked by Vulture about a pop culture quote that lives in their head rent-free. While Yang was talking about an iconic Julia Roberts quote from Erin Brockovich, Jamie Lee Curtis came into the frame, seemingly asking Yang and Rogers to lower their voices. She said, “Listen. Bring the whole fucking thing down.” To this, Yang responded, “You’re gonna hate the show then,” while Rogers added, “We’ll sit you in the back.” As soon as the video went out, many fans reacted to the incident and called out Curtis for rudely interrupting Yang and Rogers. “I did not expect a video from the Las Culturistas red carpet to be the first time I’ve ever felt triggered. lol. Jamie Lee Curtis sucks a**. This is exactly how shitty adults would treat me as a loud gay theatre kid. Doing this to them at their own event? She truly repulses me,” one user wrote with the video on X (formerly Twitter). Many others commented similarly on the video. “After stealing an Oscar, she’s feeling herself and becoming more annoying every day,” another fan commented. Meanwhile, a third user added, “This made me CRINGGGGGGGEEEEEE holy shit. Wow.” It seems that this incident is garnering criticism from all around, as fans are not at all pleased with the Halloween star. However, some also believe that this was a staged bit. Nevertheless, as of now, there aren’t many details available. Moreover, Bowen Yang, Matt Rogers, and Jamie Lee Curtis have yet to comment on the incident.",
  "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/07/MixCollage-22-Jul-2025-06-24-AM-8053.jpg?resize=1200,630",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"http://comingsoon.net/tag/jamie-lee-curtis\"\u003eJamie Lee Curtis\u003c/a\u003e\u003c/strong\u003e happens to be at the receiving end of a lot of backlash after she seemingly \u003cstrong\u003eshushed\u003c/strong\u003e \u003cstrong\u003e\u003ca href=\"http://comingsoon.net/tag/bowen-yang\"\u003eBowen Yang\u003c/a\u003e\u003c/strong\u003e \u003cstrong\u003eand Matt Rogers\u003c/strong\u003e at their annual Las Culturistas Culture Awards in Los Angeles. The move has generated a lot of negative reactions online, and fans seem to be appalled by Curtis’ behavior.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-jamie-lee-curtis-interrupting-bowen-yang-prompts-fan-reaction\"\u003eJamie Lee Curtis interrupting Bowen Yang prompts fan reaction\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe baffling incident took place at the Las Culturistas Culture Awards in Los Angeles, where hosts Bowen Yang and Matt Rogers were asked by Vulture about a pop culture quote that lives in their head rent-free. \u003c/p\u003e\n\n\n\n\u003cp\u003eWhile Yang was talking about an iconic \u003ca href=\"http://comingsoon.net/tag/julia-roberts\"\u003eJulia Roberts\u003c/a\u003e quote from \u003ca href=\"http://comingsoon.net/tag/erin-brockovich\"\u003eErin Brockovich\u003c/a\u003e, Jamie Lee Curtis came into the frame, seemingly asking Yang and Rogers to lower their voices. She said, “Listen. Bring the whole fucking thing down.” To this, Yang responded, “You’re gonna hate the show then,” while Rogers added, “We’ll sit you in the back.”\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cdiv\u003e\n\u003cblockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/reel/DMQ2YB8RLQq/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e\u003c/blockquote\u003e\n\u003c/div\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eAs soon as the video went out, many fans reacted to the incident and called out Curtis for rudely interrupting Yang and Rogers.\u003c/p\u003e\n\n\n\n\u003cp\u003e“I did not expect a video from the Las Culturistas red carpet to be the first time I’ve ever felt triggered. lol. Jamie Lee Curtis sucks a**. This is exactly how shitty adults would treat me as a loud gay theatre kid. Doing this to them at their own event? She truly repulses me,” one user wrote with the video on \u003ca href=\"https://x.com/austinblakemays/status/1946672275853324627\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eX (formerly Twitter)\u003c/a\u003e. \u003c/p\u003e\n\n\n\n\u003cp\u003eMany others commented similarly on the video. “After stealing an Oscar, she’s feeling herself and becoming more annoying every day,” \u003ca href=\"https://x.com/MessyFressh/status/1946716846876500194\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eanother fan\u003c/a\u003e commented. Meanwhile, a third user \u003ca href=\"https://x.com/ongonnan/status/1946705032830677274\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eadded\u003c/a\u003e, “This made me CRINGGGGGGGEEEEEE holy shit. Wow.” \u003c/p\u003e\n\n\n\n\u003cp\u003eIt seems that this incident is garnering criticism from all around, as fans are not at all pleased with the \u003ca href=\"http://comingsoon.net/tag/halloween\"\u003eHalloween\u003c/a\u003e star. However, some also believe that this was a staged bit. Nevertheless, as of now, there aren’t many details available. Moreover, Bowen Yang, Matt Rogers, and Jamie Lee Curtis have yet to comment on the incident.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-07-22T00:56:12Z",
  "modifiedTime": "2025-07-22T00:56:28Z"
}
