{
  "id": "7f9a8ce5-cd67-4786-a1a8-ca9fabda7e5f",
  "title": "L.A. Wildfires: PCH Reopened To Residents \u0026 Essential Traffic With One Lane Both Ways; Checkpoints \u0026 Some Restrictions Will Remain",
  "link": "https://deadline.com/2025/02/wildfire-pacific-palisades-winds-1236250233/",
  "description": "UPDATED with latest: Access to Pacific Coast Highway between Santa Monica and Malibu, which has been largely restricted since the Palisades Fire erupted Jan. 7, was expanded today for residents, business and other essential traffic. As of 6 a.m., the route was opened to residents of the Pacific Palisades and Malibu burn areas, along with […]",
  "author": "Denise Petski",
  "published": "Fri, 21 Feb 2025 01:01:32 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "News",
    "Eaton Fire",
    "L.A. Local",
    "L.A. Wildfires",
    "Los Angeles",
    "Pacific Palisades",
    "Palisades Fire"
  ],
  "byline": "Denise Petski, Tom Tapp",
  "length": 67714,
  "excerpt": "Access to Pacific Coast Highway between Santa Monica and Malibu, which has been largely restricted since the Palisades Fire erupted Jan. 7, was expanded today.",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "UPDATED with latest: Access to Pacific Coast Highway between Santa Monica and Malibu, which has been largely restricted since the Palisades Fire erupted Jan. 7, was expanded today for residents, business and other essential traffic. As of 6 a.m., the route was opened to residents of the Pacific Palisades and Malibu burn areas, along with essential businesses and school bus traffic, according to Caltrans. Residents and business owners in the area will need to have access passes to use the roadway. Residents in Malibu and unincorporated areas can obtain access passes at Malibu City Hall. Palisades residents can obtain passes from Los Angeles city staff at the Disaster Recovery Center at 10850 Pico Blvd. “The PCH closure has been challenging for our residents who need to get to and from work, school, and essential trips,” county Supervisor Lindsey Horvath said in a statement. “As PCH reopens, we have streamlined the process for them to more easily navigate checkpoints and access their properties.” Watch on Deadline Caltrans officials noted that some restrictions will still be in place. PCH is reduced to one lane in each direction with a 25 mph speed limit between Chautauqua Boulevard in Pacific Palisades and Carbon Beach Terrace in Malibu. All signalized intersections will be flashing red. No parking or stopping is permitted, and no pedestrians are allowed in the work zone. No vehicle passing is permitted. There is one lane through the McClure Tunnel from westbound Santa Monica (10) Freeway to northbound PCH, and one lane entering northbound PCH from the California Incline. Those two lanes merge into one lane, potentially causing delays. PCH still remains closed to general traffic, “and only essential travel is recommended,” according to Caltrans. People trying to reach Malibu can use the Ventura (101) Freeway and Las Virgenes Road/Malibu Canyon Road or Kanan Dume Road. Meanwhile, Los Angeles County officials announced the reopening of four county-maintained roads in the area that were closed due to the recent storms. Piuma Road, Rambla Pacifico Street, Schueren Road and Saddle Peak Road all reopened Thursday morning. Tuna Canyon Road remains closed. Las Flores Canyon Road is open to residents only. PREVIOUSLY on February 6: Southern California Edison officials conceded in a regulatory filing today that the company’s equipment may be associated with the ignition of the Hurst Fire, which burned nearly 800 acres in the Sylmar area during the height of the January windstorm in Los Angeles. The Hurst Fire, which erupted Jan. 7 and was fully contained on Jan. 16, did not result in any structures being destroyed or cause any deaths, but did force the closure of the 5 and 210 freeways and prompted evacuations. It preceded the Hughes Fire, which broke out in the area near Castaic Lake on January 22, burned over 10,000 acres and prompted further evacuations. The region’s two other massive fires, the Palisades and Eaton fires, killed a combined 29 people and damaged or destroyed tens of thousands of structures. In a filing with the state Public Utilities Commission, Paul Pimentel of SCE wrote that while the Los Angeles Fire Department is continuing to investigate the cause of the fire, “Absent additional evidence, SCE believes its equipment may be associated with the ignition of the Hurst Fire.” The filing notes that the fire originated in the vicinity of an SCE transmission tower north of Saddle Ridge Road. SCE concedes in the filing that a conductor failure occurred on the tower the night of Jan. 7, causing damaged equipment to fall to the ground at the base of the tower. In the past 30-plus years, more than 3,600 wildfires in the state have been in some way related to power generation, transmission or distribution, according to U.S. Forest Service data as reported by the New York Times. California’s two most destructive and deadly fires, the Camp and Tubbs blazes which collectively killed more than 100 people and destroyed more than 20,000 structures, were caused by failures of power systems. More locally, the deadly Thomas and Woolsey Fires which destroyed thousands of structures in L.A. and Ventura counties in 2017 and 2018 were also caused by SCE equipment failures. SCE has already been targeted in multiple lawsuits accusing its equipment of sparking the Eaton Fire, which burned 14,021 acres in the Altadena and Pasadena areas. The cause of that fire is still under investigation, but attorneys have recently pointed to surveillance video that appears to show SCE power lines arcing in the vicinity of the fire’s origin on Jan. 7. “While we do not yet know what caused the Eaton wildfire, SCE is exploring every possibility in its investigation, including the possibility that SCE’s equipment was involved,” Pedro J. Pizarro, president and CEO of SCE’s parent company, Edison International, said in a statement Thursday. “We have been fully engaged since the start of the fires in supporting the broader emergency response, containment, recovery and investigation efforts.” SCE officials said the investigation into the fire’s cause is likely to take several more months. “Our hearts go out to everyone who has suffered losses,” Pizarro said. “We are working with the local communities SCE serves to rebuild and emerge stronger. We understand the community wants answers, and we remain committed to a thorough and transparent investigation.” PREVIOUSLY on February 4: The U.S. Army Corps of Engineers announced today it has officially begun its “Phase 2” wildfire-debris removal effort, beginning with two Pasadena Unified School District campuses that were destroyed in the Eaton Fire. The announcement marked a key milestone in the wildfire recovery effort, which began with the U.S. Environmental Protection Agency engaging in Phase 1 of the process — removing household hazardous materials from destroyed and damaged structures. While that Phase 1 process is continuing, Phase 2 debris removal will move forward at properties that have been cleared by the EPA. “Beginning Phase 2 means we’re making tangible progress toward recovery,” Col. Eric Swenson, the Army Corps of Engineers Los Angeles Wildfires Recovery Field Office commander, said in a statement. “Our teams are working with urgency and care to remove hazardous debris while ensuring the safety of the community, workers and the environment.” Phase 2 involves clearing fire-damaged properties of hazardous ash and debris. The sites being cleared to begin Phase 2 are the campuses of Loma Alta Elementary School in Altadena and Edison Elementary in Pasadena. See map below, where yellow means Phase 1 is incomplete, blue means Phase 1 is complete and Purple means deferred to Phase 2. “The safety of our students and staff is our top priority,” PUSD Superintendent Elizabeth Blanco said in a statement. “This debris removal effort will allow us to begin the recovery process with confidence, and we are grateful for the support from (the Corps of Engineers, Federal Emergency Management Agency) and our local partners.” There are also individual properties (in blue below) where Phase 1 has been completed, though the are relatively few. Corps of Engineer officials said the Phase 2 operations will expand in the coming weeks to include residential properties destroyed by the Eaton and Palisades fires. According to the Corps, if the EPA determines that a property is still unsafe to enter due to hazardous materials, they will be labeled as “deferred,” and Army crews will work to render them safe to allow the cleanup efforts to move forward. The cleanup efforts have sparked criticism from some residents concerned about the sites being used to process hazardous materials being removed from destroyed properties by the EPA. Residents, however, are being allowed to return to their properties, along with contractors and utility workers, as they assess damage and determine how to move forward. A nightly curfew for the burn areas remains in effect from 6 p.m. to 6 a.m. Checkpoints restricting access to the fire-ravaged Pacific Palisades remain in place. Returning residents and authorized contractors are being given access to the Palisades Fire burn area with access passes, which are now being distributed by law enforcement at the Disaster Recovery Center in West Los Angeles, 10850 Pico Blvd., and at the West Los Angeles Civic Center, 1645 Corinth Ave. Passes can be obtained daily from 10 a.m. to 5 p.m. Pacific Coast Highway was reopened between Santa Monica and Malibu early Monday, but a stretch of the roadway was closed later Monday due to fears of possible debris or mud flows caused by two storms bearing down on the region. PCH will remain closed until at least Friday, when the rain is expected to abate, between Chautauqua Boulevard in Los Angeles and Carbon Beach Terrace in Malibu. The Eaton Fire caused at least 17 deaths, destroyed 9,418 structures and damaged 1,073 more while burning 14,021 acres. Repopulation efforts there have been completed. At least 12 people were killed in the Palisades Fire, which burned 23,448 acres, destroyed 6,837 structures and damaged 1,017 others. The cause of both fires, which began while the region was under a red flag warning for critical fire danger due to a historic wind event that saw gusts of 80 to 100 mph, remains under investigation. The Los Angeles County Office of Medical Examiner has positively identified 18 of the 29 people confirmed dead in the two wildfires. The list can be found here. Questions continued to linger about exactly how long it would take for residents to begin the rebuilding process. The EPA has been directed to complete Phase 1 cleanup within 30 days. Status updates on the EPA’s work, including an interactive map of individual fire-affected properties, are available here. Officials urged fire-affected residents to fill out “Right of Entry” forms to either opt in or out of the free Phase 2 debris-clearance program offered by the U.S. Army Corps of Engineers. Residents have until March 31 to complete the forms, which are available online at recovery.lacounty.gov/debris- removal/ or at any FEMA Disaster Recovery Center. Swenson said previously that he anticipates the vast majority of the debris-clearance work to be completed within a year. He said previous comments about the process taking up to 18 months included potential delays involved with some properties in which ownership could be in question or the resident died. Los Angeles County Board of Supervisors Chair Kathryn Barger said the county is working on a set of guidelines for property owners who would like to put temporary “accessory dwelling units” on their fire-damaged properties, allowing them to live on site while rebuilding work is done. She noted there are pre-fabricated units available that could potentially be erected on properties quickly, providing a living space for displaced residents who have been staying in hotels or other accommodations. FEMA Disaster Recovery Centers are open at UCLA Research Park West, 10850 W. Pico Blvd., and in Altadena at 540 W. Woodbury Road, to assist homeowners with applying for aid. The center’s are open daily from 9 a.m. to 8 p.m. FEMA is also operating two other centers to provide assistance to fire victims, including those from the Hurst, Sunset and Hughes fires. Those centers are at: — Sherman Oaks East Valley Adult Center, 5056 Van Nuys Blvd., building B, operating 9:30 a.m to 5 p.m. Tuesday through Friday; and— Ritchie Valens Recreation Center, 10736 Laurel Canyon Blvd., Pacoima, operating from 9 a.m. to 3 p.m. Tuesday through Friday, and 1 to 6 p.m. Saturdays. The deadline for fire victims to apply for FEMA financial relief is March 10. According to the county, FEMA has already approved more than $54 million in housing and other assistance for 24,575 households. More than 117,200 individuals have registered for FEMA assistance. By the time all the damage is assessed, the fires are expected to constitute the costliest natural disaster in U.S. history. The UCLA Anderson Forecast released a report Tuesday estimated that the two fires caused property damage and capital losses ranging between $95 billion and $164 billion, with insured losses at $75 billion. PREVIOUSLY on January 19: As the Santa Ana winds quieted over the weekend, there was more good news regarding containment figures for both the Palisades and Eaton blazes. The former fire is 52% contained (up from 43% yesterday) and the latter fire is contained at 81% (risen from 73%). The reprieve is much-needed for fire personnel heading into the week as another extreme wind event is expected from Monday through Tuesday night. In preparation for isolated gusts that could reach anywhere from 50 to 100 mph in wind-prone areas, as well as low humidity, red-flag parking restrictions are in place as forecasters issue a “particularly dangerous situation warning” for many Los Angeles and Ventura county locations. PREVIOUS, Jan. 18: More evacuation orders were lifted today as containment of the Eaton Fire and Palisades Fire has risen overnight due to firefighting efforts working in tandem with breaks in weather, including better humidity levels and lower winds. Containment of the Eaton blaze grew to 73%, up overnight from 65%, with helicopters providing water-dropping support to extinguish hot spots in steep, inaccessible canyons near Winters Creek, Mt. Lowe and Mt. Wilson. Meanwhile, containment of the Palisades Fire rose to 43%, up from 39% last night. While winds are expected to remain calm through the weekend, another Santa Ana wind event is expected to move in Monday and Tuesday, creating new risks for critical fire weather conditions, as well as rapid spread of any new blazes. According to the National Weather Service, gusts could reach 50 to 60 mph. PREVIOUS, Jan. 17: Cooler temperatures and calm winds enabled firefighters to expand containment on the Palisades and Eaton fires Friday, as some residents were being allowed to return to their homes. While most evacuation orders are expected to remain in place for at least another week, authorities siad evacuation orders were eased or lifted in more than three dozens zones on the outskirts of the Palisades burn area. Residents in about a dozen neighborhood zones were cleared to return to their homes on Thursday. In the Eaton Fire area, evacuations were lifted in areas southwest of Altadena Drive, north of New York Drive and east of Allen Avenue; an area east of Lake Avenue and south of Mendocino Lane; and south of Church Canyon Place, east of Old Toll Road and west of Sunset Ridge Road. On Thursday afternoon, residents along Canyon Crest Road into The Meadows east of El Prieto Road were allowed to return home. As of Friday, the Eaton Fire had burned 14,117 acres, with containment at 65%, up from 55% Thursday. The Palisades Fire is now 31% contained, up from 27% Thursday night. It has burned 23,713 acres, according to CalFire. At least 27 people are confirmed dead so far in the fires. Los Angeles Mayor Karen Bass on Friday appointed businessman and longtime civic leader Steve Soboroff to lead rebuilding efforts in the aftermath of the devastating Palisades Fire. “Steve Soboroff’s name is attached to hope,” Bass said. “It is attached to energy, and it is attached to many, many accomplishments. He will recommend a comprehensive city strategy for rebuilding and for expediting — expediting is a very important word here — we want to expedite the return of residents, businesses, schools, nonprofits and parks.” Bass is expected to issue a series of executive orders next week relating to recovery efforts.next week relating to recovery efforts. As firefighters are getting a reprieve from the weather at the moment, officials warn of yet another Santa Ana event this coming Monday and Tuesday. Los Angeles Public Works Department chief Mark Pestrella warned that the destruction wrought by the fires poses a danger even when the Santa Anas stop. “Properties have been damaged beyond belief. They are full of sediment, debris and hazardous materials,” he said, while assuring that debris removal would be done in conjunction with city of L.A. and the Federal Government, which would first clear away any toxic remnants. But until those toxic remnants and other debris were cleared away, a potentially greater danger, said Pestrella, could be not fire but water from winter rains. “Power, water and sewer are damaged to the point that they cannot be delivered safely in most of the areas.” Pestrella said his department was “assessing impact to the flood control system” in both the Palisades and Altadena. “Both areas suffered watershed damage burned to such a significance that we expect massive debris-laden flows when it rains,” he cautioned. “In an event that we have major rain, we do expect that all of the street areas and all of the communities will be impacted by debris flows that could be hazardous to human health. In order to address this, we are developing plans to capture and hold this debris back as much as we can during a rain event.” Southern California is currently in the grips of a La Niňa weather cycle, which portends a colder, dryer winter — thus the unprecedented January wind event of the past week. But that could change. “I have to give everybody and early warning that we do expect the window for rain to open later this month,” said Pestrella, “so we are already deploying labor forces into the area in order to ensure that the flood control system is ready — as well as our street system is ready — as much as possible for that rain event.” Southern California’s rainiest months are generally January-March, but the current long range forecast from the National Weather Service for the region predicts that “there is a 40 to 50% chance of below normal precipitation in Southern California January 22-26. Below normal is defined as the driest third of climatologically observed precipitation for mid to late January.” According to Cal Fire, detailed damage inspection maps for properties within the Palisades Fire footprint showing damaged or destroyed homes — as well as homes that are not damaged or destroyed — can be found at www.fire.ca.gov/incidents/2025/1/7/palisades-fire. Los Angeles County officials said its damage assessments can be viewed at www.recovery.lacounty.gov/palisades-fire. They will be updated daily in real time. CalFire reported that detailed damage inspection maps for properties within the Eaton Fire footprint showing damaged or destroyed homes — as well as homes that are not damaged or destroyed — can be found at fire.ca.gov/incidents/2025/1/7/eaton-fire. Los Angeles County officials said its damage assessments can be viewed at recovery.lacounty.gov/eaton-fire. Those will also be updated daily in real time. The fires have also forced thousands of pets from their homes over the last two weeks, increasing the burden on local animal shelters and rescue groups who are scrambling. Here are some ways to help animals:   — Los Angeles and Pasadena/Altadena have phone numbers for those needing help with animals left behind in fire zones. The city of L.A.’s number is 213-270-8155, and for Pasadena and Altadena, it’s 626-577-3752.   — For those who have lost or found a pet, the city and county are partnering with Petco Love Lost, a free national lost-and-found pet database at https://petcolove.org/lost/.   — Earlier this week, the Department of Animal Services and the L.A. County Department of Animal Care and Control issued a joint call for residents to help animals in need and relieve critical overcrowding at shelters by adopting or fostering those without homes. More information is available at LAanimalServices.com/about-fostering, and animalcare.lacounty.gov/become-a-foster-caretaker. PREVIOUS, Jan. 15: Two more people were behind bars today for allegedly setting small fires in Los Angeles as crews continued efforts to contain the major blazes that have killed dozens of people and destroyed roughly 13,000 structures. Los Angeles County Sheriff Robert Luna reported there have been 44 arrests so far, 36 in the Eaton Fire area and eight in the Palisades Fire area. Those apprehensions include two men who allegedly impersonated firefighters in an effort to burglarize homes. Los Angeles Police Chief Jim McDonnell reported 14 arrests as of Tuesday morning, including curfew violations, impersonating a police officer, impersonating a firefighter, DUI, vandalism, ammunition possession, burglary and other offenses. McDonnell said officers responded at 5:15 p.m. Tuesday to Glenoaks and Van Nuys boulevards, where a resident had detained a suspect who allegedly set fire to a tree. The resident was able to douse the fire and call police. When officers arrived, the suspect admitted setting the fire, saying “he liked the smell of burning leaves,” McDonnell said. At 9:30 p.m. Tuesday, officers responded to Santa Monica Boulevard and Vermont Avenue, where a suspect was setting fire to piles of rubbish and trash, McDonnell said. Officers were able to douse the flames and arrest the suspect, who told the officers she “enjoyed causing chaos and destruction,” police said. “There are people out there who, this is what they do,” McDonnell said. McDonnell on Tuesday reported three other arrests that occurred Sunday and Monday in the San Fernando Valley and West Los Angeles, all involving people who were allegedly setting small fires. L.A. County District Attorney Nathan Hochman on Monday announced charges against 10 people — including eight for looting in recent burn areas and one for arson unrelated to the major blazes. That latter arrestee was Jose Carranza Escobar, who pleaded guilty. Hochman’s office released video of his arrest. Hochman said Wednesday morning his office had charged two additional people in arson cases. Jaime Mota, 37, is charged with one count of felony arson of property and one count of felony arson during a state of emergency. Mota is being held on $350,000 bail and if convicted as charged, faces up to seven years in prison, Hochman said. At about 2 p.m. on Saturday, Mota allegedly lit a fire in the back of a warehouse/shipping yard in the city of Industry, causing bushes, stacks of pallets and the back portion of a tractor-trailer to burn, according to the DA’s Office. The second new suspect, Ruben Michael Montes, 27, is charged with one count each of felony arson during a state of emergency; felony possession, manufacturing or disposing of flammable or combustible materials, incendiary devices, or explosives with the intent to commit arson; and misdemeanor reckless burning of personal property. At about 12:30 p.m. Sunday, Montes started a fire at the San Gabriel River (605) Freeway underpass and Rivergrade Road in Irwindale, prosecutors said. Hochman said Montes faces allegations of violating probation after committing arson, engaging in violent conduct indicating a serious danger to society, and having a history of prior felony convictions. The statutory bail for Montes is $400,000. If convicted as charged, he faces up to 14 years in prison, and was also expected to be arraigned Wednesday in the court’s West Covina branch, the DA said. Another man, Juan Manuel Sierra, was arrested Thursday in connection with the nearly 1,000-acre Kenneth Fire after first being apprehended by local residents. Sierra was reportedly caught near the source of the West Hills blaze with what appeared to be a blowtorch. He has not been charged, but remains a “person of interest.” Sierra was arrested for violating felony probation related to immigration. He is being held in a L.A. County jail. Meanwhile, leaders of federal and local law enforcement agencies have partnered to create a joint task force to investigate and prosecute fire-related crimes — including arson, looting, burglary, fraud and illegal drones — as Los Angeles County recovers from devastating wildfires, it was announced today. The Joint Regional Fire Crimes Task Force will focus on investigating and prosecuting people who try to exploit the wildfire crisis, according to the U.S. Attorney’s Office. The task force includes representatives of the U.S. Attorney’s Office; the FBI; the Bureau of Alcohol, Tobacco, Firearms and Explosives; Homeland Security Investigations; the Los Angeles County District Attorney’s Office; the Los Angeles City Attorney’s Office; the Los Angeles Police Department; and the county Sheriff’s Department. PREVIOUSLY at 8 a.m.: Winds picked up again early Wednesday as firefighters worked to hold and expand containment lines on the Palisades and Eaton fires. A day after firefighters got a bit of a break with lighter winds than expected, gusts were clocked at up to 35 mph on the coast and in valleys and 55 mph in the mountains before dawn Wednesday, National Weather Service meteorologist Todd Hall said. They are expected to increase through the morning. The death toll is now 25 for the fires combined, and is expected to rise. The Palisades Fire has burned 23,717 acres and is now 19% contained. The Eaton Fire has scorched14,117 acres, with containment rising to 45% Wednesday morning, up from 35% Tuesday night. Red flag warnings of critical fire danger will be in place over much of Southern California through 6 p.m. Wednesday, with some areas under the alert until Thursday afternoon. PREVIOUS, Jan. 13, 4:25 PM: “There’s a special place in hell for you,” said Senator Adam Schiff to those who would loot neighborhoods hit by the recent fires. Then, referencing law enforcement officials standing on stage with him, Schiff continued, “And if the folks behind me have anything to say about it, there’s a special place in jail for you, too.” The Senator’s comments came just minutes after Los Angeles District Attorney Nathan Hochman announced that nine people had been charged for looting and burglary related to the Eaton and Pasadena Fires. Hochman said one person had been charged for arson. Sentences could include decades to life in prison. Three of those charged are accused of stealing $200,000 in goods from a home in Mandeville Canyon. Four others allegedly broke into a residence in Altadena and stole a number of items, including the Emmy award of the person who lived there. The arson suspect was arrested in Azusa for setting a fire in a local park on January 10. Today, the DA released video of that arrest. In other fire-related legal news, four lawsuits were filed today accusing Southern California Edison of failing to de-energize power equipment despite dire wind and fire warnings from the National Weather Service. “We’ve seen the photos, so we know that there was fire there. We don’t know what caused it,” the CEO of Edison’s parent company, Pedro Pizarro, told ABC7’s David Ono on Monday about allegations his company’s equipment caused the Eaton Fire.  PREVIOUSLY at 12:05 p.m.: Containment on L.A.’s two largest fires increased slightly overnight as firefighters brace for more extreme Santa Ana winds that could quickly spread the blazes. A red flag warning is in place for parts of the city of Los Angeles and county, with wind gusts of up to 70 mph forecast between 4 a.m. Tuesday and noon Wednesday — strong enough to potentially cause “explosive fire growth,” according to the National Weather Service. The service’s Los Angeles office also emphasized areas that are in a so-called Particularly Dangerous Situation. That region, outlined in purple below, stretches from Ventura in the west to above Fillmore in the north to the area of the Eaton Fire in the east to Malibu in the South. See map. The NWS L.A. described the conditions ominously in a statement posted to social media. “PDS Red Flag Warnings are for the extreme of the extreme fire weather scenarios. In other words, this setup is about as bad as it gets. Stay aware of your surroundings. Be prepared to evacuate. Avoid anything that can spark a fire,” the statement read. Governor Gavin Newsom echoed that warning in the tweet last night, placing the current wind event in the context of others that produced destructive fires in L.A. It also was learned today that the remains of 95-year-old Dalyce Curry, an actor who appeared in films such as The Blues Brothers, The Ten Commandments and Lady Sings the Blues, among others, were found in her burned-down Altadena home Sunday. In a Facebook post on Sunday, her granddaughter Dalyce Kelley paid tribute to her late grandmother. “We had a great run. She impacted my life in so many ways,” Kelley wrote. “This loss is devastating.” The Palisades Fire has remained at 23,713 acres burned, but containment increased overnight from 11% to 14%. The Eaton Fire, burning in the hills above Altadena, is now 33% contained. It has charred 14,117 acres. As of this morning, both blazes were experiencing only sparse active fire activity, with crews focused on dousing hot spots, jumping on spot fires and extending the containment lines.  Twenty-four people are confirmed dead in the fires, and officials say that number is expected to rise. PREVIOUS, 8:35 PM, Jan. 12: Certain evacuation zones have been reduced or lifted completely as progress is made on the dual Palisades and Eaton blazes. However, authorities have confirmed that the death toll, previously at 16, has risen to 24. Six people have lost their lives to the Palisades blaze, while 16 fatalities stem from the Eaton Fire. This comes after Los Angeles County Sheriff Robert Luna said 13 people were reported missing as a result of the wildfires, a figure that has since risen by 3. In terms of hopeful news, areas including Sierra Madre, Arcadia and northern Pasadena have been downgraded to evacuation warnings, and a couple zones were lifted completely. Areas in northwest Monrovia have also been lifted. For the Palisades Fire, an evacuation order for the area to the west of North Sepulveda Boulevard and I-405 has been downgraded to a warning. This is an improvement from a complete shutdown for sections of the 405 Freeway, which were blocked to ward off excess traffic in the West Los Angeles area. The current cost estimate is at $150 billion, making this crisis the most expensive Southern California fire to date. The 2018 Camp Fire, which previously held that title, cost approximately $30 billion. In other news, a majority of LAUSD schools will reopen tomorrow, save the campuses in the most severely impacted areas with evacuation orders, as air quality inspections and HVAC filter replacements for more than 1,000 schools aim to be conducted by Sunday night. However, firefighters are bracing for gusty winds up to 60 miles per hour, which are said to be resuming between Monday night and Wednesday. As of now, containment and acreage on both fires remain the same. So far, 29 people have been arrested due to curfew-related incidents, not including the two individuals who were apprehended on suspicion of flying an unauthorized drone in wildfire-impacted areas earlier today. PREVIOUS, 8:40 AM, Jan 12: A break in the winds and strong aerial assault overnight helped firefighters in their battle against L.A.’s two largest wildfires, but another round of strong Santa Ana winds is expected to move in later today. According to CalFire, “Sunday through Wednesday, widespread critical fire weather conditions are expected with strong Santa Ana winds. The strongest winds are likely on Tuesday with the Red Flag Warning expected to extend till 6 p.m. Wednesday evening.’ The Palisades Fire has scorched 23,707 acres and is now 16% contained. The Eaton Fire in Pasadena/Altadena has charred more than 14,000 acres but firefighters increased containment overnight from 15% to 27%. At least 16 people are confirmed dead in both fires and that number is expected to rise. All mandatory evacuations and warnings remain in effect. PREVIOUS, 8:30 PM, Jan. 11: Sixteen individuals are now dead as a result of the Eaton and Palisades blazes, the Los Angeles County Department of Medical Examiner has confirmed. In total, there are five deaths attributed to the Palisades Fire and 11 related to the Eaton Fire. The three additional fatalities, up from 13 reported earlier, were discovered in Altadena today. One was found in the 3000 block of Krenz Avenue, one in the 200 block of Wapello Street and one in the 30 block of West Pine Street, per KTLA. Several of the deceased have been identified on social media or in other reports, including 66-year-old Victor Shaw, who died defending his Altadena home that had been in his family for the better part of a century. His relatives said he had some health issues that limited his mobility, and he died with a garden hose in his hand. Additionally, the county office identified one Palisades victim as an 80-year-old man, who died at a local hospital, with his identification withheld pending notification of kin. The department said the aforementioned deaths are still under investigation and subject to processing at the facility. In addition to federal, interstate and intrastate support, some 14,000 personnel were joined earlier today by a team of firefighters from Mexico, bolstering figures by contributing more than 70 first responders and disaster relief workers from Mexico’s National Forestry Commission and Ministry of Defense. Canada has also sent dozens of reinforcements and air tankers, though its Super Scooper plane — which can gather 1,500 gallons of ocean water to drop on the fires — has been grounded following a collision with an unauthorized drone. Acreage on the dual fires remain at upward of 23,000 for the Palisades Fire with 11% containment and more than 14,000 for the Eaton Fire with 11% containment. For the latter, 7,000 structures have been destroyed or damaged, with that figure expected to rise, and an additional 40,000 said to be threatened. PREVIOUS, 4:00 PM: At over 22,000 acres burned, the Palisades Fire made a strong northeast push last night, threatening the homes located in the hills north of Brentwood. With containment remaining at 11% and a large evacuation zone stretching from the Pacific Ocean to the San Diego Freeway, as well as north to the Encino Reservoir, sections of the 405 Freeway remain closed to ward off excess traffic in the West Los Angeles area. Per CNS, officials with the J. Paul Getty Trust said today that the Getty Center near Brentwood and the Getty Villa in the Pacific Palisades have both remained intact amid the wildfires. “It was a watchful but fortunately uneventful night up here at the Getty Center. We’ve been told to anticipate stronger winds later in the day and are closely monitoring the situation. Our galleries are safe and protected. Aside from a few hot spots, the Villa remains stable,” they said in a statement. As noted, first responders are preparing for stronger gusts later this evening heading into Sunday, expecting winds of 30 to 40 miles per hour. Another strong wind event is expected between Monday night and Wednesday, with gusts between 40 to 60 miles per hour. Across town, the Eaton Fire’s acreage has climbed to over 14,000, but containment has also recently increased to 15%. As a result, evacuation orders have been lifted in parts of La Cañada Flintridge, Duarte and the gated communities of the Bradbury Estates. PREVIOUS, 9:00 AM, Jan. 11: Firefighters worked through the night to curb the spread of the Palisades Fire ahead of high desert winds which are expected to intensify over the next few days. The blaze expanded northeast late Friday into the San Fernando Valley, prompting expanded mandatory evacuations and warnings. A mandatory evacuation order remains in effect for an area from Sunset Boulevard to Encino Reservoir, and from the 405 Freeway west to Mandeville Canyon, including the Getty Center, as well as voluntary evacuations that stretch to Ventura Boulevard, including a large swathe of Encino and parts of Brentwood.  Eleven people have been confirmed dead in the Palisades \u0026 Eaton fires combined, L.A. County Sheriff Robert Luna announced at a Saturday morning news conference. By Saturday afternoon, the death toll in Eaton grew to eight, bringing the total to 13 confirmed deaths. The Palisades Fire has burned 21,596 acres and is now 11% contained, Luna said. At least 426 homes have been destroyed, along with 5,316 structures, including automobiles, and some 105,000 people remain evacuated. Luna said the L.A. County Sheriff’s Department has received 13 missing persons reports related to the fires, but some of those could overlap with fatalities. The National Weather Service issued a high wind watch for the San Gabriel Mountains, western Santa Monica Mountains Recreational Area and the Antelope Valley (14) Freeway that will be in effect Saturday night through Sunday afternoon. Those areas could see winds ranging from 30 to 50 mph, with possible gusts up to 60 mph. More powerful winds are expect to hit the region early next week.PREVIOUS, 8:40 PM, Jan. 10 : The Palisades Fire Friday night got over the ridge of the Santa Monica Mountains, threatening the San Fernando Valley. That triggered a new mandatory evacuation order for an area from Sunset Boulevard to Encino Reservoir, and from the 405 Freeway west to Mandeville Canyon. That region was previously under an evacuation warning. Voluntary evacuations stretch all the way to Ventura Boulevard, covering a large swathe of Encino as well as parts of Brentwood. New evacuation warnings have been issued for areas of Bel Air, just east of the 405 freeway. PREVIOUS noon: A break in the weather is allowing firefighters to make some progress Friday against multiple fires that continue to burn throughout the Los Angeles area. Winds are slightly calmer Friday, helping firefighters in their efforts, but more wind and dry conditions are expected to complicate efforts into next week. Ten people are confirmed dead, according to the Los Angeles County Medical Examiner, but officials but warn the actual toll will remain unclear until access to all neighborhoods is possible. More than 153,000 people remain under evacuation orders and 10,000 structures have been destroyed between the Palisades and Eaton fires, officials said. Officials warn it will take time to get an accurate and complete death count. Meanwhile, Red Flag wind warnings remain in effects for Los Angeles County through 6 p.m. Friday, and the air-quality alert is in place until 5 p.m. And there’s more bad weather news one the way, as powerful winds are excpected to hit the region again early next week. “Right now it looks like Tuesday will be the strongest day,” National Weather Service forecasters said. “Unlike this week’s very dangerous event, which was more of a northerly wind event, this one is very likely to be a traditional [northeast] Santa Ana event. Still, the low humidities and the winds will combine to bring enhanced fire danger to the area.” On Friday, a new brush fire in the northern section of Granada Hills, named the Archer Fire, ignited shortly before 10:30 a.m., forcing an evacuation warning that included heavily urban areas of the San Fernando Valley community before forward containment could be achieved. The Los Angeles Fire Department said 31.5 acres had been burned. Its center appeared to be in or around the spacious and wooded O’Melveny Park just above Sesnon Boulevard, with neighborhoods nestled directly to the south if it. Before being slowed, an evacuation warning had included Balboa Boulevard and the 5 freeway to the east and Tampa Boulevard to the west, stretching as far south as Rinaldi Boulevard, a main east-west thoroughfare in the northern valley. The Hurst Fire in Sylmar is just a few miles to the northeast of where the Archer Fire started, across the 5 and 210 freeways. The Hurst Fire is now 37% contained. The Palisades Fire, which has burned some 20,000 acres and claimed the lives of two people, is 8% contained. Firefighters quickly got the upper hand on the Kenneth Fire, which erupted Thursday afternoon near West Hills northwest of Los Angeles. It’s now 35% contained. The blaze moved into Ventura County and firefighters managed to stop the flames from spreading. As an investigation into the cause of the fire was underway, police responded to reports of a man attempting to light a fire on Ybarra Road in Woodland Hills who had been held down by residents until law enforcement arrived. The man was interviewed by LAPD investigators and Ventura County Sheriff’s deputies, but they determined there was “not enough probable cause” to arrest him as a possible arson suspect. However, the man was arrested on suspicion of a felony probation violation. The Eaton Fire in the Altadena/Pasadena area has burned nearly 14,000 acres and is 3% contained. Los Angeles County Fire Anthony Marrone says 7,000 structures are believed to have been damaged or destroyed in the Eaton Fire. PREVIOUS, Jan. 9, 5:50 PM: Two deaths have now been reported in the Palisades Fire, which has grown to nearly 20,000 acres, Los Angeles City Fire Chief Kristin Crowley announced at a late afternoon news conference Thursday. The two deaths included one body that was removed from the rubbleof a home along Pacific Coast Highway, Crowley said. Earlier Thursday, representatives of the county Medical Examiner’s Office removed human remains from the ruins of a home in the vicinity of Duke’s restaurant in Malibu.  As weary firefighters and residents are still grappling with the ongoing devastating wildfires, a new fire erupted Thursday afternoon near West Hills, northwest of Los Angeles. The Kenneth Fire had burned 960 acres by 5:30 p.m. No injuries or structural damage have been reported. A mandatory evacuation order was issued initially for an area between Vanowen and Burbank Boulevard, from County Lane Road east to Valley Circle Boulevard, but shortly before 5:30 p.m., the mandatory order was reduced to an evacuation warning, according to LAFD. Earlier evacuation warnings that were issued for an area bordered by Ingomar and Saticoy Streets south to Burbank Boulevard, from Valley Circle Boulevard east to Woodlake Avenue, have been lifted. PREVIOUS, 3 PM: Fire officials estimated that more than 5,300 structures have been destroyed by the Palisades Fire. The previous destruction estimate was 1,000+ structures burned. The news was per CalFire officials and based on an aerial survey conducted on Wednesday. A new evacuation order has been issued for a portion of Malibu on the western flank of the Palisades Fire. The section of the coastal community just given the “go” order lies north of the Malibu Pier, south of Piuma Road and east of Malibu Canyon Drive. It is sparsely populated, but the homes that DO lie within its boundaries are multi-million dollar homes. The evacuation zone also lies within the Franklin Fire burn scar that was established when that blaze swept through the region less than a month ago. That should help firefighters. The fact that the order has been issued despite the previous burn scar also says something. PREVIOUSLY at 2:01 PM: Human remains have been found in the rubble of one of the homes destroyed by the Palisades Fire, according to multiple news reports. Sheriff’s deputies made the discovery after being asked to do a welfare check on a resident who decided to stay behind. What they found was a home that had been burned to the ground in the vicinity of Pacific Coast Highway and Las Flores Canyon Road. While there they discovered the remains. The coroner’s truck was then called in. The victim has not been identified. The discovery could bring the total number of lives confirmed lost due to the fires across Los Angeles to six. The death toll from the Eaton Fire stands at five people, according to local officials. Over at that blaze on the east side of L.A., the current evacuation orders are as follows: Additionally, the entire Angeles National Forest is temporarily closed for public safety and the protection of natural resources through Wednesday, January 15. PREVIOUSLY at 11:58 AM: An immediate evacuation has been ordered for Mount Wilson and the Observatory as the Eaton Canyon Fire advances. Mount Wilson, above Los Angeles, is home to numerous television and radio transmission towers which are utilized for stations in the greater L.A. area. At last report, the fire had consumed 10,600 acres in the Pasadena and Altadena areas and was zero percent contained. There was some optimism earlier due to calmer winds Thursday, with some evacuation orders lifted. There are no homes in the area, but flames could be seen near the towers and other structures at the summit, NBC4 reports. The Eaton Canyon fire has left at least five people dead and more than 1,000 structures damaged or destroyed. Numerous injuries also have been reported. Also today, FilmLA gave an update on film permits for Greater Los Angeles: The past few days have brought unprecedented risk to life and property from multiple area wildfires, while also placing extreme demands on public safety personnel.With deepest appreciation for the efforts of local firefighters, police and paramedics at this difficult time, we advise the production community that personnel resources ordinarily available to support film production may not be available during the local State of Emergency. The numerous fires burning in Greater Los Angeles affect multiple City and County jurisdictions, including some served by FilmLA and others that are not. If prior to the fires you obtained permission from FilmLA to film in or near an evacuation zone, expect to have your permit canceled. New applications to film in or near these areas will be denied, until local permit authorities instruct us otherwise. Outside of evacuation zones, all filmmakers planning to work this week in any jurisdiction served by FilmLA, must verify that public safety personnel assigned to you will be available before you proceed.     The number of damaged or destroyed structures in the devastating Palisades Fire “is believed to be in the thousands,” Los Angeles City Fire Chief Kristin M. Crowley said during a news conference Thursday morning. “It is safe to say that the Palisades Fire is one of the most destructive natural disasters in the history of Los Angeles.” Many of the structures lost are believed to be businesses or homes, Crowley said. Fierce winds have calmed slightly as firefighters continue to battle the still out-of-control blazes throughout the Los Angeles area, allowing for progress in containment and all-important aerial firefighting efforts to resume. Winds gusts up to 60 MPH are expected to continue through Thursday, according to CalFIre. Red flag warnings remain in effect through 6 p.m. Friday for much of L.A. and Ventura counties due to moderate to strong Santa Ana winds and low humidities, according to the National Weather Service. Nearly 180,000 people remain under evacuation orders, LA County Sheriff Robert Luna said at the morning news conference. The evacuation order extends throughout the Pacific Palisades to the Pacific Ocean, including portions of Santa Monica, Malibu and Topanga. Residents and businesses in Calabasas remain under an evacuation warning on Thursday. As to fatalities, Luna previously said five people had died in Pasadena’s Eaton Fire but today said the number of fatalities is uncertain, with the true extent of the damage still being assessed. Acreage statistics have remained mainly unchanged since Wednesday. The Palisades Fire has burned 17,234 acres with zero percent containment, Luna said. The Eaton Fire in Pasadena and Altadena has charred 10,600 acres and is zero percent contained. The Sunset Fire in the Hollywood Hills scorched nearly 43 acres and also is zero percent contained. All evacuation orders were lifted for those impacted by the Sunset Fire at 7:30 a.m. Thursday. One of the fires that also erupted Wednesday, the Woodley Fire near the Sepulveda Basin in the San Fernando Valley, is fully contained at 30 acres. Luna also said 20 people have now been arrested for allegedly looting in the various fire areas in the county. “Unfortunately, I expect that to go up,” he said, adding that deputies will begin arresting anyone who is in an evacuation area without authorization. PREVIOUS, 12:30 AM: Nearly 2,000 structures have been burned across Los Angeles in the past 48 hours, 1,000 in the Palisades Fire and 972 in the Eaton Fire in and around Altadena. Additionally, in addition to the five people who have been killed in the latter blaze, five firefighters have also been injured. Of note, at least one firefighter was hurt battling the Palisades Fire. The area scorched by the Palisades Fire was updated late tonight from a bit over 15,000 acres to 17,234 acres. Three more structures burned in Studio City when what seemed to be spot fires caused multiple ignitions. On the other side of the hill, the Sunset Fire near Runyon Canyon scorched 60 acres in the Hollywood Hills. In Santa Monica, city officials instituted a curfew from from sunset to sunrise in the areas where a mandatory evacuation order is in effect. PREVIOUSLY at 2:54 p.m.: Los Angeles County Sheriff Robert Luna says five people have now died in the Eaton Fire burning in the Altadena and Pasadena areas. Luna told KNX News there is no additional information available about the deaths. The number of lives lost stood at two this morning. President Joe Biden has approved a major disaster declaration in response to the wildfires burning in the Los Angeles area, which allows those impacted to immediately access federal funds. FEMA also approved a grant to reimburse the state for firefighting costs. The federal government has provided five U.S. Forest Service tankers and 10 firefighting helicopters to support local and state operations. Biden appeared at a Santa Monica fire station and in a statement posted to X, he said, “Over 100,000 people have been ordered to evacuate communities impacted by the Southern California wildfires. At least two people have been killed. And many more are injured — including firefighters. It’s devastating. To the residents of Southern California: We are with you.” Meanwhile, Former President Barack Obama also weighed in. Also, the City of Santa Monica has updated its evacuation order to include the portion of the city north of Montana and west of 11th Street. The area was previously under an evacuation warning. A new warning was issued for the section of the city that runs south to Wilshire Blvd., west to the Pacific Ocean and east to 10th Ct. President Biden was briefed by local officials this morning on the battle against the four major wildfires ringing Northern Los Angeles and it wasn’t good news. Per an Associated Press analysis, the Palisades Fire on L.A.’s Westside is now the most destructive in the city’s history, having destroyed 1,000 structures. Previously, the 2008 Sayre Fire in Sylmar that destroyed 604 structures held that dubious distinction. For those with longer memories who recall the devastating Bel-Air Fire in 1960, that blaze took close to 500 structures. Among those structures was Will Rogers’ historic ranch house at Will Rogers State Park. The State Parks and Recreation Department announced the loss today along with “more than 30 structural losses at Topanga State Park and Will Rogers SHP.” As of 11:20 a.m. this morning, the Palisades Fire had grown to more than 11,800 acres, more than double the number released earlier this morning. By 1:30 p.m., that number had jumped to 15,832 acres. The Associated Press reported that over 1.5 million people in Southern California were without power due to the fires and winds. Of those, 957,000 were in L.A. County and 334,000 in Ventura County. On the opposite end of L.A. County the Eaton Fire, which started last night above Altadena, had grown nearly as large at 10,600 acres burned. Two other fires, the Hurst Fire which broke out in Sylmar near the junction of the 5 and 14 Freeways and the Woodley Fire in the Sepulveda Basin, were at 700 acres and 30 acres, respectively. Around 1 p.m., Los Angeles County Supervisor Kathryn Barger said between 200 to 500 structures had been destroyed, and another 13,000 structures were at risk. More than 32,500 residents were placed under evacuation orders in the nearby regions including Pasadena and Altadena, she said. One of the structures that was destroyed in the fire was the Pasadena Jewish Temple \u0026 Center. All those blazes were fanned by heavy, unpredictable winds. The top gusts over the past 48 hours include Mount Lukens Truck Trail above La Crescenta at 100 mph, Magic Mountain Truck Trail near Sylmar at 90 mph, Saddle Peak in Malibu at 98 mph, Hollywood-Burbank Airport at 84 mph and Eaton Canyon at 70 mph. A portion of that flank of the fire was nearing the Franklin Fire burn scar, which could prove helpful to firefighters. Per the National Weather Service, “The high speed river of air remains over LA County this morning and is fueling a widespread major wind event. The core of this low level jet will slowly move southward during the day and this will cause the winds over LA to slowly decrease. Since the wind speeds are so high now (mtn gusts 70 to 90 mph) the slow decrease will not bring the winds down to below warning levels until early evening.” Another Santa Ana event is on tap for Friday, according to the NWS. L.A. County emergency officials said this morning that more than 50,000 people had been evacuated due to the fires and more than 1,400 firefighters were engaged. More than 320,000 people were reportedly without power. The evacuation/warning zones for the Palisades blaze was expanded to the west this morning, with an area west of Malibu Canyon Road encompassing Malibu Creek State Park and the historic M*A*S*H set and the area where the original Planet of the Apes and many other films and TV shows were shot. See the yellow area on the left of the map below. At noon, KTLA5 broadcast video of the fire making a push north toward Old Topanga and Calabasas at Saddle Peak Road. The outlet’s airborne reporter, from his vantage in a helicopter, said the fire seemed to be spreading “in every direction.” In addition to the devastation in the hills, homes along PCH were also hit. The good news is that the evacuation order zone established last night in Santa Monica — north of San Vicente — did not grow. Over near Altadena, the evacuation zone — in red below — grew massively overnight as flames moved into neighborhoods below Eaton Canyon, where the fire sparked. The evacuation warning zone expanded in nearly every direction, including into the City of Pasadena north of the 210. All of those blazes are currently at 0% containment. PREVIOUSLY at 8:39 a.m.: Fierce winds continue to drive multiple wildfires in the Los Angeles area, leaving two people dead, multiple people injured and more than 320,000 people without power. The Palisades Fire has churned through more than 5,000 acres and destroyed some 1,000 structures, Los Angeles County Fire Anthony Marrone said at a morning news conference in Pacific Palisades, covered by all major broadcast and cable networks. There are a “high number of significant injuries to residents who did not evacuate, in addition to first responders who were on the fire lines,” he said. The cause of the fire is unknown and is under investgation. Television news footage shows homes on the beach in nearby Malibu burned to the ground. The Eaton Fire in Pasadena, which broke out late last night, has burned over 2,000 acres. Two civilians are reported dead and multiple people have suffered significant injuries, Marrone said. An estimated 100 structures have been destroyed. The cause of the Eaton Fire also is unknown and under investigation. One of the structures destroyed in the Eaton fire was the Pasadena Jewish Temple \u0026 Center, NBC4 reported. The Hurst Fire in the San Fernando Valley, which also broke out late yesterday, has burned 500 acres. In addition to the Palisades, Eaton and Hurst fires, a fourth fire — the Woodley Fire in Sepulveda Basin — has broken out. A fifth one, the Tyler Fire, started burning in Riverside County, scorching 15 acres so far. A smoke advisory has been issued around much of the Malibu Coast to Santa Monica, stretching all the way east to Pasadena, through 5 p.m. Wednesday. The Palisades Fire has destroyed many parts of its namesake enclave, including portions of Palisades Village and, up the coast a bit, The Reel Inn and Topanga Ranch Motel on PCH at Topanga Canyon Boulevard. The fires have forced the closure of Universal Hollywood Studios theme and Universal CityWalk, as well as access to the Hollywood Sign, Griffith Park and Los Angeles Zoo. The blaze continued to spread, fanned by high winds that topped out at 38 mph in the Palisades, 56 mph in Topanga and 59 mph at the Santa Monica Airport at 9:34 p.m. In Eastern Malibu, Saddle Peak clocked gusts to 98 mph at 9:37 p.m. Those wind speeds are expected to increase in the coming hours before lessening somewhat just before dawn. Winds are expected to remain high until Wednesday evening in most areas, with some pockets seeing elevated gusts through Friday. As a result of the firestorm, a 25-year-old female firefighter sustained a serious head injury as a result of the Palisades Fire. She was treated at the scene and taken to a hospital for further evaluation and treatment, according to Los Angeles Fire Department spokesman Capt. Erik Scott. Scott also said multiple burn victims were reported walking toward Duke’s Malibu restaurant at approximately 9 p.m. Incident operations redirected medical resources to the location to provide evaluation and treatment. The City of Santa Monica has issued an evacuation order for all areas of the city north of San Vicente. “Evacuation Order: Immediate threat to life. This is a lawful order to LEAVE NOW. The area is closed to public access.” See the map below from the Santa Monica Police Department for the exact parameters of the order (in red) as well as the area north of Montana, which is under an evacuation warning. Per the city, an evacuation warning is defined thusly: “Potential threat to life and/or property. Those who require additional time to evacuate, and those with pets and livestock should leave now.” All Malibu schools will be closed again tomorrow due to the continuing winds and the Palisades Fire, according to the Santa Monica Malibu Unified School District. Even as today’s devastating Palisades Fire has scorched close to 3,000 acres and prompted evacuations through the Pacific Palisades and Topanga “get set” warnings north to Calabasas, a new blaze is spreading rapidly in the hills above Altadena. Multiple evacuations have already been issued in Altadena itself and even a portion of Pasadena. See portions in red in map below. Evacuation warnings have been issued down to the 210 Freeway in Pasadena proper. See areas in yellow below. Meanwhile on the west side, the Palisades Fire has reached the campus of Pali High, with CBS News National Correspondent sharing video of the conflagration. PREVIOUSLY at 6:30 p.m.:The size of the Palisades Fire and its evacuation zone have nearly doubled in size in just under two hours. From 1,260 acres just before 3 p.m. today, the fire exploded to 2,920 acres at 6:30 p.m. Likewise, while the “must leave” list included most of the Palisades and a section of the Malibu coast moving west, at 6 p.m. the evacuation orders were expanded to include most of Topanga Canyon and the Malibu coast past Las Flores Canyon to just east of the pier. See updated chart, with evacuation orders in red and evacuation orders in yellow, directly below. Also of note: For the first time the evacuation warnings include areas of Calabasas south of the 101 as well as the area around the Malibu Pier, potentially indicating the directions in which the fire is moving. The environs of central Malibu outside city hall and the shopping district were, of course, scorched less than a month ago by the Franklin Fire. That blaze scorched thousands of acres which could act as a buffer to further spread of today’s fire to the west. KTLA5 has reported that brush near the Getty Center had caught fire, prompting concerns for the building itself. A post on the facility’s X account confirmed some trees and vegetation had been scorched, but “no structures are on fire, and staff and the collection remain safe.” Deadline confirmed earlier that The following Los Angeles Unified School District schools will be closed tomorrow due to the Palisades Fire: Canyon Charter Elementary School, Marquez Charter Elementary School, Palisades Charter Elementary School, and Paul Revere Charter Middle School. District officials say they will monitor the fire on Wednesday and potentially shift those campuses to remote learning on Thursday. PREVIOUSLY at 4:15 p.m.: “Hell of a way to start a new year,” said California Governor Gavin Newsom this afternoon at a news conference related to the Palisades Fire. After thanking local officials and first responders he added, “By no stretch of the imagination are we out of the woods.” Indeed, city, county and federal officials have already declared states of emergency. Los Angeles Police Chief Jim McDonnell said 30,000 people had been evacuated in the approximately sic hours since the blaze began in the area of N Piedra Morada Drive. Los Angeles Fire Department Chief Kristen Crowley indicated that 10,000 households had been evacuated. While no injuries had thus far been reported, she said that “multiple structures” had been damaged. The fire was moving west. PREVIOUSLY at 2:50 p.m.: Homes have been destroyed as high winds forecast to increase to between 40 and 60 miles per hour later this afternoon fanned a wildfire that has now scorched 1260-plus acres in Pacific Palisades. According to reports multiple homes have been destroyed. While it began as a 10 acre blaze at about 10:30 a.m. in the area of N Piedra Morada Dr near The Highlands, the incident quickly became a 200-plus acre blaze in less than an hour, threatening homes with smoke blowing West toward the Getty Villa. The museum is closed to the public today, but a source tells Deadline the people working there were told to leave. The facility reportedly has a very detailed plan to keep the art safe, including fireproof walls. There are over 250 LAFD firefighters battling the blaze, in addition to those from neighboring agencies.  Eastbound Pacific Coast Highway has been closed at Topanga Canyon Boulevard. Eastbound lanes of PCH were also closed at Las Flores Canyon Road, according L.A.C.S.D Public Information Officer Tuyet Alcala. Traffic was being diverted on the Santa Monica Freeway at Lincoln Boulevard to keep people from entering the area. Sunset Boulevard at Palisades Drive was also reportedly impassible, with firefighters potentially using the thoroughfare as a firebreak. At about 12:30 p.m., with local roads choked with traffic and some people abandoning their cars, residents were evacuating on foot, according to Captain Eric Scott of the Los Angeles Fire Department. On KTLA5, a local resident — who the young reporter did not recognize as actor Steve Gutenberg — plead with people who were abandoning their cars to at least leave the keys in them so others could move the vehicles blocking their way. “This is not a parking lot,” said the actor. “If you leave your car on Palisades Drive, leave the keys in it so a guy like me can move it.” Evacuation orders were issued at about noon for the area around Piedra Morada, according to multiple news outlets. Areas near Topanga to the west and Rustic Canyon to the east were reportedly under evacuation warnings. Emergency officials are urging anyone in the path of the fire to leave the area. In fact, one former ABC7 local TV reporter was live on the air from her home and had to get off when she received the evacuation order. An alert sent out by the Malibu/Lost Hills Sheriff Station warned of “immediate threat to life.” See map below for current evacuations as of 1 p.m. Mandatory evacuations are in red and evacuation warnings are in yellow. Local TV stations broke into coverage of former President Jimmy Carter’s memorial services to cover the incident, with remote crews staging shots from the beach parking lots on PCH with a billowing black plume in the background. The smoke could also be seen across most of West Los Angeles. Actor James Woods posted close-up video of flames approaching the back deck of his home. The Emmy-winner also indicated that he had safely evacuated writing, “We were blessed to have LA fire and police depts doing their jobs so well. We are safe and out. There are several elementary schools in our neighborhood and there was an enormous community effort to evacuate the children safely. Can not speak more highly of the LA fire and LAPD.” Former Fall Guy actress and writer Heather Thomas posted several videos of the fire on a hill nearby, noting in one clip that “both of my daughters live across the canyon and [are] evacuating over here.” Thomas’ husband is Ziffren Brittenham LLP founding partner Skip Brittenham. The National Weather Service in has been warning for several days that today’s windstorm would bring extreme fire conditions as it couples very high winds with very low humidity. Winds were clocked at 46 mph in the Palisades this morning. Humidity is expected to be critically low on Wednesday. As of about noon, SCE had begun emergency power shutdowns to prevent power lines blown down by winds from sparking fires. Areas effected included the Point Dume area and up the the coast into Western Malibu. You can watch a time lapse video of the start and growth of the Pacific Palisades fire below. City News Service contributed to this report.",
  "image": "https://deadline.com/wp-content/uploads/2025/02/GettyImages-2198948228.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\t\u003cstrong\u003eUPDATED with latest: \u003c/strong\u003e Access to Pacific Coast Highway between Santa Monica and Malibu, which has been largely restricted since the \u003ca href=\"https://deadline.com/tag/palisades-fire/\" id=\"auto-tag_palisades-fire\" data-tag=\"palisades-fire\"\u003ePalisades Fire\u003c/a\u003e erupted Jan. 7, was expanded today for residents, business and other essential traffic.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAs of 6 a.m., the route was opened to residents of the \u003ca href=\"https://deadline.com/tag/pacific-palisades/\" id=\"auto-tag_pacific-palisades\" data-tag=\"pacific-palisades\"\u003ePacific Palisades\u003c/a\u003e and Malibu burn areas, along with essential businesses and school bus traffic, according to Caltrans.\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tResidents and business owners in the area will need to have access passes to use the roadway. Residents in Malibu and unincorporated areas can obtain access passes at Malibu City Hall. Palisades residents can obtain passes from \u003ca href=\"https://deadline.com/tag/los-angeles/\" id=\"auto-tag_los-angeles\" data-tag=\"los-angeles\"\u003eLos Angeles\u003c/a\u003e city staff at the Disaster Recovery Center at 10850 Pico Blvd.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t“The PCH closure has been challenging for our residents who need to get to and from work, school, and essential trips,” county Supervisor Lindsey Horvath said in a statement. “As PCH reopens, we have streamlined the process for them to more easily navigate checkpoints and access their properties.”\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234771711\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tCaltrans officials noted that some restrictions will still be in place. PCH is reduced to one lane in each direction with a 25 mph speed limit between Chautauqua Boulevard in Pacific Palisades and Carbon Beach Terrace in Malibu. All signalized intersections will be flashing red. No parking or stopping is permitted, and no pedestrians are allowed in the work zone. No vehicle passing is permitted. There is one lane through the McClure Tunnel from westbound Santa Monica (10) Freeway to northbound PCH, and one lane entering northbound PCH from the California Incline. Those two lanes merge into one lane, potentially causing delays.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tPCH still remains closed to general traffic, “and only essential travel is recommended,” according to Caltrans. People trying to reach Malibu can use the Ventura (101) Freeway and Las Virgenes Road/Malibu Canyon Road or Kanan Dume Road.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tMeanwhile, Los Angeles County officials announced the reopening of four county-maintained roads in the area that were closed due to the recent storms. Piuma Road, Rambla Pacifico Street, Schueren Road and Saddle Peak Road all reopened Thursday morning. Tuna Canyon Road remains closed. Las Flores Canyon Road is open to residents only.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUSLY on February \u003c/strong\u003e6: Southern California Edison officials conceded in a regulatory filing today that the company’s equipment may be associated with the ignition of the Hurst Fire, which burned nearly 800 acres in the Sylmar area during the height of the \u003ca data-id=\"1236249158\" data-type=\"post\" href=\"https://deadline.com/2025/01/windstorm-los-angeles-ventura-counties-forecast-1236249158/\"\u003eJanuary windstorm\u003c/a\u003e in Los Angeles.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tThe Hurst Fire, which erupted Jan. 7 and was fully contained on Jan. 16, did not result in any structures being destroyed or cause any deaths, but did force the closure of the 5 and 210 freeways and prompted evacuations. It preceded the Hughes Fire, which \u003ca href=\"https://deadline.com/2025/01/l-a-fires-hughes-fire-updates-1236263854/\"\u003ebroke out in the area\u003c/a\u003e near Castaic Lake on January 22, burned over 10,000 acres and prompted further evacuations. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe region’s two other massive fires, the Palisades and Eaton fires, killed a combined 29 people and damaged or destroyed tens of thousands of structures.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn a filing with the state Public Utilities Commission, Paul Pimentel of SCE wrote that while the Los Angeles Fire Department is continuing to investigate the cause of the fire, “Absent additional evidence, SCE believes its equipment may be associated with the ignition of the Hurst Fire.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe filing notes that the fire originated in the vicinity of an SCE transmission tower north of Saddle Ridge Road. SCE concedes in the filing that a conductor failure occurred on the tower the night of Jan. 7, causing damaged equipment to fall to the ground at the base of the tower.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn the past 30-plus years, more than 3,600 wildfires in the state have been in some way related to power generation, transmission or distribution, according to U.S. Forest Service data \u003ca rel=\"nofollow\" href=\"https://www.nytimes.com/interactive/2025/01/13/us/los-angeles-fires-cause.html\" target=\"_blank\"\u003eas reported by \u003c/a\u003ethe New York Times. California’s two most destructive and deadly fires, the Camp and Tubbs blazes which collectively killed more than 100 people and destroyed more than 20,000 structures, were caused by failures of power systems. More locally, the deadly Thomas and Woolsey Fires which destroyed thousands of structures in L.A. and Ventura counties in 2017 and 2018 were also caused by SCE equipment failures.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSCE has already been targeted in multiple lawsuits accusing its equipment of sparking the \u003ca href=\"https://deadline.com/tag/eaton-fire/\" id=\"auto-tag_eaton-fire\" data-tag=\"eaton-fire\"\u003eEaton Fire\u003c/a\u003e, which burned 14,021 acres in the Altadena and Pasadena areas. The cause of that fire is still under investigation, but attorneys have recently pointed to surveillance video that appears to show SCE power lines arcing in the vicinity of the fire’s origin on Jan. 7.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“While we do not yet know what caused the Eaton wildfire, SCE is exploring every possibility in its investigation, including the possibility that SCE’s equipment was involved,” Pedro J. Pizarro, president and CEO of SCE’s parent company, Edison International, said in a statement Thursday. “We have been fully engaged since the start of the fires in supporting the broader emergency response, containment, recovery and investigation efforts.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSCE officials said the investigation into the fire’s cause is likely to take several more months.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Our hearts go out to everyone who has suffered losses,” Pizarro said. “We are working with the local communities SCE serves to rebuild and emerge stronger. We understand the community wants answers, and we remain committed to a thorough and transparent investigation.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUSLY on February 4\u003c/strong\u003e: The U.S. Army Corps of Engineers announced today it has officially begun its “Phase 2” wildfire-debris removal effort, beginning with two Pasadena Unified School District campuses that were destroyed in the Eaton Fire.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe announcement marked a key milestone in the wildfire recovery effort, which began with the U.S. Environmental Protection Agency engaging in Phase 1 of the process — removing household hazardous materials from destroyed and damaged structures. While that Phase 1 process is continuing, Phase 2 debris removal will move forward at properties that have been cleared by the EPA.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t“Beginning Phase 2 means we’re making tangible progress toward recovery,” Col. Eric Swenson, the Army Corps of Engineers Los Angeles Wildfires Recovery Field Office commander, said in a statement. “Our teams are working with urgency and care to remove hazardous debris while ensuring the safety of the community, workers and the environment.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tPhase 2 involves clearing fire-damaged properties of hazardous ash and debris.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe sites being cleared to begin Phase 2 are the campuses of Loma Alta Elementary School in Altadena and Edison Elementary in Pasadena. See map below, where yellow means Phase 1 is incomplete, blue means Phase 1 is complete and Purple means deferred to Phase 2.\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\t\n\n\u003cfigure\u003e\n\n\t\t\t\n\u003cdiv\u003e\n\t\n\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?w=300\" data-lazy-src=\"https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?w=300\" alt=\"\" data-lazy-srcset=\"https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png 2480w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=150,87 150w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=300,173 300w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=1024,591 1024w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=1536,887 1536w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=2048,1183 2048w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=173,100 173w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=60,35 60w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=352,203 352w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=110,64 110w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=285,165 285w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=320,185 320w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=640,370 640w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=800,462 800w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=1280,739 1280w\" data-lazy-sizes=\"(min-width: 87.5rem) 1000px, (min-width: 78.75rem) 681px, (min-width: 48rem) 450px, (max-width: 48rem) 250px\" height=\"591\" width=\"1024\" decoding=\"\" srcset=\"https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png 2480w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=150,87 150w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=300,173 300w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=1024,591 1024w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=1536,887 1536w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=2048,1183 2048w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=173,100 173w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=60,35 60w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=352,203 352w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=110,64 110w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=285,165 285w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=320,185 320w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=640,370 640w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=800,462 800w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.06.10 PM.png?resize=1280,739 1280w\"/\u003e\n\t\t\t\n\t\t\t\u003c/p\u003e\n\t\n\t\u003c/div\u003e\n\t\n\t\n\u003c/figure\u003e\n\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\t“The safety of our students and staff is our top priority,” PUSD Superintendent Elizabeth Blanco said in a statement. “This debris removal effort will allow us to begin the recovery process with confidence, and we are grateful for the support from (the Corps of Engineers, Federal Emergency Management Agency) and our local partners.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThere are also individual properties (in blue below) where Phase 1 has been completed, though the are relatively few.\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\t\n\n\u003cfigure\u003e\n\n\t\t\t\n\u003cdiv\u003e\n\t\n\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?w=300\" data-lazy-src=\"https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?w=300\" alt=\"\" data-lazy-srcset=\"https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png 2336w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=150,78 150w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=300,157 300w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=1024,536 1024w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=1536,804 1536w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=2048,1071 2048w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=191,100 191w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=60,31 60w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=352,184 352w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=110,58 110w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=285,149 285w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=320,167 320w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=640,335 640w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=800,418 800w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=1280,670 1280w\" data-lazy-sizes=\"(min-width: 87.5rem) 1000px, (min-width: 78.75rem) 681px, (min-width: 48rem) 450px, (max-width: 48rem) 250px\" height=\"536\" width=\"1024\" decoding=\"\" srcset=\"https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png 2336w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=150,78 150w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=300,157 300w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=1024,536 1024w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=1536,804 1536w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=2048,1071 2048w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=191,100 191w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=60,31 60w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=352,184 352w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=110,58 110w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=285,149 285w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=320,167 320w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=640,335 640w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=800,418 800w, https://deadline.com/wp-content/uploads/2025/02/Screenshot-2025-02-04-at-4.02.46 PM.png?resize=1280,670 1280w\"/\u003e\n\t\t\t\n\t\t\t\u003c/p\u003e\n\t\n\t\u003c/div\u003e\n\t\n\t\n\u003c/figure\u003e\n\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\tCorps of Engineer officials said the Phase 2 operations will expand in the coming weeks to include residential properties destroyed by the Eaton and Palisades fires. According to the Corps, if the EPA determines that a property is still unsafe to enter due to hazardous materials, they will be labeled as “deferred,” and Army crews will work to render them safe to allow the cleanup efforts to move forward.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe cleanup efforts have sparked criticism from some residents concerned about the sites being used to process hazardous materials being removed from destroyed properties by the EPA.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tResidents, however, are being allowed to return to their properties, along with contractors and utility workers, as they assess damage and determine how to move forward. A nightly curfew for the burn areas remains in effect from 6 p.m. to 6 a.m.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tCheckpoints restricting access to the fire-ravaged Pacific Palisades remain in place. Returning residents and authorized contractors are being given access to the Palisades Fire burn area with access passes, which are now being distributed by law enforcement at the Disaster Recovery Center in West Los Angeles, 10850 Pico Blvd., and at the West Los Angeles Civic Center, 1645 Corinth Ave. Passes can be obtained daily from 10 a.m. to 5 p.m.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tPacific Coast Highway was reopened between Santa Monica and Malibu early Monday, but a stretch of the roadway was closed later Monday due to fears of possible debris or mud flows caused by two storms bearing down on the region.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tPCH will remain closed until at least Friday, when the rain is expected to abate, between Chautauqua Boulevard in Los Angeles and Carbon Beach Terrace in Malibu.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe Eaton Fire caused at least 17 deaths, destroyed 9,418 structures and damaged 1,073 more while burning 14,021 acres. Repopulation efforts there have been completed.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAt least 12 people were killed in the Palisades Fire, which burned 23,448 acres, destroyed 6,837 structures and damaged 1,017 others.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe cause of both fires, which began while the region was under a red flag warning for critical fire danger due to a historic wind event that saw gusts of 80 to 100 mph, remains under investigation.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe Los Angeles County Office of Medical Examiner has positively identified 18 of the 29 people confirmed dead in the two wildfires. The list can be found \u003ca rel=\"nofollow\" href=\"https://me.lacounty.gov/2025/press-releases/wildfire-update-18-victims-%20identified-by-medical-%20examiner/?utm_content=\u0026amp;utm_medium=email\u0026amp;utm_name=\u0026amp;utm_source=govdelivery\u0026amp;utm_te%20rm=.\" target=\"_blank\"\u003ehere\u003c/a\u003e. \n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tQuestions continued to linger about exactly how long it would take for residents to begin the rebuilding process. The EPA has been directed to complete Phase 1 cleanup within 30 days.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tStatus updates on the EPA’s work, including an interactive map of individual fire-affected properties, are available \u003ca rel=\"nofollow\" href=\"https://epa.gov/ca/2025-%20california-wildfires\" target=\"_blank\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tOfficials urged fire-affected residents to fill out “Right of Entry” forms to either opt in or out of the free Phase 2 debris-clearance program offered by the U.S. Army Corps of Engineers. Residents have until March 31 to complete the forms, which are available online at recovery.lacounty.gov/debris- removal/ or at any FEMA Disaster Recovery Center.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSwenson said previously that he anticipates the vast majority of the debris-clearance work to be completed within a year. He said previous comments about the process taking up to 18 months included potential delays involved with some properties in which ownership could be in question or the resident died.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tLos Angeles County Board of Supervisors Chair Kathryn Barger said the county is working on a set of guidelines for property owners who would like to put temporary “accessory dwelling units” on their fire-damaged properties, allowing them to live on site while rebuilding work is done. She noted there are pre-fabricated units available that could potentially be erected on properties quickly, providing a living space for displaced residents who have been staying in hotels or other accommodations.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tFEMA Disaster Recovery Centers are open at UCLA Research Park West, 10850 W. Pico Blvd., and in Altadena at 540 W. Woodbury Road, to assist homeowners with applying for aid. The center’s are open daily from 9 a.m. to 8 p.m.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tFEMA is also operating two other centers to provide assistance to fire victims, including those from the Hurst, Sunset and Hughes fires. Those centers are at:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t— Sherman Oaks East Valley Adult Center, 5056 Van Nuys Blvd., building B, operating 9:30 a.m to 5 p.m. Tuesday through Friday; and\u003cbr/\u003e— Ritchie Valens Recreation Center, 10736 Laurel Canyon Blvd., Pacoima, operating from 9 a.m. to 3 p.m. Tuesday through Friday, and 1 to 6 p.m. Saturdays.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe deadline for fire victims to apply for FEMA financial relief is March 10. According to the county, FEMA has already approved more than $54 million in housing and other assistance for 24,575 households. More than 117,200 individuals have registered for FEMA assistance.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tBy the time all the damage is assessed, the fires are expected to constitute the costliest natural disaster in U.S. history.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe UCLA Anderson Forecast released a report Tuesday estimated that the two fires caused property damage and capital losses ranging between $95 billion and $164 billion, with insured losses at $75 billion.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUSLY on January 19:\u003c/strong\u003e As the Santa Ana winds quieted over the weekend, there was more good news regarding containment figures for both the Palisades and Eaton blazes. The former fire is 52% contained (up from 43% yesterday) and the latter fire is contained at 81% (risen from 73%).\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe reprieve is much-needed for fire personnel heading into the week as another extreme wind event is expected from Monday through Tuesday night. In preparation for isolated gusts that could reach anywhere from 50 to 100 mph in wind-prone areas, as well as low humidity, red-flag parking restrictions are in place as forecasters issue a “particularly dangerous situation warning” for many Los Angeles and Ventura county locations.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUS, Jan. 18:\u003c/strong\u003e More evacuation orders were lifted today as containment of the Eaton Fire and Palisades Fire has risen overnight due to firefighting efforts working in tandem with breaks in weather, including better humidity levels and lower winds.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tContainment of the Eaton blaze grew to 73%, up overnight from 65%, with helicopters providing water-dropping support to extinguish hot spots in steep, inaccessible canyons near Winters Creek, Mt. Lowe and Mt. Wilson. Meanwhile, containment of the Palisades Fire rose to 43%, up from 39% last night.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWhile winds are expected to remain calm through the weekend, another Santa Ana wind event is expected to move in Monday and Tuesday, creating new risks for critical fire weather conditions, as well as rapid spread of any new blazes. According to the National Weather Service, gusts could reach 50 to 60 mph.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUS, Jan. 17:\u003c/strong\u003e Cooler temperatures and calm winds enabled firefighters to expand containment on the Palisades and Eaton fires Friday, as some residents were being allowed to return to their homes.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWhile most evacuation orders are expected to remain in place for at least another week, authorities siad evacuation orders were eased or lifted in more than three dozens zones on the outskirts of the Palisades burn area. Residents in about a dozen neighborhood zones were cleared to return to their homes on Thursday.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn the Eaton Fire area, evacuations were lifted in areas southwest of Altadena Drive, north of New York Drive and east of Allen Avenue; an area east of Lake Avenue and south of Mendocino Lane; and south of Church Canyon Place, east of Old Toll Road and west of Sunset Ridge Road. On Thursday afternoon, residents along Canyon Crest Road into The Meadows east of El Prieto Road were allowed to return home.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAs of Friday, the Eaton Fire had burned 14,117 acres, with containment at 65%, up from 55% Thursday. The Palisades Fire is now 31% contained, up from 27% Thursday night. It has burned 23,713 acres, according to CalFire.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAt least 27 people are confirmed dead so far in the fires. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tLos Angeles Mayor Karen Bass on Friday appointed businessman and longtime civic leader Steve Soboroff to lead rebuilding efforts in the aftermath of the devastating Palisades Fire. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Steve Soboroff’s name is attached to hope,” Bass said. “It is attached to energy, and it is attached to many, many accomplishments. He will recommend a comprehensive city strategy for rebuilding and for expediting — expediting is a very important word here — we want to expedite the return of residents, businesses, schools, nonprofits and parks.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tBass is expected to issue a series of executive orders next week relating to recovery efforts.\u003cbr/\u003enext week relating to recovery efforts.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAs firefighters are getting a reprieve from the weather at the moment, officials warn of yet another Santa Ana event this coming Monday and Tuesday.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tLos Angeles Public Works Department chief Mark Pestrella warned that the destruction wrought by the fires poses a danger even when the Santa Anas stop.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Properties have been damaged beyond belief. They are full of sediment, debris and hazardous materials,” he said, while assuring that debris removal would be done in conjunction with city of L.A. and the Federal Government, which would first clear away any toxic remnants.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tBut until those toxic remnants and other debris were cleared away, a potentially greater danger, said Pestrella, could be not fire but water from winter rains.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t“Power, water and sewer are damaged to the point that they cannot be delivered safely in most of the areas.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tPestrella said his department was “assessing impact to the flood control system” in both the Palisades and Altadena.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Both areas suffered watershed damage burned to such a significance that we expect massive debris-laden flows when it rains,” he cautioned. “In an event that we have major rain, we do expect that all of the street areas and all of the communities will be impacted by debris flows that could be hazardous to human health. In order to address this, we are developing plans to capture and hold this debris back as much as we can during a rain event.” \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSouthern California is currently in the grips of a La Niňa weather cycle, which portends a colder, dryer winter — thus the unprecedented January wind event of the past week. But that could change.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“I have to give everybody and early warning that we do expect the window for rain to open later this month,” said Pestrella, “so we are already deploying labor forces into the area in order to ensure that the flood control system is ready — as well as our street system is ready — as much as possible for that rain event.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSouthern California’s rainiest months are generally January-March, but the current long range forecast from the National Weather Service for the region predicts that “there is a 40 to 50% chance of below normal precipitation in Southern California January 22-26. Below normal is defined as the driest third of climatologically observed precipitation for mid to late January.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAccording to Cal Fire, detailed damage inspection maps for properties within the Palisades Fire footprint showing damaged or destroyed homes — as well as homes that are not damaged or destroyed — can be found at \u003ca rel=\"nofollow\" href=\"https://www.fire.ca.gov/incidents/2025/1/7/palisades-fire\" target=\"_blank\"\u003ewww.fire.ca.gov/incidents/2025/1/7/palisades-fire\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tLos Angeles County officials said its damage assessments can be viewed at \u003ca rel=\"nofollow\" href=\"https://www.recovery.lacounty.gov/palisades-fire\" target=\"_blank\"\u003ewww.recovery.lacounty.gov/palisades-fire\u003c/a\u003e. They will be updated daily in real time.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tCalFire reported that detailed damage inspection maps for properties within the Eaton Fire footprint showing damaged or destroyed homes — as well as homes that are not damaged or destroyed — can be found at \u003ca rel=\"nofollow\" href=\"https://fire.ca.gov/incidents/2025/1/7/eaton-fire\" target=\"_blank\"\u003efire.ca.gov/incidents/2025/1/7/eaton-fire\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tLos Angeles County officials said its damage assessments can be viewed at \u003ca rel=\"nofollow\" href=\"https://recovery.lacounty.gov/eaton-fire\" target=\"_blank\"\u003erecovery.lacounty.gov/eaton-fire\u003c/a\u003e. Those will also be updated daily in real time.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe fires have also  forced thousands of pets from their homes over the last two weeks, increasing the burden on local animal shelters and rescue groups who are scrambling.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tHere are some ways to help animals:\u003cbr/\u003e   — Los Angeles and Pasadena/Altadena have phone numbers for those needing help with animals left behind in fire zones. The city of L.A.’s number is 213-270-8155, and for Pasadena and Altadena, it’s 626-577-3752.\u003cbr/\u003e   — For those who have lost or found a pet, the city and county are partnering with Petco Love Lost, a free national lost-and-found pet database at \u003ca href=\"https://petcolove.org/lost/\" rel=\"nofollow\" target=\"_blank\"\u003ehttps://petcolove.org/lost/\u003c/a\u003e.\u003cbr/\u003e   — Earlier this week, the Department of Animal Services and the L.A. County Department of Animal Care and Control issued a joint call for residents to help animals in need and relieve critical overcrowding at shelters by adopting or fostering those without homes. More information is available at \u003ca href=\"https://LAanimalServices.com/about-fostering\" rel=\"nofollow\" target=\"_blank\"\u003eLAanimalServices.com/about-fostering\u003c/a\u003e, and \u003ca href=\"https://animalcare.lacounty.gov/become-a-foster-caretaker\" rel=\"nofollow\" target=\"_blank\"\u003eanimalcare.lacounty.gov/become-a-foster-caretaker\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUS, Jan. 15:\u003c/strong\u003e Two more people were behind bars today for allegedly setting small fires in Los Angeles as crews continued efforts to contain the major blazes that have killed dozens of people and destroyed roughly 13,000 structures.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tLos Angeles County Sheriff Robert Luna reported there have been 44 arrests so far, 36 in the Eaton Fire area and eight in the Palisades Fire area. Those apprehensions include two men who allegedly impersonated firefighters in an effort to burglarize homes.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tLos Angeles Police Chief Jim McDonnell reported 14 arrests as of Tuesday morning, including curfew violations, impersonating a police officer, impersonating a firefighter, DUI, vandalism, ammunition possession, burglary and other offenses.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tMcDonnell said officers responded at 5:15 p.m. Tuesday to Glenoaks and Van Nuys boulevards, where a resident had detained a suspect who allegedly set fire to a tree. The resident was able to douse the fire and call police. When officers arrived, the suspect admitted setting the fire, saying “he liked the smell of burning leaves,” McDonnell said.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAt 9:30 p.m. Tuesday, officers responded to Santa Monica Boulevard and Vermont Avenue, where a suspect was setting fire to piles of rubbish and trash, McDonnell said. Officers were able to douse the flames and arrest the suspect, who told the officers she “enjoyed causing chaos and destruction,” police said.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\t“There are people out there who, this is what they do,” McDonnell said.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tMcDonnell on Tuesday reported three other arrests that occurred Sunday and Monday in the San Fernando Valley and West Los Angeles, all involving people who were allegedly setting small fires.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tL.A. County District Attorney Nathan Hochman on Monday announced charges against 10 people — including eight for looting in recent burn areas and one for arson unrelated to the major blazes.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThat latter arrestee was Jose Carranza Escobar, who pleaded guilty. Hochman’s office released video of his arrest.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tHochman said Wednesday morning his office had charged two additional people in arson cases.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tJaime Mota, 37, is charged with one count of felony arson of property and one count of felony arson during a state of emergency. Mota is being held on $350,000 bail and if convicted as charged, faces up to seven years in prison, Hochman said.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAt about 2 p.m. on Saturday, Mota allegedly lit a fire in the back of a warehouse/shipping yard in the city of Industry, causing bushes, stacks of pallets and the back portion of a tractor-trailer to burn, according to the DA’s Office.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe second new suspect, Ruben Michael Montes, 27, is charged with one count each of felony arson during a state of emergency; felony possession, manufacturing or disposing of flammable or combustible materials, incendiary devices, or explosives with the intent to commit arson; and misdemeanor reckless burning of personal property.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAt about 12:30 p.m. Sunday, Montes started a fire at the San Gabriel River (605) Freeway underpass and Rivergrade Road in Irwindale, prosecutors said.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tHochman said Montes faces allegations of violating probation after committing arson, engaging in violent conduct indicating a serious danger to society, and having a history of prior felony convictions. The statutory bail for Montes is $400,000. If convicted as charged, he faces up to 14 years in prison, and was also expected to be arraigned Wednesday in the court’s West Covina branch, the DA said.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAnother man, Juan Manuel Sierra, was arrested Thursday in connection with the nearly 1,000-acre Kenneth Fire after first being apprehended by local residents. Sierra was reportedly caught near the source of the West Hills blaze with what appeared to be a blowtorch. He has not been charged, but remains a “person of interest.” Sierra was arrested for violating felony probation related to immigration. He is being held in a L.A. County jail.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tMeanwhile, leaders of federal and local law enforcement agencies have partnered to create a joint task force to investigate and prosecute fire-related crimes — including arson, looting, burglary, fraud and illegal drones — as Los Angeles County recovers from devastating wildfires, it was announced today.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe Joint Regional Fire Crimes Task Force will focus on investigating and prosecuting people who try to exploit the wildfire crisis, according to the U.S. Attorney’s Office.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe task force includes representatives of the U.S. Attorney’s Office; the FBI; the Bureau of Alcohol, Tobacco, Firearms and Explosives; Homeland Security Investigations; the Los Angeles County District Attorney’s Office; the Los Angeles City Attorney’s Office; the Los Angeles Police Department; and the county Sheriff’s Department.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUSLY at 8 a.m.: \u003c/strong\u003eWinds picked up again early Wednesday as firefighters worked to hold and expand containment lines on the Palisades and Eaton fires.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tA day after firefighters got a bit of a break with lighter winds than expected, gusts were clocked at up to 35 mph on the coast and in valleys and 55 mph in the mountains before dawn Wednesday, National Weather Service meteorologist Todd Hall said. They are expected to increase through the morning.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe death toll is now 25 for the fires combined, and is expected to rise.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe Palisades Fire has burned 23,717 acres and is now 19% contained. The Eaton Fire has scorched14,117 acres, with containment rising to 45% Wednesday morning, up from 35% Tuesday night.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tRed flag warnings of critical fire danger will be in place over much of Southern California through 6 p.m. Wednesday, with some areas under the alert until Thursday afternoon.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUS, Jan. 13, 4:25 PM: \u003c/strong\u003e“There’s a special place in hell for you,” said Senator Adam Schiff to those who would loot neighborhoods hit by the recent fires. Then, referencing law enforcement officials standing on stage with him, Schiff continued, “And if the folks behind me have anything to say about it, there’s a special place in jail for you, too.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe Senator’s comments came just minutes after Los Angeles District Attorney Nathan Hochman announced that nine people had been charged for looting and burglary related to the Eaton and Pasadena Fires. Hochman said one person had been charged for arson. Sentences could include decades to life in prison.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThree of those charged are accused of stealing $200,000 in goods from a home in Mandeville Canyon. Four others allegedly broke into a residence in Altadena and stole a number of items, including the Emmy award of the person who lived there.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe arson suspect was \u003ca href=\"https://deadline.com/2025/01/suspected-arsonist-arrested-azusa-california-fires-1236254672/\"\u003earrested in Azusa\u003c/a\u003e for setting a fire in a local park on January 10. Today, the DA released video of that arrest.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tIn other fire-related legal news, four lawsuits were \u003ca rel=\"nofollow\" href=\"https://abcnews.go.com/US/homeowners-renters-sue-california-utility-company-eaton-fire/story?id=117636620\" target=\"_blank\"\u003efiled today\u003c/a\u003e accusing Southern California Edison of failing to de-energize power equipment despite dire wind and fire warnings from the National Weather Service.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“We’ve seen the photos, so we know that there was fire there. We don’t know what caused it,” the CEO of Edison’s parent company, Pedro Pizarro, told ABC7’s David Ono on Monday about allegations his company’s equipment caused the Eaton Fire. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUSLY at 12:05 p.m.:\u003c/strong\u003e Containment on L.A.’s two largest fires increased slightly overnight as firefighters brace for more extreme Santa Ana winds that could quickly spread the blazes.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tA red flag \u003ca rel=\"noreferrer noopener nofollow\" target=\"_blank\" href=\"https://www.weather.gov/lox/\"\u003ewarning\u003c/a\u003e is in place for parts of the city of Los Angeles and county, with wind gusts of up to 70 mph forecast between 4 a.m. Tuesday and noon Wednesday — strong enough to potentially cause “explosive fire growth,” according to the National Weather Service.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe service’s Los Angeles office also emphasized areas that are in a so-called Particularly Dangerous Situation. That region, outlined in purple below, stretches from Ventura in the west to above Fillmore in the north to the area of the Eaton Fire in the east to Malibu in the South. See map.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tThe NWS L.A. described the conditions ominously in a statement posted to social media. “PDS Red Flag Warnings are for the extreme of the extreme fire weather scenarios. In other words, this setup is about as bad as it gets. Stay aware of your surroundings. Be prepared to evacuate. Avoid anything that can spark a fire,” the statement read.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tGovernor Gavin Newsom echoed that warning in the tweet last night, placing the current wind event in the context of others that produced destructive fires in L.A.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tIt also was learned today that the remains of 95-year-old Dalyce Curry, an actor who appeared in films such as \u003cem\u003eThe Blues Brothers, The Ten Commandments\u003c/em\u003e and \u003cem\u003eLady Sings the Blues\u003c/em\u003e, among others, were found in her burned-down Altadena home Sunday.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn a \u003ca rel=\"noreferrer noopener nofollow\" target=\"_blank\" href=\"https://www.facebook.com/dalycekelley/videos/524425367421841\"\u003eFacebook post\u003c/a\u003e on Sunday, her granddaughter Dalyce Kelley paid tribute to her late grandmother.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“We had a great run. She impacted my life in so many ways,” Kelley wrote. “This loss is devastating.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe Palisades Fire has remained at 23,713 acres burned, but containment increased overnight from 11% to 14%. The Eaton Fire, burning in the hills above Altadena, is now 33% contained. It has charred 14,117 acres. As of this morning, both blazes were experiencing only sparse active fire activity, with crews focused on dousing hot spots, jumping on spot fires and extending the containment lines. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tTwenty-four people are confirmed dead in the fires, and officials say that number is expected to rise.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUS, 8:35 PM, Jan. 12:\u003c/strong\u003e Certain evacuation zones have been reduced or lifted completely as progress is made on the dual Palisades and Eaton blazes. However, authorities have confirmed that the death toll, previously at 16, has risen to 24.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSix people have lost their lives to the Palisades blaze, while 16 fatalities stem from the Eaton Fire. This comes after Los Angeles County Sheriff Robert Luna said 13 people were reported missing as a result of the wildfires, a figure that has since risen by 3.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn terms of hopeful news, areas including Sierra Madre, Arcadia and northern Pasadena have been downgraded to evacuation warnings, and a couple zones were lifted completely. Areas in northwest Monrovia have also been lifted.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tFor the Palisades Fire, an evacuation order for the area to the west of North Sepulveda Boulevard and I-405 has been downgraded to a warning. This is an improvement from a complete shutdown for sections of the 405 Freeway, which were blocked to ward off excess traffic in the West Los Angeles area.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe current cost estimate is at $150 billion, making this crisis the most expensive Southern California fire to date. The 2018 Camp Fire, which previously held that title, cost approximately $30 billion.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn other news, a majority of LAUSD schools will reopen tomorrow, save the campuses in the most severely impacted areas with evacuation orders, as air quality inspections and HVAC filter replacements for more than 1,000 schools aim to be conducted by Sunday night.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tHowever, firefighters are bracing for gusty winds up to 60 miles per hour, which are said to be resuming between Monday night and Wednesday. As of now, containment and acreage on both fires remain the same. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSo far, 29 people have been arrested due to curfew-related incidents, not including the two individuals who were \u003ca href=\"https://deadline.com/2025/01/two-arrested-flying-drones-eaton-fire-1236255124/\"\u003eapprehended on suspicion of flying an unauthorized drone\u003c/a\u003e in wildfire-impacted areas earlier today.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUS, 8:40 AM, Jan 12:\u003c/strong\u003e A break in the winds and strong aerial assault overnight helped firefighters in their battle against L.A.’s two largest wildfires, but another round of strong Santa Ana winds is expected to move in later today.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAccording to CalFire, “Sunday through Wednesday, widespread critical fire weather conditions are expected with strong Santa Ana winds. The strongest winds are likely on Tuesday with the Red Flag Warning expected to extend till 6 p.m. Wednesday evening.’\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe Palisades Fire has scorched 23,707 acres and is now 16% contained. The Eaton Fire in Pasadena/Altadena has charred more than 14,000 acres but firefighters increased containment overnight from 15% to 27%.  At least 16 people are confirmed dead in both fires and that number is expected to rise. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAll mandatory evacuations and warnings remain in effect. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUS, 8:30 PM, Jan. 11:\u003c/strong\u003e Sixteen individuals are now dead as a result of the Eaton and Palisades blazes, the Los Angeles County Department of Medical Examiner has confirmed. In total, there are five deaths attributed to the Palisades Fire and 11 related to the Eaton Fire.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe three additional fatalities, up from 13 reported earlier, were discovered in Altadena today. One was found in the 3000 block of Krenz Avenue, one in the 200 block of Wapello Street and one in the 30 block of West Pine Street, \u003ca rel=\"nofollow\" href=\"https://ktla.com/news/local-news/officials-investigate-5-new-deaths-totalling-16-lives-lost-in-palisades-eaton-fires/\" target=\"_blank\"\u003eper KTLA\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSeveral of the deceased \u003ca rel=\"nofollow\" href=\"https://www.usatoday.com/story/news/nation/2025/01/10/la-fire-victims-palisades-altadena-california/77575654007/\" target=\"_blank\"\u003ehave been identified\u003c/a\u003e on social media or in other reports, including 66-year-old Victor Shaw, who died defending his Altadena home that had been in his family for the better part of a century. His relatives said he had some health issues that limited his mobility, and he died with a garden hose in his hand. Additionally, the county office identified one Palisades victim as an 80-year-old man, who died at a local hospital, with his identification withheld pending notification of kin.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe department said the aforementioned deaths are still under investigation and subject to processing at the facility.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn addition to federal, interstate and intrastate support, some 14,000 personnel were joined earlier today by a team of firefighters from Mexico, bolstering figures by contributing more than 70 first responders and disaster relief workers from Mexico’s National Forestry Commission and Ministry of Defense. Canada has also sent dozens of reinforcements and air tankers, though its Super Scooper plane — which can gather 1,500 gallons of ocean water to drop on the fires — has been grounded following a collision with an unauthorized drone.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAcreage on the dual fires remain at upward of 23,000 for the Palisades Fire with 11% containment and more than 14,000 for the Eaton Fire with 11% containment. For the latter, 7,000 structures have been destroyed or damaged, with that figure expected to rise, and an additional 40,000 said to be threatened.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003c/strong\u003e\u003cstrong\u003ePREVIOUS, 4:00 PM\u003c/strong\u003e: At over 22,000 acres burned, the Palisades Fire made a strong northeast push last night, threatening the homes located in the hills north of Brentwood. With containment remaining at 11% and a large evacuation zone stretching from the Pacific Ocean to the San Diego Freeway, as well as north to the Encino Reservoir, sections of the 405 Freeway remain closed to ward off excess traffic in the West Los Angeles area.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tPer CNS, officials with the J. Paul Getty Trust said today that the Getty Center near Brentwood and the Getty Villa in the Pacific Palisades have both remained intact amid the wildfires. “It was a watchful but fortunately uneventful night up here at the Getty Center. We’ve been told to anticipate stronger winds later in the day and are closely monitoring the situation. Our galleries are safe and protected. Aside from a few hot spots, the Villa remains stable,” they said in a statement.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAs noted, first responders are preparing for stronger gusts later this evening heading into Sunday, expecting winds of 30 to 40 miles per hour. Another strong wind event is expected between Monday night and Wednesday, with gusts between 40 to 60 miles per hour.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAcross town, the Eaton Fire’s acreage has climbed to over 14,000, but containment has also recently increased to 15%. As a result, evacuation orders have been lifted in parts of La Cañada Flintridge, Duarte and the gated communities of the Bradbury Estates.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUS, 9:00 AM, Jan. 11:\u003c/strong\u003e Firefighters worked through the night to curb the spread of the Palisades Fire ahead of high desert winds which are expected to intensify over the next few days. The blaze expanded northeast late Friday into the San Fernando Valley, prompting expanded mandatory evacuations and warnings.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tA mandatory evacuation order remains in effect for an area from Sunset Boulevard to Encino Reservoir, and from the 405 Freeway west to Mandeville Canyon, including the Getty Center, as well as voluntary evacuations that stretch to Ventura Boulevard, including a large swathe of Encino and parts of Brentwood.  \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tEleven people have been confirmed dead in the Palisades \u0026amp; Eaton fires combined, L.A. County Sheriff Robert Luna announced at a Saturday morning news conference. By Saturday afternoon, the death toll in Eaton grew to eight, bringing the total to 13 confirmed deaths.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe Palisades Fire has burned 21,596 acres and is now 11% contained, Luna said. At least 426 homes have been destroyed, along with 5,316 structures, including automobiles, and some 105,000 people remain evacuated.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tLuna said the L.A. County Sheriff’s Department has received 13 missing persons reports related to the fires, but some of those could overlap with fatalities.\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\u003cp\u003e\n\tThe National Weather Service issued a high wind watch for the San Gabriel Mountains, western Santa Monica Mountains Recreational Area and the Antelope Valley (14) Freeway that will be in effect Saturday night through Sunday afternoon. Those areas could see winds ranging from 30 to 50 mph, with possible gusts up to 60 mph. More powerful winds are expect to hit the region early next week.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003ePREVIOUS, 8:40 PM, Jan. 10 : \u003c/strong\u003e The Palisades Fire Friday night got over the ridge of the Santa Monica Mountains, threatening the San Fernando Valley. That triggered a new mandatory evacuation order for an area from Sunset Boulevard to Encino Reservoir, and from the 405 Freeway west to Mandeville Canyon. That region was previously under an evacuation warning. Voluntary evacuations stretch all the way to Ventura Boulevard, covering a large swathe of Encino as well as parts of Brentwood. New evacuation warnings have been issued for areas of Bel Air, just east of the 405 freeway.\u003c/p\u003e\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUS noon\u003c/strong\u003e: A break in the weather is allowing firefighters to make some progress Friday against multiple fires that continue to burn throughout the Los Angeles area. Winds are slightly calmer Friday, helping firefighters in their efforts, but more wind and dry conditions are expected to complicate efforts into next week.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tTen people are confirmed dead, according to the Los Angeles County Medical Examiner, but officials but warn the actual toll will remain unclear until access to all neighborhoods is possible. More than 153,000 people remain under evacuation orders and 10,000 structures have been destroyed between the Palisades and Eaton fires, officials said.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tOfficials warn it will take time to get an accurate and complete death count. Meanwhile, Red Flag wind warnings remain in effects for Los Angeles County through 6 p.m. Friday, and the air-quality alert is in place until 5 p.m.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAnd there’s more bad weather news one the way, as powerful winds are excpected to hit the region again early next week. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Right now it looks like Tuesday will be the strongest day,” National Weather Service forecasters said. “Unlike this week’s very dangerous event, which was more of a northerly wind event, this one is very likely to be a traditional [northeast] Santa Ana event. Still, the low humidities and the winds will combine to bring enhanced fire danger to the area.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tOn Friday, a new brush fire in the northern section of Granada Hills, named the Archer Fire, ignited shortly before 10:30 a.m., forcing an evacuation warning that included heavily urban areas of the San Fernando Valley community before forward containment could be achieved.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe Los Angeles Fire Department said 31.5 acres had been burned. Its center appeared to be in or around the spacious and wooded O’Melveny Park just above Sesnon Boulevard, with neighborhoods nestled directly to the south if it.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tBefore being slowed, an evacuation warning had included Balboa Boulevard and the 5 freeway to the east and Tampa Boulevard to the west, stretching as far south as Rinaldi Boulevard, a main east-west thoroughfare in the northern valley.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe Hurst Fire in Sylmar is just a few miles to the northeast of where the Archer Fire started, across the 5 and 210 freeways. The Hurst Fire is now 37% contained.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe Palisades Fire, which has burned some 20,000 acres and claimed the lives of two people, is 8% contained.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tFirefighters quickly got the upper hand on the Kenneth Fire, which erupted Thursday afternoon near West Hills northwest of Los Angeles. It’s now 35% contained. The blaze moved into Ventura County and firefighters managed to stop the flames from spreading.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAs an investigation into the cause of the fire was underway, police responded to reports of a man attempting to light a fire on Ybarra Road in Woodland Hills who had been held down by residents until law enforcement arrived. The man was interviewed by LAPD investigators and Ventura County Sheriff’s deputies, but they determined there was “not enough probable cause” to arrest him as a possible arson suspect. However, the man was arrested on suspicion of a felony probation violation.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe Eaton Fire in the Altadena/Pasadena area has burned nearly 14,000 acres and is 3% contained. Los Angeles County Fire Anthony Marrone says 7,000 structures are believed to have been damaged or destroyed in the Eaton Fire.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUS, Jan. 9, 5:50 PM: \u003c/strong\u003eTwo deaths have now been reported in the Palisades Fire, which has grown to nearly 20,000 acres, Los Angeles City Fire Chief Kristin Crowley announced at a late afternoon news conference Thursday. The two deaths included one body that was removed from the rubble\u003cbr/\u003eof a home along Pacific Coast Highway, Crowley said.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tEarlier Thursday, representatives of the county Medical Examiner’s Office removed human remains from the ruins of a home in the vicinity of Duke’s restaurant in Malibu. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAs weary firefighters and residents are still grappling with the ongoing devastating wildfires, a new fire erupted Thursday afternoon near West Hills, northwest of Los Angeles. The Kenneth Fire had burned 960 acres by 5:30 p.m. No injuries or structural damage have been reported. \n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tA mandatory evacuation order was issued initially for an area between Vanowen and Burbank Boulevard, from County Lane Road east to Valley Circle Boulevard, but shortly before 5:30 p.m., the mandatory order was reduced to an evacuation warning, according to LAFD. Earlier evacuation warnings that were issued for an area bordered by Ingomar and Saticoy Streets south to Burbank Boulevard, from Valley Circle Boulevard east to Woodlake Avenue, have been lifted.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUS, 3 PM: \u003c/strong\u003eFire officials estimated that more than 5,300 structures have been destroyed by the Palisades Fire. The previous destruction estimate was 1,000+ structures burned. The news was per CalFire officials and based on an aerial survey conducted on Wednesday.\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\t\n\n\u003cfigure\u003e\n\n\t\t\t\n\u003cdiv\u003e\n\t\n\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?w=262\" data-lazy-src=\"https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?w=262\" alt=\"\" data-lazy-srcset=\"https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg 682w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=131,150 131w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=262,300 262w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=87,100 87w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=52,60 52w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=352,403 352w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=150,172 150w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=110,126 110w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=285,326 285w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=210,240 210w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=320,366 320w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=420,480 420w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=640,732 640w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=525,600 525w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=672,768 672w\" data-lazy-sizes=\"(min-width: 87.5rem) 1000px, (min-width: 78.75rem) 681px, (min-width: 48rem) 450px, (max-width: 48rem) 250px\" height=\"780\" width=\"682\" decoding=\"\" srcset=\"https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg 682w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=131,150 131w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=262,300 262w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=87,100 87w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=52,60 52w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=352,403 352w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=150,172 150w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=110,126 110w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=285,326 285w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=210,240 210w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=320,366 320w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=420,480 420w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=640,732 640w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=525,600 525w, https://deadline.com/wp-content/uploads/2025/01/structures-update.jpg?resize=672,768 672w\"/\u003e\n\t\t\t\n\t\t\t\u003c/p\u003e\n\t\n\t\u003c/div\u003e\n\t\n\t\n\u003c/figure\u003e\n\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\tA new evacuation order has been issued for a portion of Malibu on the western flank of the Palisades Fire. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe section of the coastal community just given the “go” order lies north of the Malibu Pier, south of Piuma Road and east of Malibu Canyon Drive. It is sparsely populated, but the homes that DO lie within its boundaries are multi-million dollar homes. \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tThe evacuation zone also lies within the Franklin Fire burn scar that was established when that blaze \u003ca data-id=\"1236199270\" data-type=\"post\" href=\"https://deadline.com/2024/12/franklin-fire-central-malibu-wind-evacuation-1236199270/\"\u003eswept through the region\u003c/a\u003e less than a month ago. That should help firefighters. The fact that the order has been issued despite the previous burn scar also says something.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUSLY at 2:01 PM:\u003c/strong\u003e Human remains have been found in the rubble of one of the homes destroyed by the Palisades Fire, according to multiple news reports.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSheriff’s deputies made the discovery after being asked to do a welfare check on a resident who decided to stay behind. What they found was a home that had been burned to the ground in the vicinity of Pacific Coast Highway and Las Flores Canyon Road. While there they discovered the remains. The coroner’s truck was then called in.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe victim has not been identified.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe discovery could bring the total number of lives confirmed lost due to the fires across Los Angeles to six. The death toll from the Eaton Fire stands at five people, according to local officials.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tOver at that blaze on the east side of L.A., the current evacuation orders are as follows:\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\t\n\n\u003cfigure\u003e\n\n\t\t\t\n\u003cdiv\u003e\n\t\n\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?w=300\" data-lazy-src=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?w=300\" alt=\"\" data-lazy-srcset=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png 1962w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=150,73 150w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=300,146 300w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=1024,500 1024w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=1536,750 1536w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=205,100 205w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=60,29 60w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=352,172 352w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=110,54 110w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=285,139 285w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=320,156 320w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=640,312 640w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=800,391 800w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=1280,625 1280w\" data-lazy-sizes=\"(min-width: 87.5rem) 1000px, (min-width: 78.75rem) 681px, (min-width: 48rem) 450px, (max-width: 48rem) 250px\" height=\"500\" width=\"1024\" decoding=\"\" srcset=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png 1962w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=150,73 150w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=300,146 300w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=1024,500 1024w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=1536,750 1536w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=205,100 205w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=60,29 60w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=352,172 352w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=110,54 110w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=285,139 285w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=320,156 320w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=640,312 640w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=800,391 800w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-09-at-1.48.38 PM.png?resize=1280,625 1280w\"/\u003e\n\t\t\t\n\t\t\t\u003c/p\u003e\n\t\n\t\u003c/div\u003e\n\t\n\t\n\u003c/figure\u003e\n\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\tAdditionally, the entire Angeles National Forest is temporarily closed for public safety and the protection of natural resources through Wednesday, January 15.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUSLY at 11:58 AM:\u003c/strong\u003e An immediate evacuation has been ordered for Mount Wilson and the Observatory as the Eaton Canyon Fire advances. Mount Wilson, above Los Angeles, is home to numerous television and radio transmission towers which are utilized for stations in the greater L.A. area.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAt last report, the fire had consumed 10,600 acres in the Pasadena and Altadena areas and was zero percent contained. There was some optimism earlier due to calmer winds Thursday, with some evacuation orders lifted. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThere are no homes in the area, but flames could be seen near the towers and other structures at the summit, NBC4 reports.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe Eaton Canyon fire has left at least five people dead and more than 1,000 structures damaged or destroyed. Numerous injuries also have been reported.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAlso today, FilmLA gave an update on film permits for Greater Los Angeles: \n\n\t\u003c/p\u003e\n\n\n\n\n\u003cblockquote\u003e\n\t\u003cdiv\u003e\u003cp\u003eThe past few days have brought unprecedented risk to life and property from multiple area wildfires, while also placing extreme demands on public safety personnel.\u003c/p\u003e\u003cp\u003eWith deepest appreciation for the efforts of local firefighters, police and paramedics at this difficult time, we advise the production community that personnel resources ordinarily available to support film production may not be available during the local State of Emergency. \u003c/p\u003e\u003cp\u003eThe numerous fires burning in Greater Los Angeles affect multiple City and County jurisdictions, including some served by FilmLA and others that are not. If prior to the fires you obtained permission from FilmLA to film in or near an evacuation zone, expect to have your permit canceled. New applications to film in or near these areas will be denied, until local permit authorities instruct us otherwise. \u003c/p\u003e\u003cp\u003eOutside of evacuation zones, all filmmakers planning to work this week in any jurisdiction served by FilmLA, must verify that public safety personnel assigned to you will be available before you proceed.    \u003c/p\u003e\u003c/div\u003e\u003c/blockquote\u003e\n\n\n\u003cp\u003e\n\tThe number of damaged or destroyed structures in the devastating Palisades Fire “is believed to be in the thousands,” Los Angeles City Fire Chief Kristin M. Crowley said during a news conference Thursday morning. “It is safe to say that the Palisades Fire is one of the most destructive natural disasters in the history of Los Angeles.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tMany of the structures lost are believed to be businesses or homes, Crowley said.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tFierce winds have calmed slightly as firefighters continue to battle the still out-of-control blazes throughout the Los Angeles area, allowing for progress in containment and all-important aerial firefighting efforts to resume. Winds gusts up to 60 MPH are expected to continue through Thursday, according to CalFIre. Red flag warnings remain in effect through 6 p.m. Friday for much of L.A. and Ventura counties due to moderate to strong Santa Ana winds and low humidities, according to the National Weather Service.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tNearly 180,000 people remain under evacuation orders, LA County Sheriff Robert Luna said at the morning news conference.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe evacuation order extends throughout the Pacific Palisades to the Pacific Ocean, including portions of Santa Monica, Malibu and Topanga. Residents and businesses in Calabasas remain under an evacuation warning on Thursday.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAs to fatalities, Luna previously said five people had died in Pasadena’s Eaton Fire but today said the number of fatalities is uncertain, with the true extent of the damage still being assessed.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAcreage statistics have remained mainly unchanged since Wednesday. The Palisades Fire has burned 17,234 acres with zero percent containment, Luna said. The Eaton Fire in Pasadena and Altadena has charred 10,600 acres and is zero percent contained. The Sunset Fire in the Hollywood Hills scorched nearly 43 acres and also is zero percent contained. All evacuation orders were lifted for those impacted by the Sunset Fire at 7:30 a.m. Thursday.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tOne of the fires that also erupted Wednesday, the Woodley Fire near the Sepulveda Basin in the San Fernando Valley, is fully contained at 30 acres.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tLuna also said 20 people have now been arrested for allegedly looting in the various fire areas in the county. “Unfortunately, I expect that to go up,” he said, adding that deputies will begin arresting anyone who is in an evacuation area without authorization.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUS, 12:30 AM: \u003c/strong\u003eNearly 2,000 structures have been burned across Los Angeles in the past 48 hours, 1,000 in the Palisades Fire and 972 in the Eaton Fire in and around Altadena. Additionally, in addition to the five people who have been killed in the latter blaze, five firefighters have also been injured. Of note, at least one firefighter was hurt battling the Palisades Fire.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe area scorched by the Palisades Fire was updated late tonight from a bit over 15,000 acres to 17,234 acres. \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tThree more structures burned in Studio City when what seemed to be spot fires caused multiple ignitions. On the other side of the hill, \u003ca data-id=\"1236252259\" data-type=\"post\" href=\"https://deadline.com/2025/01/hollywood-hills-fire-runyon-canyon-1236252259/\"\u003ethe Sunset Fire\u003c/a\u003e near Runyon Canyon scorched 60 acres in the Hollywood Hills.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn Santa Monica, city officials instituted a curfew from from sunset to sunrise in the areas where a mandatory evacuation order is in effect.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUSLY at 2:54 p.m.:\u003c/strong\u003e Los Angeles County Sheriff Robert Luna says five people have now died in the Eaton Fire burning in the Altadena and Pasadena areas. Luna told KNX News there is no additional information available about the deaths. The number of lives lost stood at two this morning.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tPresident Joe Biden has approved a major disaster declaration in response to the wildfires burning in the Los Angeles area, which allows those impacted to immediately access federal funds. FEMA also approved a grant to reimburse the state for firefighting costs. The federal government has provided five U.S. Forest Service tankers and 10 firefighting helicopters to support local and state operations. Biden appeared at a Santa Monica fire station and in a statement posted to X, he said, “Over 100,000 people have been ordered to evacuate communities impacted by the Southern California wildfires. At least two people have been killed. And many more are injured — including firefighters. It’s devastating. To the residents of Southern California: We are with you.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tMeanwhile, Former President Barack Obama also weighed in.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tAlso, the City of Santa Monica has updated its evacuation order to include the portion of the city north of Montana and west of 11th Street. The area was previously under an evacuation warning. A new warning was issued for the section of the city that runs south to Wilshire Blvd., west to the Pacific Ocean and east to 10th Ct.\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\t\n\n\u003cfigure\u003e\n\n\t\t\t\n\u003cdiv\u003e\n\t\n\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?w=300\" data-lazy-src=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?w=300\" alt=\"\" data-lazy-srcset=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png 1674w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=150,96 150w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=300,192 300w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=1024,657 1024w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=1536,985 1536w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=156,100 156w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=60,38 60w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=352,226 352w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=110,71 110w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=285,183 285w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=320,205 320w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=640,411 640w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=800,513 800w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=1280,821 1280w\" data-lazy-sizes=\"(min-width: 87.5rem) 1000px, (min-width: 78.75rem) 681px, (min-width: 48rem) 450px, (max-width: 48rem) 250px\" height=\"657\" width=\"1024\" decoding=\"\" srcset=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png 1674w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=150,96 150w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=300,192 300w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=1024,657 1024w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=1536,985 1536w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=156,100 156w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=60,38 60w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=352,226 352w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=110,71 110w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=285,183 285w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=320,205 320w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=640,411 640w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=800,513 800w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-2.33.24 PM.png?resize=1280,821 1280w\"/\u003e\n\t\t\t\n\t\t\t\u003c/p\u003e\n\t\n\t\u003c/div\u003e\n\t\n\t\n\u003c/figure\u003e\n\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e \u003c/strong\u003ePresident Biden \u003ca href=\"https://deadline.com/2025/01/biden-los-angeles-fires-wind-1236250290/\"\u003ewas briefed by local officials\u003c/a\u003e this morning on the battle against the four major wildfires ringing Northern Los Angeles and it wasn’t good news.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tPer an Associated Press \u003ca rel=\"nofollow\" href=\"https://apnews.com/live/live-updates-wildfire-los-angeles-palisades?taid=677eddcbc338db0001e689e5\u0026amp;utm_campaign=TrueAnthem\u0026amp;utm_medium=AP\u0026amp;utm_source=Twitter\" target=\"_blank\"\u003eanalysis\u003c/a\u003e, the Palisades Fire on L.A.’s Westside is now the most destructive in the city’s history, having destroyed 1,000 structures. Previously, the 2008 Sayre Fire in Sylmar that destroyed 604 structures held that dubious distinction. For those with longer memories who recall the devastating Bel-Air Fire in 1960, that blaze took close to 500 structures.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tAmong those structures was Will Rogers’ historic ranch house at Will Rogers State Park. The State Parks and Recreation Department announced the loss today along with “more than 30 structural losses at Topanga State Park and Will Rogers SHP.”\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tAs of 11:20 a.m. this morning, the Palisades Fire had grown to more than 11,800 acres, more than double the number released earlier this morning. By 1:30 p.m., that number had jumped to 15,832 acres.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe Associated Press \u003ca href=\"https://apnews.com/live/live-updates-wildfire-los-angeles-palisades#00000194-47fd-d698-afdf-d7ff3cc20000\" rel=\"nofollow\" target=\"_blank\"\u003ereported\u003c/a\u003e that over 1.5 million people in Southern California were without power due to the fires and winds. Of those, 957,000 were in L.A. County and 334,000 in Ventura County.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tOn the opposite end of L.A. County the Eaton Fire, which started last night above Altadena, had grown nearly as large at 10,600 acres burned. Two other fires, the Hurst Fire which broke out in Sylmar near the junction of the 5 and 14 Freeways and the Woodley Fire in the Sepulveda Basin, were at 700 acres and 30 acres, respectively.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAround 1 p.m., Los Angeles County Supervisor Kathryn Barger said between 200 to 500 structures had been destroyed, and another 13,000 structures were at risk. More than 32,500 residents were placed under evacuation orders in the nearby regions including Pasadena and Altadena, she said.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tOne of the structures that was destroyed in the fire was the Pasadena Jewish Temple \u0026amp; Center.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAll those blazes were fanned by heavy, unpredictable winds. The top gusts over the past 48 hours include Mount Lukens Truck Trail above La Crescenta at 100 mph, Magic Mountain Truck Trail near Sylmar at 90 mph, Saddle Peak in Malibu at 98 mph, Hollywood-Burbank Airport at 84 mph and Eaton Canyon at 70 mph. A portion of that flank of the fire was nearing the Franklin Fire burn scar, which could prove helpful to firefighters.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tPer the National Weather Service, “The high speed river of air remains over LA County this morning and is fueling a widespread major wind event. The core of this low level jet will slowly move southward during the day and this will cause the winds over LA to slowly decrease. Since the wind speeds are so high now (mtn gusts 70 to 90 mph) the slow decrease will not bring the winds down to below warning levels until early evening.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAnother Santa Ana event is on tap for Friday, according to the NWS.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t L.A. County emergency officials said this morning that more than 50,000 people had been evacuated due to the fires and more than 1,400 firefighters were engaged. More than 320,000 people were reportedly without power.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe evacuation/warning zones for the Palisades blaze was expanded to the west this morning, with an area west of Malibu Canyon Road encompassing Malibu Creek State Park and the historic \u003cem\u003eM*A*S*H\u003c/em\u003e set and the area where the original \u003cem\u003ePlanet of the Apes\u003c/em\u003e and many other films and TV shows were shot. See the yellow area on the left of the map below.\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\t\n\n\u003cfigure\u003e\n\n\t\t\t\n\u003cdiv\u003e\n\t\n\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?w=300\" data-lazy-src=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?w=300\" alt=\"\" data-lazy-srcset=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png 1998w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=150,74 150w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=300,148 300w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=1024,504 1024w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=1536,756 1536w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=203,100 203w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=60,30 60w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=352,173 352w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=110,54 110w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=285,140 285w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=320,158 320w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=640,315 640w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=800,394 800w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=1280,630 1280w\" data-lazy-sizes=\"(min-width: 87.5rem) 1000px, (min-width: 78.75rem) 681px, (min-width: 48rem) 450px, (max-width: 48rem) 250px\" height=\"504\" width=\"1024\" decoding=\"\" srcset=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png 1998w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=150,74 150w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=300,148 300w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=1024,504 1024w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=1536,756 1536w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=203,100 203w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=60,30 60w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=352,173 352w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=110,54 110w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=285,140 285w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=320,158 320w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=640,315 640w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=800,394 800w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.17.45 AM.png?resize=1280,630 1280w\"/\u003e\n\t\t\t\n\t\t\t\u003c/p\u003e\n\t\n\t\u003c/div\u003e\n\t\n\t\n\u003c/figure\u003e\n\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\tAt noon, KTLA5 broadcast video of the fire making a push north toward Old Topanga and Calabasas at Saddle Peak Road. The outlet’s airborne reporter, from his vantage in a helicopter, said the fire seemed to be spreading “in every direction.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn addition to the devastation in the hills, homes along PCH were also hit.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cdiv\u003e\n\u003cblockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/reel/DEkiwVgvDsH/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e\u003c/blockquote\u003e\n\u003c/div\u003e\u003c/figure\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tThe good news is that the evacuation order zone established last night in Santa Monica — north of San Vicente — did not grow. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tOver near Altadena, the evacuation zone — in red below — grew massively overnight as flames moved into neighborhoods below Eaton Canyon, where the fire sparked. The evacuation warning zone expanded in nearly every direction, including into the City of Pasadena north of the 210.\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\t\n\n\u003cfigure\u003e\n\n\t\t\t\n\u003cdiv\u003e\n\t\n\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?w=300\" data-lazy-src=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?w=300\" alt=\"\" data-lazy-srcset=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png 1950w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=150,80 150w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=300,160 300w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=1024,547 1024w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=1536,821 1536w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=187,100 187w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=60,32 60w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=352,188 352w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=110,59 110w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=285,152 285w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=320,171 320w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=640,342 640w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=800,427 800w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=1280,684 1280w\" data-lazy-sizes=\"(min-width: 87.5rem) 1000px, (min-width: 78.75rem) 681px, (min-width: 48rem) 450px, (max-width: 48rem) 250px\" height=\"547\" width=\"1024\" decoding=\"\" srcset=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png 1950w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=150,80 150w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=300,160 300w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=1024,547 1024w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=1536,821 1536w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=187,100 187w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=60,32 60w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=352,188 352w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=110,59 110w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=285,152 285w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=320,171 320w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=640,342 640w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=800,427 800w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-08-at-11.28.10 AM.png?resize=1280,684 1280w\"/\u003e\n\t\t\t\n\t\t\t\u003c/p\u003e\n\t\n\t\u003c/div\u003e\n\t\n\t\n\u003c/figure\u003e\n\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\tAll of those blazes are currently at 0% containment.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUSLY at 8:39 a.m.:\u003c/strong\u003e Fierce winds continue to drive multiple wildfires in the Los Angeles area, leaving two people dead, multiple people injured and more than 320,000 people without power.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe Palisades Fire has churned through more than 5,000 acres and destroyed some 1,000 structures, Los Angeles County Fire Anthony Marrone said at a morning news conference in Pacific Palisades, covered by all major broadcast and cable networks. There are a “high number of significant injuries to residents who did not evacuate, in addition to first responders who were on the fire lines,” he said. The cause of the fire is unknown and is under investgation.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tTelevision news footage shows homes on the beach in nearby Malibu burned to the ground.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe \u003ca href=\"https://deadline.com/2025/01/eaton-canyon-fire-breaks-out-pasadena-mandatory-evacuations-wind-flames-spread-1236250956/\"\u003eEaton Fire in Pasadena\u003c/a\u003e, which broke out late last night, has burned over 2,000 acres. Two civilians are reported dead and multiple people have suffered significant injuries, Marrone said. An estimated 100 structures have been destroyed. The cause of the Eaton Fire also is unknown and under investigation.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tOne of the structures destroyed in the Eaton fire was the Pasadena Jewish Temple \u0026amp; Center, NBC4 reported.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe Hurst Fire in the San Fernando Valley, which also broke out late yesterday, has burned 500 acres.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tIn addition to the Palisades, Eaton and Hurst fires, a fourth fire — the Woodley Fire in Sepulveda Basin — has broken out. A fifth one, the \u003ca rel=\"noreferrer noopener nofollow\" target=\"_blank\" href=\"https://www.fire.ca.gov/incidents/2025/1/8/tyler-fire\"\u003eTyler Fire\u003c/a\u003e, started burning in Riverside County, scorching 15 acres so far.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tA smoke advisory has been issued around much of the Malibu Coast to Santa Monica, stretching all the way east to Pasadena, through 5 p.m. Wednesday.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe Palisades Fire  has destroyed many parts of its namesake enclave, including portions of Palisades Village and, up the coast a bit, The Reel Inn and Topanga Ranch Motel on PCH at Topanga Canyon Boulevard.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe fires have forced the closure of Universal Hollywood Studios theme and Universal CityWalk, as well as access to the Hollywood Sign, Griffith Park and Los Angeles Zoo.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tThe blaze continued to spread, fanned by high winds that topped out at 38 mph in the Palisades, 56 mph in Topanga and 59 mph at the Santa Monica Airport at 9:34 p.m. In Eastern Malibu, Saddle Peak clocked gusts to 98 mph at 9:37 p.m. Those wind speeds are expected to increase in the coming hours before lessening somewhat just before dawn. Winds are expected to remain high until Wednesday evening in most areas, with some pockets seeing elevated gusts through Friday.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cdiv\u003e\n\u003cblockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/reel/DEkorxXPCgF/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e\u003c/blockquote\u003e\n\u003c/div\u003e\u003c/figure\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tAs a result of the firestorm, a 25-year-old female firefighter sustained a serious head injury as a result of the Palisades Fire. She was treated at the scene and taken to a hospital for further evaluation and treatment, according to Los Angeles Fire Department spokesman Capt. Erik Scott.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tScott also said multiple burn victims were reported walking toward Duke’s Malibu restaurant at approximately 9 p.m. Incident operations redirected medical resources to the location to provide evaluation and treatment.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe City of Santa Monica has issued an evacuation order for all areas of the city north of San Vicente. “Evacuation Order: Immediate threat to life. This is a lawful order to LEAVE NOW. The area is closed to public access.”\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tSee the map below from the Santa Monica Police Department for the exact parameters of the order (in red) as well as the area north of Montana, which is under an evacuation warning. Per the city, an evacuation warning is defined thusly: “Potential threat to life and/or property. Those who require additional time to evacuate, and those with pets and livestock should leave now.”\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\t\n\n\u003cfigure\u003e\n\n\t\t\t\n\u003cdiv\u003e\n\t\n\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?w=300\" data-lazy-src=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?w=300\" alt=\"\" data-lazy-srcset=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png 1054w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=150,91 150w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=300,182 300w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=1024,620 1024w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=165,100 165w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=60,36 60w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=352,213 352w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=110,67 110w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=285,173 285w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=320,194 320w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=640,387 640w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=800,484 800w\" data-lazy-sizes=\"(min-width: 87.5rem) 1000px, (min-width: 78.75rem) 681px, (min-width: 48rem) 450px, (max-width: 48rem) 250px\" height=\"620\" width=\"1024\" decoding=\"\" srcset=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png 1054w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=150,91 150w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=300,182 300w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=1024,620 1024w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=165,100 165w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=60,36 60w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=352,213 352w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=110,67 110w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=285,173 285w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=320,194 320w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=640,387 640w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-8.01.35 PM.png?resize=800,484 800w\"/\u003e\n\t\t\t\n\t\t\t\u003c/p\u003e\n\t\n\t\u003c/div\u003e\n\t\n\t\n\u003c/figure\u003e\n\n\u003c/div\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tAll Malibu schools will be closed again tomorrow due to the continuing winds and the Palisades Fire, according to the Santa Monica Malibu Unified School District.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tEven as today’s devastating Palisades Fire has scorched close to 3,000 acres and prompted evacuations through the Pacific Palisades and Topanga “get set” warnings north to Calabasas, a new blaze is spreading rapidly in the hills above Altadena.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tMultiple evacuations have already been issued in Altadena itself and even a portion of Pasadena. See portions in red in map below. Evacuation warnings have been issued down to the 210 Freeway in Pasadena proper. See areas in yellow below.\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\t\n\n\u003cfigure\u003e\n\n\t\t\t\n\u003cdiv\u003e\n\t\n\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?w=300\" data-lazy-src=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?w=300\" alt=\"\" data-lazy-srcset=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png 1586w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=150,98 150w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=300,195 300w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=1024,666 1024w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=1536,999 1536w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=154,100 154w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=60,39 60w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=352,229 352w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=110,72 110w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=285,185 285w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=320,208 320w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=640,416 640w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=800,521 800w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=1280,833 1280w\" data-lazy-sizes=\"(min-width: 87.5rem) 1000px, (min-width: 78.75rem) 681px, (min-width: 48rem) 450px, (max-width: 48rem) 250px\" height=\"666\" width=\"1024\" decoding=\"\" srcset=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png 1586w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=150,98 150w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=300,195 300w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=1024,666 1024w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=1536,999 1536w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=154,100 154w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=60,39 60w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=352,229 352w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=110,72 110w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=285,185 285w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=320,208 320w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=640,416 640w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=800,521 800w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-7.43.47 PM.png?resize=1280,833 1280w\"/\u003e\n\t\t\t\n\t\t\t\u003c/p\u003e\n\t\n\t\u003c/div\u003e\n\t\n\t\n\u003c/figure\u003e\n\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\tMeanwhile on the west side, the Palisades Fire has reached the campus of Pali High, with CBS News National Correspondent sharing video of the conflagration.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUSLY at 6:30 p.m.:\u003c/strong\u003eThe size of the Palisades Fire and its evacuation zone have nearly doubled in size in just under two hours. From 1,260 acres just before 3 p.m. today, the fire exploded to 2,920 acres at 6:30 p.m.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tLikewise, while the “must leave” list included most of the Palisades and a section of the Malibu coast moving west, at 6 p.m. the evacuation orders were expanded to include most of Topanga Canyon and the Malibu coast past Las Flores Canyon to just east of the pier. See updated chart, with evacuation orders in red and evacuation orders in yellow, directly below. \u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\t\n\n\u003cfigure\u003e\n\n\t\t\t\n\u003cdiv\u003e\n\t\n\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?w=300\" data-lazy-src=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?w=300\" alt=\"\" data-lazy-srcset=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png 1570w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=150,103 150w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=300,205 300w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=1024,700 1024w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=1536,1051 1536w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=146,100 146w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=60,41 60w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=352,241 352w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=110,75 110w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=285,195 285w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=320,219 320w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=640,438 640w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=800,547 800w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=1280,876 1280w\" data-lazy-sizes=\"(min-width: 87.5rem) 1000px, (min-width: 78.75rem) 681px, (min-width: 48rem) 450px, (max-width: 48rem) 250px\" height=\"700\" width=\"1024\" decoding=\"\" srcset=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png 1570w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=150,103 150w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=300,205 300w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=1024,700 1024w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=1536,1051 1536w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=146,100 146w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=60,41 60w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=352,241 352w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=110,75 110w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=285,195 285w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=320,219 320w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=640,438 640w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=800,547 800w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-6.10.00 PM.png?resize=1280,876 1280w\"/\u003e\n\t\t\t\n\t\t\t\u003c/p\u003e\n\t\n\t\u003c/div\u003e\n\t\n\t\n\u003c/figure\u003e\n\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\tAlso of note: For the first time the evacuation warnings include areas of Calabasas south of the 101 as well as the area around the Malibu Pier, potentially indicating the directions in which the fire is moving.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe environs of central Malibu outside city hall and the shopping district were, of course, \u003ca href=\"https://deadline.com/2024/12/franklin-fire-central-malibu-wind-evacuation-1236199270/\"\u003escorched less than a month ago\u003c/a\u003e by the Franklin Fire. That blaze scorched thousands of acres which could act as a buffer to further spread of today’s fire to the west.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tKTLA5 has reported that brush near the Getty Center had caught fire, prompting concerns for the building itself. A post on the facility’s X account confirmed some trees and vegetation had been scorched, but “no structures are on fire, and staff and the collection remain safe.” Deadline confirmed earlier that \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tThe following Los Angeles Unified School District schools will be closed tomorrow due to the Palisades Fire: Canyon Charter Elementary School, Marquez Charter Elementary School, Palisades Charter Elementary School, and Paul Revere Charter Middle School. District officials say they will monitor the fire on Wednesday and potentially shift those campuses to remote learning on Thursday.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUSLY at 4:15 p.m.:\u003c/strong\u003e “Hell of a way to start a new year,” said California Governor Gavin Newsom this afternoon at a news conference related to the Palisades Fire. After thanking local officials and first responders he added, “By no stretch of the imagination are we out of the woods.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIndeed, city, county and federal officials have already declared states of emergency.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tLos Angeles Police Chief Jim McDonnell said 30,000 people had been evacuated in the approximately sic hours since the blaze began in the area of N Piedra Morada Drive. Los Angeles Fire Department Chief Kristen Crowley indicated that 10,000 households had been evacuated. While no injuries had thus far been reported, she said that “multiple structures” had been damaged. The fire was moving west.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003ePREVIOUSLY at 2:50 p.m.:\u003c/strong\u003e Homes have been destroyed as high winds \u003ca data-id=\"1236249158\" data-type=\"post\" href=\"https://deadline.com/2025/01/windstorm-los-angeles-ventura-counties-forecast-1236249158/\"\u003eforecast to increase to between 40 and 60 miles per hour\u003c/a\u003e later this afternoon fanned a wildfire that has now scorched \u003ca rel=\"nofollow\" href=\"https://www.fire.ca.gov/incidents/2025/1/7/palisades-fire\" target=\"_blank\"\u003e1260-plus acres\u003c/a\u003e in Pacific Palisades. According to reports multiple homes have been destroyed.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWhile it began as a 10 acre blaze at about 10:30 a.m. in the area of N Piedra Morada Dr near The Highlands, the incident quickly became a 200-plus acre blaze in less than an hour, threatening homes with smoke blowing West toward the Getty Villa. The museum is closed to the public today, but a source tells Deadline the people working there were told to leave. The facility reportedly has a very detailed plan to keep the art safe, including fireproof walls.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThere are over 250 LAFD firefighters battling the blaze, in addition to those from neighboring agencies. \n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tEastbound Pacific Coast Highway has been closed at Topanga Canyon Boulevard. Eastbound lanes of PCH were also closed at Las Flores Canyon Road, according L.A.C.S.D Public Information Officer Tuyet Alcala. Traffic was being diverted on the Santa Monica Freeway at Lincoln Boulevard to keep people from entering the area. Sunset Boulevard at Palisades Drive was also reportedly impassible, with firefighters potentially using the thoroughfare as a firebreak.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAt about 12:30 p.m., with local roads choked with traffic and some people abandoning their cars, residents were evacuating on foot, according to Captain Eric Scott of the Los Angeles Fire Department.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tOn KTLA5, a local resident — who the young reporter did not recognize as actor Steve Gutenberg — plead with people who were abandoning their cars to at least leave the keys in them so others could move the vehicles blocking their way. “This is not a parking lot,” said the actor. “If you leave your car on Palisades Drive, leave the keys in it so a guy like me can move it.”\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tEvacuation orders were issued at about noon for the area around Piedra Morada, according to multiple news outlets. Areas near Topanga to the west and Rustic Canyon to the east were reportedly under evacuation warnings. Emergency officials are urging anyone in the path of the fire to leave the area.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn fact, one former ABC7 local TV reporter was live on the air from her home and had to get off when she received the evacuation order. An alert sent out by the Malibu/Lost Hills Sheriff Station warned of “immediate threat to life.” See map below for current evacuations as of 1 p.m. Mandatory evacuations are in red and evacuation warnings are in yellow.\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\t\n\n\u003cfigure\u003e\n\n\t\t\t\n\u003cdiv\u003e\n\t\n\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?w=300\" data-lazy-src=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?w=300\" alt=\"\" data-lazy-srcset=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png 1154w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=150,77 150w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=300,153 300w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=1024,524 1024w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=196,100 196w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=60,31 60w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=352,180 352w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=110,56 110w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=285,146 285w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=320,164 320w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=640,327 640w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=800,409 800w\" data-lazy-sizes=\"(min-width: 87.5rem) 1000px, (min-width: 78.75rem) 681px, (min-width: 48rem) 450px, (max-width: 48rem) 250px\" height=\"524\" width=\"1024\" decoding=\"\" srcset=\"https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png 1154w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=150,77 150w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=300,153 300w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=1024,524 1024w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=196,100 196w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=60,31 60w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=352,180 352w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=110,56 110w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=285,146 285w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=320,164 320w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=640,327 640w, https://deadline.com/wp-content/uploads/2025/01/Screenshot-2025-01-07-at-2.25.04 PM.png?resize=800,409 800w\"/\u003e\n\t\t\t\n\t\t\t\u003c/p\u003e\n\t\n\t\u003c/div\u003e\n\t\n\t\n\u003c/figure\u003e\n\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\tLocal TV stations broke into coverage of former President Jimmy Carter’s memorial services to cover the incident, with remote crews staging shots from the beach parking lots on PCH with a billowing black plume in the background. The smoke could also be seen across most of West Los Angeles.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tActor James Woods posted close-up video of flames approaching the back deck of his home.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cfigcaption\u003eThe Emmy-winner also indicated that he had safely evacuated writing, “We were blessed to have LA fire and police depts doing their jobs so well. We are safe and out. There are several elementary schools in our neighborhood and there was an enormous community effort to evacuate the children safely. Can not speak more highly of the LA fire and LAPD.”\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tFormer \u003cem\u003eFall Guy\u003c/em\u003e actress and writer Heather Thomas posted several videos of the fire on a hill nearby, noting in one clip that “both of my daughters live across the canyon and [are] evacuating over here.” Thomas’ husband is Ziffren Brittenham LLP founding partner Skip Brittenham.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tThe National Weather Service in has been warning for several days that today’s windstorm would bring extreme fire conditions as it couples very high winds with very low humidity. Winds were \u003ca rel=\"nofollow\" href=\"https://x.com/CaliforniaWxGuy/status/1876714385881628966\" target=\"_blank\"\u003eclocked at 46 mph\u003c/a\u003e in the Palisades this morning. Humidity is expected to be critically low on Wednesday.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\tAs of about noon, SCE had begun emergency power shutdowns to prevent power lines blown down by winds from sparking fires. Areas effected included the Point Dume area and up the the coast into Western Malibu.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tYou can watch a time lapse video of the start and growth of the Pacific Palisades fire below.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cfigure\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\n\t\u003cem\u003eCity News Service contributed to this report.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "70 min read",
  "publishedTime": "2025-02-21T01:01:32Z",
  "modifiedTime": "2025-02-21T01:01:34Z"
}
