{
  "id": "86429440-7305-4c67-aa69-080a947d357d",
  "title": "Divergent Filmmaker Reflects on His Time with the Franchise",
  "link": "https://bleedingcool.com/movies/divergent-filmmaker-reflects-on-his-time-with-the-franchise/",
  "description": "The director of the Divergent film shares his thoughts on the future of the franchise and reflects on his experiences working with it.",
  "author": "Aedan Juvet",
  "published": "Sun, 26 Jan 2025 16:47:07 -0600",
  "source": "https://www.bleedingcool.com/movies/feed/",
  "categories": [
    "Lionsgate",
    "Movies",
    "divergent",
    "film",
    "lionsgate",
    "neil burger"
  ],
  "byline": "Aedan Juvet",
  "length": 2841,
  "excerpt": "The Divergent book series has enjoyed substantial popularity over the years. However, its live-action film adaptations haven't quite mirrored that success despite its cult audience, noteworthy budget, and recognizable cast. As a matter of fact, each of the three films generally underperformed, and the planned fourth film was ultimately canceled, suggesting that Hollywood adaptations of […]",
  "siteName": "Bleeding Cool News",
  "favicon": "",
  "text": "Posted in: Lionsgate, Movies | Tagged: divergent, film, lionsgate, neil burgerThe director of the Divergent film shares his thoughts on the future of the franchise and reflects on his experiences working with it.Article Summary Neil Burger discusses possible reboot ideas for the Divergent franchise. The Divergent films didn't match the book series' popularity, leading to cancellation of the fourth film. Director reflects on the impact of casting Shailene Woodley and others in their roles. Speculation about the future of Divergent remains as fans wonder about potential revivals. The Divergent book series has enjoyed substantial popularity over the years. However, its live-action film adaptations haven't quite mirrored that success despite its cult audience, noteworthy budget, and recognizable cast. As a matter of fact, each of the three films generally underperformed, and the planned fourth film was ultimately canceled, suggesting that Hollywood adaptations of the franchise might be at an impasse for now. Now, the filmmaker behind the Divergent films is opening up about where the franchise could go next and what that might entail. Divergent: Lionsgate Divergent Director on the Future of the Franchise When talking to Screen Rant, Divergent filmmaker Neil Burger shared his thoughts on the idea of a possible future of the franchise, with Burger noting, \"And they just kind of reboot everything. I have not thought about that; I'm sure that's crossed Lionsgate's mind to do it in a different way. I'm really proud of that movie, and I'm particularly proud of the cast that I got together for it, whether it be Shailene Woodley, or Theo James, or Miles Teller, or Kate Winslet. Many of them, it was sort of an early, important role for them, and they were so fun to work with. So, it was great, I always will be part of that franchise and am happy to be part of it in some way.\" Divergent official plot summary: In a world divided by factions based on virtues, Tris learns she's Divergent and won't fit in. When she discovers a plot to destroy Divergents, Tris and the mysterious Four must find out what makes Divergents dangerous before it's too late. The first film stars Shailene Woodley, Theo James, Ashley Judd, Jai Courtney, Ray Stevenson, Zoë Kravitz, Miles Teller, Tony Goldwyn, Maggie Q, and Kate Winslet. Would you be interested in a possible Divergent revival? It kind of seems like it's only a matter of time anyway, right? Enjoyed this? Please share on social media! Stay up-to-date and support the site by following Bleeding Cool on Google News today! About Aedan JuvetA self-proclaimed pop culture aficionado with a passion for all things horror. Words for Cosmopolitan, Screen Rant, MTV News, NME, etc. For pitches, please email aedanjuvet@gmail.com",
  "image": "https://bleedingcool.com/wp-content/uploads/2023/10/divergent-1-2000x1125.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"wrapper\"\u003e\u003carticle id=\"article\" data-post-id=\"2153248\" itemscope=\"\" itemtype=\"http://schema.org/Article\"\u003e\u003cp\u003ePosted in: \u003ca href=\"https://bleedingcool.com/movies/lionsgate/\" rel=\"category\"\u003eLionsgate\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/movies/\" rel=\"category\"\u003eMovies\u003c/a\u003e | Tagged: \u003ca href=\"https://bleedingcool.com/tag/divergent/\" rel=\"tag\"\u003edivergent\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/film-2/\" rel=\"tag\"\u003efilm\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/lionsgate/\" rel=\"tag\"\u003elionsgate\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/neil-burger/\" rel=\"tag\"\u003eneil burger\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\u003cp\u003eThe director of the Divergent film shares his thoughts on the future of the franchise and reflects on his experiences working with it.\u003c/p\u003e\u003chr/\u003e\u003chr/\u003e\u003cdiv id=\"post_summary\"\u003e\u003ch2\u003eArticle Summary\u003c/h2\u003e\u003cul\u003e\n\u003cli\u003eNeil Burger discusses possible reboot ideas for the Divergent franchise.\u003c/li\u003e\n\u003cli\u003eThe Divergent films didn\u0026#39;t match the book series\u0026#39; popularity, leading to cancellation of the fourth film.\u003c/li\u003e\n\u003cli\u003eDirector reflects on the impact of casting Shailene Woodley and others in their roles.\u003c/li\u003e\n\u003cli\u003eSpeculation about the future of Divergent remains as fans wonder about potential revivals.\u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003chr/\u003e\u003cp\u003e\u003ciframe width=\"1170\" height=\"658\" srcdoc=\"\u0026lt;style\u0026gt;*{padding:0;margin:0;overflow:hidden}html,body{height:100%}img,span{position:absolute;width:100%;top:0;bottom:0;margin:auto}span{height:1.5em;text-align:center;font:48px/1.5 sans-serif;color:white;text-shadow:0 0 0.5em black}\u0026lt;/style\u0026gt;\u0026lt;a href=https://www.youtube.com/embed/Aw7Eln_xuWc?feature=oembed?autoplay=1\u0026gt;\u0026lt;img src=https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://img.youtube.com/vi/Aw7Eln_xuWc/hqdefault.jpg loading=\u0026#34;lazy\u0026#34; alt=\u0026#34;Link to play video.\u0026#34;\u0026gt;\u0026lt;span\u0026gt;▶\u0026lt;/span\u0026gt;\u0026lt;/a\u0026gt;\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture; fullscreen;\" loading=\"lazy\" src=\"https://www.youtube.com/embed/Aw7Eln_xuWc?feature=oembed\" title=\"Youtube Video\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003cp\u003eThe \u003cem\u003eDivergent\u003c/em\u003e \u003ca href=\"https://bleedingcool.com/movies/divergent-author-shares-her-feelings-on-the-cancelled-final-film/\"\u003ebook series\u003c/a\u003e has enjoyed substantial popularity over the years. However, its live-action film adaptations haven\u0026#39;t quite mirrored that success despite its cult audience, noteworthy budget, and recognizable cast. As a matter of fact, each of the three films generally underperformed, and the planned fourth film was ultimately canceled, suggesting that Hollywood adaptations of the franchise might be at an impasse for now. Now, the filmmaker behind the\u003cem\u003e Divergent\u003c/em\u003e films is opening up about where the franchise could go next and what that might entail.\u003c/p\u003e\n\u003cfigure id=\"attachment_1910506\" aria-describedby=\"caption-attachment-1910506\"\u003e\u003cimg src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:420/q:75/https://bleedingcool.com/wp-content/uploads/2023/10/divergent-1.jpg\" alt=\"Divergent Author Shares Her Feelings on the Cancelled Final Film\" width=\"600\" height=\"420\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:420/q:75/https://bleedingcool.com/wp-content/uploads/2023/10/divergent-1.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20600%20420%22%20width%3D%22600%22%20height%3D%22420%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003cfigcaption id=\"caption-attachment-1910506\"\u003eDivergent: Lionsgate\u003c/figcaption\u003e\u003c/figure\u003e\n\u003ch2\u003e\u003cem\u003eDivergent\u003c/em\u003e Director on the Future of the Franchise\u003c/h2\u003e\n\u003cp\u003eWhen \u003ca href=\"https://screenrant.com/divergent-movie-reboot-chances-neil-burger-response/\"\u003etalking\u003c/a\u003e to\u003cem\u003e Screen Rant\u003c/em\u003e,\u003cem\u003e Divergent\u003c/em\u003e filmmaker \u003cstrong\u003eNeil Burger\u003c/strong\u003e shared his thoughts on the idea of a possible future of the franchise, with Burger noting, \u0026#34;And they just kind of reboot everything. I have not thought about that; I\u0026#39;m sure that\u0026#39;s crossed Lionsgate\u0026#39;s mind to do it in a different way. I\u0026#39;m really proud of that movie, and I\u0026#39;m particularly proud of the cast that I got together for it, whether it be Shailene Woodley, or Theo James, or Miles Teller, or Kate Winslet. Many of them, it was sort of an early, important role for them, and they were so fun to work with. So, it was great, I always will be part of that franchise and am happy to be part of it in some way.\u0026#34;\u003c/p\u003e\n\u003cp\u003eDivergent official plot summary: In a world divided by factions based on virtues, Tris learns she\u0026#39;s Divergent and won\u0026#39;t fit in. When she discovers a plot to destroy Divergents, Tris and the mysterious Four must find out what makes Divergents dangerous before it\u0026#39;s too late. The first film stars \u003cstrong\u003eShailene Woodley, Theo James, Ashley Judd, Jai Courtney, Ray Stevenson, Zoë Kravitz, Miles Teller, Tony Goldwyn, Maggie Q,\u003c/strong\u003e and \u003cstrong\u003eKate Winslet\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eWould you be interested in a possible \u003cem\u003eDivergent\u003c/em\u003e revival? It kind of seems like it\u0026#39;s only a matter of time anyway, right?\u003c/p\u003e\n\u003chr/\u003e\u003cdiv id=\"bc_sharing_is_caring\"\u003e\u003ccenter\u003e\u003cp\u003e\u003cstrong\u003eEnjoyed this? Please share on social media!\u003c/strong\u003e\u003c/p\u003e\u003ca href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fdivergent-filmmaker-reflects-on-his-time-with-the-franchise%2F\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://twitter.com/share?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fdivergent-filmmaker-reflects-on-his-time-with-the-franchise%2F\u0026amp;text=Divergent+Filmmaker+Reflects+on+His+Time+with+the+Franchise\u0026amp;via=bleedingcool\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"http://pinterest.com/pin/create/button/?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fdivergent-filmmaker-reflects-on-his-time-with-the-franchise%2F\u0026amp;description=Divergent+Filmmaker+Reflects+on+His+Time+with+the+Franchise\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://reddit.com/submit?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fdivergent-filmmaker-reflects-on-his-time-with-the-franchise%2F\u0026amp;title=Divergent+Filmmaker+Reflects+on+His+Time+with+the+Franchise\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003c/center\u003e\u003c/div\u003e\n    \u003ca id=\"google_follow\" href=\"https://news.google.com/publications/CAAqBwgKMPHflgsw1IauAw?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n        \u003cp\u003e\u003cimg width=\"100\" height=\"81\u0026#34;\" src=\"https://bleedingcool.com/Google_News_icon.png\"/\u003e\n        \u003c/p\u003e\n        \u003cp\u003e\n            Stay up-to-date and support the site by following Bleeding Cool on Google News today!\n        \u003c/p\u003e\n    \u003c/a\u003e\u003c/article\u003e\u003csection\u003e\u003ch2\u003e\u003cimg data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:150/h:150/q:75/https://www.gravatar.com/avatar/2500221ce21a38e3e1ae0062dba07dbc?s=150\" src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20150%20150%22%20width%3D%22150%22%20height%3D%22150%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\" width=\"150px\" height=\"150px\" alt=\"Aedan Juvet\"/\u003eAbout \u003ca href=\"https://bleedingcool.com/author/ajuvet/\"\u003eAedan Juvet\u003c/a\u003e\u003c/h2\u003eA self-proclaimed pop culture aficionado with a passion for all things horror. Words for Cosmopolitan, Screen Rant, MTV News, NME, etc. \n\nFor pitches, please email aedanjuvet@gmail.com\u003c/section\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-01-26T16:47:07-06:00",
  "modifiedTime": "2025-01-26T16:47:07-06:00"
}
