{
  "id": "8939a8f3-360d-489e-86f9-461d3ae9cc03",
  "title": "A Seinfeld Actor Tried To Pitch His Own Spin-Off (And It Sounds Awful)",
  "link": "https://www.slashfilm.com/1837625/seinfeld-actor-pitch-own-sitcom-awful-phil-morris/",
  "description": "A notable supporting player on Seinfeld came up with a pitch for their own spin-off sitcom. However, it's probably for the best that it never happened.",
  "author": "Lorenzo Tanos",
  "published": "Wed, 30 Apr 2025 21:00:00 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Comedy Shows"
  ],
  "byline": "Lorenzo Tanos",
  "length": 5430,
  "excerpt": "A notable supporting player on Seinfeld came up with a pitch for their own spin-off sitcom. However, it's probably for the best that it never happened.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slashfilm-favicon.png",
  "text": "NBC It's not uncommon for recurring characters on a popular sitcom to receive successful spin-off shows. For example, \"Happy Days\" spawned \"Laverne \u0026 Shirley\" and \"Mork \u0026 Mindy,\" the latter of which originated from what was first thought of as a \"horrible\" episode script. (There's also \"Joanie Loves Chachi,\" though as the saying goes, you can't win 'em all.)  On the other end of the spectrum, you've got shows like \"Seinfeld,\" which drew impressive audiences back in the day but didn't give birth to any sort of spin-off series. Advertisement However, it wasn't for a lack of trying that the \"show about nothing\" has nothing by way of spin-offs. George Costanza actor Jason Alexander pitched a couple of spin-off ideas, one of which would have centered on Cosmo Kramer's (Michael Richards) lawyer, Jackie Chiles (Phil Morris), who was a parody of O.J. Simpson's defense attorney Johnnie Cochran. And as it turns out, Morris made a similar pitch, as he stated at a 1999 press event (via the Chicago Tribune) that he was developing a spin-off that would see his fast-talking lawyer character working at a \"very austere white law firm.\" He added that \"Seinfeld\" co-creators Jerry Seinfeld and Larry David were on board as executive producers and that he was hoping for a midseason 1999 launch on the parent show's network, NBC. Advertisement The series, as Morris explained, was likely not going to feature anyone from the main cast of \"Seinfeld,\" as the actor doubted Richards was up for reprising Kramer. \"Julia [Louis-Dreyfuss] isn't that interested in another weekly grind, and I don't think Jason is, either,\" he continued. \"Jackie has his own energy and conflicts. We'll go from there.\" NBC claimed it was unaware of Morris' planned Seinfeld spin-off series NBC During that same press event, Phil Morris explained why he felt the time was right for a Jackie Chiles spin-off, saying that his experience playing the character in a series of Honda commercials convinced him that audiences wanted to see more of Kramer's lawyer on their television screens.  \"They've given us the sense that this character would exist outside the 'Seinfeld' franchise,\" he related. \"The public wouldn't let him go. Since the final episode, people had been clamoring for something that reminded them of 'Seinfeld.'\" The actor also noted that Jerry Seinfeld himself gave him his blessing after initially rejecting the pitch. \"He said, 'You know, you're right. It's time for this guy. He's a killer character. You're going to be a big-time TV star.' Those were his exact words,\" Morris recalled. Advertisement While Morris seemed very optimistic about the chances of his show getting greenlit, NBC's response when asked for comment on the potential spin-off essentially doused cold water on the whole affair. A spokesperson told the San Francisco Chronicle that the network was not aware of Morris' pitch for Jackie Chiles to get his own series. \"This is the first we're hearing about it,\" the representative said. \"It's news to the network.\"  That was pretty much the last anyone heard of a possible Chiles spin-off, and it's probably just as well. Why a Jackie Chiles spin-off wouldn't have worked If done right, parodies of key figures from much-publicized legal cases like the O.J. Simpson murder trial can work quite well. Remember when Johnnie Cochran (voiced by Trey Parker) entered the \"South Park\" universe and represented Chef (Isaac Hayes) in the season 2 episode \"Chef Aid\"? The parody, as well as Cochran's \"Chewbacca defense,\" made sense (no pun intended) because the lawyer was a one-shot character — his technically posthumous, wordless cameos in season 14's now-banned episodes \"200\" and \"201\" notwithstanding. Meanwhile, even a mere 10-episode season of a Jackie Chiles spin-off would have gotten tired and repetitive; he was good in small doses on \"Seinfeld,\" but there are only so many ways you can keep a parody of a real-life celebrity interesting as the main character on a weekly sitcom. Advertisement In addition, characters based on people from high-profile water-cooler events can quickly become dated. While present-day viewers can enjoy most of \"Seinfeld\" without asking older friends or relatives to explain the jokes and references, the same likely wouldn't have applied to Phil Morris' proposed spin-off — who is this Jackie Chiles, and why is he supposed to be funny? Lastly, there's the possibility of racially insensitive humor and storylines sneaking into the mix, given how Chiles was supposed to be the lone Black attorney in a firm of stuffy, by-the-book white lawyers. What might have been hilarious in 1999 could be construed as insensitive for more modern audiences. All that is to say that Morris — and \"Seinfeld\" fans — dodged a bullet when nothing ultimately came of his pitch for a Chiles spin-off. Advertisement",
  "image": "https://www.slashfilm.com/img/gallery/a-seinfeld-actor-tried-to-pitch-his-own-spin-off-and-it-sounds-awful/l-intro-1744957247.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                \n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1837625/seinfeld-actor-pitch-own-sitcom-awful-phil-morris/\" data-post-title=\"A Seinfeld Actor Tried To Pitch His Own Spin-Off (And It Sounds Awful)\" data-slide-num=\"0\" data-post-id=\"1837625\"\u003e\n                                             \u003cpicture id=\"p6c128730749562e20a34e70ee09b0be2\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/a-seinfeld-actor-tried-to-pitch-his-own-spin-off-and-it-sounds-awful/intro-1744957247.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/a-seinfeld-actor-tried-to-pitch-his-own-spin-off-and-it-sounds-awful/intro-1744957247.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/a-seinfeld-actor-tried-to-pitch-his-own-spin-off-and-it-sounds-awful/intro-1744957247.jpg\" data-slide-url=\"https://www.slashfilm.com/1837625/seinfeld-actor-pitch-own-sitcom-awful-phil-morris/\" data-post-id=\"1837625\" data-slide-num=\"0\" data-slide-title=\"A Seinfeld Actor Tried To Pitch His Own Spin-Off (And It Sounds Awful): \" width=\"780\" height=\"438\" alt=\"Jackie Chiles (Phil Morris) representing Jerry Seinfeld (himself) and friends in court in Seinfeld\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eNBC\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n                \n                \n\u003cp\u003eIt\u0026#39;s not uncommon for recurring characters on a popular sitcom to receive successful spin-off shows. For example, \u0026#34;Happy Days\u0026#34; spawned \u0026#34;Laverne \u0026amp; Shirley\u0026#34; and \u003ca href=\"https://www.slashfilm.com/853726/how-robin-williams-made-a-horrible-happy-days-script-worthy-of-the-mork-mindy-spinoff/\" target=\"_blank\"\u003e\u0026#34;Mork \u0026amp; Mindy,\u0026#34; the latter of which originated from what was first thought of as a \u0026#34;horrible\u0026#34; episode script\u003c/a\u003e. (There\u0026#39;s also \u0026#34;Joanie Loves Chachi,\u0026#34; though as the saying goes, you can\u0026#39;t win \u0026#39;em all.)  On the other end of the spectrum, you\u0026#39;ve got shows like \u0026#34;Seinfeld,\u0026#34; which drew impressive audiences back in the day but didn\u0026#39;t give birth to any sort of spin-off series.\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp\u003eHowever, it wasn\u0026#39;t for a lack of trying that the \u0026#34;show about nothing\u0026#34; has nothing by way of spin-offs. George Costanza actor \u003ca href=\"https://www.slashfilm.com/1826532/jason-alexander-seinfeld-spin-offs-pitch/\" target=\"_blank\"\u003eJason Alexander pitched a couple of spin-off ideas\u003c/a\u003e, one of which would have centered on Cosmo Kramer\u0026#39;s (Michael Richards) lawyer, Jackie Chiles (Phil Morris), who was a parody of O.J. Simpson\u0026#39;s defense attorney Johnnie Cochran. And as it turns out, Morris made a similar pitch, as he stated at a 1999 press event (via the \u003ca href=\"https://www.chicagotribune.com/1999/07/24/seinfeld-may-be-gone-but-jackie-chiles-lives/\" target=\"_blank\"\u003eChicago Tribune\u003c/a\u003e) that he was developing a spin-off that would see his fast-talking lawyer character working at a \u0026#34;very austere white law firm.\u0026#34; He added that \u0026#34;Seinfeld\u0026#34; co-creators Jerry Seinfeld and Larry David were on board as executive producers and that he was hoping for a midseason 1999 launch on the parent show\u0026#39;s network, NBC.\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp\u003eThe series, as Morris explained, was likely not going to feature anyone from the main cast of \u0026#34;Seinfeld,\u0026#34; as the actor doubted Richards was up for reprising Kramer. \u0026#34;Julia [Louis-Dreyfuss] isn\u0026#39;t that interested in another weekly grind, and I don\u0026#39;t think Jason is, either,\u0026#34; he continued. \u0026#34;Jackie has his own energy and conflicts. We\u0026#39;ll go from there.\u0026#34;\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eNBC claimed it was unaware of Morris\u0026#39; planned Seinfeld spin-off series\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1837625/seinfeld-actor-pitch-own-sitcom-awful-phil-morris/\" data-post-title=\"A Seinfeld Actor Tried To Pitch His Own Spin-Off (And It Sounds Awful)\" data-slide-num=\"1\" data-post-id=\"1837625\"\u003e\n                                             \u003cpicture id=\"pebabfa89461f411b5f2dbf62144556cf\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/a-seinfeld-actor-tried-to-pitch-his-own-spin-off-and-it-sounds-awful/nbc-claimed-it-was-unaware-of-morris-planned-spin-off-series-1744957248.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/a-seinfeld-actor-tried-to-pitch-his-own-spin-off-and-it-sounds-awful/nbc-claimed-it-was-unaware-of-morris-planned-spin-off-series-1744957248.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/a-seinfeld-actor-tried-to-pitch-his-own-spin-off-and-it-sounds-awful/nbc-claimed-it-was-unaware-of-morris-planned-spin-off-series-1744957248.jpg\" data-slide-url=\"https://www.slashfilm.com/1837625/seinfeld-actor-pitch-own-sitcom-awful-phil-morris/\" data-post-id=\"1837625\" data-slide-num=\"1\" data-slide-title=\"A Seinfeld Actor Tried To Pitch His Own Spin-Off (And It Sounds Awful): NBC claimed it was unaware of Morris\u0026#39; planned Seinfeld spin-off series\" width=\"780\" height=\"438\" alt=\"Jackie Chiles (Phil Morris) and Jerry Seinfeld (himself) talking in court in Seinfeld\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eNBC\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eDuring that same press event, Phil Morris explained why he felt the time was right for a Jackie Chiles spin-off, saying that his experience playing the character in a series of Honda commercials convinced him that audiences wanted to see more of Kramer\u0026#39;s lawyer on their television screens.  \u0026#34;They\u0026#39;ve given us the sense that this character would exist outside the \u0026#39;Seinfeld\u0026#39; franchise,\u0026#34; he related. \u0026#34;The public wouldn\u0026#39;t let him go. Since the final episode, people had been clamoring for something that reminded them of \u0026#39;Seinfeld.\u0026#39;\u0026#34; The actor also noted that Jerry Seinfeld himself gave him his blessing after initially rejecting the pitch. \u0026#34;He said, \u0026#39;You know, you\u0026#39;re right. It\u0026#39;s time for this guy. He\u0026#39;s a killer character. You\u0026#39;re going to be a big-time TV star.\u0026#39; Those were his exact words,\u0026#34; Morris recalled.\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp\u003eWhile Morris seemed very optimistic about the chances of his show getting greenlit, NBC\u0026#39;s response when asked for comment on the potential spin-off essentially doused cold water on the whole affair. A spokesperson told the \u003ca href=\"https://www.sfgate.com/entertainment/article/Seinfeld-Actor-Says-a-Spin-Off-Is-in-the-Works-2918616.php\" target=\"_blank\"\u003eSan Francisco Chronicle\u003c/a\u003e that the network was not aware of Morris\u0026#39; pitch for Jackie Chiles to get his own series. \u0026#34;This is the first we\u0026#39;re hearing about it,\u0026#34; the representative said. \u0026#34;It\u0026#39;s news to the network.\u0026#34; \u003c/p\u003e\n\u003cp\u003eThat was pretty much the last anyone heard of a possible Chiles spin-off, and it\u0026#39;s probably just as well.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eWhy a Jackie Chiles spin-off wouldn\u0026#39;t have worked\u003c/h2\u003e\n                                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eIf done right, parodies of key figures from much-publicized legal cases like the O.J. Simpson murder trial can work quite well. Remember when Johnnie Cochran (voiced by Trey Parker) entered the \u0026#34;South Park\u0026#34; universe and represented Chef (Isaac Hayes) in the season 2 episode \u0026#34;Chef Aid\u0026#34;? The parody, as well as Cochran\u0026#39;s \u0026#34;Chewbacca defense,\u0026#34; made sense (no pun intended) because the lawyer was a one-shot character — his technically posthumous, wordless cameos in \u003ca href=\"https://www.slashfilm.com/1742242/south-park-banned-episodes-not-streaming-max/\" target=\"_blank\"\u003eseason 14\u0026#39;s now-banned episodes \u0026#34;200\u0026#34; and \u0026#34;201\u0026#34;\u003c/a\u003e notwithstanding. Meanwhile, even a mere 10-episode season of a Jackie Chiles spin-off would have gotten tired and repetitive; he was good in small doses on \u0026#34;Seinfeld,\u0026#34; but there are only so many ways you can keep a parody of a real-life celebrity interesting as the main character on a weekly sitcom.\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp\u003eIn addition, characters based on people from high-profile water-cooler events can quickly become dated. While present-day viewers can enjoy most of \u0026#34;Seinfeld\u0026#34; without asking older friends or relatives to explain the jokes and references, the same likely wouldn\u0026#39;t have applied to Phil Morris\u0026#39; proposed spin-off — who is this Jackie Chiles, and why is he supposed to be funny? Lastly, there\u0026#39;s the possibility of racially insensitive humor and storylines sneaking into the mix, given how Chiles was supposed to be the lone Black attorney in a firm of stuffy, by-the-book white lawyers. What might have been hilarious in 1999 could be construed as insensitive for more modern audiences.\u003c/p\u003e\n\u003cp\u003eAll that is to say that Morris — and \u0026#34;Seinfeld\u0026#34; fans — dodged a bullet when nothing ultimately came of his pitch for a Chiles spin-off.\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-04-30T21:00:00Z",
  "modifiedTime": "2025-04-30T21:00:00Z"
}
