{
  "id": "92f47fdc-3ce1-416f-8068-3369d730d417",
  "title": "Tom Segura’s Twisted Netflix Comedy Series ‘Bad Thoughts’ Drops First Trailer, Sets May Release Date",
  "link": "https://variety.com/2025/tv/awards/tom-segura-bad-thoughts-netflix-trailer-release-date-1236351414/",
  "description": "Netflix has released the first teaser for its new dark and twisted comedy series, “Bad Thoughts,” starring stand-up comedian Tom Segura, and announced the release date for May 13. Segura, who serves as creator, director, executive producer and star, debuted a sneak peek of the series during his sold-out at Madison Square Garden. The six-episode […]",
  "author": "Clayton Davis",
  "published": "Sun, 30 Mar 2025 00:00:00 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "Awards",
    "News",
    "Trailers",
    "Bad Thoughts",
    "Netflix",
    "Tom Segura"
  ],
  "byline": "Clayton Davis",
  "length": 2336,
  "excerpt": "Netflix has debuted the first trailer for the comedy series \"Bad Thoughts\" from Tom Segura, and announced its release date.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "Netflix has released the first teaser for its new dark and twisted comedy series, “Bad Thoughts,” starring stand-up comedian Tom Segura, and announced the release date for May 13. Segura, who serves as creator, director, executive producer and star, debuted a sneak peek of the series during his sold-out at Madison Square Garden. The six-episode series blends elements of “Black Mirror” and “The Twilight Zone,” aiming to deliver chuckles and big laughs. Episodes are directed by Rami Hachache, Jeremy Konner and Segura. Konner serves as head writer and is best known for co-creating the educational sketch comedy series “Drunk History,” which ran on Comedy Central for six seasons from 2013 to 2019 and was nominated for 17 Emmys. The producing team includes Segura, Konner, Ryan Hall, Molly Mandel, Craig Gerara and Matthew Zinman. The series is produced under Segura’s Your Mom’s House banner — the same name as his hit comedy podcast co-hosted with his wife, Christina Pazsitzky, who also appears in the teaser. Popular on Variety With “Bad Thoughts” premiering just ahead of the close of the Emmy eligibility window, Netflix has confirmed it will submit the show in the outstanding short-form comedy, drama, or variety series category. The streamer previously won in that category with the third season of “I Think You Should Leave With Tim Robinson” in 2023. Netflix says the show “centers on Segura, who also serves as the show’s narrator, as he takes us through each episode in a series of vignettes. The twisted comedic sensibility of Tom’s stand-up is the core DNA of this series, where every story will unfold in a hilariously disturbing way only he could imagine.” Segura has previously released five stand-up specials on Netflix: “Sledgehammer” (2023), “Ball Hog” (2020), “Disgraceful” (2018), “Mostly Stories” (2016) and “Completely Normal” (2014). He completed his “Come Together” stand-up tour in 2023 and 2024. In 2022, he published the bestselling comedic essay collection “I’d Like to Play Alone, Please.” Under his YMH Studios banner, he also co-hosts “2 Bears 1 Cave” with comedian Bert Kreischer. Segura appeared on Variety’s 2023 stand-up comedy roundtable alongside Marlon Wayans, Sam Jay and Matt Rife. Watch the first teaser trailer below.",
  "image": "https://variety.com/wp-content/uploads/2025/03/BTH_S1_Unit_00994R-1.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\t\u003ca href=\"https://variety.com/t/netflix/\" id=\"auto-tag_netflix\" data-tag=\"netflix\"\u003eNetflix\u003c/a\u003e has released the first teaser for its new dark and twisted comedy series, “\u003ca href=\"https://variety.com/t/bad-thoughts/\" id=\"auto-tag_bad-thoughts\" data-tag=\"bad-thoughts\"\u003eBad Thoughts\u003c/a\u003e,” starring stand-up comedian \u003ca href=\"https://variety.com/t/tom-segura/\" id=\"auto-tag_tom-segura\" data-tag=\"tom-segura\"\u003eTom Segura\u003c/a\u003e, and announced the release date for May 13.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSegura, who serves as creator, director, executive producer and star, debuted a sneak peek of the series during his sold-out at Madison Square Garden. The six-episode series blends elements of “Black Mirror” and “The Twilight Zone,” aiming to deliver chuckles and big laughs.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tEpisodes are directed by Rami Hachache, Jeremy Konner and Segura. Konner serves as head writer and is best known for co-creating the educational sketch comedy series “Drunk History,” which ran on Comedy Central for six seasons from 2013 to 2019 and was nominated for 17 Emmys.\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tThe producing team includes Segura, Konner, Ryan Hall, Molly Mandel, Craig Gerara and Matthew Zinman. The series is produced under Segura’s Your Mom’s House banner — the same name as his hit comedy podcast co-hosted with his wife, Christina Pazsitzky, who also appears in the teaser.\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tWith “Bad Thoughts” premiering just ahead of the close of the Emmy eligibility window, Netflix has confirmed it will submit the show in the outstanding short-form comedy, drama, or variety series category. The streamer previously won in that category with the third season of “I Think You Should Leave With Tim Robinson” in 2023.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tNetflix says the show “centers on Segura, who also serves as the show’s narrator, as he takes us through each episode in a series of vignettes. The twisted comedic sensibility of Tom’s stand-up is the core DNA of this series, where every story will unfold in a hilariously disturbing way only he could imagine.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSegura has previously released five stand-up specials on Netflix: “Sledgehammer” (2023), “Ball Hog” (2020), “Disgraceful” (2018), “Mostly Stories” (2016) and “Completely Normal” (2014). He completed his “Come Together” stand-up tour in 2023 and 2024. In 2022, he published the bestselling comedic essay collection “I’d Like to Play Alone, Please.” Under his YMH Studios banner, he also co-hosts “2 Bears 1 Cave” with comedian Bert Kreischer.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSegura appeared on \u003ca href=\"https://variety.com/2023/tv/awards/stand-up-roundtable-matt-rife-tom-segura-marlon-wayans-sam-jay-1235804838/\"\u003e\u003cem\u003eVariety’s \u003c/em\u003e2023 stand-up comedy roundtable\u003c/a\u003e alongside Marlon Wayans, Sam Jay and Matt Rife.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tWatch the first teaser trailer below.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Bad Thoughts | Tom Segura Comedy Series | Date Announcement | Netflix\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/114imgBAAVg?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-03-30T00:00:00Z",
  "modifiedTime": "2025-03-28T21:30:45Z"
}
