{
  "id": "9553330a-b791-4e2a-9a29-d4e4abde7cc3",
  "title": "‘Superman’ Box Office Muscle, David Zaslav’s Early Victory Lap, Last-Minute Emmy Predictions and Waiting for Rihanna",
  "link": "https://variety.com/2025/biz/news/superman-zaslav-emmys-rihanna-smurfs-daily-variety-podcast-1236460208/",
  "description": "“Superman” flexed solid box office muscle in its debut weekend. Warner Bros. Discovery boss David Zaslav took an early victory lap over the Man of Steel’s performance, while Rihanna arrived fashionably late to Sunday’s premiere of “Smurfs” with her two young sons in tow. These stories are included in today’s installment of “Daily Variety,” a […]",
  "author": "Cynthia Littleton",
  "published": "Mon, 14 Jul 2025 23:20:39 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Daily Variety",
    "Rihanna",
    "Strictly Business",
    "Superman"
  ],
  "byline": "Cynthia Littleton",
  "length": 2526,
  "excerpt": "'Superman' flexes box office muscle. David Zaslav takes an early victory lap and Rihanna arrives fashionably late on today's Daily Variety podcast.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "“Superman” flexed solid box office muscle in its debut weekend. Warner Bros. Discovery boss David Zaslav took an early victory lap over the Man of Steel’s performance, while Rihanna arrived fashionably late to Sunday’s premiere of “Smurfs” with her two young sons in tow. These stories are included in today’s installment of “Daily Variety,” a new podcast that features conversations with Variety journalists about news, trends and personalities making waves in media and entertainment. Rebecca Rubin, Variety‘s box office expert, weighs in on “Superman’s” performance and some of the suprising regional trends in its performance. Popular on Variety “The top 10 markets were pretty standard. L.A., New York, Dallas, Chicago and San Francisco were some of the top markets. But when I was looking at the top 10 locations, something that caught my eye was there were two theaters in Florida, one in Orlando and one in Miami, and one theater in Atlanta that cracked the top 10 locations,” Rubin says. “Again, usually [the top 10] are populated by theaters in L.A., New York and Texas. I thought it was interesting that those Southern venues were some of the highest grossing. And so it played pretty evenly across the country.” Clayton Davis, Variety‘s chief awards editor, offered some last-minute thoughts on what to expect with Tuesday’s Emmy nominations. His biggest burning question is whether Television Academy voters will bestow a nomination on “The Pitt” star Noah Wyle. Wyle grabbed five consective supporting drama actor nominations from 1995 to 1999 for his work on NBC’s “ER.” “It’s been 26 years since Noah Wyle has gotten any nomination and I think [‘The Pitt’] is such a dark horse to win drama series,” Davis opines. Marc Malkin, Variety‘s red carpet veteran, offers a zippy “Just for Variety” rundown of “Smurfs” premiere event on the Paramount Pictures lot on a sizzling Sunday in Hollywood. Yes, Rihanna arrived nearly two hours after the screening ended. But she didn’t disappoint with her two young sons in tow and plenty of quips about her experience playing Smurfette. “This is not just for the kids. I’m a super-fan of Smurfs. I’ve always been a fan. I’m really excited for a new generation of Smurfs fans” to discover the film, the pop superstar tells Variety. Listen to Daily Variety on iHeartPodcasts, Apple Podcasts, Amazon Music, Spotify and other podcast platforms. (Pictured: Rihanna at Sunday’s premiere of “The Smurfs”",
  "image": "https://variety.com/wp-content/uploads/2025/07/GettyImages-2224394535-e1752532829317.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\t“\u003ca href=\"https://variety.com/t/superman/\" id=\"auto-tag_superman\" data-tag=\"superman\"\u003eSuperman\u003c/a\u003e” flexed solid box office muscle in its debut weekend. Warner Bros. Discovery boss David Zaslav took an early victory lap over the Man of Steel’s performance, while \u003ca href=\"https://variety.com/t/rihanna/\" id=\"auto-tag_rihanna\" data-tag=\"rihanna\"\u003eRihanna\u003c/a\u003e arrived fashionably late to Sunday’s premiere of “Smurfs” with her two young sons in tow.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThese stories are included in today’s installment of “\u003ca href=\"https://variety.com/t/daily-variety/\" id=\"auto-tag_daily-variety\" data-tag=\"daily-variety\"\u003eDaily Variety\u003c/a\u003e,” a new podcast that features conversations with \u003cem\u003eVariety\u003c/em\u003e journalists about news, trends and personalities making waves in media and entertainment.\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tRebecca Rubin, \u003cem\u003eVariety\u003c/em\u003e‘s box office expert, weighs in on “Superman’s” performance and some of the suprising regional trends in its performance.\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\t“The top 10 markets were pretty standard. L.A., New York, Dallas, Chicago and San Francisco were some of the top markets. But when I was looking at the top 10 locations, something that caught my eye was there were two theaters in Florida, one in Orlando and one in Miami, and one theater in Atlanta that cracked the top 10 locations,” Rubin says. “Again, usually [the top 10] are populated by theaters in L.A., New York and Texas. I thought it was interesting that those Southern venues were some of the highest grossing. And so it played pretty evenly across the country.”\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\n\tClayton Davis, \u003cem\u003eVariety\u003c/em\u003e‘s chief awards editor, offered some last-minute thoughts on what to expect with Tuesday’s Emmy nominations. His biggest burning question is whether Television Academy voters will bestow a nomination on “The Pitt” star Noah Wyle. Wyle grabbed five consective supporting drama actor nominations from 1995 to 1999 for his work on NBC’s “ER.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“It’s been 26 years since Noah Wyle has gotten any nomination and I think [‘The Pitt’] is such a dark horse to win drama series,” Davis opines.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tMarc Malkin, \u003cem\u003eVariety\u003c/em\u003e‘s red carpet veteran, offers a zippy “Just for Variety” rundown of “Smurfs” premiere event on the Paramount Pictures lot on a sizzling Sunday in Hollywood. Yes, Rihanna arrived nearly two hours after the screening ended. But she didn’t disappoint with her two young sons in tow and plenty of quips about her experience playing Smurfette.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“This is not just for the kids. I’m a super-fan of Smurfs. I’ve always been a fan. I’m really excited for a new generation of Smurfs fans” to discover the film, the pop superstar tells \u003cem\u003eVariety. \u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003ca rel=\"nofollow\" href=\"https://podcasts.apple.com/us/podcast/strictly-business/id1367322664?i=1000717224393\" target=\"_blank\"\u003e\u003cstrong\u003e\u003cem\u003eListen to Daily Variety\u003c/em\u003e\u003c/strong\u003e\u003c/a\u003e\u003cem\u003e\u003cstrong\u003e on iHeartPodcasts, Apple Podcasts, Amazon Music, Spotify and other podcast platforms.\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t(Pictured: Rihanna at Sunday’s premiere of “The Smurfs”\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-07-14T23:20:39Z",
  "modifiedTime": "2025-07-14T23:51:15Z"
}
