{
  "id": "9a72df75-bc2a-405e-8c50-94d041b13f61",
  "title": "‘Mythic Quest’ Canceled After Four Seasons, Apple TV+ to Air Updated Finale Episode With New Ending (EXCLUSIVE)",
  "link": "https://variety.com/2025/tv/news/mythic-quest-canceled-apple-tv-plus-new-ending-1236366662/",
  "description": "The Apple TV+ comedy “Mythic Quest” has been canceled after four seasons, Variety has learned exclusively. The series aired its fourth season finale on March 26 following its January debut. It had been renewed for Seasons 3 and 4 back in 2021. But in true video game style, the show is getting an extra life. […]",
  "author": "Joseph Otterson",
  "published": "Sat, 12 Apr 2025 01:00:00 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Apple TV+",
    "Mythic Quest"
  ],
  "byline": "Joe Otterson",
  "length": 2698,
  "excerpt": "The Apple TV+ comedy \"Mythic Quest\" has been canceled, Variety has learned. But the show is getting a new finale episode with a new ending",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "The Apple TV+ comedy “Mythic Quest” has been canceled after four seasons, Variety has learned exclusively. The series aired its fourth season finale on March 26 following its January debut. It had been renewed for Seasons 3 and 4 back in 2021. But in true video game style, the show is getting an extra life. An updated finale episode with a new ending will premiere next week on Apple TV+. “Endings are hard. But after four incredible seasons, ‘Mythic Quest’ is coming to a close,” said series executive producers Megan Ganz, David Hornsby, and Rob McElhenney. “We’re so proud of the show and the world we got to build—and deeply grateful to every cast and crew member who poured their heart into it. To all our fans, thank you for playing with us. To our partners at Apple, thank you for believing in the vision from the very beginning. Because endings are hard, with Apple’s blessing we made one final update to our last episode—so we could say goodbye, instead of just game over.” “Mythic Quest” was among the first original series to launch on Apple TV+, debuting in February 2020 after the service launched in November 2019. Although Apple does not release viewership info for their shows, the series was well-received by critics since its launch. The four seasons averaged a 97% critical approval rating on Rotten Tomatoes. Popular on Variety The single-cam workplace comedy followed the staff of a video game studio that produced the titular game, a massively popular MMORPG. Series co-creator McElhenney also starred in the show as Ian Grimm, the creator and creative director of “Mythic Quest.” The cast also included Charlotte Nicdao, Hornsby, Danny Pudi, Ashly Burch, Imani Hakim, Jessie Ennis, and Naomi Ekperigin. McElhenney created the show along with Charlie Day and Ganz, with all three executive producing. McElhenney and Day did so under their RCG banner. Additional executive producers included Hornsby, Michael Rotenberg and Nicholas Frenkel on behalf of 3 Arts and Margaret Boykin, Austin Dill, and Gérard Guillemot for Ubisoft Film \u0026 Television. Lionsgate Television produced along with 3 Arts and Ubisoft. In addition to its four season run, “Mythic Quest” also produced two special episodes — one shot remotely about the show’s characters dealing with quarantine and another called “Everlight,” which saw the characters celebrating their return to the office. The show also spawned the spinoff series “Side Quest,” which debuted on March 26. That show was a four-episode anthology, with each episode exploring the lives of different people involved in the “Mythic Quest” game, from its creators to fans.",
  "image": "https://variety.com/wp-content/uploads/2025/04/Mythic_Quest_Photo_041006.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tThe \u003ca href=\"https://variety.com/t/apple-tv-2/\" id=\"auto-tag_apple-tv-2\" data-tag=\"apple-tv-2\"\u003eApple TV+\u003c/a\u003e comedy “\u003ca href=\"https://variety.com/t/mythic-quest/\" id=\"auto-tag_mythic-quest\" data-tag=\"mythic-quest\"\u003eMythic Quest\u003c/a\u003e” has been canceled after four seasons, \u003cem\u003eVariety\u003c/em\u003e has learned exclusively. The series aired its fourth season finale on March 26 following its January debut. It had been \u003ca rel=\"noreferrer noopener\" data-id=\"https://variety.com/2021/tv/news/mythic-quest-renewed-season-3-4-apple-1235094563/\" target=\"_blank\" data-type=\"link\" href=\"https://variety.com/2021/tv/news/mythic-quest-renewed-season-3-4-apple-1235094563/\"\u003erenewed for Seasons 3 and 4 \u003c/a\u003eback in 2021.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tBut in true video game style, the show is getting an extra life. An updated finale episode with a new ending will premiere next week on Apple TV+. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Endings are hard. But after four incredible seasons, ‘Mythic Quest’ is coming to a close,” said series executive producers Megan Ganz, David Hornsby, and Rob McElhenney. “We’re so proud of the show and the world we got to build—and deeply grateful to every cast and crew member who poured their heart into it. To all our fans, thank you for playing with us. To our partners at Apple, thank you for believing in the vision from the very beginning. Because endings are hard, with Apple’s blessing we made one final update to our last episode—so we could say goodbye, instead of just game over.”\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\t“Mythic Quest” was among the first original series to launch on Apple TV+, debuting in February 2020 after the service launched in November 2019. Although Apple does not release viewership info for their shows, the series was well-received by critics since its launch. The four seasons averaged a 97% critical approval rating on Rotten Tomatoes.  \n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tThe single-cam workplace comedy followed the staff of a video game studio that produced the titular game, a massively popular MMORPG. Series co-creator McElhenney also starred in the show as Ian Grimm, the creator and creative director of “Mythic Quest.” The cast also included Charlotte Nicdao, Hornsby, Danny Pudi, Ashly Burch, Imani Hakim, Jessie Ennis, and Naomi Ekperigin.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tMcElhenney created the show along with Charlie Day and Ganz, with all three executive producing. McElhenney and Day did so under their RCG banner. Additional executive producers included Hornsby, Michael Rotenberg and Nicholas Frenkel on behalf of 3 Arts and Margaret Boykin, Austin Dill, and Gérard Guillemot for Ubisoft Film \u0026amp; Television. Lionsgate Television produced along with 3 Arts and Ubisoft. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn addition to its four season run, “Mythic Quest” also produced two special episodes — one shot remotely about the show’s characters dealing with quarantine and another called “Everlight,” which saw the characters celebrating their return to the office. \n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tThe show also spawned the spinoff series “Side Quest,” which debuted on March 26. That show was a four-episode anthology, with each episode exploring the lives of different people involved in the “Mythic Quest” game, from its creators to fans.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-12T01:00:00Z",
  "modifiedTime": "2025-04-12T00:19:36Z"
}
