{
  "id": "9ade7e66-9b91-4b29-8734-608669abaf34",
  "title": "WGA Awards: ‘Anora’ \u0026 ‘Nickel Boys’ Take Top Screenplay Prizes — Updating Live",
  "link": "https://deadline.com/2025/02/writers-guild-awards-2025-winners-list-1236288821/",
  "description": "The 77th annual Writers Guild Awards are being handed out tonight over concurrent ceremonies in Los Angeles and New York, and Deadline is posting the winners live as they are announced. See the winners list below. The guild’s nominations honoring the year’s best in film, TV, new media, news, radio and promotional writing were revealed […]",
  "author": "Erik Pedersen",
  "published": "Sun, 16 Feb 2025 00:29:47 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "News",
    "Awardsnews",
    "WGA Awards",
    "Writers Guild Awards",
    "Writers Guild Of America"
  ],
  "byline": "Denise Petski",
  "length": 4007,
  "excerpt": "Here are the winners of the 2025 Writers Guild Awards Awards, which were handed out February 15 in dual ceremonies in Hollywood and Manhattan.",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "The 77th annual Writers Guild Awards are being handed out tonight over concurrent ceremonies in Los Angeles and New York, and Deadline is posting the winners live as they are announced. See the winners list below. The guild’s nominations honoring the year’s best in film, TV, new media, news, radio and promotional writing were revealed January 15 after being postponed twice due to the L.A. wildfires. At last year’s strike-delayed WGA Awards, the top film prizes for Original Screenplay and Adapted Screenplay to The Holdovers and American Fiction, respectively. The latter already had won the Academy Award for Cord Jefferson, but Justine Triet and Arthur Harari’s Anatomy of a Fall beat Alexander Payne’s Holdovers for the Original Screenplay Oscar. The Writers Guild top TV winners in 2024 were Succession, The Bear Beef and The Last of Us. RELATED: Deadline’s Read The Screenplay Series 2025 Watch on Deadline The WGA West and East also are giving special honors to several folks tonight. David Lynch, who died in January, has been named the recipient of the WGA West’s 2025 Laurel Award for Screenwriting Achievement. Breaking Bad and Better Call Saul creator Vince Gilligan is set for the WGAW’s Paddy Chayefsky Laurel Award for Television Writing Achievement, and Nickel Boys screenwriters RaMell Ross and Joslyn Barnes will receive its 2025 Paul Selvin Award. WGAE will honor Scott Frank with the Ian McLellan Hunter Award for Career Achievement, Bill Lawrence (Herb Sargent Award for Comedy Excellence) and Kathy McGee (Richard B. Jablow Award). RELATED: Joel Kim Booster Hopes To Bring Levity To WGA Awards’ West Coast Ceremony After Years Of Strife For Writers The WGA Awards often exclude several top films due to eligibility rules. If a film is produced outside the WGA collective bargaining agreement or written by a non-union member, it is not eligible for the guild’s awards. This holds true again this year, which means such awards-season favorites as Golden Globe winner Conclave, Emilia Pérez, I’m Still Here, Inside Out 2, The Room Next Door, Sing Sing and The Wild Robot are out of the Adapted race. Among those ineligible for Original Screenplay are All We Imagine as Light, The Brutalist, Hard Truths, Gotham Awards winner His Three Daughters, I Saw the TV Glow, The Seed of the Sacred Fig, September 5 and The Substance. Joel Kim Booster is hosting the Los Angeles ceremony from the Beverly Hilton, and Roy Wood Jr. is emceeing the New York show at Edison Ballroom in Manhattan.  Here are the winners so far at the 2025 Writers Guild Awards: ORIGINAL SCREENPLAY Anora, Written by Sean Baker; Neon ADAPTED SCREENPLAY Nickel Boys, Screenplay by RaMell Ross \u0026 Joslyn Barnes, Based on the Book The Nickel Boys by Colson Whitehead; Orion Pictures/Amazon MGM Studios LIMITED SERIES The Penguin, Written by Vladimir Cvetko, Breannah Gibson,Erika L. Johnson, Lauren LeFranc, Corina Maritescu, Megan Martin, JohnMcCutcheon, Shaye Ogbonna, Nick Towne, Noelle Valdivia, Kira Snyder; HBO | Max “Welcome to Spiderwick” (The Spiderwick Chronicles), Written by Aron Eli Coleite; Roku Channel NEWS SCRIPT – REGULARLY SCHEDULED, BULLETIN, OR BREAKING REPORT “Willie Mays Tribute” (CBS Newspath), Written by Gerald Mazza; CBS News NEWS SCRIPT – ANALYSIS, FEATURE, OR COMMENTARY “The Resistance” (60 Minutes), Written by Scott Pelley, Nicole Young, Kristin Steve; CBS News QUIZ AND AUDIENCE PARTICIPATION Pop Culture Jeopardy!, Writers Marcus Brown, Buzzy Cohen, Michael Davies, Chip Dornell, John Duarte, Mark Gaberman, Debbie Griffin, Michele Loud, Traci Mack, Amy Ozols, Louis Virtel, Billy Wisse; Amazon Prime DIGITAL NEWS “What Is Hamas Thinking Now?”, Written by Akbar Shahid Ahmed; HuffPost SHORT FORM STREAMING Die Hart 3: Hart to Kill, Written by Tripper Clancy; Roku Channel Erik Pedersen contributed to this report.",
  "image": "https://deadline.com/wp-content/uploads/2025/01/WGA-Awards-2025.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tThe 77th annual \u003ca href=\"https://deadline.com/tag/writers-guild-awards/\" id=\"auto-tag_writers-guild-awards\" data-tag=\"writers-guild-awards\"\u003eWriters Guild Awards\u003c/a\u003e are being handed out tonight over concurrent ceremonies in Los Angeles and New York, and Deadline is posting the winners live as they are announced. See the winners list below. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe guild’s nominations honoring the year’s best in film, TV, new media, news, radio and promotional writing \u003ca href=\"https://deadline.com/2025/01/writers-guild-awards-nominations-2025-1236255337/\"\u003ewere revealed January 15\u003c/a\u003e after being postponed twice due to the L.A. wildfires.\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tAt \u003ca href=\"https://deadline.com/2024/04/writers-guild-awards-2024-winners-list-1235884851/\"\u003elast year’s strike-delayed WGA Awards\u003c/a\u003e, the top film prizes for Original Screenplay and Adapted Screenplay to \u003cem\u003eThe Holdovers \u003c/em\u003eand \u003cem\u003eAmerican Fiction\u003c/em\u003e, respectively. The latter already had \u003ca href=\"https://deadline.com/2024/03/oscars-winners-2024-1235845118/\"\u003ewon the Academy Award\u003c/a\u003e for Cord Jefferson, but Justine Triet and Arthur Harari’s \u003cem\u003eAnatomy of a Fall \u003c/em\u003ebeat Alexander Payne’s \u003cem\u003eHoldovers\u003c/em\u003e for the Original Screenplay Oscar. The Writers Guild top TV winners in 2024 were \u003cem\u003eSuccession, The Bear Beef and The Last of Us.\u003c/em\u003e\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eRELATED: \u003ca href=\"https://deadline.com/story-arc/read-the-screenplay-series/\"\u003eDeadline’s Read The Screenplay Series 2025\u003c/a\u003e\u003c/strong\u003e\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234771711\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tThe WGA West and East also are giving special honors to several folks tonight. David Lynch, who \u003ca href=\"https://deadline.com/2025/01/david-lynch-dead-twin-peaks-blue-velvet-elephant-man-1236258625/\"\u003edied in January\u003c/a\u003e, has been named the \u003ca href=\"https://deadline.com/2025/01/david-lynch-posthumously-writers-guild-laurel-award-screenwriting-1236271742/\"\u003erecipient of the WGA West’s 2025 Laurel Award\u003c/a\u003e for Screenwriting Achievement. \u003cem\u003eBreaking Bad \u003c/em\u003eand\u003cem\u003e Better Call Saul\u003c/em\u003e creator \u003ca href=\"https://deadline.com/2025/01/vince-gilligan-wga-awards-career-honor-1236262872/\"\u003eVince Gilligan is set\u003c/a\u003e for the WGAW’s Paddy Chayefsky Laurel Award for Television Writing Achievement, and \u003cem\u003eNickel Boys \u003c/em\u003escreenwriters \u003ca href=\"https://deadline.com/2025/02/nickel-boys-screenwriters-wga-paul-selvin-award-1236281668/\"\u003eRaMell Ross and Joslyn Barnes will receive\u003c/a\u003e its 2025 Paul Selvin Award. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWGAE will \u003ca href=\"https://deadline.com/2024/12/scott-frank-wga-east-career-achievement-award-2025-1236200869/\"\u003ehonor Scott Frank\u003c/a\u003e with the Ian McLellan Hunter Award for Career Achievement, \u003ca href=\"https://deadline.com/2025/01/bill-lawrence-herb-sargent-award-wga-east-1236251895/\"\u003eBill Lawrence (Herb Sargent Award for Comedy Excellence)\u003c/a\u003e and \u003ca href=\"https://deadline.com/2024/12/kathy-mcgee-wga-east-richard-b-jablow-service-award-1236195258/\"\u003eKathy McGee (Richard B. Jablow Award)\u003c/a\u003e. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eRELATED: \u003ca href=\"https://deadline.com/2025/02/joel-kim-booster-host-2025-wga-awards-interview-1236287097/\"\u003eJoel Kim Booster Hopes To Bring Levity To WGA Awards’ West Coast Ceremony After Years Of Strife For Writers\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe WGA Awards often exclude several top films due to eligibility rules. If a film is produced outside the WGA collective bargaining agreement or written by a non-union member, it is not eligible for the guild’s awards.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThis holds true again this year, which means such awards-season favorites as \u003ca href=\"https://deadline.com/2025/01/conclave-peter-straughan-wins-best-screenplay-golden-globes-1236247786/\"\u003eGolden Globe winner \u003cem\u003eConclave\u003c/em\u003e\u003c/a\u003e,\u003cem\u003e Emilia Pérez\u003c/em\u003e, \u003cem\u003eI’m Still Here\u003c/em\u003e,\u003cem\u003e Inside Out 2\u003c/em\u003e, \u003cem\u003eThe Room Next Door\u003c/em\u003e, \u003cem\u003eSing Sing\u003c/em\u003e and \u003cem\u003eThe Wild Robot\u003c/em\u003e are out of the Adapted race. Among those ineligible for Original Screenplay are \u003cem\u003eAll We Imagine as Light\u003c/em\u003e, \u003cem\u003eThe Brutalist\u003c/em\u003e, \u003cem\u003eHard Truths\u003c/em\u003e, \u003ca href=\"https://deadline.com/2024/12/2024-gotham-awards-winners-list-1236189204/\"\u003eGotham Awards winner\u003c/a\u003e \u003cem\u003eHis Three Daughters\u003c/em\u003e, \u003cem\u003eI Saw the TV Glow\u003c/em\u003e, \u003cem\u003eThe Seed of the Sacred Fig, September 5 \u003c/em\u003eand \u003cem\u003eThe Substance\u003c/em\u003e.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tJoel Kim Booster is \u003ca href=\"https://deadline.com/2025/02/joel-kim-booster-host-2025-wga-awards-interview-1236287097/\"\u003ehosting the Los Angeles ceremony\u003c/a\u003e from the Beverly Hilton, and Roy Wood Jr. is emceeing the New York show at Edison Ballroom in Manhattan. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tHere are the winners so far at the 2025 Writers Guild Awards:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eORIGINAL SCREENPLAY\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAnora, Written by Sean Baker; Neon\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eADAPTED SCREENPLAY\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tNickel Boys, Screenplay by RaMell Ross \u0026amp; Joslyn Barnes, Based on the Book The Nickel Boys by Colson Whitehead; Orion Pictures/Amazon MGM Studios\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cb\u003e\u003cstrong\u003eLIMITED SERIES\u003c/strong\u003e\u003c/b\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe Penguin, Written by Vladimir Cvetko, Breannah Gibson,\u003cbr/\u003eErika L. Johnson, Lauren LeFranc, Corina Maritescu, Megan Martin, John\u003cbr/\u003eMcCutcheon, Shaye Ogbonna, Nick Towne, Noelle Valdivia, Kira Snyder; HBO | Max\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Welcome to Spiderwick” (The Spiderwick Chronicles), Written by Aron Eli Coleite; Roku Channel\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eNEWS SCRIPT – REGULARLY SCHEDULED, BULLETIN, OR BREAKING REPORT\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Willie Mays Tribute” (CBS Newspath), Written by Gerald Mazza; CBS News\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eNEWS SCRIPT – ANALYSIS, FEATURE, OR COMMENTARY\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“The Resistance” (60 Minutes), Written by Scott Pelley, Nicole Young, Kristin Steve; CBS News\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eQUIZ AND AUDIENCE PARTICIPATION\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tPop Culture Jeopardy!, Writers Marcus Brown, Buzzy Cohen, Michael Davies, Chip Dornell, John Duarte, Mark Gaberman, Debbie Griffin, Michele Loud, Traci Mack, Amy Ozols, Louis Virtel, Billy Wisse; Amazon Prime\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eDIGITAL NEWS\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“What Is Hamas Thinking Now?”, Written by Akbar Shahid Ahmed; HuffPost\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eSHORT FORM STREAMING\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tDie Hart 3: Hart to Kill, Written by Tripper Clancy; Roku Channel\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003e\n\t\u003cem\u003eErik Pedersen contributed to this report.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-02-16T00:29:47Z",
  "modifiedTime": "2025-02-16T01:07:31Z"
}
