{
  "id": "9f52c351-046a-48c0-91c1-ed107275d4e6",
  "title": "‘Zootopia 2’ Charms CinemaCon As Ke Huy Quan Intros Scenes Of Judy Hopps \u0026 Nick Wilde In Therapy With Quinta Brunson’s Dr. Fuzzby",
  "link": "https://deadline.com/2025/04/zootopia-2-quinta-brunson-ke-huy-quan-cinemacon-1236358834/",
  "description": "Plucky bunny cop Judy Hopps and her erstwhile foil, now partner, fox Nick Wilde got some prime screen time during Disney’s CinemaCon presentation today as a pair of clips were shown from Zootopia 2. The sequel to 2016’s Oscar-winning $1B+ grosser is due for release in the Thanksgiving corridor this year. The first movie followed […]",
  "author": "Nancy Tartaglione",
  "published": "Fri, 04 Apr 2025 01:07:57 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "News",
    "CinemaCon",
    "Disney",
    "Ke Huy Quan",
    "Quinta Brunson",
    "Zootopia 2"
  ],
  "byline": "Nancy Tartaglione, Anthony D'Alessandro, Jill Goldsmith",
  "length": 2795,
  "excerpt": "Disney unveiled new footage from Zootopia 2, the sequel to its 2016 Oscar winning blockbuster, at CinemaCon and featuring Ke Huy Quan and Quinta Brunson",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "Plucky bunny cop Judy Hopps and her erstwhile foil, now partner, fox Nick Wilde got some prime screen time during Disney’s CinemaCon presentation today as a pair of clips were shown from Zootopia 2. The sequel to 2016’s Oscar-winning $1B+ grosser is due for release in the Thanksgiving corridor this year. The first movie followed Judy (Ginnifer Goodwin) as a rookie cop who teams up with con artist Nick (Jason Bateman) to uncover a conspiracy in a titular metropolis of anthropomorphic animals. New cast member Ke Huy Quan was on hand to introduce the fresh Zootopia 2 footage. He joins the follow-up as a snake named Gary, the impetus for Judy and Nick’s next case. This portion of the show was introduced in voice-over by Bateman as Nick, who referred to CinemaCon as “ZinemaCon, Celebrating the Animal Experience” before Quan took the stage. Watch on Deadline RELATED: The 25 Highest-Grossing Animated Films Of All Time At The Box Office Quan called Gary “Zootopia’s first snake” and winked, “Like me, he is terrifying and villainous. … Gary kicks off the whole mystery when he turns up and panics the town.” Judy and Nick take on the case of tracking Gary down, but they are “going through a rough patch,” per Oscar winner Quan, and reluctantly are subjected to partners-counseling sessions with a “therapy animal” aka Dr Fuzzby (voiced by newly announced Quinta Brunson). In the first clip shown, the group-therapy meeting has a number of curiously paired partners — think elephant and mouse — but Judy is in denial that she and Nick have any issues. “We have been partners for one week and we are not dysfunctional at all. … Us being here seems like a misunderstanding,” she says as she nervously thumps her foot. Dr. Fuzzby in turn notes the “disconnected affectation of her emotionally insecure partner.” RELATED: The Movies That Have Made More Than $1 Billion At The Box Office In the second clip shown today, we see Judy and Nick set off to a swamp area where the snake has been sighted and where they meet with a beaver “who has her own way of communicating.”  Zootopia 2 is directed and written by Byron Howard and Jared Bush, who also were on the original. That film was a global phenomenon, grossing $1.026B and scooping the Best Animated Feature Academy Award.  RELATED: Zoe Saldaña Shows Off ‘Avatar: Fire And Ash’ At Disney’s CinemaCon\\ RELATED: Marvel At CinemaCon: ‘Thunderbolts*’ Cast Stumbles In From The Casino \u0026 Female Silver Surfer Shows Off ‘Fantastic Four’ Footage RELATED: Jeremy Allen White Transforms Into Bruce Springsteen In ‘Deliver Me From Nowhere’ – CinemaCon RELATED: Tom Cruise Returns To CinemaCon To Show Off ‘Mission: Impossible – The Final Reckoning’",
  "image": "https://deadline.com/wp-content/uploads/2025/04/Ke-Huy-Quan-CinemaCon.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tPlucky bunny cop Judy Hopps and her erstwhile foil, now partner, fox Nick Wilde got some prime screen time during \u003ca href=\"https://deadline.com/tag/disney/\" id=\"auto-tag_disney\" data-tag=\"disney\"\u003eDisney\u003c/a\u003e’s \u003ca href=\"https://deadline.com/tag/cinemacon/\" id=\"auto-tag_cinemacon\" data-tag=\"cinemacon\"\u003eCinemaCon\u003c/a\u003e presentation today as a pair of clips were shown from \u003cem\u003e\u003ca href=\"https://deadline.com/tag/zootopia-2/\" id=\"auto-tag_zootopia-2\" data-tag=\"zootopia-2\"\u003eZootopia 2\u003c/a\u003e\u003c/em\u003e. The sequel to 2016’s Oscar-winning $1B+ grosser is due for release in the Thanksgiving corridor this year.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\n\tThe first movie followed Judy (Ginnifer Goodwin) as a rookie cop who teams up with con artist Nick (Jason Bateman) to uncover a conspiracy in a titular metropolis of anthropomorphic animals.\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tNew cast member \u003ca href=\"https://deadline.com/tag/ke-huy-quan/\" id=\"auto-tag_ke-huy-quan\" data-tag=\"ke-huy-quan\"\u003eKe Huy Quan\u003c/a\u003e was on hand to introduce the fresh \u003cem\u003eZootopia 2\u003c/em\u003e footage. He joins the follow-up as a snake named Gary, the impetus for Judy and Nick’s next case. \n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tThis portion of the show was introduced in voice-over by Bateman as Nick, who referred to CinemaCon as “ZinemaCon, Celebrating the Animal Experience” before Quan took the stage.\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234771711\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eRELATED: \u003ca href=\"https://deadline.com/gallery/highest-grossing-animated-movies-all-time/\" data-type=\"pmc-gallery\" data-id=\"1235984884\"\u003eThe 25 Highest-Grossing Animated Films Of All Time At The Box Office\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tQuan called Gary “Zootopia’s first snake” and winked, “Like me, he is terrifying and villainous. … Gary kicks off the whole mystery when he turns up and panics the town.” Judy and Nick take on the case of tracking Gary down, but they are “going through a rough patch,” per Oscar winner Quan, and reluctantly are subjected to partners-counseling sessions with a “therapy animal” aka Dr Fuzzby (voiced by newly announced \u003ca href=\"https://deadline.com/tag/quinta-brunson/\" id=\"auto-tag_quinta-brunson\" data-tag=\"quinta-brunson\"\u003eQuinta Brunson\u003c/a\u003e).\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\n\tIn the first clip shown, the group-therapy meeting has a number of curiously paired partners — think elephant and mouse — but Judy is in denial that she and Nick have any issues. “We have been partners for one week and we are not dysfunctional at all. … Us being here seems like a misunderstanding,” she says as she nervously thumps her foot. Dr. Fuzzby in turn notes the “disconnected affectation of her emotionally insecure partner.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eRELATED: \u003ca href=\"https://deadline.com/gallery/highest-grossing-movies-all-time/\" data-type=\"pmc-gallery\" data-id=\"1235520083\"\u003eThe Movies That Have Made More Than $1 Billion At The Box Office\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn the second clip shown today, we see Judy and Nick set off to a swamp area where the snake has been sighted and where they meet with a beaver “who has her own way of communicating.” \u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\n\t\u003cem\u003eZootopia 2\u003c/em\u003e is directed and written by Byron Howard and Jared Bush, who also were on the original. That film was a global phenomenon, grossing $1.026B and scooping the \u003ca href=\"https://deadline.com/2017/02/zootopia-best-animated-feature-film-oscar-2017-donald-trump-1202003884/\"\u003eBest Animated Feature Academy Award. \u003c/a\u003e\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eRELATED: \u003ca href=\"https://deadline.com/2025/04/avatar-fire-and-ash-first-look-1236358731/\"\u003eZoe Saldaña Shows Off ‘Avatar: Fire And Ash’ At Disney’s CinemaCon\u003c/a\u003e\u003c/strong\u003e\\\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eRELATED: \u003ca href=\"https://deadline.com/2025/04/thunderbolts-fantastic-four-new-footage-1236358769/\"\u003eMarvel At CinemaCon: ‘Thunderbolts*’ Cast Stumbles In From The Casino \u0026amp; Female Silver Surfer Shows Off ‘Fantastic Four’ Footage\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eRELATED: \u003ca href=\"https://deadline.com/2025/04/jeremy-allen-bruce-springsteen-deliver-me-from-nowhere-cinemacon-1236358823/\"\u003eJeremy Allen White Transforms Into Bruce Springsteen In ‘Deliver Me From Nowhere’ – CinemaCon\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eRELATED: \u003c/strong\u003e\u003ca href=\"https://deadline.com/2025/04/tom-cruise-mission-impossible-cinemacon-1236358190/\"\u003e\u003cstrong\u003eTom Cruise Returns To CinemaCon To Show Off ‘Mission: Impossible – The Final Reckoning’\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-04T01:07:57Z",
  "modifiedTime": "2025-04-04T01:07:59Z"
}
