{
  "id": "a7994a05-4892-4931-bca6-f0ba418cb869",
  "title": "Disney To Pay Out $43M In Pay Equity Class Action Deal; Mouse House To Bring Outside Consultants On Board To Check Practices",
  "link": "https://deadline.com/2024/11/disney-pay-equity-suit-settlement-figure-1236187331/",
  "description": "We now know how much Disney is writing a check for to end the pay equity class action suit that has loomed over the company for the past five years. Set to address the up to 14,000 eligible class members of Mouse House female employees past and present from 2015 to today, the Bob Iger-run […]",
  "author": "Dominic Patten",
  "published": "Tue, 26 Nov 2024 00:44:00 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "Legal",
    "News",
    "Bob Iger",
    "Disney",
    "pay equity",
    "Walt Disney Company"
  ],
  "byline": "Dominic Patten",
  "length": 2983,
  "excerpt": "We now know how much Disney is writing a check for to end the pay equity class action suit that has loomed over the company for the past five years. Set to address the up to 14,000 eligible class members of Mouse House female employees past and present from 2015 to today, the Bob Iger-run […]",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "We now know how much Disney is writing a check for to end the pay equity class action suit that has loomed over the company for the past five years. Set to address the up to 14,000 eligible class members of Mouse House female employees past and present from 2015 to today, the Bob Iger-run fun palace will be paying $43.25 million, according to papers set filed in LA Superior Court docket later tonight. Far less than the $300 million it was estimated the case could balloon to once if was certified as a class action last December, the official compensation comes a couple of weeks after news broke of a quietly reached October settlement between Disney and the Lori Andrus represented plaintiffs. The whole matter was set to go to trial in May 2025. “We have always been committed to paying our employees fairly and have demonstrated that commitment throughout this case, and we are pleased to have resolved this matter,” a Disney spokesperson told Deadline today. Watch on Deadline Having said that, the company is also bringing in outside consultant to help foster better practices in terms of pay equality, I hear. Also, Disney will further its cooperation for another three years with external economist on the matter of compensation equity.   All of which is nice, but the bacon really gets fried up on January 10, 2025 in a downtown hearing before Judge Elihu M. Berle to get final approval for the settlement.  While never a sure thing and open to degrees of objection, that session in six weeks will more than likely be the end of this case. First filed in April 2019 over back pay, lost benefits and more by Disney staffers LaRonda Rasmussen and Karen Moore and heading towards a May 2025 trial, the suit accused the Magic Kingdom of not being so kind with its cash based on gender as opposed to performance. At its core, the suit claimed Disney has violated the Fair Employment \u0026 Housing Act and California’s Equal Pay Act in paying men more than women for the same work. Seeking at least $150 million in lost wages initially, the suit saw repeated big push back from Disney over the year in efforts to have it dismissed and not certified. Exclaiming the whole thing was merely “highly individualized allegations,” Disney’s Paul Hasting LLP team sought to limit the matter to a small contingent of less than 10 women. There was also drama over documents and discovery, with the plaintiffs calling out the Mouse House as dragging their feet with data and paperwork. Now it’s a very different type of paperwork everyone is waiting on from the judge after Thanksgiving, Christmas and New Year’s. Worth noting: The class action and any payout does not include women employed at Hulu, ESPN, Pixar and previously Fox assets like FX or National Geographic. Attorneys for the plaintiffs did not respond to request for comment on the settlement filing, if and when they do, we will update this post.",
  "image": "https://deadline.com/wp-content/uploads/2024/11/Disney.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\n\tWe now know how much \u003ca href=\"https://deadline.com/tag/disney/\" id=\"auto-tag_disney_1\" data-tag=\"disney\"\u003eDisney\u003c/a\u003e is writing a check for to end the \u003ca href=\"https://deadline.com/tag/pay-equity/\" id=\"auto-tag_pay-equity_1\" data-tag=\"pay-equity\"\u003epay equity\u003c/a\u003e class action suit that has loomed over the company for the past five years.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSet to address the up to 14,000 eligible class members of Mouse House female employees past and present from 2015 to today, the \u003ca href=\"https://deadline.com/tag/bob-iger/\" id=\"auto-tag_bob-iger_1\" data-tag=\"bob-iger\"\u003eBob Iger\u003c/a\u003e-run fun palace will be paying $43.25 million, according to papers set filed in LA Superior Court docket later tonight.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tFar less than the $300 million it was estimated the case could balloon to once if was \u003ca href=\"https://deadline.com/2023/12/disney-pay-equity-female-employees-class-acion-1235659375/\"\u003ecertified as a class action last Decembe\u003c/a\u003er, the official compensation comes a couple of weeks after\u003ca href=\"https://deadline.com/2024/11/disney-lawsuit-settlement-pay-equity-bob-iger-1236175006/\"\u003e news broke of a quietly reached October settlement between Disney and the Lori Andrus represented plaintiffs\u003c/a\u003e. The whole matter was set to go to trial in May 2025.\n\n\t\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\n\t“We have always been committed to paying our employees fairly and have demonstrated that commitment throughout this case, and we are pleased to have resolved this matter,” a Disney spokesperson told Deadline today. \n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234771711\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tHaving said that, the company is also bringing in outside consultant to help foster better practices in terms of pay equality, I hear. Also, Disney will further its cooperation for another three years with external economist on the matter of compensation equity.  \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAll of which is nice, but the bacon really gets fried up on January 10, 2025 in a downtown hearing before Judge Elihu M. Berle to get final approval for the settlement.  While never a sure thing and open to degrees of objection, that session in six weeks will more than likely be the end of this case.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tFirst filed in April 2019 over back pay, lost benefits and more by Disney staffers LaRonda Rasmussen and Karen Moore and heading towards a May 2025 trial, the suit accused the Magic Kingdom of not being so kind with its cash based on gender as opposed to performance. At its core, the suit claimed Disney has violated the Fair Employment \u0026amp; Housing Act and California’s Equal Pay Act in paying men more than women for the same work.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSeeking at least $150 million in lost wages initially, the suit saw repeated big push back from Disney over the year in efforts to have it dismissed and not certified. Exclaiming the whole thing was merely “highly individualized allegations,” Disney’s Paul Hasting LLP team sought to limit the matter to a small contingent of less than 10 women. There was also drama over documents and discovery, with the plaintiffs calling out the Mouse House as dragging their feet with data and paperwork.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tNow it’s a very different type of paperwork everyone is waiting on from the judge after Thanksgiving, Christmas and New Year’s.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWorth noting: The class action and any payout does not include women employed at \u003ca href=\"https://deadline.com/tag/hulu/\"\u003eHulu\u003c/a\u003e, \u003ca href=\"https://deadline.com/tag/espn/\"\u003eESPN\u003c/a\u003e, Pixar and previously Fox assets like FX or National Geographic.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAttorneys for the plaintiffs did not respond to request for comment on the settlement filing, if and when they do, we will update this post. \u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-26T00:44:00Z",
  "modifiedTime": "2024-11-26T01:08:32Z"
}
