{
  "id": "ae6dc765-d3d7-4545-9acc-4fce286439e8",
  "title": "‘Split Fiction’ Movie in the Works: Bidding War Begins for Rights to Adapt Hit Video Game (EXCLUSIVE)",
  "link": "https://variety.com/2025/film/news/split-fiction-movie-video-game-adaptation-1236344367/",
  "description": "A film adaptation of “Split Fiction,” the hot new co-op game from “It Takes Two” developer Hazelight Studios, is in the works, Variety has learned. Sources at the Game Developers Conference (GDC) in San Francisco have confirmed that media company Story Kitchen (led by the team that shepherded “It Takes Two” into a film project […]",
  "author": "Jennifer Maas",
  "published": "Thu, 20 Mar 2025 22:50:08 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Hazelight Studios",
    "Split Fiction"
  ],
  "byline": "Jennifer Maas",
  "length": 1686,
  "excerpt": "A film adaptation of \"Split Fiction,\" the hot new co-op game from \"It Takes Two\" developer Hazelight Studios, is in the works.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "A film adaptation of “Split Fiction,” the hot new co-op game from “It Takes Two” developer Hazelight Studios, is in the works, Variety has learned. Sources at the Game Developers Conference (GDC) in San Francisco have confirmed that media company Story Kitchen (led by the team that shepherded “It Takes Two” into a film project now set up at Amazon) is putting together the film’s cast, writers and director into a package as offers for the rights keep coming in from multiple top Hollywood studios. Variety, which is on the ground at GDC this week, is continuing to monitor the bidding war, with more details on the project to come. Popular on Variety Representatives for Hazelight Studios and Story Kitchen did not immediately respond to request for comment Thursday. Written by director and Hazelight studio chief Josef Fares and Sebastian Johansson, “Split Fiction” blends fantasy and science fiction, following a pair of authors trapped in the worlds they wrote. “Split Fiction” features gameplay mechanics involving split-screen combat, platforming challenges and differing abilities for each character. The game is a hit with players and critics alike, receiving positive reviews and massive sales. According to Hazelight, the game sold more than two million copies in the first week following its March 6 release, and that number continues to rise at a rapid clip. “Split Fiction” was first announced at the 2024 Game Awards by Fares, but began development immediately after the release of Hazelight’s critically acclaimed “It Takes Two” in 2021. The film rights to “It Takes Two” were snapped up by Amazon in April 2022.",
  "image": "https://variety.com/wp-content/uploads/2025/03/Split-Fiction.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tA film adaptation of “\u003ca href=\"https://variety.com/t/split-fiction/\" id=\"auto-tag_split-fiction\" data-tag=\"split-fiction\"\u003eSplit Fiction\u003c/a\u003e,” the hot new co-op game from “It Takes Two” developer \u003ca href=\"https://variety.com/t/hazelight-studios/\" id=\"auto-tag_hazelight-studios\" data-tag=\"hazelight-studios\"\u003eHazelight Studios\u003c/a\u003e, is in the works, \u003cem\u003eVariety \u003c/em\u003ehas learned.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSources at the Game Developers Conference (GDC) in San Francisco have confirmed that media company Story Kitchen (led by the team that\u003ca data-id=\"https://variety.com/2022/film/news/it-takes-two-movie-amazon-dwayne-johnson-1235236319/\" data-type=\"link\" href=\"https://variety.com/2022/film/news/it-takes-two-movie-amazon-dwayne-johnson-1235236319/\"\u003e shepherded “It Takes Two” into a film project now set up at Amazon\u003c/a\u003e) is putting together the film’s cast, writers and director into a package as offers for the rights keep coming in from multiple top Hollywood studios.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cem\u003eVariety\u003c/em\u003e, which is on the ground at GDC this week, is continuing to monitor the bidding war, with more details on the project to come.\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tRepresentatives for Hazelight Studios and Story Kitchen did not immediately respond to request for comment Thursday.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tWritten by director and Hazelight studio chief Josef Fares and Sebastian Johansson, “Split Fiction” blends fantasy and science fiction, following a pair of authors trapped in the worlds they wrote. “Split Fiction” features gameplay mechanics involving split-screen combat, platforming challenges and differing abilities for each character.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe game is a hit with players and critics alike, receiving positive reviews and massive sales. According to Hazelight, the game sold more than \u003ca data-id=\"https://variety.com/2025/gaming/news/split-fiction-2-million-copies-sold-1236336662/\" data-type=\"link\" href=\"https://variety.com/2025/gaming/news/split-fiction-2-million-copies-sold-1236336662/\"\u003etwo million copies in the first week\u003c/a\u003e following its March 6 release, and that number continues to rise at a rapid clip.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Split Fiction” was first announced at the 2024 Game Awards by Fares, but began development immediately after the release of Hazelight’s critically acclaimed “It Takes Two” in 2021. The film rights to “It Takes Two” were snapped up by Amazon in April 2022.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-03-20T22:50:08Z",
  "modifiedTime": "2025-03-20T23:00:03Z"
}
