{
  "id": "afb8c225-17c8-4906-8cda-bc74d8c525e2",
  "title": "White House Correspondents’ Dinner: ‘We’ve Been Tested, Attacked’ and Put Through ‘the Ringer,’ Eugene Daniels Says",
  "link": "https://variety.com/2025/tv/news/white-house-correspondents-tested-attacked-eugene-daniels-1236379310/",
  "description": "The White House Correspondents’ Dinner “is going to feel a little different this year,” the organization’s president acknowledged Saturday at the outset of the annual gathering of the White House press corps. Eugene Daniels, White House Correspondents Assn. president who is soon to become an anchor for MSNBC, opened the event at the Washington Hilton […]",
  "author": "Cynthia Littleton",
  "published": "Sun, 27 Apr 2025 00:52:08 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "White House Correspondents Association"
  ],
  "byline": "William Earl",
  "length": 3416,
  "excerpt": "White House Correspondents' Assn. chief Eugene Daniels nodded to the org's recent struggles amid Trump attacks at the start of its dinner event.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "The White House Correspondents’ Dinner “is going to feel a little different this year,” the organization’s president acknowledged Saturday at the outset of the annual gathering of the White House press corps. Eugene Daniels, White House Correspondents Assn. president who is soon to become an anchor for MSNBC, opened the event at the Washington Hilton Hotel with an acknowledgement that the WHCA has had a bumpy ride to this year’s event. “There’s no president, there’s no comedian, it’s just an intense focus on our fabulous scholarship students,” he said. “Just a celebration of all of you — thousands of people with a shared commitment to the First Amendment.” Popular on Variety The WHCA typically has a prominent comedian deliver roast-y remarks about the president. This year, the WHCA tapped Amber Ruffin for the gig in February but then disinvited her after complaints from conservatives about her sharp criticisms of Trump and the MAGA movement. Daniels has been under fire for that decision and for the WHCA’s response to Trump administration power moves against the media, including taking control of organization and assignments for the White House press pool. Daniels, a veteran of Politico who will soon be one of three anchors of MSNBC’s Saturday and Sunday morning broadcast “The Weekend,” told the crowd that the larger mission of WHCA members — to report on the activity of the President and the White House for the benefit of the American public — has not changed. “I know this has been an extremely difficult year for all. It’s been difficult for this association. We’ve been tested, attacked,” Daniels said. Every morning, WHCA members “run to the White House — plane, train, automobile — with one mission — holding the powerful accountable, telling the stories of those who can’t tell them for themselves. That has never stopped, and it never will,” he said. Daniels did not mention the Ruffin situation specifically but he did nod to it in thanking his fellow WHCA board members: “We have been through the ringer,” he said. At the end of his brief opening remarks, Daniels joked about the famously competitive nature of the White House press corps. “If any breaking news happens, I’ll pop back up here let you all in on it, so you can feel free to let your hair down. Unless it’s too good. Then I’m just going to whisper to my new bosses here,” Daniels said. The WHCA has about 900 members. The WHCA has held an annual dinner since 1921. In his first term, President Donald Trump became the only president in a century to not to attend the event at least once in his term, a sign of Trump’s contentious relationship with the news media. The dinner raises money for the WHCA to fund scholarships and other journalism education outreach activities. In March, when the WHCA dropped Ruffin, Daniels told members that it was important to keep the focus on journalism this year given the threats posed by Trump’s extreme antagonism. “The WHCA board has unanimously decided we are no longer featuring a comedic performance this year. At this consequential moment for journalism, I want to ensure the focus is not on the politics of division but entirely on awarding our colleagues for their outstanding work and providing scholarship and mentorship to the next generation of journalists,” Daniels wrote.",
  "image": "https://variety.com/wp-content/uploads/2025/04/GettyImages-2212149247-e1745713360723.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tThe White House Correspondents’ Dinner “is going to feel a little different this year,” the organization’s president acknowledged Saturday at the outset of the annual gathering of the White House press corps.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tEugene Daniels, White House Correspondents Assn. president who is soon to become an anchor for MSNBC, opened the event at the Washington Hilton Hotel with an acknowledgement that the WHCA has had a bumpy ride to this year’s event. \n\n\n\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t“There’s no president, there’s no comedian, it’s just an intense focus on our fabulous scholarship students,” he said. “Just a celebration of all of you — thousands of people with a shared commitment to the First Amendment.”\n\n\t\u003c/p\u003e\n\n\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tThe WHCA typically has a prominent comedian deliver roast-y remarks about the president. This year, the WHCA tapped Amber Ruffin for the gig in February but then disinvited her after complaints from conservatives about her sharp criticisms of Trump and the MAGA movement. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tDaniels has been under fire for that decision and for the WHCA’s response to Trump administration power moves against the media, including taking control of organization and assignments for the White House press pool. Daniels, a veteran of Politico who will soon be one of three anchors of MSNBC’s Saturday and Sunday morning broadcast “The Weekend,” told the crowd that the larger mission of WHCA members — to report on the activity of the President and the White House for the benefit of the American public — has not changed. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“I know this has been an extremely difficult year for all. It’s been difficult for this association. We’ve been tested, attacked,” Daniels said. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tEvery morning, WHCA members “run to the White House — plane, train, automobile — with one mission — holding the powerful accountable, telling the stories of those who can’t tell them for themselves. That has never stopped, and it never will,” he said.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tDaniels did not mention the Ruffin situation specifically but he did nod to it in thanking his fellow WHCA board members: “We have been through the ringer,” he said. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAt the end of his brief opening remarks, Daniels joked about the famously competitive nature of the White House press corps. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“If any breaking news happens, I’ll pop back up here let you all in on it, so you can feel free to let your hair down. Unless it’s too good. Then I’m just going to whisper to my new bosses here,” Daniels said.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tThe WHCA has about 900 members. The WHCA has held an annual dinner since 1921. In his first term, President Donald Trump became the only president in a century to not to attend the event at least once in his term, a sign of Trump’s contentious relationship with the news media.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe dinner raises money for the WHCA to fund scholarships and other journalism education outreach activities. In March, when the WHCA dropped Ruffin, Daniels told members that it was important to keep the focus on journalism this year given the threats posed by Trump’s extreme antagonism.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“The WHCA board has unanimously decided we are no longer featuring a comedic performance this year. At this consequential moment for journalism, I want to ensure the focus is not on the politics of division but entirely on awarding our colleagues for their outstanding work and providing scholarship and mentorship to the next generation of journalists,” Daniels wrote.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-27T00:52:08Z",
  "modifiedTime": "2025-04-27T00:55:03Z"
}
