{
  "id": "b040c7d2-f686-47b3-ab9e-66e8f72ce0a2",
  "title": "Wick is Pain: Explore How The John Wick Films Came To Be In A New Doc",
  "link": "https://bleedingcool.com/movies/wick-is-pain-explore-how-the-john-wick-films-came-to-be-in-a-new-doc/",
  "description": "Wick is Pain is a new documentary set to be released later this week that explores the origins of the John Wick franchise.",
  "author": "Kaitlyn Booth",
  "published": "Sun, 04 May 2025 19:17:07 -0500",
  "source": "https://www.bleedingcool.com/movies/feed/",
  "categories": [
    "Lionsgate",
    "Movies",
    "wick is pain"
  ],
  "byline": "Kaitlyn Booth",
  "length": 5111,
  "excerpt": "The John Wick movies have been something pretty special from the beginning. We all thought this was just another disposable action film where the elevator pitch quite literally seemed like it was, \"Taken but with a dog.\" However, it was so much more, and you don't get the kind of support from fans and critics […]",
  "siteName": "Bleeding Cool News",
  "favicon": "",
  "text": "Posted in: Lionsgate, Movies | Tagged: wick is painWick is Pain is a new documentary set to be released later this week that explores the origins of the John Wick franchise.Article Summary Wick is Pain is a new documentary diving into the origins and making of the John Wick franchise. Features interviews with Keanu Reeves, Chad Stahelski, and key members of the creative team. The film premieres at Beyond Fest on May 8 and will be available digitally on May 9. Explores the franchise's gritty journey from indie concept to global action phenomenon. The John Wick movies have been something pretty special from the beginning. We all thought this was just another disposable action film where the elevator pitch quite literally seemed like it was, \"Taken but with a dog.\" However, it was so much more, and you don't get the kind of support from fans and critics this consistently if there isn't something special there. In the year of the stunt category becoming a thing at the Oscars, and people are starting to really recognize the work people put into making our favorite movies look fantastic, there probably isn't a better time for Wick is Pain to come out. This documentary explores how the franchise came to be with interviews from star Keanu Reeves, director Chad Stahelski, and more, telling us how all of this came to be. Lionsgate sent out a press release with a trailer, poster, and some quotes from everyone involved with the documentary talking about the project. Wick is Pain is directed by Jeffrey Doe, produced by Josh Oreck, Gabriel Roth, and Matthew Sidle, and executive produced by Tina Carter. It will screen exclusively at Beyond Fest at the American Cinematheque on May 8, and will be available to buy on digital platforms where movies are purchased, including Amazon Prime Video, Apple TV, Fandango at Home, YouTube, Microsoft Movies \u0026 TV, and Comcast Xfinity, among others, the next day, May 9 (with pre-orders starting May 1). Photo Credit: Courtesy of Lionsgate © 2025 Lionsgate \"I'm excited to share and be a part of taking fans behind the curtain on the extraordinary journey of making the John Wick films,\" said Keanu Reeves. Chad Stahelski said, \"We had an idea for a low-budget independent movie. Looking back now, more than ten years later, it's hard to believe what that idea became. It's the fans that embraced the movie that made it all possible—and made all the pain a pleasure.\" Basil Iwanyk said, \"We have never worked harder on any movie than we have on the John Wick series. Producing a movie is always long hours and stressful times, but John Wick turned that up to the max—and because we survived, that's what made the movies so gratifying.\" David Leitch, producer of John Wick, added, \"It's safe to say that John Wick changed our lives, for everyone involved. We had been waiting for the opportunity to show our vision of what action filmmaking could be, and this film and this character gave us that opportunity. Thank you, Mr. Wick.\" Director Jeffrey Doe said, \"From the beginning of this project, Chad's only guidance was 'Keep it honest.' The bold candor from Chad, Keanu, and the rest of the Wick team was incredible. They helped us shape a raw, unflinching take on the costs of sticking to your guns to achieve an artistic vision, filled with all the physical, emotional, and personal suffering that brings. It's been a privilege to share their remarkable story of pain, joy, and triumph in a way that I hope it captivates John Wick fans everywhere!\" Producer Josh Oreck added, \"I met Keanu Reeves and Chad Stahelski 27 years ago in a dilapidated warehouse in Burbank, where they trained daily for a 'sci-fi movie' that ended up being The Matrix. Since that day, I've been fortunate enough to have a front-row seat to a masterclass in filmmaking—and the decades of hard work, wild-ass thinking, agony, and resilience that built the icon that is John Wick. This is a chronicle of that adventure, and I'm so grateful to Chad, Keanu, and the rest of the Wick team for letting us tell their story.\" Adam Fogelson, chair, Lionsgate Motion Picture Group, said \"The phenomenal success of the John Wick franchise demonstrates what happens when filmmakers deliver everything fans wish for in a movie viewing experience: emotionally impactful storytelling, one of the most beloved actors of his generation, characters the audience cares about, and a next-level approach to every aspect of filmmaking. I am so excited for our fans to get this unprecedented glimpse into the incredible story of how those ingredients came together to form the franchise they know and love.\" Enjoyed this? Please share on social media! Stay up-to-date and support the site by following Bleeding Cool on Google News today! About Kaitlyn BoothKaitlyn is the Editor-in-Chief at Bleeding Cool. Film critic and pop culture writer since 2013. Ace. Leftist. Nerd. Feminist. Writer. Replicant Translator. Cinephillic Virtue Signaler. She/Her. UFCA/GALECA Member. 🍅 Approved. Follow her Threads, Instagram, and Twitter @katiesmovies.",
  "image": "https://bleedingcool.com/wp-content/uploads/2025/05/JW4_Unit_210811_00711_R-2000x1125.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"wrapper\"\u003e\u003carticle id=\"article\" data-post-id=\"2214841\" itemscope=\"\" itemtype=\"http://schema.org/Article\"\u003e\u003cp\u003ePosted in: \u003ca href=\"https://bleedingcool.com/movies/lionsgate/\" rel=\"category\"\u003eLionsgate\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/movies/\" rel=\"category\"\u003eMovies\u003c/a\u003e | Tagged: \u003ca href=\"https://bleedingcool.com/tag/wick-is-pain/\" rel=\"tag\"\u003ewick is pain\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\u003cp\u003eWick is Pain is a new documentary set to be released later this week that explores the origins of the John Wick franchise.\u003c/p\u003e\u003chr/\u003e\u003chr/\u003e\u003cdiv id=\"post_summary\"\u003e\u003ch2\u003eArticle Summary\u003c/h2\u003e\u003cul\u003e\n\u003cli\u003eWick is Pain is a new documentary diving into the origins and making of the John Wick franchise.\u003c/li\u003e\n\u003cli\u003eFeatures interviews with Keanu Reeves, Chad Stahelski, and key members of the creative team.\u003c/li\u003e\n\u003cli\u003eThe film premieres at Beyond Fest on May 8 and will be available digitally on May 9.\u003c/li\u003e\n\u003cli\u003eExplores the franchise\u0026#39;s gritty journey from indie concept to global action phenomenon.\u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003chr/\u003e\u003cp\u003e\u003ciframe width=\"1170\" height=\"658\" srcdoc=\"\u0026lt;style\u0026gt;*{padding:0;margin:0;overflow:hidden}html,body{height:100%}img,span{position:absolute;width:100%;top:0;bottom:0;margin:auto}span{height:1.5em;text-align:center;font:48px/1.5 sans-serif;color:white;text-shadow:0 0 0.5em black}\u0026lt;/style\u0026gt;\u0026lt;a href=https://www.youtube.com/embed/LaEjB78QLSE?feature=oembed?autoplay=1\u0026gt;\u0026lt;img src=https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://img.youtube.com/vi/LaEjB78QLSE/hqdefault.jpg loading=\u0026#34;lazy\u0026#34; alt=\u0026#34;Link to play video.\u0026#34;\u0026gt;\u0026lt;span\u0026gt;▶\u0026lt;/span\u0026gt;\u0026lt;/a\u0026gt;\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture; fullscreen;\" loading=\"lazy\" src=\"https://www.youtube.com/embed/LaEjB78QLSE?feature=oembed\" title=\"Youtube Video\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003cp\u003eThe John Wick movies have been something pretty special from the beginning. We all thought this was just another disposable action film where the elevator pitch quite literally seemed like it was, \u0026#34;\u003cem\u003eTaken\u003c/em\u003e but with a dog.\u0026#34; However, it was so much more, and you don\u0026#39;t get the kind of support from fans and critics this consistently if there isn\u0026#39;t something special there. In the year of the stunt category becoming a thing at the Oscars, and people are starting to really recognize the work people put into making our favorite movies look fantastic, there probably isn\u0026#39;t a better time for \u003cem\u003eWick is Pain\u003c/em\u003e to come out. This documentary \u003cspan\u003eexplores how the franchise came to be with interviews from star \u003cstrong\u003eKeanu Reeves, \u003c/strong\u003edirector \u003cstrong\u003eChad Stahelski\u003c/strong\u003e, and more, telling us how all of this came to be.\u003c/span\u003e Lionsgate sent out a press release with a \u003ca href=\"https://youtu.be/LaEjB78QLSE\"\u003etrailer\u003c/a\u003e, poster, and some quotes from everyone involved with the documentary talking about the project.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eWick is Pain\u003c/em\u003e is directed by\u003cstrong\u003e Jeffrey Doe\u003c/strong\u003e, produced by \u003cstrong\u003eJosh Oreck, Gabriel Roth, \u003c/strong\u003eand \u003cstrong\u003eMatthew Sidle\u003c/strong\u003e, and executive produced by \u003cstrong\u003eTina Carter\u003c/strong\u003e. It will screen exclusively at Beyond Fest at the American Cinematheque on May 8, and will be available to buy on digital platforms where movies are purchased, including Amazon Prime Video, Apple TV, Fandango at Home, YouTube, Microsoft Movies \u0026amp; TV, and Comcast Xfinity, among others, the next day, May 9 (with pre-orders starting May 1).\u003c/p\u003e\n\u003cfigure id=\"attachment_2214848\" aria-describedby=\"caption-attachment-2214848\"\u003e\u003ca href=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://bleedingcool.com/wp-content/uploads/2025/05/WIP_2025x3000_Online_1SHT_TSR_V2.jpg\"\u003e\u003cimg src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:889/q:75/https://bleedingcool.com/wp-content/uploads/2025/05/WIP_2025x3000_Online_1SHT_TSR_V2.jpg\" alt=\"A promotional illustration for the film featuring Keanu Reeves as John Wick, showing him with blood on his face and a pained expression. The text \u0026#39;WICK is PAIN\u0026#39; is prominently displayed, along with the release date \u0026#39;ON DIGITAL MAY 9\u0026#39;.\" width=\"600\" height=\"889\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:889/q:75/https://bleedingcool.com/wp-content/uploads/2025/05/WIP_2025x3000_Online_1SHT_TSR_V2.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20600%20889%22%20width%3D%22600%22%20height%3D%22889%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2214848\"\u003ePhoto Credit: Courtesy of Lionsgate © 2025 Lionsgate\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\u0026#34;I\u0026#39;m excited to share and be a part of taking fans behind the curtain on the extraordinary journey of making the John Wick films,\u0026#34; said Keanu Reeves.\u003c/p\u003e\n\u003cp\u003eChad Stahelski said, \u0026#34;We had an idea for a low-budget independent movie. Looking back now, more than ten years later, it\u0026#39;s hard to believe what that idea became. It\u0026#39;s the fans that embraced the movie that made it all possible—and made all the pain a pleasure.\u0026#34;\u003c/p\u003e\n\u003cp\u003eBasil Iwanyk said, \u0026#34;We have never worked harder on any movie than we have on the John Wick series. Producing a movie is always long hours and stressful times, but John Wick turned that up to the max—and because we survived, that\u0026#39;s what made the movies so gratifying.\u0026#34;\u003c/p\u003e\n\u003cp\u003eDavid Leitch, producer of John Wick, added, \u0026#34;It\u0026#39;s safe to say that John Wick changed our lives, for everyone involved. We had been waiting for the opportunity to show our vision of what action filmmaking could be, and this film and this character gave us that opportunity. Thank you, Mr. Wick.\u0026#34;\u003c/p\u003e\n\n\t\t\n\t\t\n\n\u003cp\u003eDirector Jeffrey Doe said, \u0026#34;From the beginning of this project, Chad\u0026#39;s only guidance was \u0026#39;Keep it honest.\u0026#39; The bold candor from Chad, Keanu, and the rest of the Wick team was incredible. They helped us shape a raw, unflinching take on the costs of sticking to your guns to achieve an artistic vision, filled with all the physical, emotional, and personal suffering that brings. It\u0026#39;s been a privilege to share their remarkable story of pain, joy, and triumph in a way that I hope it captivates John Wick fans everywhere!\u0026#34;\u003c/p\u003e\n\u003cp\u003eProducer Josh Oreck added, \u0026#34;I met Keanu Reeves and Chad Stahelski 27 years ago in a dilapidated warehouse in Burbank, where they trained daily for a \u0026#39;sci-fi movie\u0026#39; that ended up being The Matrix. Since that day, I\u0026#39;ve been fortunate enough to have a front-row seat to a masterclass in filmmaking—and the decades of hard work, wild-ass thinking, agony, and resilience that built the icon that is John Wick. This is a chronicle of that adventure, and I\u0026#39;m so grateful to Chad, Keanu, and the rest of the Wick team for letting us tell their story.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAdam Fogelson, chair, Lionsgate Motion Picture Group, said \u0026#34;The phenomenal success of the John Wick franchise demonstrates what happens when filmmakers deliver everything fans wish for in a movie viewing experience: emotionally impactful storytelling, one of the most beloved actors of his generation, characters the audience cares about, and a next-level approach to every aspect of filmmaking. I am so excited for our fans to get this unprecedented glimpse into the incredible story of how those ingredients came together to form the franchise they know and love.\u0026#34;\u003c/p\u003e\n\u003chr/\u003e\u003cdiv id=\"bc_sharing_is_caring\"\u003e\u003ccenter\u003e\u003cp\u003e\u003cstrong\u003eEnjoyed this? Please share on social media!\u003c/strong\u003e\u003c/p\u003e\u003ca href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fwick-is-pain-explore-how-the-john-wick-films-came-to-be-in-a-new-doc%2F\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://twitter.com/share?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fwick-is-pain-explore-how-the-john-wick-films-came-to-be-in-a-new-doc%2F\u0026amp;text=Wick+is+Pain%3A+Explore+How+The+John+Wick+Films+Came+To+Be+In+A+New+Doc\u0026amp;via=bleedingcool\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"http://pinterest.com/pin/create/button/?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fwick-is-pain-explore-how-the-john-wick-films-came-to-be-in-a-new-doc%2F\u0026amp;description=Wick+is+Pain%3A+Explore+How+The+John+Wick+Films+Came+To+Be+In+A+New+Doc\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://reddit.com/submit?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fwick-is-pain-explore-how-the-john-wick-films-came-to-be-in-a-new-doc%2F\u0026amp;title=Wick+is+Pain%3A+Explore+How+The+John+Wick+Films+Came+To+Be+In+A+New+Doc\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003c/center\u003e\u003c/div\u003e\n    \u003ca id=\"google_follow\" href=\"https://news.google.com/publications/CAAqBwgKMPHflgsw1IauAw?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n        \u003cp\u003e\u003cimg width=\"100\" height=\"81\u0026#34;\" src=\"https://bleedingcool.com/Google_News_icon.png\"/\u003e\n        \u003c/p\u003e\n        \u003cp\u003e\n            Stay up-to-date and support the site by following Bleeding Cool on Google News today!\n        \u003c/p\u003e\n    \u003c/a\u003e\u003c/article\u003e\u003csection\u003e\u003ch2\u003e\u003cimg data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:150/h:150/q:75/https://www.gravatar.com/avatar/c6bcaa58a7b5119a6d358a10f6547af6?s=150\" src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20150%20150%22%20width%3D%22150%22%20height%3D%22150%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\" width=\"150px\" height=\"150px\" alt=\"Kaitlyn Booth\"/\u003eAbout \u003ca href=\"https://bleedingcool.com/author/kbooth/\"\u003eKaitlyn Booth\u003c/a\u003e\u003c/h2\u003eKaitlyn is the Editor-in-Chief at Bleeding Cool. Film critic and pop culture writer since 2013. Ace. Leftist. Nerd. Feminist. Writer. Replicant Translator. Cinephillic Virtue Signaler. She/Her. UFCA/GALECA Member. 🍅 Approved. Follow her Threads, Instagram, and Twitter @katiesmovies.\u003c/section\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-05-04T19:17:07-05:00",
  "modifiedTime": "2025-05-04T19:17:07-05:00"
}
