{
  "id": "b3ddcc59-a556-4ca4-bf8b-8af3d84a6522",
  "title": "Explosive Trailer for Intense Action Comedy Film 'Zero' Set in Senegal",
  "link": "https://www.firstshowing.net/2025/explosive-trailer-for-intense-action-comedy-film-zero-set-in-senegal/",
  "description": "\"If you want to live - RUN!\" Whoa! Don't miss this one. Well Go USA has revealed an official trailer for the action thriller film from Africa titled Zero, the latest creation of director Jean Luc Herbulot. It debuted at Beyond Fest and the Sitges Film Festival last year (read my review) and it will be dropping in US theaters and on VOD this April to watch. This has such a bold \u0026 crazy concept! Two American strangers searching for purpose in the city of Dakar, Senegal, wake up with bombs strapped to their chests, counting down from ten hours. Controlled by a mysterious voice on a phone (Willem Dafoe), they must complete a series of chaotic missions with devastating consequences. As the city erupts in protest against Western influences, the two confused men race for redemption. ZER0 is a thrilling, darkly humorous tale of survival, connection, and the human search for meaning. Starring Hus Miller, Cam McHarg, Gary Dourdan, Roger Sallah, and Moran Rosenblatt. Even if it's a little rough around the edges, this is still so rad - a \"cool, inventive, and very kinetic action thriller.\" A new one from the same guy behind Saloum! And it's definitely […]",
  "author": "Alex Billington",
  "published": "Tue, 04 Mar 2025 21:27:11 +0000",
  "source": "https://www.firstshowing.net/feed/",
  "categories": [
    "To Watch",
    "Trailer"
  ],
  "byline": "Alex Billington",
  "length": 2638,
  "excerpt": "\"If you want to live - RUN!\" Whoa! Don't miss this one. Well Go USA has revealed an official trailer for the action thriller film from Africa titled Zero, the latest creation of director Jean Luc Herbulot. It debuted at Beyond Fest and the Sitges Film Festival last year (read my review) and it will",
  "siteName": "FirstShowing.net",
  "favicon": "https://www.firstshowing.net/favicon-32x32.png",
  "text": "by March 4, 2025Source: YouTube \"If you want to live - RUN!\" Whoa! Don't miss this one. Well Go USA has revealed an official trailer for the action thriller film from Africa titled Zero, the latest creation of director Jean Luc Herbulot. It debuted at Beyond Fest and the Sitges Film Festival last year (read my review) and it will be dropping in US theaters and on VOD this April to watch. This has such a bold \u0026 crazy concept! Two American strangers searching for purpose in the city of Dakar, Senegal, wake up with bombs strapped to their chests, counting down from ten hours. Controlled by a mysterious voice on a phone (Willem Dafoe), they must complete a series of chaotic missions with devastating consequences. As the city erupts in protest against Western influences, the two confused men race for redemption. ZER0 is a thrilling, darkly humorous tale of survival, connection, and the human search for meaning. Starring Hus Miller, Cam McHarg, Gary Dourdan, Roger Sallah, and Moran Rosenblatt. Even if it's a little rough around the edges, this is still so rad - a \"cool, inventive, and very kinetic action thriller.\" A new one from the same guy behind Saloum! And it's definitely worth a watch. Here's the official US trailer (+ poster) for Jean Luc Herbulot's action movie Zero, direct from YouTube: In the bustling heart of Dakar, two Americans (Hus Miller \u0026 Cam McHarg) wake to a nightmare: bombs strapped to their chests, and they only have ten hours before they explode. With no idea who’s behind it, their only hope for survival is to listen to the instructions of a mysterious voice on the phone, forcing them to complete a series of bizarre and perilous tasks across the city. As they race against time in this twisted scavenger hunt, the vibrant streets of Dakar become a high-stakes labyrinth of survival. Darkly thrilling and filled with unexpected political commentary on colonialism and modern African society, this tense and exciting, pulse-pounding new thriller keeps you guessing until the very last second—because in this world, every move counts. Zero is directed by the Congolese filmmaker Jean Luc Herbulot, director of the films Dealer, Interstate, and Saloum previously, plus many other shorts and the \"Get Millie Black\" series. The screenplay is written by Hus Miller \u0026 Jean Luc Herbulot. It's produced by Steven Adams, Pamela Diop, Gary Dourdan, Hus Miller. This initially premiered at the 2024 Sitges Film Festival \u0026 Beyond Fest last fall. Well Go USA will debut Zero in select US theaters + on VOD starting April 11th, 2025 this spring. Interested? Find more posts in: To Watch, Trailer",
  "image": "https://media2.firstshowing.net/firstshowing/img16/ZeroSenegalPostermainbigTW2.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\n\t\t\t\u003cp\u003eby \t\t\u003cbr/\u003eMarch 4, 2025\u003cbr/\u003e\u003cem\u003eSource:\u003c/em\u003e \u003ca href=\"https://www.youtube.com/watch?v=_wVUlt_kWko\" rel=\"noopener nofollow\" target=\"_blank\"\u003eYouTube\u003c/a\u003e\u003cbr/\u003e\u003c/p\u003e\n\t\t\u003cp\u003e\u003ca href=\"https://www.firstshowing.net/2025/explosive-trailer-for-intense-action-comedy-film-zero-set-in-senegal/\"\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/ZeroSenegalPostermainbigTsr1.jpg?quality=96\" alt=\"Zero Trailer\" width=\"350\" height=\"168\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u0026#34;If you want to live - RUN!\u0026#34;\u003c/em\u003e Whoa! Don\u0026#39;t miss this one. Well Go USA has revealed an official trailer for the action thriller film from Africa titled \u003cstrong\u003e\u003cem\u003eZero\u003c/em\u003e\u003c/strong\u003e, the latest creation of director \u003cstrong\u003eJean Luc Herbulot\u003c/strong\u003e. It debuted at Beyond Fest and the Sitges Film Festival last year (\u003ca href=\"https://www.firstshowing.net/2024/sitges-2024-riveting-countdown-thriller-zero-from-jean-luc-herbulot/\"\u003eread my review\u003c/a\u003e) and it will be dropping in US theaters and on VOD \u003ca href=\"https://www.firstshowing.net/schedule2025/#apr\"\u003ethis April\u003c/a\u003e to watch. This has such a bold \u0026amp; crazy concept! Two American strangers searching for purpose in the city of Dakar, Senegal, wake up with bombs strapped to their chests, counting down from ten hours. Controlled by a mysterious voice on a phone (\u003cstrong\u003eWillem Dafoe\u003c/strong\u003e), they must complete a series of chaotic missions with devastating consequences. As the city erupts in protest against Western influences, the two confused men race for redemption. \u003cem\u003eZER0\u003c/em\u003e is a thrilling, darkly humorous tale of survival, connection, and the human search for meaning. Starring \u003cstrong\u003eHus Miller\u003c/strong\u003e, \u003cstrong\u003eCam McHarg\u003c/strong\u003e, \u003cstrong\u003eGary Dourdan\u003c/strong\u003e, \u003cstrong\u003eRoger Sallah\u003c/strong\u003e, and \u003cstrong\u003eMoran Rosenblatt\u003c/strong\u003e. Even if it\u0026#39;s a little rough around the edges, this is still so rad - a \u0026#34;cool, inventive, and very kinetic action thriller.\u0026#34; A new one from the same guy behind \u003ca href=\"https://www.firstshowing.net/2022/official-trailer-for-awesome-african-neo-western-horror-saloum/\"\u003e\u003cem\u003eSaloum\u003c/em\u003e\u003c/a\u003e! And it\u0026#39;s definitely worth a watch.\u003cspan id=\"more-730956\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eHere\u0026#39;s the official US trailer (+ poster) for Jean Luc Herbulot\u0026#39;s action movie \u003cstrong\u003e\u003cem\u003eZero\u003c/em\u003e\u003c/strong\u003e, direct from \u003ca href=\"https://www.youtube.com/watch?v=_wVUlt_kWko\" rel=\"noopener\" target=\"_blank\"\u003eYouTube\u003c/a\u003e:\u003c/p\u003e\n\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/ZeroSenegalPostermainbig5991.jpg\" alt=\"Zero Poster\" width=\"599\" height=\"885\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eIn the bustling heart of Dakar, two Americans (Hus Miller \u0026amp; Cam McHarg) wake to a nightmare: bombs strapped to their chests, and they only have ten hours before they explode. With no idea who’s behind it, their only hope for survival is to listen to the instructions of a mysterious voice on the phone, forcing them to complete a series of bizarre and perilous tasks across the city. As they race against time in this twisted scavenger hunt, the vibrant streets of Dakar become a high-stakes labyrinth of survival. Darkly thrilling and filled with unexpected political commentary on colonialism and modern African society, this tense and exciting, pulse-pounding new thriller keeps you guessing until the very last second—because in this world, every move counts.\u003c/em\u003e \u003cem\u003eZero\u003c/em\u003e is directed by the Congolese filmmaker \u003ca href=\"https://www.imdb.com/name/nm2699094/\" rel=\"noopener\" target=\"_blank\"\u003e\u003cstrong\u003eJean Luc Herbulot\u003c/strong\u003e\u003c/a\u003e, director of the films \u003cem\u003eDealer\u003c/em\u003e, \u003cem\u003eInterstate\u003c/em\u003e, and \u003ca href=\"https://www.firstshowing.net/2022/official-trailer-for-awesome-african-neo-western-horror-saloum/\" title=\"Must Watch Trailer for \u0026#39;Saloum\u0026#39; Awesome African Neo-Western Horror\"\u003e\u003cem\u003eSaloum\u003c/em\u003e\u003c/a\u003e previously, plus many other shorts and the \u0026#34;\u003ca href=\"https://www.firstshowing.net/2024/tamara-lawrance-investigates-kingston-in-get-millie-black-full-trailer/\" title=\"Tamara Lawrance Investigates Kingston in \u0026#39;Get Millie Black\u0026#39; Full Trailer\"\u003eGet Millie Black\u003c/a\u003e\u0026#34; series. The screenplay is written by Hus Miller \u0026amp; Jean Luc Herbulot. It\u0026#39;s produced by Steven Adams, Pamela Diop, Gary Dourdan, Hus Miller. This initially premiered at the 2024 Sitges Film Festival \u0026amp; Beyond Fest last fall. Well Go USA will debut \u003cem\u003eZero\u003c/em\u003e in select US theaters + on VOD starting \u003ca href=\"https://www.firstshowing.net/schedule2025/#apr\"\u003e\u003cstrong\u003eApril 11th, 2025\u003c/strong\u003e\u003c/a\u003e this spring. \u003cem\u003eInterested?\u003c/em\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eFind more posts in:\u003c/strong\u003e \u003ca href=\"https://www.firstshowing.net/category/worthwatching/\" rel=\"category tag\"\u003eTo Watch\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/trailers/\" rel=\"category tag\"\u003eTrailer\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-03-04T16:27:11-05:00",
  "modifiedTime": null
}
