{
  "id": "b53fe8f3-2f69-4f54-93c1-0716f0acd8d7",
  "title": "Two Strangers Trapped in a Home - Trailer for 'Persona' Horror Thriller",
  "link": "https://www.firstshowing.net/2024/two-strangers-trapped-in-a-house-persona-horror-thriller-trailer/",
  "description": "\"Did we do something to deserve it?\" \"No one deserves this...\" Gravitas Ventures has unveiled the official trailer for Persona, an indie horror thriller from director Mike Ho, mostly known for making many music videos over the last decade. Set for a VOD release in December if anyone wants to watch. Not sure why they needed to use the same Persona title as the iconic 1966 Ingmar Bergman film. A woman wakes up locked in a house, injured with no memory. She's terrified yet relieved to find a woman bound in another room. These two strangers must work together to figure out what's really going on before the door is unlocked. Who is coming back for her? Why are they locked up in this house? Starring Shanti Lowry and Sophia Ali, with Andrew Howard and Omar Gooding. This doesn't look so interesting - better to just rewatch Saw again. Here's the official trailer (+ scary poster) for Mike Ho's hororr film Persona, direct from YouTube: Two women wake up injured, with seemingly no memory of how they got there, trapped inside a secluded home. These two strangers must work together to figure out just what’s going on - before the […]",
  "author": "Alex Billington",
  "published": "Wed, 06 Nov 2024 18:18:47 +0000",
  "source": "https://www.firstshowing.net/feed/",
  "categories": [
    "To Watch",
    "Trailer"
  ],
  "byline": "Alex Billington",
  "length": 1816,
  "excerpt": "\"Did we do something to deserve it?\" \"No one deserves this...\" Gravitas Ventures has unveiled the official trailer for Persona, an indie horror thriller from director Mike Ho, mostly known for making many music videos over the last decade. Set for a VOD release in December if anyone wants to watch. Not sure why they",
  "siteName": "FirstShowing.net",
  "favicon": "https://www.firstshowing.net/favicon-32x32.png",
  "text": "TRAILERS by November 6, 2024Source: YouTube \"Did we do something to deserve it?\" \"No one deserves this...\" Gravitas Ventures has unveiled the official trailer for Persona, an indie horror thriller from director Mike Ho, mostly known for making many music videos over the last decade. Set for a VOD release in December if anyone wants to watch. Not sure why they needed to use the same Persona title as the iconic 1966 Ingmar Bergman film. A woman wakes up locked in a house, injured with no memory. She's terrified yet relieved to find a woman bound in another room. These two strangers must work together to figure out what's really going on before the door is unlocked. Who is coming back for her? Why are they locked up in this house? Starring Shanti Lowry and Sophia Ali, with Andrew Howard and Omar Gooding. This doesn't look so interesting - better to just rewatch Saw again. Here's the official trailer (+ scary poster) for Mike Ho's hororr film Persona, direct from YouTube: Two women wake up injured, with seemingly no memory of how they got there, trapped inside a secluded home. These two strangers must work together to figure out just what’s going on - before the doors are unlocked and their captor is revealed. Can she figure out who is coming back for them... before his arrival? Persona is directed by American filmmaker Mike Ho, director of the action thriller film Imani previously, plus tons of other music videos as well. The screenplay is written by Blyth Kemp. Produced by Shanti Lowry. This hasn't premiered at any film festivals or elsewhere, as far we know. Gravitas Ventures debut Mike Ho's Persona horror film direct-to-VOD in the US starting December 3rd, 2024 coming soon. Anyone into it? Find more posts: To Watch, Trailer prev next",
  "image": "https://media2.firstshowing.net/firstshowing/img16/PersonaPostermainimagebigTW1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\t\t\u003ch2 id=\"pagetitle\"\u003e\u003ca href=\"https://www.firstshowing.net/category/trailers/\" title=\"Click for more trailers\"\u003eTRAILERS\u003c/a\u003e\n\t\t\u003c/h2\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\n\t\t\t\u003cp\u003eby \t\t\u003cbr/\u003eNovember 6, 2024\u003cbr/\u003e\u003cem\u003eSource:\u003c/em\u003e \u003ca href=\"https://www.youtube.com/watch?v=Tk-LL6m-_FU\" rel=\"noopener nofollow\" target=\"_blank\"\u003eYouTube\u003c/a\u003e\u003cbr/\u003e\u003c/p\u003e\n\t\t\u003cp\u003e\u003ca href=\"https://www.firstshowing.net/2024/two-strangers-trapped-in-a-house-persona-horror-thriller-trailer/\"\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/PersonaPostermainimagebigTsr1.jpg\" alt=\"Persona Trailer\" width=\"350\" height=\"168\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u0026#34;Did we do something to deserve it?\u0026#34; \u0026#34;No one deserves this...\u0026#34;\u003c/em\u003e Gravitas Ventures has unveiled the official trailer for \u003cstrong\u003e\u003cem\u003ePersona\u003c/em\u003e\u003c/strong\u003e, an indie horror thriller from director Mike Ho, mostly known for making many music videos over the last decade. Set for a VOD release in December if anyone wants to watch. Not sure why they needed to use the same \u003cem\u003ePersona\u003c/em\u003e title as the iconic 1966 Ingmar Bergman \u003ca href=\"https://www.imdb.com/title/tt0060827/\" rel=\"noopener nofollow\" target=\"_blank\"\u003efilm\u003c/a\u003e. A woman wakes up locked in a house, injured with no memory. She\u0026#39;s terrified yet relieved to find a woman bound in another room. These two strangers must work together to figure out what\u0026#39;s really going on before the door is unlocked. Who is coming back for her? Why are they locked up in this house? Starring \u003cstrong\u003eShanti Lowry\u003c/strong\u003e and \u003cstrong\u003eSophia Ali\u003c/strong\u003e, with \u003cstrong\u003eAndrew Howard\u003c/strong\u003e and \u003cstrong\u003eOmar Gooding\u003c/strong\u003e. This doesn\u0026#39;t look so interesting - better to just \u003ca href=\"https://www.firstshowing.net/2024/quick-trailer-for-lionsgates-saw-unrated-20th-re-release/\" title=\"Quick Trailer for Lionsgate\u0026#39;s \u0026#39;Saw\u0026#39; Unrated 20th Anniversary Re-Release\"\u003erewatch \u003cem\u003eSaw\u003c/em\u003e\u003c/a\u003e again.\u003cspan id=\"more-717306\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eHere\u0026#39;s the official trailer (+ scary poster) for Mike Ho\u0026#39;s hororr film \u003cstrong\u003e\u003cem\u003ePersona\u003c/em\u003e\u003c/strong\u003e, direct from \u003ca href=\"https://www.youtube.com/watch?v=Tk-LL6m-_FU\" rel=\"noopener\" target=\"_blank\"\u003eYouTube\u003c/a\u003e:\u003c/p\u003e\n\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/PersonaPostermainimagebig5991.jpg?width=599\" alt=\"Persona Poster\" width=\"599\" height=\"879\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eTwo women wake up injured, with seemingly no memory of how they got there, trapped inside a secluded home. These two strangers must work together to figure out just what’s going on - before the doors are unlocked and their captor is revealed. Can she figure out who is coming back for them... before his arrival?\u003c/em\u003e \u003cem\u003ePersona\u003c/em\u003e is directed by American filmmaker \u003ca href=\"https://www.imdb.com/name/nm5674619/\" rel=\"noopener\" target=\"_blank\"\u003e\u003cstrong\u003eMike Ho\u003c/strong\u003e\u003c/a\u003e, director of the action thriller film \u003cem\u003eImani\u003c/em\u003e previously, plus tons of other music videos as well. The screenplay is written by Blyth Kemp. Produced by Shanti Lowry. This hasn\u0026#39;t premiered at any film festivals or elsewhere, as far we know. Gravitas Ventures debut Mike Ho\u0026#39;s \u003cem\u003ePersona\u003c/em\u003e horror film direct-to-VOD in the US starting \u003ca href=\"https://www.firstshowing.net/schedule2024/#dec\"\u003e\u003cstrong\u003eDecember 3rd, 2024\u003c/strong\u003e\u003c/a\u003e coming soon. \u003cem\u003eAnyone into it?\u003c/em\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eFind more posts:\u003c/strong\u003e \u003ca href=\"https://www.firstshowing.net/category/worthwatching/\" rel=\"category tag\"\u003eTo Watch\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/trailers/\" rel=\"category tag\"\u003eTrailer\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\u003c/div\u003e\n\t\u003cdiv id=\"rightbar\"\u003e\n\t\t\u003cul id=\"slnav\"\u003e\n\t\t\t\u003cli id=\"prev\"\u003e\u003ca href=\"#\"\u003eprev\u003c/a\u003e\u003c/li\u003e\n\t\t    \u003cli id=\"next\"\u003e\u003ca href=\"#\"\u003enext\u003c/a\u003e\u003c/li\u003e\n\t\t\u003c/ul\u003e\n\t\t\u003cul id=\"slides\"\u003e\n\n\t\t\u003c/ul\u003e\n\t\t\u003c/div\u003e      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-06T13:18:47-05:00",
  "modifiedTime": null
}
