{
  "id": "b6bee460-8795-48ea-a9e9-3707502ecf73",
  "title": "Washington Spirit Owner Michele Kang on Momentum in Women’s Sports as Team Preps for NWSL Championship: ‘You Can Feel the Change’",
  "link": "https://variety.com/2024/tv/news/washington-spirit-michele-kang-momentum-womens-sports-1236218636/",
  "description": "Washington Spirt owner Michele Kang won’t be suiting up to play in the National Women’s Soccer League championship game on Saturday, but she has surely helped her team score some goals as the league’s 12th season comes to a close. Kang is the founder and CEO of health care technology firm Cognosante and an active […]",
  "author": "Cynthia Littleton",
  "published": "Sat, 23 Nov 2024 00:57:43 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Michele Kang",
    "NWSL",
    "Washington Spirit"
  ],
  "byline": "Cynthia Littleton",
  "length": 4900,
  "excerpt": "On the eve of the National Women's Soccer League championship game, Washington Spirit owner Michele Kang sees growing momentum for female-led sports.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "Washington Spirt owner Michele Kang won’t be suiting up to play in the National Women’s Soccer League championship game on Saturday, but she has surely helped her team score some goals as the league’s 12th season comes to a close. Kang is the founder and CEO of health care technology firm Cognosante and an active philanthropist. She acquired the Washington Spirit team in 2021, the year the D.C.-based squad won the NWSL championship for the first time. Kang’s timing was good. The Washington Spirit are well-positioned for major growth as the team and the NWSL capitalize on the wave of interest in women’s sports that coalesced last spring around the NCAA women’s basketball tournament. Spirit star Trinity Rodman was a big star for Team USA at the Paris Summer Olympic Games. The WNBA, NWSL and other sports leagues have seen an uptick in ticket sales, sponsorship deals and general media interest, which advocates hope will be the fuel to make women’s leagues more prominent in the general sports landscape. On the eve of Saturday’s championship game between the Orlando Pride and Spirit at Kansas City’s CPKC Stadium, Kang offered her thoughts on what the momentum of 2024 will mean for the long term and what it will take to bring female-led sports into parity with the men’s game. Popular on Variety How has the momentum for women’s sports translated to the business of Washington Spirit? 2024 exceeded even my own expectations. We welcomed a record 150,000 fans to Audi Field with three sell-out crowds. Ten out of 13 regular season games generated the highest attendances in the history of the club. We’re fielding more calls from potential corporate partners than ever before. And most importantly, you can feel the change when you attend a game. There is a growing electricity and aura to this team that is contagious, and businesses are catching on. What are the biggest hurdles to getting women’s soccer closer to parity with the men’s game? Is the heightened focus on women’s sports helping conversations with media partners and sponsors? The biggest challenges to achieving parity between women’s soccer and men’s soccer lie in building strong, sustainable foundations that account for the unique nature of the women’s game. Women’s soccer is different from men’s – it has its own distinct history, development path and future. To elevate the women’s game to stand shoulder-to-shoulder with men’s American football, basketball and hockey, we need targeted long-term investments in foundational areas such as youth development, coaching, and refereeing, as well as innovations like gear designed specifically for female athletes. These investments are essential to fostering talent and strengthening the ecosystem from the ground up. The growing focus on women’s sports has sparked meaningful conversations with media partners and sponsors, but achieving true parity will require a deeper, collective commitment to advancing the women’s game on its own terms. What do you see as opportunities in media outside of games for Washington Spirit stars and coaches? At the Spirit, we are fortunate to have players like Trinity Rodman and a Head Coach in Jona Giraldez who are at the upper echelons of success and name recognition in soccer. Trinity, especially after her amazing performance at the summer Olympics, has begun to transcend the sport and break through into mainstream media. The Spirit, and the NWSL as a whole are part of the cultural zeitgeist in a way that it never has been before. The momentum is exciting and something we must keep building upon by forging deeper relationships across film, television and social media. What has the NWSL done right to capitalize on the post-NCAA March Madness interest in women’s sports? What else needs to be done? The interest in women’s soccer has been building for decades — think back to the 1999 World Cup, when the U.S. Women’s National Team captivated the world. What’s different now is the sustained momentum behind this movement and the growing investment across the ecosystem. The NWSL is the most competitive and dynamic women’s soccer league in the world, home to the best players and unparalleled talent. To build on this momentum, we need to amplify the stories of our incredible athletes, enhance the fan experience both in-stadium and digitally, and continue making the league more competitive and entertaining as a product. Our players have powerful, inspiring stories that deserve a global platform, and we need media partners to invest in sharing these narratives. At the same time, creating unforgettable fan experiences and pushing the boundaries of competition will solidify the NWSL as the premier destination for women’s soccer. The NWSL championship game airs Saturday at 8 p.m. ET/5 p.m. PT on CBS and Paramount+.",
  "image": "https://variety.com/wp-content/uploads/2024/11/GettyImages-2182236752-e1732318321594.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tWashington Spirt owner \u003ca href=\"https://variety.com/t/michele-kang/\" id=\"auto-tag_michele-kang\" data-tag=\"michele-kang\"\u003eMichele Kang\u003c/a\u003e won’t be suiting up to play in the National Women’s Soccer League championship game on Saturday, but she has surely helped her team score some goals as the league’s 12th season comes to a close.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tKang is the founder and CEO of health care technology firm Cognosante and an active philanthropist. She acquired the \u003ca href=\"https://variety.com/t/washington-spirit/\" id=\"auto-tag_washington-spirit\" data-tag=\"washington-spirit\"\u003eWashington Spirit\u003c/a\u003e team in 2021, the year the D.C.-based squad won the \u003ca href=\"https://variety.com/t/nwsl/\" id=\"auto-tag_nwsl\" data-tag=\"nwsl\"\u003eNWSL\u003c/a\u003e championship for the first time. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tKang’s timing was good. The Washington Spirit are well-positioned for major growth as the team and the NWSL capitalize on the wave of interest in women’s sports that coalesced last spring around the NCAA women’s basketball tournament. Spirit star Trinity Rodman was a big star for Team USA at the Paris Summer Olympic Games. The WNBA, NWSL and other sports leagues have seen an uptick in ticket sales, sponsorship deals and general media interest, which advocates hope will be the fuel to make women’s leagues more prominent in the general sports landscape.\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tOn the eve of Saturday’s championship game between the Orlando Pride and Spirit at Kansas City’s CPKC Stadium, Kang offered her thoughts on what the momentum of 2024 will mean for the long term and what it will take to bring female-led sports into parity with the men’s game.\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eHow has the momentum for women’s sports translated to the business of Washington Spirit?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t2024 exceeded even my own expectations. We welcomed a record 150,000 fans to Audi Field with three sell-out crowds. Ten out of 13 regular season games generated the highest attendances in the history of the club. We’re fielding more calls from potential corporate partners than ever before. And most importantly, you can feel the change when you attend a game. There is a growing electricity and aura to this team that is contagious, and businesses are catching on.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eWhat are the biggest hurdles to getting women’s soccer closer to parity with the men’s game? Is the heightened focus on women’s sports helping conversations with media partners and sponsors?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe biggest challenges to achieving parity between women’s soccer and men’s soccer lie in building strong, sustainable foundations that account for the unique nature of the women’s game. Women’s soccer is different from men’s – it has its own distinct history, development path and future. To elevate the women’s game to stand shoulder-to-shoulder with men’s American football, basketball and hockey, we need targeted long-term investments in foundational areas such as youth development, coaching, and refereeing, as well as innovations like gear designed specifically for female athletes. These investments are essential to fostering talent and strengthening the ecosystem from the ground up. The growing focus on women’s sports has sparked meaningful conversations with media partners and sponsors, but achieving true parity will require a deeper, collective commitment to advancing the women’s game on its own terms.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eWhat do you see as opportunities in media outside of games for Washington Spirit stars and coaches?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAt the Spirit, we are fortunate to have players like Trinity Rodman and a Head Coach in Jona Giraldez who are at the upper echelons of success and name recognition in soccer. Trinity, especially after her amazing performance at the summer Olympics, has begun to transcend the sport and break through into mainstream media. The Spirit, and the NWSL as a whole are part of the cultural zeitgeist in a way that it never has been before. The momentum is exciting and something we must keep building upon by forging deeper relationships across film, television and social media.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eWhat has the NWSL done right to capitalize on the post-NCAA March Madness interest in women’s sports? What else needs to be done?\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe interest in women’s soccer has been building for decades — think back to the 1999 World Cup, when the U.S. Women’s National Team captivated the world. What’s different now is the sustained momentum behind this movement and the growing investment across the ecosystem.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe NWSL is the most competitive and dynamic women’s soccer league in the world, home to the best players and unparalleled talent. To build on this momentum, we need to amplify the stories of our incredible athletes, enhance the fan experience both in-stadium and digitally, and continue making the league more competitive and entertaining as a product. Our players have powerful, inspiring stories that deserve a global platform, and we need media partners to invest in sharing these narratives. At the same time, creating unforgettable fan experiences and pushing the boundaries of competition will solidify the NWSL as the premier destination for women’s soccer.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cem\u003eThe NWSL championship game airs Saturday at 8 p.m. ET/5 p.m. PT on CBS and Paramount+.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-11-23T00:57:43Z",
  "modifiedTime": "2024-11-23T01:03:33Z"
}
