{
  "id": "b965e00b-b36c-4891-bc44-7f7877928ede",
  "title": "WWE’s Lyra Valkyria and Dakota Kai Are ‘Ready to Make History’ With First Ever Women’s Intercontinental Championship Match",
  "link": "https://variety.com/2025/tv/news/wwe-raw-netflix-lyra-valkyria-dakota-kai-intercontinental-championship-match-1236271971/",
  "description": "Lyra Valkyria and Dakota Kai are one match away from the biggest moment of their careers. After clawing their way through their respective sides of a qualifying bracket, the two will face off in the tournament finals to crown WWE’s first-ever Women’s Intercontinental Champion. Variety spoke to Valkyria and Kai ahead of their clash on […]",
  "author": "Lauren Coates",
  "published": "Tue, 14 Jan 2025 00:00:00 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "Athletes",
    "News",
    "Monday Night Raw",
    "Netfilx",
    "WWE"
  ],
  "byline": "Lauren Coates",
  "length": 4619,
  "excerpt": "WWE wrestlers Lyra Valkyria and Dakota Kai speak to Variety ahead of their intercontinental championship match on Raw",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "Lyra Valkyria and Dakota Kai are one match away from the biggest moment of their careers. After clawing their way through their respective sides of a qualifying bracket, the two will face off in the tournament finals to crown WWE’s first-ever Women’s Intercontinental Champion. Variety spoke to Valkyria and Kai ahead of their clash on “Monday Night Raw,” which recently made waves with a jump from linear television to Netflix. Raw’s move to Netflix was particularly impactful for Kai, who hails from New Zealand: “My family back home, they always had trouble watching any of my matches, so they would be watching YouTube highlights. The fact that we’re on Netflix now, it’s super easy for them to be able to follow me and watch anything I do on ‘Raw.'” Popular on Variety “Everything has happened so quickly, I have to sometimes not think about it and switch off, just take it day by day as stuff comes, because it’s very easy to get overwhelmed,” said Valkyria, who was called up to WWE‘s main roster in April of 2024. “Since the move to ‘Raw,’ I feel so at home on Monday night, from the locker room to management to the difference in traveling every week. I love the life on the road that ‘Raw’ brings. It’s very fast-paced, very just like thrown in the deep end, and I find that really exciting and fun” But while Valkyria’s ascent in WWE has been (almost dizzyingly) swift, Kai’s tenure has been marked by long-term dedication. “I’ve been with the company now for about seven and a half years, and I’m super grateful for everything I’ve done. I’ll look back and look at the people I’ve been tagging with, being on WrestleMania, having these opportunities to do PLEs overseas.” Kai has held tag team gold twice in WWE, but the Intercontinental Championship would mark her first singles title with the company. “To be able to be the first ever Intercontinental Women’s Champion, I can’t really fathom it. I’ve got to manifest, I’m really bad at that. My self-esteem is not the best. But I wanted these opportunities, so I’m going to leave it all out in the ring and hopefully have my hand raised at the end of the match.” Valkyria similarly admitted to experiencing self-doubt in the past, but approaches the IC title with newfound confidence: “Going up against Becky [Lynch] for the [NXT Women’s Championship], I felt ready, but there was still that voice in my head that wondered if I was out of my depth. Right now, when it comes to this tournament, this title, I don’t have that out-of-my-depth feeling anymore. I really feel like I’m ready to make history and that I’ve earned my place here.”  As for her opponent’s commitment to wrestling even after ACL and meniscus injuries, Valkyria acknowledges Kai’s dedication to their craft: “I actually have a lot of respect for Dakota, because she’s overcome knee injury and surgery and I’ve done the same. I know how strong you have to be to come back from that, and she had a bit more trouble with that than I did. She’s a multi-time tag champion, but she has also never had that singles crowning moment in WWE. I know she really, really wants this, and my strategy is just believing that I want it more.” In terms of strategy, Kai admits to watching tape of Valkyria’s clashes with fellow Damage Ctrl stablemate Iyo Sky: “Even just watching the bouts that Iyo and Lyra had against each other, it’s insane. I consider Iyo the best in the world. She’s amazing. I’ve known her since I was in Japan.” Valkyria holds Sky in similarly high regard: “Those three matches on ‘Raw’ I had against Iyo, I have them up there with my biggest achievements of the year. I’m very proud of having gone toe to toe with her three times because I really think she’s one of the best in the world.” If she takes home the gold, Valkyria listed Sky among her potential dream opponents, alongside Women’s World Women’s Champion Rhea Ripley. “I would absolutely love to go against Rhea, Iyo again, Tiffany [Stratton] or run it back with Roxanne [Perez] from NXT. Bayley would be amazing. There’s so many women that I haven’t worked with yet, I’m still just getting started on the main roster.” Kai similarly named Bayley as a dream opponent for an Intercontinental Title Defense: “Just because she’s done so much for me. She brought me back in terms of forming Damage CTRL, she’s believed in me since my NXT days. I think that would be such a fairytale moment to be able to come full circle with her.” WWE’s “Monday Night Raw” airs live on Netflix every Monday at 5 p.m. PT / 8 p.m. ET.",
  "image": "https://variety.com/wp-content/uploads/2025/01/WWE-Raw-Lyra-Valkyria-and-Dakota-Kai.png?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tLyra Valkyria and Dakota Kai are one match away from the biggest moment of their careers. After clawing their way through their respective sides of a qualifying bracket, the two will face off in the tournament finals to crown \u003ca href=\"https://variety.com/2025/tv/news/wwe-monday-night-raw-netflix-debut-paul-levesque-1236269872/\"\u003eWWE’s\u003c/a\u003e first-ever Women’s Intercontinental Champion.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cem\u003eVariety\u003c/em\u003e spoke to Valkyria and Kai ahead of their clash on “\u003ca href=\"https://variety.com/2025/tv/news/wwe-monday-night-raw-netflix-viewership-4-9-million-views-ratings-1236266931/\"\u003eMonday Night Raw\u003c/a\u003e,” which recently made waves with a jump from linear television to Netflix.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tRaw’s move to Netflix was particularly impactful for Kai, who hails from New Zealand: “My family back home, they always had trouble watching any of my matches, so they would be watching YouTube highlights. The fact that we’re on Netflix now, it’s super easy for them to be able to follow me and watch anything I do on ‘Raw.\u0026#39;”\n\n\t\u003c/p\u003e\n\n\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\t“Everything has happened so quickly, I have to sometimes not think about it and switch off, just take it day by day as stuff comes, because it’s very easy to get overwhelmed,” said Valkyria, who was called up to \u003ca href=\"https://variety.com/t/wwe/\" id=\"auto-tag_wwe\" data-tag=\"wwe\"\u003eWWE\u003c/a\u003e‘s main roster in April of 2024. “Since the move to ‘Raw,’ I feel so at home on Monday night, from the locker room to management to the difference in traveling every week. I love the life on the road that ‘Raw’ brings. It’s very fast-paced, very just like thrown in the deep end, and I find that really exciting and fun”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tBut while Valkyria’s ascent in WWE has been (almost dizzyingly) swift, Kai’s tenure has been marked by long-term dedication. “I’ve been with the company now for about seven and a half years, and I’m super grateful for everything I’ve done. I’ll look back and look at the people I’ve been tagging with, being on WrestleMania, having these opportunities to do PLEs overseas.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tKai has held tag team gold twice in WWE, but the Intercontinental Championship would mark her first singles title with the company. “To be able to be the first ever Intercontinental Women’s Champion, I can’t really fathom it. I’ve got to manifest, I’m really bad at that. My self-esteem is not the best. But I wanted these opportunities, so I’m going to leave it all out in the ring and hopefully have my hand raised at the end of the match.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tValkyria similarly admitted to experiencing self-doubt in the past, but approaches the IC title with newfound confidence:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Going up against Becky [Lynch] for the [NXT Women’s Championship], I felt ready, but there was still that voice in my head that wondered if I was out of my depth. Right now, when it comes to this tournament, this title, I don’t have that out-of-my-depth feeling anymore. I really feel like I’m ready to make history and that I’ve earned my place here.” \n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tAs for her opponent’s commitment to wrestling even after ACL and meniscus injuries, Valkyria acknowledges Kai’s dedication to their craft:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“I actually have a lot of respect for Dakota, because she’s overcome knee injury and surgery and I’ve done the same. I know how strong you have to be to come back from that, and she had a bit more trouble with that than I did. She’s a multi-time tag champion, but she has also never had that singles crowning moment in WWE. I know she really, really wants this, and my strategy is just believing that I want it more.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn terms of strategy, Kai admits to watching tape of Valkyria’s clashes with fellow Damage Ctrl stablemate Iyo Sky: “Even just watching the bouts that Iyo and Lyra had against each other, it’s insane. I consider Iyo the best in the world. She’s amazing. I’ve known her since I was in Japan.” \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tValkyria holds Sky in similarly high regard: “Those three matches on ‘Raw’ I had against Iyo, I have them up there with my biggest achievements of the year. I’m very proud of having gone toe to toe with her three times because I really think she’s one of the best in the world.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIf she takes home the gold, Valkyria listed Sky among her potential dream opponents, alongside Women’s World Women’s Champion Rhea Ripley.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“I would absolutely love to go against Rhea, Iyo again, Tiffany [Stratton] or run it back with Roxanne [Perez] from NXT. Bayley would be amazing. There’s so many women that I haven’t worked with yet, I’m still just getting started on the main roster.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tKai similarly named Bayley as a dream opponent for an Intercontinental Title Defense: “Just because she’s done so much for me. She brought me back in terms of forming Damage CTRL, she’s believed in me since my NXT days. I think that would be such a fairytale moment to be able to come full circle with her.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cem\u003eWWE’s “\u003ca href=\"https://variety.com/t/monday-night-raw/\" id=\"auto-tag_monday-night-raw\" data-tag=\"monday-night-raw\"\u003eMonday Night Raw\u003c/a\u003e” airs live on Netflix every Monday at 5 p.m. PT / 8 p.m. ET.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-01-14T00:00:00Z",
  "modifiedTime": "2025-01-14T00:08:53Z"
}
