{
  "id": "bb6573c7-076f-4884-80ce-0bb184638ea3",
  "title": "Netflix’s Narnia Movie Angers Theaters, IMAX Has ‘Nuclear Option’",
  "link": "https://www.comingsoon.net/movies/news/1928195-netflix-narnia-movie-has-nuclear-option-for-theater-chains",
  "description": "Netflix‘s upcoming The Chronicles of Narnia films have reportedly left theater chains and studios angry after reaching an exclusive deal with IMAX, with the film company readying a “nuclear option” if chains decide not to show the movie. What is the issue between theater chains and Netflix’s Narnia movie? In a recent report from Puck, […] The post Netflix’s Narnia Movie Angers Theaters, IMAX Has ‘Nuclear Option’ appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
  "author": "Anthony Nash",
  "published": "Tue, 25 Feb 2025 23:02:00 +0000",
  "source": "https://www.comingsoon.net/feed",
  "categories": [
    "Movies",
    "Greta Gerwig",
    "IMAX",
    "Movie News",
    "Netflix",
    "Rich Gelfond",
    "Streaming",
    "The Chronicles of Narnia"
  ],
  "byline": "Anthony Nash",
  "length": 2065,
  "excerpt": "Netflix's upcoming The Chronicles of Narnia films have reportedly left theater chains and studios angry after reaching a deal with IMAX.",
  "siteName": "ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More",
  "favicon": "https://www.comingsoon.net/wp-content/uploads/sites/3/2022/12/cs_ico_144x144.png?w=144",
  "text": "Netflix‘s upcoming The Chronicles of Narnia films have reportedly left theater chains and studios angry after reaching an exclusive deal with IMAX, with the film company readying a “nuclear option” if chains decide not to show the movie. What is the issue between theater chains and Netflix’s Narnia movie? In a recent report from Puck, U.S. theater chains and film studios were left angry after IMAX and Netflix came to a deal that saw The Chronicles of Narnia getting a two-week exclusivity deal on IMAX screens when it premieres on Thanksgiving 2026. The reason, according to Puck, is due to how various studios and chains had no idea the deal was happening, and now fear that other movies slated for the holiday 2026 calendar could be in danger of losing out on releases. Puck reports that legacy studios and theater chains view Netflix as a “common enemy,” according to one studio source. Specifically, Disney was said to be “especially furious” about the IMAX deal, with an insider noting that IMAX CEO Rich Gelfond “did this on his own without consulting any of his [studio] partners,” an insider said. “They gave Netflix a two-week exclusive even though the other studios provide movies to them 52 weeks a year.” Puck’s report mentions that, theoretically, theater chains could decide to refuse to play Greta Gerwig’s Narnia movie on their IMAX screens when the time comes, and simply show other movies. However, the report mentions that IMAX has already considered this, and that Gelfond has assured both Gerwig and those at Netflix that the company has a “nuclear option” that will ensure that theaters cooperate and book the film. Just what that nuclear option is is unknown, as of now, although IMAX did say in a statement to Puck that, under its agreements with theaters, the company “requires exhibitors to play the films we format and program. Our ability to curate our programming is what makes us valuable to exhibitors, filmmakers, and studios, and delivers a return on investment with our theaters worldwide.” (Source: Puck)",
  "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/01/Narnia-release-date-Greta-Gerwig-Netflix-IMAX.jpg?resize=1200,630",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003e\u003ca href=\"http://comingsoon.net/tag/netflix\"\u003eNetflix\u003c/a\u003e‘s upcoming \u003ca href=\"https://www.comingsoon.net/tag/the-chronicles-of-narnia\"\u003e\u003cstrong\u003eThe Chronicles of Narnia\u003c/strong\u003e\u003c/a\u003e films have reportedly left theater chains and studios angry after reaching an exclusive deal with IMAX, with the film company readying a “nuclear option” if chains decide not to show the movie.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-what-is-the-issue-between-theater-chains-and-netflix-s-narnia-movie\"\u003eWhat is the issue between theater chains and Netflix’s Narnia movie?\u003c/h2\u003e\n\n\n\n\u003cp\u003eIn a recent report from Puck, U.S. theater chains and film studios were left angry after IMAX and Netflix came to a deal that saw The Chronicles of Narnia getting a two-week exclusivity deal on IMAX screens when it premieres on Thanksgiving 2026. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe reason, according to Puck, is due to how various studios and chains had no idea the deal was happening, and now fear that other movies slated for the holiday 2026 calendar could be in danger of losing out on releases.\u003c/p\u003e\n\n\n\n\u003cp\u003ePuck reports that legacy studios and theater chains view Netflix as a “common enemy,” according to one studio source. Specifically, Disney was said to be “especially furious” about the IMAX deal, with an insider noting that IMAX CEO Rich Gelfond “did this on his own without consulting any of his [studio] partners,” an insider said. “They gave Netflix a two-week exclusive even though the other studios provide movies to them 52 weeks a year.”\u003c/p\u003e\n\n\n\n\u003cp\u003ePuck’s report mentions that, theoretically, theater chains could decide to refuse to play Greta Gerwig’s Narnia movie on their IMAX screens when the time comes, and simply show other movies. However, the report mentions that IMAX has already considered this, and that Gelfond has assured both Gerwig and those at Netflix that the company has a “nuclear option” that will ensure that theaters cooperate and book the film.\u003c/p\u003e\n\n\n\n\u003cp\u003eJust what that nuclear option is is unknown, as of now, although IMAX did say in a statement to Puck that, under its agreements with theaters, the company “requires exhibitors to play the films we format and program. Our ability to curate our programming is what makes us valuable to exhibitors, filmmakers, and studios, and delivers a return on investment with our theaters worldwide.”\u003c/p\u003e\n\n\n\n\u003cp\u003e(Source: \u003ca href=\"https://puck.news/why-everyone-is-mad-about-netflixs-narnia-deal/\"\u003ePuck\u003c/a\u003e) \u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-25T23:02:00Z",
  "modifiedTime": "2025-02-25T23:02:22Z"
}
