{
  "id": "bfa94143-5356-4af4-a979-0a2a7e253491",
  "title": "A Gilligan's Island Prop Sparked Unexpected Real-Life Complications",
  "link": "https://www.slashfilm.com/1802591/gilligans-island-prop-plane-real-life-complications/",
  "description": "A comically unusual prop used on the TV movie The Castaways on Gilligan's Island accidentally caused some real-world problems during filming.",
  "author": "Witney Seibold",
  "published": "Sat, 08 Mar 2025 23:45:00 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Comedy Shows"
  ],
  "byline": "Witney Seibold",
  "length": 4323,
  "excerpt": "A comically unusual prop used on the TV movie The Castaways on Gilligan’s Island accidentally caused some real-world problems during filming.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slash-film-favicon-448x448.png",
  "text": "CBS Television Distribution The second of the three \"Gilligan's Island\" spinoff TV movies was called \"The Castaways on Gilligan's Island,\" and it aired on NBC on May 3, 1979. It arrived one year after the first movie, \"Rescue from Gilligan's Island,\" and 12 years after the final episode of the original \"Gilligan's Island\" TV series. The \"Gilligan's Island\" TV movies were considered dubiously canonical by the show's fans. Tina Louise didn't reprise her role as Ginger from the \"Gilligan's Island\" TV show for any of them (with Judith Baldwin serving as her replacement), while, generally speaking, they aren't nearly as well-remembered or beloved as Sherwood Schwartz's original creation. The animated \"Gilligan's Island\" spinoff shows also contradicted what happened in the TV movies, leaving fans to debate which of the \"Gilligan's Island\" timelines counts as the \"real one.\" Personally, I like to think \"Gilligan's Planet\" is the canonical path. In \"The Castaways on Gilligan's Island,\" life is looking grim for Gilligan and co. It seems that a recent tsunami ruined the island's underground fresh water supply, which means the castaways are in danger of dying of thirst. By wild coincidence, Gilligan (Bob Denver) then uncovers a heretofore undiscovered WWII airplane hangar that contains a pair of old 1940s-era planes. The Professor (Russell Johnson) manages to construct a single working plane out of them — the Minnow III — and the seven castaways eagerly board, finally happy to be free of their island prison. Naturally, though, the plane is forced to make an emergency landing after Gilligan accidentally falls out. To shoot the plane scenes, the movie's creatives acquired a flight-worthy craft and pasted bamboo on its sides. They then had to actually fly it over the Pacific, just off the coast of Los Angeles. It seems, however, that the sight of a bamboo encrusted plane distracted the other aircrafts in the area, choking up L.A.'s air traffic. In an interview available on the MeTV website, Alan Hale (The Skipper) once recalled, with clarity, the real-world disruptions caused by the Minnow III. The Minnow III looked so weird that it clogged up Los Angeles air traffic NBC Hale remembered the trouble that the \"Castaways on Gilligan's Island\" plane made, at least by hearsay. According to the actor, the prop plane had to dump actual detritus out of its hold, causing further distress. To quote him directly: \"The plane that 'rescued' us was actually built and flown over the Pacific Ocean. From what I heard, we almost disrupted air traffic because they sighted this strange plane made of bamboo. Then, in the script, we had to jettison all the excess luggage, even my teddy bear. [...] Somebody might have thought a boat had actually sunk there. [...] Suppose you were out in a boat and suddenly saw all this luggage floating.\" Hale added that the floating suitcases had to be clearly marked as props, just in case the Coast Guard found them and assumed that a real boat had sunk somewhere nearby. Hale served in the Coast Guard prior to his prolific acting career, so he knew what its officers might have been looking for. Of course, the plane is a mere plot point in \"The Castaways on Gilligan's Island.\" After the military spots the Minnow III, its officers locate Gilligan's Island and offer to rescue the castaways once and for all. Naturally, upon leaving the island, the castaways begin to feel homesick, so Mr. Howell (Jim Backus) decides to deliberately return and open a beach resort there. He and his island friends also agree to run the resort, providing love and relationship advice for anyone who comes to stay there. \"The Castaways on Gilligan's Island\" was essentially a backdoor pilot for a \"Gilligan's Island\"-themed knockoff of \"The Love Boat.\" That series, however, never came to be. Whether or not that's a good thing, I leave to you to decide.",
  "image": "https://www.slashfilm.com/img/gallery/a-gilligans-island-prop-sparked-unexpected-real-life-complications/l-intro-1741017519.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n    \n                \u003cdiv\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1802591/gilligans-island-prop-plane-real-life-complications/\" data-post-title=\"A Gilligan\u0026#39;s Island Prop Sparked Unexpected Real-Life Complications\" data-slide-num=\"0\" data-post-id=\"1802591\"\u003e\n                                             \u003cpicture id=\"pfddb66b27451030155189ae872111085\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/a-gilligans-island-prop-sparked-unexpected-real-life-complications/intro-1741017519.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/a-gilligans-island-prop-sparked-unexpected-real-life-complications/intro-1741017519.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/a-gilligans-island-prop-sparked-unexpected-real-life-complications/intro-1741017519.jpg\" data-slide-url=\"https://www.slashfilm.com/1802591/gilligans-island-prop-plane-real-life-complications/\" data-post-id=\"1802591\" data-slide-num=\"0\" data-slide-title=\"A Gilligan\u0026#39;s Island Prop Sparked Unexpected Real-Life Complications: \" width=\"780\" height=\"438\" alt=\"Gilligan holding a spoon up to his face on Gilligan\u0026#39;s Island\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eCBS Television Distribution\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eThe second of the three \u0026#34;Gilligan\u0026#39;s Island\u0026#34; spinoff TV movies was called \u0026#34;The Castaways on Gilligan\u0026#39;s Island,\u0026#34; and it aired on NBC on May 3, 1979. It arrived one year after the first movie, \u0026#34;Rescue from Gilligan\u0026#39;s Island,\u0026#34; and 12 years after \u003ca href=\"https://www.slashfilm.com/1740750/gilligans-island-ending-explained/\" target=\"_blank\"\u003ethe final episode of the original \u0026#34;Gilligan\u0026#39;s Island\u0026#34; TV series\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eThe \u0026#34;Gilligan\u0026#39;s Island\u0026#34; TV movies were considered dubiously canonical by the show\u0026#39;s fans. Tina Louise didn\u0026#39;t reprise her role as Ginger from the \u0026#34;Gilligan\u0026#39;s Island\u0026#34; TV show for any of them (with Judith Baldwin serving as her replacement), while, generally speaking, they aren\u0026#39;t nearly as well-remembered or beloved as Sherwood Schwartz\u0026#39;s original creation. \u003ca href=\"https://www.slashfilm.com/1633112/gilligans-island-animated-spin-offs/\" target=\"_blank\"\u003eThe animated \u0026#34;Gilligan\u0026#39;s Island\u0026#34; spinoff shows\u003c/a\u003e also contradicted what happened in the TV movies, leaving fans to debate which of the \u0026#34;Gilligan\u0026#39;s Island\u0026#34; timelines counts as the \u0026#34;real one.\u0026#34; Personally, I like to think \u0026#34;Gilligan\u0026#39;s Planet\u0026#34; is the canonical path.\u003c/p\u003e\n\u003cp\u003eIn \u0026#34;The Castaways on Gilligan\u0026#39;s Island,\u0026#34; life is looking grim for Gilligan and co. It seems that a recent tsunami ruined the island\u0026#39;s underground fresh water supply, which means the castaways are in danger of dying of thirst. By wild coincidence, Gilligan (Bob Denver) then uncovers a heretofore undiscovered WWII airplane hangar that contains a pair of old 1940s-era planes. The Professor (Russell Johnson) manages to construct a single working plane out of them — the Minnow III — and the seven castaways eagerly board, finally happy to be free of their island prison. Naturally, though, the plane is forced to make an emergency landing after Gilligan accidentally falls out.\u003c/p\u003e\n\n\u003cp\u003eTo shoot the plane scenes, the movie\u0026#39;s creatives acquired a flight-worthy craft and pasted bamboo on its sides. They then had to actually fly it over the Pacific, just off the coast of Los Angeles. It seems, however, that the sight of a bamboo encrusted plane distracted the other aircrafts in the area, choking up L.A.\u0026#39;s air traffic. In an interview available on the \u003ca href=\"https://www.metv.com/stories/a-fake-plane-made-for-a-gilligans-island-special-caused-some-real-air-traffic-disruption\" target=\"_blank\"\u003eMeTV website\u003c/a\u003e, Alan Hale (The Skipper) once recalled, with clarity, the real-world disruptions caused by the Minnow III.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eThe Minnow III looked so weird that it clogged up Los Angeles air traffic\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1802591/gilligans-island-prop-plane-real-life-complications/\" data-post-title=\"A Gilligan\u0026#39;s Island Prop Sparked Unexpected Real-Life Complications\" data-slide-num=\"1\" data-post-id=\"1802591\"\u003e\n                                             \u003cpicture id=\"p43ec14bde59cdd32c1bf937064be47df\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/a-gilligans-island-prop-sparked-unexpected-real-life-complications/the-minnow-iii-looked-so-weird-that-it-clogged-up-los-angeles-air-traffic-1741017520.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/a-gilligans-island-prop-sparked-unexpected-real-life-complications/the-minnow-iii-looked-so-weird-that-it-clogged-up-los-angeles-air-traffic-1741017520.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/a-gilligans-island-prop-sparked-unexpected-real-life-complications/the-minnow-iii-looked-so-weird-that-it-clogged-up-los-angeles-air-traffic-1741017520.jpg\" data-slide-url=\"https://www.slashfilm.com/1802591/gilligans-island-prop-plane-real-life-complications/\" data-post-id=\"1802591\" data-slide-num=\"1\" data-slide-title=\"A Gilligan\u0026#39;s Island Prop Sparked Unexpected Real-Life Complications: The Minnow III looked so weird that it clogged up Los Angeles air traffic\" width=\"780\" height=\"438\" alt=\"The Minnow III from The Castaways of Gilligan\u0026#39;s Island.\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eNBC\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eHale remembered the trouble that the \u0026#34;Castaways on Gilligan\u0026#39;s Island\u0026#34; plane made, at least by hearsay. According to the actor, the prop plane had to dump actual detritus out of its hold, causing further distress. To quote him directly:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003e\u0026#34;The plane that \u0026#39;rescued\u0026#39; us was actually built and flown over the Pacific Ocean. From what I heard, we almost disrupted air traffic because they sighted this strange plane made of bamboo. Then, in the script, we had to jettison all the excess luggage, even my teddy bear. [...] Somebody might have thought a boat had actually sunk there. [...] Suppose you were out in a boat and suddenly saw all this luggage floating.\u0026#34;\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eHale added that the floating suitcases had to be clearly marked as props, just in case the Coast Guard found them and assumed that a real boat had sunk somewhere nearby. \u003ca href=\"https://www.slashfilm.com/1659329/alan-hale-jr-gilligans-island-star-death-coast-guard-tribute/\" target=\"_blank\"\u003eHale served in the Coast Guard prior to his prolific acting career\u003c/a\u003e, so he knew what its officers might have been looking for.\u003c/p\u003e\n\n\u003cp\u003eOf course, the plane is a mere plot point in \u0026#34;The Castaways on Gilligan\u0026#39;s Island.\u0026#34; After the military spots the Minnow III, its officers locate Gilligan\u0026#39;s Island and offer to rescue the castaways once and for all. Naturally, upon leaving the island, the castaways begin to feel homesick, so Mr. Howell (Jim Backus) decides to deliberately return and open a beach resort there. He and his island friends also agree to run the resort, providing love and relationship advice for anyone who comes to stay there.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The Castaways on Gilligan\u0026#39;s Island\u0026#34; was essentially a backdoor pilot for a \u0026#34;Gilligan\u0026#39;s Island\u0026#34;-themed knockoff of \u0026#34;The Love Boat.\u0026#34; That series, however, never came to be. Whether or not that\u0026#39;s a good thing, I leave to you to decide.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-03-08T23:45:00Z",
  "modifiedTime": "2025-03-08T23:45:00Z"
}
