{
  "id": "c47400f2-3b91-46f6-a2d4-17a5e984005a",
  "title": "A One-Off Futurama Robot Was Originally Pitched As A Main Character",
  "link": "https://www.slashfilm.com/1710257/futurama-robot-main-character-pitch-rocket-pal/",
  "description": "Futurama originally had another robot as a main character in addition to Bender, but he only became a minor robot with a couple appearances on the show.",
  "author": "Devin Meenan",
  "published": "Thu, 14 Nov 2024 23:00:00 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Cartoon Shows",
    "Comedy Shows"
  ],
  "byline": "Devin Meenan",
  "length": 4676,
  "excerpt": "Futurama originally had another robot as a main character in addition to Bender, but he only became a minor robot with a couple appearances on the show.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slash-film-favicon-448x448.png",
  "text": "We may receive a commission on purchases made from links. Comedy Central Philip J. Fry (Billy West) is the hero of \"Futurama,\" but his robot buddy Bender (John DiMaggio) is the show's star. A crass alcoholic \"lovable scamp\" (read: sociopath), Bender is to \"Futurama\" what Homer is on \"The Simpsons.\" \"Futurama\" takes place in the 31st century, and this future is filled with plenty more charming robots than only Bender. From acting unit Calculon (Maurice LaMarche) to the Robot Devil (voiced by Homer Simpson himself, Dan Castellaneta), some of the funniest characters in \"Futurama\" have silicon souls.  No one can accuse \"Futurama\" of being written by Isaac Asimov, but many episodes of the show explore Bender's existence as a robot too. In \"Fear Of A Bot Planet,\" the characters visit a planet that is Bender's paradise (a planet of robots who want to kill all humans). \"Obsoluely Fabulous\" sees Bender befriend several outmoded robots while he himself deals with fears of obsolescence. \"Free Will Hunting\" forces Bender to reckon with how, as a robot, he has no true free will.  Bender is also never one to share the spotlight. According to the recent book \"The Art of Futurama,\" though, the creators of \"Futurama\" originally conceived there would be another robot in the main cast: the Pocket Pal. A small robot, the Pocket Pal has a battery torso, pipe-cleaner limbs, Mickey Mouse glove hands, and a TV-shaped head (antennae and all). See \"Futurama\" creator Matt Groening's sketch of the Pal below: Matt Groening The Pocket Pal (who has only had two small cameos) was meant to serve a vital function in \"Futurama\" — exposition. The Pocket Pal was supposed to teach Fry about the future of Futurama Comedy Central Fry is the audience surrogate of \"Futurama.\" As a man from 1999, he's the one who is also confused about the weird parts of the future. Even in later seasons, when he's been living in the 31st century for decades, the other characters will still sometimes have to explain new customs and technology to him. According to DVD commentary for the \"Futurama\" episode \"Less Than Hero,\" the Pocket Pal was going to be the one who answered Fry's questions. Fry would carry the Pal around in his pocket, then pull it out whenever something was confused. Bender would be annoyed by the Pocket Pal's cutesy appearance. Groening explained in \"The Art of Futurama\" that the Pocket Pal is based on a character from the \"Uncle Scrooge\" comics: Little Helper, mini-robot assistant to chicken inventor Gyro Gearloose. \"Futurama\" director Bill Morrison said that the Pocket Pal was originally going to have a lightbulb head, just like the Little Helper does. (See below.) Indeed, even the Pocket Pal's final design has Disney design flourishes. Disney The Pocket Pal was dropped even before \"Futurama\" debut episode \"Space Pilot 3000\" was completed, and the mini robot has only shown up two times. In \"Less Than Hero,\" a mugger attacks Fry and Leela. He's holding a small robot which is holding a tiny gun in his own hand; the robot looks like a mean, green Pocket Pal. The Pocket Pal itself (implied to be a mass-produced model) appears in \"Futurama\" movie \"The Beast With A Billion Backs.\" The crux of the movie is that there's a crack in the universe, an \"Anomaly.\" Professor Farnsworth, plus his rival Wernstrom, team up and discover that electrically-powered devices cannot pass through the anomaly. To demonstrate the effect, Wernstrom uses a projector that mimics the Anomaly, and a yellow Pocket Pal. Once it shouts \"Playtime is funtime\" (voiced by Tress MacNeille), Wernstrom throws it towards the projector where it explodes. Before the two Professors mount an expedition to the Anomaly, they decide to blow off steam by blowing up more of the Pocket Pals — \"Playtime is funtime,\" Farnsworth observes. The Pocket Pal's gruesome fate reflects how the very idea of it was thrown out from the show. \"The Art of Futurama\" is available in print and from digital retailers.",
  "image": "https://www.slashfilm.com/img/gallery/a-one-off-futurama-robot-was-originally-pitched-as-a-main-character/l-intro-1731347686.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n                        \n            \n\n            \u003cp\u003e\u003cem\u003e\u003csmall\u003eWe may receive a commission on purchases made from links.\u003c/small\u003e\u003c/em\u003e\u003c/p\u003e\u003carticle\u003e\n    \n    \n    \n                \n    \n                \u003cdiv\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1710257/futurama-robot-main-character-pitch-rocket-pal/\" data-post-title=\"A One-Off Futurama Robot Was Originally Pitched As A Main Character\" data-slide-num=\"0\" data-post-id=\"1710257\"\u003e\n                                             \u003cpicture id=\"p303757b9d1d77264d8167ca7bf82b555\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/a-one-off-futurama-robot-was-originally-pitched-as-a-main-character/intro-1731347686.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/a-one-off-futurama-robot-was-originally-pitched-as-a-main-character/intro-1731347686.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/a-one-off-futurama-robot-was-originally-pitched-as-a-main-character/intro-1731347686.jpg\" data-slide-url=\"https://www.slashfilm.com/1710257/futurama-robot-main-character-pitch-rocket-pal/\" data-post-id=\"1710257\" data-slide-num=\"0\" data-slide-title=\"A One-Off Futurama Robot Was Originally Pitched As A Main Character: \" width=\"780\" height=\"438\" alt=\"Futurama: The Beast With A Billion Backs the League of Robots\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eComedy Central\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003ePhilip J. Fry (Billy West) is the hero of \u0026#34;Futurama,\u0026#34; but his robot buddy Bender (John DiMaggio) is the show\u0026#39;s star. A crass alcoholic \u0026#34;lovable scamp\u0026#34; (read: sociopath), \u003ca href=\"https://www.slashfilm.com/1608031/futurama-bender-homer-simpson/\" target=\"_blank\"\u003eBender is to \u0026#34;Futurama\u0026#34; what Homer is on \u0026#34;The Simpsons.\u0026#34;\u003c/a\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u0026#34;Futurama\u0026#34; takes place in the 31st century, and this future is filled with plenty more charming robots than only Bender. From acting unit Calculon (Maurice LaMarche) to the Robot Devil (voiced by Homer Simpson himself, Dan Castellaneta), some of the funniest characters in \u0026#34;Futurama\u0026#34; have silicon souls. \u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eNo one can accuse \u0026#34;Futurama\u0026#34; of being written by Isaac Asimov, but many episodes of the show explore Bender\u0026#39;s existence as a robot too. In \u0026#34;Fear Of A Bot Planet,\u0026#34; the characters visit a planet that is Bender\u0026#39;s paradise (a planet of robots who want to kill all humans). \u0026#34;Obsoluely Fabulous\u0026#34; sees Bender befriend several outmoded robots while he himself deals with fears of obsolescence. \u0026#34;Free Will Hunting\u0026#34; forces Bender to reckon with how, as a robot, he has no true free will. \u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eBender is also never one to share the spotlight. According to the recent book \u003ca href=\"https://www.amazon.com/Art-Futurama-Matt-Groening/dp/141977350X?tag=staticmedia-slashfilm-20\" rel=\"sponsored\" target=\"_blank\"\u003e\u0026#34;The Art of Futurama,\u0026#34;\u003c/a\u003e though, the creators of \u0026#34;Futurama\u0026#34; originally conceived there would be another robot in the main cast: the Pocket Pal. A small robot, the Pocket Pal has a battery torso, pipe-cleaner limbs, Mickey Mouse glove hands, and a TV-shaped head (antennae and all). See \u0026#34;Futurama\u0026#34; creator Matt Groening\u0026#39;s sketch of the Pal below:\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"Futurama pocket pal concept art\" data-lazy-src=\"https://www.slashfilm.com/img/uploads/embed/it-BkndAQ-1731183454.jpg\" src=\"https://www.slashfilm.com/img/uploads/embed/it-BkndAQ-1731183454.jpg\"/\u003e\u003cspan\u003eMatt Groening\u003c/span\u003e\n\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eThe Pocket Pal (who has only had two small cameos) was meant to serve a vital function in \u0026#34;Futurama\u0026#34; — exposition.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \u003ch2\u003eThe Pocket Pal was supposed to teach Fry about the future of Futurama\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1710257/futurama-robot-main-character-pitch-rocket-pal/\" data-post-title=\"A One-Off Futurama Robot Was Originally Pitched As A Main Character\" data-slide-num=\"1\" data-post-id=\"1710257\"\u003e\n                                             \u003cpicture id=\"pbe857a8d84359c5b26a993ec316168bf\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/a-one-off-futurama-robot-was-originally-pitched-as-a-main-character/the-pocket-pal-was-supposed-to-teach-fry-about-the-future-of-futurama-1731347686.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/a-one-off-futurama-robot-was-originally-pitched-as-a-main-character/the-pocket-pal-was-supposed-to-teach-fry-about-the-future-of-futurama-1731347686.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/a-one-off-futurama-robot-was-originally-pitched-as-a-main-character/the-pocket-pal-was-supposed-to-teach-fry-about-the-future-of-futurama-1731347686.jpg\" data-slide-url=\"https://www.slashfilm.com/1710257/futurama-robot-main-character-pitch-rocket-pal/\" data-post-id=\"1710257\" data-slide-num=\"1\" data-slide-title=\"A One-Off Futurama Robot Was Originally Pitched As A Main Character: The Pocket Pal was supposed to teach Fry about the future of Futurama\" width=\"780\" height=\"438\" alt=\"Futurama: The Beast With A Billion Backs Pocket Pal\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eComedy Central\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eFry is the audience surrogate of \u0026#34;Futurama.\u0026#34; As a man from 1999, he\u0026#39;s the one who is also confused about the weird parts of the future. Even in later seasons, when he\u0026#39;s been living in the 31st century for decades, the other characters will still sometimes have to explain new customs and technology to him.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eAccording to DVD commentary for the \u0026#34;Futurama\u0026#34; episode \u0026#34;Less Than Hero,\u0026#34; the Pocket Pal was going to be the one who answered Fry\u0026#39;s questions. Fry would carry the Pal around in his pocket, then pull it out whenever something was confused. Bender would be annoyed by the Pocket Pal\u0026#39;s cutesy appearance.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eGroening explained in \u0026#34;The Art of Futurama\u0026#34; that the Pocket Pal is based on a character from \u003ca href=\"https://www.slashfilm.com/1178525/how-donald-duck-once-sparked-a-logistical-argument-with-disney-about-life-preservers/\" target=\"_blank\"\u003ethe \u0026#34;Uncle Scrooge\u0026#34; comics\u003c/a\u003e: Little Helper, mini-robot assistant to chicken inventor Gyro Gearloose. \u0026#34;Futurama\u0026#34; director Bill Morrison said that the Pocket Pal was originally going to have a lightbulb head, just like the Little Helper does. (See below.) Indeed, even the Pocket Pal\u0026#39;s final design has Disney design flourishes.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg alt=\"Little Helper and Gyro Gearloose comic panels\" data-lazy-src=\"https://www.slashfilm.com/img/uploads/embed/it-9ZnICH-1731347652.jpg\" src=\"https://www.slashfilm.com/img/uploads/embed/it-9ZnICH-1731347652.jpg\"/\u003e\u003cspan\u003eDisney\u003c/span\u003e\n\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003e\u003ca href=\"https://www.slashfilm.com/1536543/futurama-pilot-draft-fry-organ-auction/\" target=\"_blank\"\u003eThe Pocket Pal was dropped even before \u0026#34;Futurama\u0026#34; debut episode \u0026#34;Space Pilot 3000\u0026#34;\u003c/a\u003e was completed, and the mini robot has only shown up two times. In \u0026#34;Less Than Hero,\u0026#34; a mugger attacks Fry and Leela. He\u0026#39;s holding a small robot which is holding a tiny gun in his own hand; the robot looks like a mean, green Pocket Pal.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eThe Pocket Pal itself (implied to be a mass-produced model) appears in \u0026#34;Futurama\u0026#34; movie \u0026#34;The Beast With A Billion Backs.\u0026#34; The crux of the movie is that there\u0026#39;s a crack in the universe, an \u0026#34;Anomaly.\u0026#34; Professor Farnsworth, plus his rival Wernstrom, team up and discover that electrically-powered devices cannot pass through the anomaly. To demonstrate the effect, Wernstrom uses a projector that mimics the Anomaly, and a yellow Pocket Pal. Once it shouts \u0026#34;Playtime is funtime\u0026#34; (voiced by Tress MacNeille), Wernstrom throws it towards the projector where it explodes.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eBefore the two Professors mount an expedition to the Anomaly, they decide to blow off steam by blowing \u003cem\u003eup\u003c/em\u003e more of the Pocket Pals — \u0026#34;Playtime \u003cem\u003eis\u003c/em\u003e funtime,\u0026#34; Farnsworth observes. The Pocket Pal\u0026#39;s gruesome fate reflects how the very idea of it was thrown out from the show.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003e\u0026#34;The Art of Futurama\u0026#34; is available in print and from digital retailers.\u003c/p\u003e\n\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-11-14T23:00:00Z",
  "modifiedTime": "2024-11-14T23:00:00Z"
}
