{
  "id": "cae4d55f-20b7-46d1-80b3-639cc4e3f60a",
  "title": "Ari Aster Talks “Very Frightening” Future Of AI As Some Treat The Tech “As A God”",
  "link": "https://deadline.com/2025/07/ari-aster-very-frightening-future-ai-1236449522/",
  "description": "No stranger to building a bone-chilling horror, Ari Aster is sharing one of his greatest fears for Hollywood. The Eddington writer/director recently admitted he has “a lot of fear” regarding the growing use of AI in the industry and how some treat it “as a god,” knowing “we have no say” in how the technology […]",
  "author": "Glenn Garner",
  "published": "Fri, 04 Jul 2025 01:02:24 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "News",
    "AI",
    "Ari Aster",
    "Tech",
    "technology"
  ],
  "byline": "Glenn Garner",
  "length": 2018,
  "excerpt": "No stranger to building a bone-chilling horror, Ari Aster is sharing one of his greatest fears for Hollywood amid the ongoing rise of AI.",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "No stranger to building a bone-chilling horror, Ari Aster is sharing one of his greatest fears for Hollywood. The Eddington writer/director recently admitted he has “a lot of fear” regarding the growing use of AI in the industry and how some treat it “as a god,” knowing “we have no say” in how the technology is implemented as it continues to evolve. “It’s obviously already too late. We’re in a race now,” he told Letterboxd. “It’s how the history of technological innovation has worked: If we can, we will. I have larger questions, you know? What did Marshall McLuhan say: ‘Man is the sex organ of the machine world,’ right? Is this technology an extension of us, are we extensions of this technology, or are we here to usher it into being? Watch on Deadline Aster added, “If you talk to these engineers and the people ushering this AI in, they don’t talk about AI as this great new medium; they don’t even talk about it as technology. They talk about it as a god. They talk like disciples. They’re very worshipful of this thing. Whatever space there was between our lived reality and this imaginal reality—that’s disappearing, and we’re merging, and that’s very frightening.” With the Senate recently striking a provision in Donald Trump‘s One Big Beautiful Bill, which would have barred states from regulating AI for the next decade, some in Hollywood are embracing the technology and attempting to set a standard of “clean AI” use. Aster explained that “the most uncanny thing” about AI’s capabilities “is that it’s less uncanny than I want it to be.” “I see AI-generated videos, and they look like life; they just look real,” Aster continued. “It goes back to that human capacity for adaptation. The weirder things get, and the longer we live in them, the more normal they become. But something huge is happening right now, and we have no say in it. So, here we go. I can’t believe we’re actually going to live through this and see what happens. Holy cow.”",
  "image": "https://deadline.com/wp-content/uploads/2025/07/P101RDGU-e1751589567624.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tNo stranger to building a bone-chilling horror, \u003ca href=\"https://deadline.com/tag/ari-aster/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eAri Aster\u003c/a\u003e is sharing one of his greatest fears for Hollywood.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe \u003cem\u003e\u003ca rel=\"noreferrer noopener\" target=\"_blank\" href=\"https://deadline.com/tag/eddington/\"\u003eEddington\u003c/a\u003e\u003c/em\u003e writer/director recently admitted he has “a lot of fear” regarding the growing use of \u003ca rel=\"noreferrer noopener\" target=\"_blank\" href=\"https://deadline.com/tag/ai/\"\u003eAI\u003c/a\u003e in the industry and how some treat it “as a god,” knowing “we have no say” in how the \u003ca href=\"https://deadline.com/tag/technology-2/\" id=\"auto-tag_technology-2\" data-tag=\"technology-2\"\u003etechnology\u003c/a\u003e is implemented as it continues to evolve.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“It’s obviously already too late. We’re in a race now,” he told \u003ca rel=\"noreferrer noopener nofollow\" target=\"_blank\" href=\"https://letterboxd.com/journal/eddington-ari-aster-interview/\"\u003eLetterboxd\u003c/a\u003e. “It’s how the history of technological innovation has worked: If we can, we will. I have larger questions, you know? What did Marshall McLuhan say: ‘Man is the sex organ of the machine world,’ right? Is this technology an extension of us, are we extensions of this technology, or are we here to usher it into being?\n\n\t\u003c/p\u003e\n\n\u003cdiv data-pmc-adm-ad-id=\"1234771711\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\n\n\n\u003cp\u003e\n\tAster added, “If you talk to these engineers and the people ushering this AI in, they don’t talk about AI as this great new medium; they don’t even talk about it as technology. They talk about it as a god. They talk like disciples. They’re very worshipful of this thing. Whatever space there was between our lived reality and this imaginal reality—that’s disappearing, and we’re merging, and that’s very frightening.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWith the Senate recently \u003ca rel=\"noreferrer noopener\" target=\"_blank\" href=\"https://deadline.com/2025/07/senate-strikes-ai-moratorium-1236446571/\"\u003estriking a provision\u003c/a\u003e in \u003ca rel=\"noreferrer noopener\" target=\"_blank\" href=\"https://deadline.com/tag/donald-trump/\"\u003eDonald Trump\u003c/a\u003e‘s \u003ca rel=\"noreferrer noopener\" target=\"_blank\" href=\"https://deadline.com/tag/one-big-beautiful-bill/\"\u003eOne Big Beautiful Bill\u003c/a\u003e, which would have \u003ca rel=\"noreferrer noopener\" target=\"_blank\" href=\"https://deadline.com/2025/07/trump-big-beautiful-bill-hollywood-1236449251/\"\u003ebarred states from regulating AI\u003c/a\u003e for the next decade, some in Hollywood are embracing the technology and attempting to set a standard of “\u003ca rel=\"noreferrer noopener\" target=\"_blank\" href=\"https://deadline.com/2025/05/clean-ai-hollywood-transformation-1236395081/\"\u003eclean AI\u003c/a\u003e” use.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAster explained that “the most uncanny thing” about AI’s capabilities “is that it’s less uncanny than I want it to be.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“I see AI-generated videos, and they look like life; they just look real,” Aster continued. “It goes back to that human capacity for adaptation. The weirder things get, and the longer we live in them, the more normal they become. But something huge is happening right now, and we have no say in it. So, here we go. I can’t believe we’re actually going to live through this and see what happens. Holy cow.”\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-07-04T01:02:24Z",
  "modifiedTime": "2025-07-04T01:05:47Z"
}
