{
  "id": "cbbfdba3-7bcb-4bcc-b827-375e83d86211",
  "title": "Dakota Johnson Says ‘Madame Web’ “Wasn’t My Fault” \u0026 Blames Flop On Decisions Made By People “Who Don’t Have A Creative Bone In Their Body”",
  "link": "https://deadline.com/2025/06/dakota-johnson-madame-web-flop-1236425464/",
  "description": "Dakota Johnson starred in Madame Web, which was a box office flop amid the discussion of superhero movie fatigue. In a new interview, the Materialists star says the film’s failure was due to some “people who don’t have a creative bone in their body.” “It wasn’t my fault,” Johnson told The Los Angeles Times. “There’s […]",
  "author": "Armando Tinoco",
  "published": "Fri, 06 Jun 2025 00:20:19 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "News",
    "Dakota Johnson",
    "Madame Web"
  ],
  "byline": "Armando Tinoco",
  "length": 2926,
  "excerpt": "Dakota Johnson says 'Madame Web's failure was due to some \"people who don't have a creative bone in their body.\"",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "Dakota Johnson starred in Madame Web, which was a box office flop amid the discussion of superhero movie fatigue. In a new interview, the Materialists star says the film’s failure was due to some “people who don’t have a creative bone in their body.” “It wasn’t my fault,” Johnson told The Los Angeles Times. “There’s this thing that happens now where a lot of creative decisions are made by committee. Or made by people who don’t have a creative bone in their body. And it’s really hard to make art that way. Or to make something entertaining that way.” She continued, “And I think unfortunately with Madame Web, it started out as something and turned into something else. And I was just sort of along for the ride at that point. But that happens. Bigger-budget movies fail all the time.” Watch on Deadline Johnson noted that she doesn’t “have a Band-Aid over it,” and adds, “There’s no part of me that’s like, ‘Oh, I’ll never do that again’ to anything. I’ve done even tiny movies that didn’t do well. Who cares?” Madame Web stars Dakota Johnson as a paramedic who develops psychic abilities following an accident, making her see future events in the “Spider-Man world.” The film opened to $51.5M worldwide, way below the reported $80M budget, and also starred Sydney Sweeney, Isabela Merced, Celeste O’Connor, Tahar Rahim, Mike Epps, Emma Roberts, and Adam Scott. Following the results of Madame Web, Johnson hinted that the experience put her off and she didn’t have the desire to star in another superhero movie. “I had never done anything like it before. I probably will never do anything like it again because I don’t make sense in that world. And I know that now,” Johnson said in an interview with Bustle. She continued, “Sometimes in this industry, you sign on to something, and it’s one thing and then as you’re making it, it becomes a completely different thing, and you’re like, ‘Wait, what?’ But it was a real learning experience, and of course it’s not nice to be a part of something that’s ripped to shreds, but I can’t say that I don’t understand.” In an interview at the end of 2024, Sony Pictures CEO Tony Vinciquerra acknowledged the film’s underperformance at the box office and explained why he thinks it didn’t do well. “Madame Web underperformed in the theaters because the press just crucified it. It was not a bad film, and it did great on Netflix,” Vinciquerra told the Los Angeles Times. Vinciquerra acknowledged that Kraven the Hunter underperformed like Madame Web and suggested, “for some reason, the press decided that they didn’t want us making these films … and the critics just destroyed them.” “They also did it with Venom, but the audience loved Venom and made Venom a massive hit,” he added. “These are not terrible films. They were just destroyed by the critics in the press, for some reason.”",
  "image": "https://deadline.com/wp-content/uploads/2025/06/dakota-johnson-madame-web.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\t\u003ca href=\"https://deadline.com/tag/dakota-johnson/\" id=\"auto-tag_dakota-johnson\" data-tag=\"dakota-johnson\"\u003eDakota Johnson\u003c/a\u003e starred in \u003ca href=\"https://deadline.com/tag/madame-web/\" id=\"auto-tag_madame-web\" data-tag=\"madame-web\"\u003eMadame Web\u003c/a\u003e, which was a box office flop amid the discussion of superhero movie fatigue.\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\n\tIn a new interview, the\u003cem\u003e Materialists\u003c/em\u003e star says the film’s failure was due to some “people who don’t have a creative bone in their body.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“It wasn’t my fault,” Johnson told \u003cem\u003e\u003ca rel=\"noreferrer noopener nofollow\" target=\"_blank\" href=\"https://www.latimes.com/entertainment-arts/movies/story/2025-06-04/dakota-johnson-celine-song-rom-com-materialists\"\u003eThe Los Angeles Times\u003c/a\u003e\u003c/em\u003e. “There’s this thing that happens now where a lot of creative decisions are made by committee. Or made by people who don’t have a creative bone in their body. And it’s really hard to make art that way. Or to make something entertaining that way.” \u003c/p\u003e\n\n\n\n\n\n\n\n\n\u003cp\u003e\n\tShe continued, “And I think unfortunately with \u003cem\u003eMadame Web\u003c/em\u003e, it started out as something and turned into something else. And I was just sort of along for the ride at that point. But that happens. Bigger-budget movies fail all the time.”\n\n\t\u003c/p\u003e\n\n\u003cdiv data-pmc-adm-ad-id=\"1234771711\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tJohnson noted that she doesn’t “have a Band-Aid over it,” and adds, “There’s no part of me that’s like, ‘Oh, I’ll never do that again’ to anything. I’ve done even tiny movies that didn’t do well. Who cares?”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cem\u003eMadame Web\u003c/em\u003e stars Dakota Johnson as a paramedic who develops psychic abilities following an accident, making her see future events in the “Spider-Man world.” The film \u003ca href=\"https://deadline.com/2024/02/bob-marley-one-love-madame-web-opening-weekend-global-international-box-office-1235829751/\"\u003eopened to $51.5M worldwide\u003c/a\u003e, way below the reported $80M budget, and also starred Sydney Sweeney, Isabela Merced, Celeste O’Connor, Tahar Rahim, Mike Epps, Emma Roberts, and Adam Scott.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cspan\u003eFollowing the results of \u003cem\u003eMadame Web\u003c/em\u003e, Johnson hinted that the experience put her off and she didn’t have the desire to star in another superhero movie.\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“I had never done anything like it before. I probably will never do anything like it again because I don’t make sense in that world. And I know that now,” Johnson said in an interview with \u003cem\u003e\u003ca rel=\"noreferrer noopener nofollow\" target=\"_blank\" href=\"https://www.bustle.com/entertainment/dakota-johnson-teatime-book-club?utm_campaign=Bustle\u0026amp;utm_content=1709650099\"\u003eBustle\u003c/a\u003e\u003c/em\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tShe continued, “Sometimes in this industry, you sign on to something, and it’s one thing and then as you’re making it, it becomes a completely different thing, and you’re like, ‘Wait, what?’ But it was a real learning experience, and of course it’s not nice to be a part of something that’s ripped to shreds, but I can’t say that I don’t understand.”\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tIn an interview at the end of 2024, Sony Pictures CEO Tony Vinciquerra acknowledged the film’s underperformance at the box office and explained why he thinks it didn’t do well.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“\u003cem\u003eMadame Web\u003c/em\u003e underperformed in the theaters because the press just crucified it. It was not a bad film, and it did great on Netflix,” Vinciquerra told the \u003cem\u003e\u003ca rel=\"noreferrer noopener nofollow\" target=\"_blank\" href=\"https://www.latimes.com/entertainment-arts/business/story/2024-12-26/tony-vinciquerra-reflects-on-his-time-at-sony\"\u003eLos Angeles Times\u003c/a\u003e\u003c/em\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tVinciquerra acknowledged that \u003cem\u003eKraven the Hunter\u003c/em\u003e underperformed like \u003cem\u003eMadame Web\u003c/em\u003e and suggested, “for some reason, the press decided that they didn’t want us making these films … and the critics just destroyed them.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“They also did it with \u003cem\u003eVenom\u003c/em\u003e, but the audience loved \u003cem\u003eVenom\u003c/em\u003e and made \u003cem\u003eVenom\u003c/em\u003e a massive hit,” he added. “These are not terrible films. They were just destroyed by the critics in the press, for some reason.”\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-06T00:20:19Z",
  "modifiedTime": "2025-06-06T00:20:21Z"
}
