{
  "id": "d697e7ca-81f4-4231-b7e7-c04e17603cf2",
  "title": "Apple’s Matt Cherniss On ‘Severance’ \u0026 ‘The Studio’ Emmy Success, ‘Pachinko’s Future \u0026 ‘Ted Lasso’s Return",
  "link": "https://deadline.com/2025/07/matt-cherniss-severance-the-studio-emmys-ted-lasso-season-4-1236458693/",
  "description": "Apple TV+ has the most nominated program at the 2025 Emmy Awards in drama Severance, with 27 noms for its second season, and most nominated comedy series in The Studio (23), which broke the record of another Apple series, Ted Lasso, for most nominations a freshman comedy has gotten while tying The Bear‘s record for […]",
  "author": "Nellie Andreeva",
  "published": "Wed, 16 Jul 2025 01:11:55 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "News",
    "Apple",
    "Emmy Awards",
    "Emmys",
    "Matt Cherniss",
    "Pachinko",
    "Severance",
    "Ted Lasso",
    "The Studio"
  ],
  "byline": "Nellie Andreeva",
  "length": 9379,
  "excerpt": "Apple's Matt Cherniss on 'Severance' and 'The Studio' Emmy success and upcoming season, 'Pachinko's Season 3 prospects \u0026 'Ted Lasso's Season 4 return.",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "Apple TV+ has the most nominated program at the 2025 Emmy Awards in drama Severance, with 27 noms for its second season, and most nominated comedy series in The Studio (23), which broke the record of another Apple series, Ted Lasso, for most nominations a freshman comedy has gotten while tying The Bear‘s record for most nominations for a comedy series in a single year. “It’s thrilling and gratifying,” Apple TV+’s head of development Matt Cherniss said. “I think most of all, I’m just happy for the shows themselves, the talent involved, all the time and effort that they put into doing something original and different, and all the risks that they take along the way. To see that rewarded in shows like Severance and The Studio and Shrinking, it’s just great.” ‘Severance’s Season 2 delay, big budget and Season 3 status Severance‘s big Emmy showing comes after a three-year gap between Season 1 and Season 2 of the sci-fi drama from Dan Erickson and Ben Stiller. Cherniss wasn’t too worried about fans not coming back after the lengthy hiatus. Watch on Deadline “I think there was always such a passionate fan base for the show,” he said. “You never know exactly what’s going to happen, and there were certainly challenges around Covid and the strikes that made there be a bit of time between seasons. But I think that’s just a testament to the originality of the series. And if there was ever a moment where you might question that, all you needed to do was to pick up a script or look at a cut and realize just how interesting and ambitious and excellent that show was. I think it always gave us the confidence that this was a show that the audience was going to come back to. The fact that it grew as much as it did in Season 2, I think was even more gratifying.” As Deadline reported in February, Severance surpassed Ted Lasso to become Apple TV+’s most watched series with the launch of Season 2. It became a Nielsen rankings and pop culture mainstay during its run. A lot has been written about Severance‘s high price point too, with Season 2 budget rumored to be around $20 million, fueled by the show’s elaborate sets, visual look and high-profile talent. “I think it goes beyond a price point when you’re talking about a show like this; I think that you know the creators of shows, they take a big leap of faith when they decide where they want to invest their time and invest in terms of shows,” Cherniss said. “When they do and when they choose us, we’re just going to work tirelessly to make sure they have the support they need, the resources they need to bring their vision to life, and that every part of Apple is committed to making that show a success. And I think that that’s what happened with a show like Severance. We knew it was special, and we knew it needed a certain amount of resources to get there, and we were behind it. It’s gratifying to see that the audience enjoys the show as much as they do, and that it’s getting the kudos that it so well deserves.” Trying to avoid such a large gap between Seasons 2 and 3, “they’re all really hard at work,” Cherniss said about the creative team working on next season. “I’m hoping they take at least a day off today to celebrate all their hard work.” As for when we can expect Season 3, “It’s in process,” Cherniss said. “I don’t think we’re prepared to say much more than that, but everyone is working as quickly as they can to bring the show back. It’s obviously got to come back at as high a level as has been now the signature of the series, and so that’s not something that we’re going to sacrifice.” ‘The Studio’s reach Beyond Hollywood \u0026 Season 2 Hollywood responded to a show about itself as the TV Academy recognized The Studio with 23 Emmy nominations. It’s always a gamble whether an “inside baseball” series like Seth Rogen and Evan Goldberg’s showbiz comedy would find a wide audience but Apple TV+ went after their pitch, outbidding other streamers for it. “Seth and Evan had a vision for this show from the start that was evident the first time we spoke to them about it,” Cherniss said. “And, while it certainly has a lot to say about Hollywood, I think that we were always compelled by their vision, how they wanted to tell their stories, the characters that they had created. And I think that the tone of the comedy, all of those were things that transcended the workplace of it all, I guess you could say, and made us confident that they were master storytellers, and we’re going to find a way to bring this world to life in an original and a resonant way. While Netflix chief Ted Sarandos made a cameo in Season 1, Apple TV+ executives did not. Cherniss is not tempted. “All I know definitively is that I will not be making a cameo in Season 2,” he said. As for what is in store next season, “they are hard at work in figuring out where things will go,” he said laconically. ‘Shrinking’s expanding Emmy footprint Bill Lawrence and Jason Segal’s Shrinking made big Emmy strides with its second season, going from 2 to 7 nominations, including the show’s first Outstanding Comedy Series nod and first career Emmy nomination for Harrison Ford. “It’s such a wonderful show, it’s life-affirming, it’s heartwarming, yet I think it allows us to look at ourselves in the mirror in a really powerful way,” Cherniss said. “Bill and Jason and everyone involved have put so much time and effort into bringing those stories to life. It’s got an aspiration to it that I love, and I think really resonates with people. It’s amazing to be a small part of Harrison Ford’s long resume and career. That’s fun for all of us here, and I just couldn’t be happier for the show..” Cherniss wouldn’t elaborate on Season 3, which is in production, with Michael J. Fox playing a new recurring character. “We’re well into Season 3 at this point. I don’t want to give anything away about the show itself and the arc of those characters, only to say, I think the show just continues to get better and better with every season,” he said.” ‘Pachinko’s Future Overall, Apple TV+ saw 14 programs nominated today. “It’s great to see Pachinko be honored, Presumed Innocent, Brian Tyree Henry, it’s great to see such a well deserved nomination for such a powerful performance in Dope Thief,” Cherniss said. Pachinko‘s two Emmy nominations, for production design and cinematography, come almost a year after the second season premiered on Apple TV+. There has been no word on a conclusion for the series, which had been envisioned for a three-season run. I hear there was an overture to another streamer to potentially pick it up, which fell through. “Pachinko is a show we’re extremely proud of. I don’t think we have anything to announce about future seasons at this time, but happy for all of them,” Cherniss said. “And it is a show that I think has so much hope and aspiration built in.” ‘Ted Lasso’s big return Speaking of aspiration, nothing beats beloved Apple comedy Ted Lasso in that department. A two-time winner in the Outstanding Comedy Series category, the series is returning after a multi-year break with a fourth season, slated to begin production this summer. Would it be ready for 2026 Emmy consideration? “I have high hopes for season four of Ted Lasso, so we’re just getting down that road,” Cherniss said. “I don’t know what more can be said about Ted Lasso that hasn’t already been said, and we’re so excited that it’s coming back.” He would’t provide specifics whether the comedy would reinvent itself as it shifts its focus from a men’s to a women’s soccer team. “I don’t think I want to say anything about the direction that the show is going, only that I think if you love Ted Lasso you’re gonna love the next season.” ‘Your Friends \u0026 Neighbors’s growth trajectory Apple TV+’s new drama Your Friends \u0026 Neighbors starring Jon Hamm, earned a very early Season 2 renewal and has done well on the platform. It earned one Emmy nomination, for main title music. “The show’s been a huge hit for us, I expect that will only grow with time,” Cherniss said. “I find the show to be wildly entertaining, I think Jon Hamm is amazing in it. It is thought provoking, and as series go, I think gives the audience entertainment and also, it was really resonant. I’ve seen some early days on Season 2, it’s only continuing down that road.” Coming down the pike Cherniss, who has been at Apple TV+ since the beginning as the first development executive hired by toppers Zack Van Amburg and Jamie Erlicht, reflected on the streamer’s evolution as an original programming player. “We’re five plus years into this, we’re still a new service, we’re still growing,” he said. “I think we’re all really gratified by what we’re seeing today as a sign that we continue to move in the right direction. I think there’s a lot of great series coming in the next year.” A few that he highlighted include Chief of War, starring Jason Momoa, which Cherniss called “as ambitious as any big epic genre action show that you’ll see,” The Morning Show Season 4 and Vince Gilligan’s new series. “I think that, post-pandemic, post-strike, we’re just starting to hit our stride,” he said.",
  "image": "https://deadline.com/wp-content/uploads/2025/07/Matt-Cherniss.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\t\u003ca href=\"https://deadline.com/tag/apple/\" id=\"auto-tag_apple\" data-tag=\"apple\"\u003eApple\u003c/a\u003e TV+ has the most nominated program at the 2025 \u003ca href=\"https://deadline.com/tag/emmy-awards/\" id=\"auto-tag_emmy-awards\" data-tag=\"emmy-awards\"\u003eEmmy Awards\u003c/a\u003e in drama \u003cem\u003e\u003ca href=\"https://deadline.com/tag/severance/\" id=\"auto-tag_severance\" data-tag=\"severance\"\u003eSeverance\u003c/a\u003e, \u003c/em\u003ewith 27 noms for its second season, and most nominated comedy series in \u003cem\u003e\u003ca href=\"https://deadline.com/tag/the-studio/\" id=\"auto-tag_the-studio\" data-tag=\"the-studio\"\u003eThe Studio\u003c/a\u003e\u003c/em\u003e (23), which broke the record of another Apple series, \u003cem\u003e\u003ca href=\"https://deadline.com/tag/ted-lasso/\" id=\"auto-tag_ted-lasso\" data-tag=\"ted-lasso\"\u003eTed Lasso\u003c/a\u003e,\u003c/em\u003e for most nominations a freshman comedy has gotten while tying \u003cem\u003eThe Bear\u003c/em\u003e‘s record for most nominations for a comedy series in a single year.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“It’s thrilling and gratifying,” Apple TV+’s head of development \u003ca href=\"https://deadline.com/tag/matt-cherniss/\" id=\"auto-tag_matt-cherniss\" data-tag=\"matt-cherniss\"\u003eMatt Cherniss\u003c/a\u003e said. “I think most of all, I’m just happy for the shows themselves, the talent involved, all the time and effort that they put into doing something original and different, and all the risks that they take along the way. To see that rewarded in shows like \u003cem\u003eSeverance\u003c/em\u003e and \u003cem\u003eThe Studio \u003c/em\u003eand\u003cem\u003e Shrinking\u003c/em\u003e, it’s just great.”\n\n\t\u003c/p\u003e\n\n\n\n\n\n\t\u003ch2\u003e\n\t\t‘Severance’s Season 2 delay, big budget and Season 3 status\t\u003c/h2\u003e\n\n\n\n\u003cp\u003e\n\t\u003cem\u003eSeverance\u003c/em\u003e‘s big Emmy showing comes after a three-year gap between Season 1 and Season 2 of the sci-fi drama from Dan Erickson and Ben Stiller. Cherniss wasn’t too worried about fans not coming back after the lengthy hiatus. \n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234771711\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\t“I think there was always such a passionate fan base for the show,” he said. “You never know exactly what’s going to happen, and there were certainly challenges around Covid and the strikes that made there be a bit of time between seasons. But I think that’s just a testament to the originality of the series. And if there was ever a moment where you might question that, all you needed to do was to pick up a script or look at a cut and realize just how interesting and ambitious and excellent that show was. I think it always gave us the confidence that this was a show that the audience was going to come back to. The fact that it grew as much as it did in Season 2, I think was even more gratifying.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAs Deadline \u003ca href=\"https://deadline.com/2025/02/severance-ratings-season-2-apple-most-watched-series-1236294760/\"\u003ereported in February\u003c/a\u003e, \u003cem\u003eSeverance \u003c/em\u003esurpassed \u003cem\u003eTed Lasso \u003c/em\u003eto become Apple TV+’s most watched series with the launch of Season 2. It became a Nielsen rankings and pop culture mainstay during its run.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tA lot has been written about\u003cem\u003e Severance\u003c/em\u003e‘s high price point too, with Season 2 budget rumored to be around $20 million, fueled by the show’s elaborate sets, visual look and high-profile talent.  \n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t“I think it goes beyond a price point when you’re talking about a show like this; I think that you know the creators of shows, they take a big leap of faith when they decide where they want to invest their time and invest in terms of shows,” Cherniss said. “When they do and when they choose us, we’re just going to work tirelessly to make sure they have the support they need, the resources they need to bring their vision to life, and that every part of Apple is committed to making that show a success. And I think that that’s what happened with a show like \u003cem\u003eSeverance\u003c/em\u003e. We knew it was special, and we knew it needed a certain amount of resources to get there, and we were behind it. It’s gratifying to see that the audience enjoys the show as much as they do, and that it’s getting the kudos that it so well deserves.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tTrying to avoid such a large gap between Seasons 2 and 3, “they’re all really hard at work,” Cherniss said about the creative team working on next season. “I’m hoping they take at least a day off today to celebrate all their hard work.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAs for when we can expect Season 3, “It’s in process,” Cherniss said. “I don’t think we’re prepared to say much more than that, but everyone is working as quickly as they can to bring the show back. It’s obviously got to come back at as high a level as has been now the signature of the series, and so that’s not something that we’re going to sacrifice.”\u003c/p\u003e\n\n\n\n\t\u003ch2\u003e\n\t\t‘The Studio’s reach Beyond Hollywood \u0026amp; Season 2\t\u003c/h2\u003e\n\n\n\n\u003cp\u003e\n\tHollywood responded to a show about itself as the TV Academy recognized \u003cem\u003eThe Studio \u003c/em\u003ewith 23 Emmy nominations. It’s always a gamble whether an “inside baseball” series like Seth Rogen and Evan Goldberg’s showbiz comedy would find a wide audience but Apple TV+ went after their pitch, outbidding other streamers for it.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Seth and Evan had a vision for this show from the start that was evident the first time we spoke to them about it,” Cherniss said. “And, while it certainly has a lot to say about Hollywood, I think that we were always compelled by their vision, how they wanted to tell their stories, the characters that they had created. And I think that the tone of the comedy, all of those were things that transcended the workplace of it all, I guess you could say, and made us confident that they were master storytellers, and we’re going to find a way to bring this world to life in an original and a resonant way. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWhile Netflix chief Ted Sarandos made a cameo in Season 1, Apple TV+ executives did not. Cherniss is not tempted. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“All I know definitively is that I will not be making a cameo in Season 2,” he said. As for what is in store next season, “they are hard at work in figuring out where things will go,” he said laconically. \u003c/p\u003e\n\n\n\n\t\u003ch2\u003e\n\t\t‘Shrinking’s expanding Emmy footprint\t\u003c/h2\u003e\n\n\n\n\u003cp\u003e\n\tBill Lawrence and Jason Segal’s \u003cem\u003eShrinking \u003c/em\u003emade big Emmy strides with its second season, going from 2 to 7 nominations, including the show’s first Outstanding Comedy Series nod and first career Emmy nomination for Harrison Ford. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“It’s such a wonderful show, it’s life-affirming, it’s heartwarming, yet I think it allows us to look at ourselves in the mirror in a really powerful way,” Cherniss said. “Bill and Jason and everyone involved have put so much time and effort into bringing those stories to life. It’s got an aspiration to it that I love, and I think really resonates with people. It’s amazing to be a small part of Harrison Ford’s long resume and career. That’s fun for all of us here, and I just couldn’t be happier for the show..”\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tCherniss wouldn’t elaborate on Season 3, which is in production, with Michael J. Fox playing a new recurring character.  \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“We’re well into Season 3 at this point. I don’t want to give anything away about the show itself and the arc of those characters, only to say, I think the show just continues to get better and better with every season,” he said.”\u003c/p\u003e\n\n\n\n\t\u003ch2\u003e\n\t\t‘Pachinko’s Future\t\u003c/h2\u003e\n\n\n\n\u003cp\u003e\n\tOverall, Apple TV+ saw 14 programs nominated today. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“It’s great to see \u003cem\u003e\u003ca href=\"https://deadline.com/tag/pachinko/\" id=\"auto-tag_pachinko\" data-tag=\"pachinko\"\u003ePachinko\u003c/a\u003e\u003c/em\u003e be honored,\u003cem\u003e Presumed Innocen\u003c/em\u003et, Brian Tyree Henry, it’s great to see such a well deserved nomination for such a powerful performance in \u003cem\u003eDope Thief\u003c/em\u003e,” Cherniss said.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cem\u003ePachinko\u003c/em\u003e‘s two Emmy nominations, for production design and cinematography, come almost a year after the second season premiered on Apple TV+. There has been no word on a conclusion for the series, which had been envisioned for a three-season run. I hear there was an overture to another streamer to potentially pick it up, which fell through. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“\u003cem\u003ePachinko \u003c/em\u003eis a show we’re extremely proud of. I don’t think we have anything to announce about future seasons at this time, but happy for all of them,” Cherniss said. “And it is a show that I think has so much hope and aspiration built in.”\u003c/p\u003e\n\n\n\n\t\u003ch2\u003e\n\t\t‘Ted Lasso’s big return\t\u003c/h2\u003e\n\n\n\n\u003cp\u003e\n\tSpeaking of aspiration, nothing beats beloved Apple comedy \u003cem\u003eTed Lasso\u003c/em\u003e in that department. A two-time winner in the Outstanding Comedy Series category, the series is returning after a multi-year break with a fourth season, slated to begin production this summer. Would it be ready for 2026 Emmy consideration?\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“I have high hopes for season four of\u003cem\u003e Ted Lasso, \u003c/em\u003eso we’re just getting down that road,” Cherniss said. “I don’t know what more can be said about \u003cem\u003eTed Lasso \u003c/em\u003ethat hasn’t already been said, and we’re so excited that it’s coming back.” \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tHe would’t provide specifics whether the comedy would reinvent itself as it shifts its focus from a men’s to a women’s soccer team. “I don’t think I want to say anything about the direction that the show is going, only that I think if you love\u003cem\u003e Ted Lasso\u003c/em\u003e you’re gonna love the next season.”\u003c/p\u003e\n\n\n\n\t\u003ch2\u003e\n\t\t‘Your Friends \u0026amp; Neighbors’s growth trajectory\t\u003c/h2\u003e\n\n\n\n\u003cp\u003e\n\tApple TV+’s new drama \u003cem\u003eYour Friends \u0026amp; Neighbors \u003c/em\u003estarring Jon Hamm, earned a very early Season 2 renewal and has done well on the platform. It earned one Emmy nomination, for main title music. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“The show’s been a huge hit for us, I expect that will only grow with time,” Cherniss said. “I find the show to be wildly entertaining, I think Jon Hamm is amazing in it. It is thought provoking, and as series go, I think gives the audience entertainment and also, it was really resonant. I’ve seen some early days on Season 2, it’s only continuing down that road.” \u003c/p\u003e\n\n\n\n\t\u003ch2\u003e\n\t\tComing down the pike\t\u003c/h2\u003e\n\n\n\n\u003cp\u003e\n\tCherniss, who has been at Apple TV+ since the beginning as the first development executive hired by toppers Zack Van Amburg and Jamie Erlicht, reflected on the streamer’s evolution as an original programming player. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“We’re five plus years into this, we’re still a new service, we’re still growing,” he said. “I think we’re all really gratified by what we’re seeing today as a sign that we continue to move in the right direction. I think there’s a lot of great series coming in the next year.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tA few that he highlighted include \u003cem\u003eChief of War,\u003c/em\u003e starring Jason Momoa, which Cherniss called “as ambitious as any big epic genre action show that you’ll see,” \u003cem\u003eThe Morning Show\u003c/em\u003e Season 4 and Vince Gilligan’s new series. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“I think that, post-pandemic, post-strike, we’re just starting to hit our stride,” he said.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-07-16T01:11:55Z",
  "modifiedTime": "2025-07-16T01:21:11Z"
}
