{
  "id": "d7452715-ffbe-4585-a6f2-de4e970e8539",
  "title": "AMC Says New NCM Preshow Ads Before Movies “Does Not Negatively Influence Moviegoing Habits”",
  "link": "https://deadline.com/2025/06/amc-responds-more-commercials-1236423804/",
  "description": "Word got out today that the No. 1 circuit, AMC Theatres, was going to start running more advertising during their pre-shows starting July 1. Why is this a big deal? Bigger than the taxation of trade routes? Because AMC close to six years ago said it wouldn’t partake in National CineMedia’s new ad spot. At […]",
  "author": "anthonypauldalessandro",
  "published": "Thu, 05 Jun 2025 01:01:50 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "News",
    "AMC Entertainment",
    "AMC Theatres"
  ],
  "byline": "Anthony D'Alessandro",
  "length": 2115,
  "excerpt": "AMC responded to news today that they're running more ads before movies. Essentially, it doesn't impact moviegoing according to the chain.",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "Word got out today that the No. 1 circuit, AMC Theatres, was going to start running more advertising during their pre-shows starting July 1. Why is this a big deal? Bigger than the taxation of trade routes? Because AMC close to six years ago said it wouldn’t partake in National CineMedia’s new ad spot. At the time, AMC believed that more ads would make moviegoers mad. Well, AMC has changed course. Other rivals are already running longer ads during their pre-shows. Exhibition can’t survive on film rentals alone. Essentially AMC has hammered a deal with National CineMedia Inc. to run the spots during each movie’s pre-shows. National CineMedia is the ad network in major exhibition circuits. There’s a “platinum spot” that will be shown on screens just prior to a movie’s start. AMC will reportedly get a cut of the ad sales. Watch on Deadline Said an AMC spokesperson, “For the past five years, AMC has sought out crucial revenue that is not reliant on the increase of base ticket prices. We’ve done this through more and better moviegoing enhancements like our significant expansion of PLFs, a greater selection of food and beverage offerings, and the introduction of movie-going merchandise like popcorn buckets and other collectable concession vessels. During that same time, others in our industry have taken in revenue through their partnership with NCM, via these so-called Platinum Spots.”  They added, “While AMC was initially reluctant to bring this to our theatres, our competitors have fully participated for more than five years without any direct impact to their attendance. This is a strong indication that this NCM preshow initiative does not negatively influence moviegoing habits. Our participation delivers us vital revenue as we continue on our recovery path and allows us to continue offering significant value on ticket prices through initiatives like Discount Tuesday, 20% off matinee pricing, and the upcoming 50% off Wednesday ticketing program.” Bloomberg first had the story about AMC running more ads during pre-shows.",
  "image": "https://deadline.com/wp-content/uploads/2023/05/GettyImages-1305539833.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tWord got out today that the No. 1 circuit, \u003ca href=\"https://deadline.com/tag/amc-theatres/\" id=\"auto-tag_amc-theatres\" data-tag=\"amc-theatres\"\u003eAMC Theatres\u003c/a\u003e, was going to start running more advertising during their pre-shows starting July 1. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWhy is this a big deal? Bigger than the taxation of trade routes? Because AMC close to six years ago said it wouldn’t partake in National CineMedia’s new ad spot. At the time, AMC believed that more ads would make moviegoers mad. Well, AMC has changed course. Other rivals are already running longer ads during their pre-shows. Exhibition can’t survive on film rentals alone.  \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tEssentially AMC has hammered a deal with National CineMedia Inc. to run the spots during each movie’s pre-shows. National CineMedia is the ad network in major exhibition circuits. \n\n\t\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\n\tThere’s a “platinum spot” that will be shown on screens just prior to a movie’s start. AMC will reportedly get a cut of the ad sales. \n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234771711\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tSaid an AMC spokesperson, “For the past five years, AMC has sought out crucial revenue that is not reliant on the increase of base ticket prices. We’ve done this through more and better moviegoing enhancements like our significant expansion of PLFs, a greater selection of food and beverage offerings, and the introduction of movie-going merchandise like popcorn buckets and other collectable concession vessels. During that same time, others in our industry have taken in revenue through their partnership with NCM, via these so-called Platinum Spots.” \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThey added, “While AMC was initially reluctant to bring this to our theatres, our competitors have fully participated for more than five years without any direct impact to their attendance. This is a strong indication that this NCM preshow initiative does not negatively influence moviegoing habits. Our participation delivers us vital revenue as we continue on our recovery path and allows us to continue offering significant value on ticket prices through initiatives like Discount Tuesday, 20% off matinee pricing, and the upcoming 50% off Wednesday ticketing program.”\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tBloomberg first had the story about AMC running more ads during pre-shows. \u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-06-05T01:01:50Z",
  "modifiedTime": "2025-06-05T01:02:16Z"
}
