{
  "id": "d7bf0ada-30bf-4ec8-aea2-79e929f8e392",
  "title": "Daniel Dae Kim \u0026 Reina Hardesty in Spy Thriller 'Butterfly' Full Trailer",
  "link": "https://www.firstshowing.net/2025/daniel-dae-kim-reina-hardesty-in-spy-thriller-butterfly-full-trailer/",
  "description": "\"She won't just let us walk away. We have to bring her down...\" Prime Video has revealed an official trailer for Butterfly, a spy thriller series arriving to watch starting this September. This streaming series is based on the graphic novel by Arash Amel, and also produced by The Amel Company, along with Amazon Studios, Boom! Studios, and 3AD. \"Second chances don't come twice.\" \"They share a past, now they share a mission.\" Daniel Dae Kim stars as David Jung, an enigmatic, highly unpredictable former US intelligence operative living in South Korea. When the consequences of an impossible decision from his past come back to haunt him, and he finds himself pursued by Rebecca (and her organization Caddis) – a deadly, sociopathic young agent assigned to kill him. The cast includes Reina Hardesty as Rebecca, Piper Perabo as the boss, with Kim Ji-hoon, Park Hae-soo, Kim Tae-hee, Charles Parnell, Sean Dulake, and Nayoon Kim. Plus Sung Dong-il and Lee Il-hwa in guest roles. It's basically a Korean action series about spies – but made mostly in English for US audiences to enjoy as well. It looks entertaining \u0026 quite similar to Netflix's FUBAR. Here's the main official trailer (+ poster) […]",
  "author": "Alex Billington",
  "published": "Mon, 14 Jul 2025 17:59:16 +0000",
  "source": "https://www.firstshowing.net/feed/",
  "categories": [
    "Streaming",
    "To Watch",
    "Trailer"
  ],
  "byline": "Alex Billington",
  "length": 2499,
  "excerpt": "\"She won't just let us walk away. We have to bring her down...\" Prime Video has revealed an official trailer for Butterfly, a spy thriller series arriving to watch starting this September. This streaming series is based on the graphic novel by Arash Amel, and also produced by The Amel Company, along with Amazon Studios,",
  "siteName": "FirstShowing.net",
  "favicon": "https://www.firstshowing.net/favicon-32x32.png",
  "text": "by July 14, 2025Source: YouTube \"She won't just let us walk away. We have to bring her down...\" Prime Video has revealed an official trailer for Butterfly, a spy thriller series arriving to watch starting this September. This streaming series is based on the graphic novel by Arash Amel, and also produced by The Amel Company, along with Amazon Studios, Boom! Studios, and 3AD. \"Second chances don't come twice.\" \"They share a past, now they share a mission.\" Daniel Dae Kim stars as David Jung, an enigmatic, highly unpredictable former US intelligence operative living in South Korea. When the consequences of an impossible decision from his past come back to haunt him, and he finds himself pursued by Rebecca (and her organization Caddis) – a deadly, sociopathic young agent assigned to kill him. The cast includes Reina Hardesty as Rebecca, Piper Perabo as the boss, with Kim Ji-hoon, Park Hae-soo, Kim Tae-hee, Charles Parnell, Sean Dulake, and Nayoon Kim. Plus Sung Dong-il and Lee Il-hwa in guest roles. It's basically a Korean action series about spies – but made mostly in English for US audiences to enjoy as well. It looks entertaining \u0026 quite similar to Netflix's FUBAR. Here's the main official trailer (+ poster) for Prime Video's series Butterfly, direct from PV's YouTube: Butterfly is a character-driven spy thriller that explores complex family dynamics within the treacherous world of global espionage. Centered on David Jung (Daniel Dae Kim), an enigmatic, highly unpredictable former US intelligence operative living in South Korea, whose life is blown to pieces when consequences of an impossible decision from his past come back to haunt him, and he finds himself pursued by: Rebecca (Reina Hardesty), a deadly, sociopathic young agent assigned to kill him, and also Caddis, the sinister spy organization she works for. Butterfly is a spy series created and written by Ken Woodruff \u0026 Steph Cha. Additional writing by Dave Kalstein, Sung Rno, Diana Son, Denise Thé. Based on the graphic novel written by Arash Amel. With episodes directed by Japanese-American filmmaker Kitao Sakurai, of eps of \"Dave\" and \"Twisted Metal\", and years working for \"The Eric Andre Show\". Developed by 3AD. Executive produced by Ken Woodruff, Steph Cha, Daniel Dae Kim, John Cheng, Stephen Christy, Ross Richie, and Arash Amel. Amazon will debut the Butterfly series streaming on Prime Video starting August 13th, 2025 coming soon. Find more posts in: Streaming, To Watch, Trailer",
  "image": "https://media2.firstshowing.net/firstshowing/img17/ButterflyseriesPostermainTW1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\n\t\t\t\u003cp\u003eby \t\t\u003cbr/\u003eJuly 14, 2025\u003cbr/\u003e\u003cem\u003eSource:\u003c/em\u003e \u003ca href=\"https://www.youtube.com/watch?v=RBmyiyZba3s\" rel=\"noopener nofollow\" target=\"_blank\"\u003eYouTube\u003c/a\u003e\u003cbr/\u003e\u003c/p\u003e\n\t\t\u003cp\u003e\u003ca href=\"https://www.firstshowing.net/2025/daniel-dae-kim-reina-hardesty-in-spy-thriller-butterfly-full-trailer/\"\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img17/ButterflyseriesPostermainTsr1.jpg\" alt=\"Butterfly Spy Series Trailer\" width=\"350\" height=\"168\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u0026#34;She won\u0026#39;t just let us walk away. We have to bring her down...\u0026#34;\u003c/em\u003e Prime Video has revealed an official trailer for \u003cstrong\u003e\u003cem\u003eButterfly\u003c/em\u003e\u003c/strong\u003e, a spy thriller series arriving to watch starting this \u003ca href=\"https://www.firstshowing.net/schedule2025/#sep\"\u003eSeptember\u003c/a\u003e. This streaming series is based on the \u003ca href=\"https://amzn.to/4nNA7Cw\" rel=\"noopener\" target=\"_blank\"\u003egraphic novel\u003c/a\u003e by Arash Amel, and also produced by The Amel Company, along with Amazon Studios, Boom! Studios, and 3AD. \u0026#34;Second chances don\u0026#39;t come twice.\u0026#34; \u0026#34;They share a past, now they share a mission.\u0026#34; \u003cstrong\u003eDaniel Dae Kim\u003c/strong\u003e stars as David Jung, an enigmatic, highly unpredictable former US intelligence operative living in South Korea. When the consequences of an impossible decision from his past come back to haunt him, and he finds himself pursued by Rebecca (and her organization Caddis) – a deadly, sociopathic young agent assigned to kill him. The cast includes \u003cstrong\u003eReina Hardesty\u003c/strong\u003e as Rebecca, \u003cstrong\u003ePiper Perabo\u003c/strong\u003e as the boss, with \u003cstrong\u003eKim Ji-hoon\u003c/strong\u003e, \u003cstrong\u003ePark Hae-soo\u003c/strong\u003e, \u003cstrong\u003eKim Tae-hee\u003c/strong\u003e, \u003cstrong\u003eCharles Parnell\u003c/strong\u003e, \u003cstrong\u003eSean Dulake\u003c/strong\u003e, and \u003cstrong\u003eNayoon Kim\u003c/strong\u003e. Plus \u003cstrong\u003eSung Dong-il\u003c/strong\u003e and \u003cstrong\u003eLee Il-hwa\u003c/strong\u003e in guest roles. It\u0026#39;s basically a Korean action series about spies – but made mostly in English for US audiences to enjoy as well. It looks entertaining \u0026amp; quite similar to \u003ca href=\"https://www.firstshowing.net/2025/arnold-is-back-for-more-missions-in-fubar-action-series-season-2/\" title=\"Arnold is Back For More Missions in \u0026#39;FUBAR\u0026#39; Action Series - Season 2\"\u003eNetflix\u0026#39;s \u003cem\u003eFUBAR\u003c/em\u003e\u003c/a\u003e.\u003cspan id=\"more-747902\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eHere\u0026#39;s the main official trailer (+ poster) for Prime Video\u0026#39;s series \u003cstrong\u003e\u003cem\u003eButterfly\u003c/em\u003e\u003c/strong\u003e, direct from PV\u0026#39;s \u003ca href=\"https://www.youtube.com/watch?v=RBmyiyZba3s\" rel=\"noopener\" target=\"_blank\"\u003eYouTube\u003c/a\u003e:\u003c/p\u003e\n\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img17/ButterflyseriesPostermain5992.jpg\" alt=\"Butterfly Spy Series Trailer\" width=\"599\" height=\"337\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img17/ButterflyseriesPostermain5991.jpg\" alt=\"Butterfly Spy Series Poster\" width=\"599\" height=\"749\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eButterfly is a character-driven spy thriller that explores complex family dynamics within the treacherous world of global espionage. Centered on David Jung (Daniel Dae Kim), an enigmatic, highly unpredictable former US intelligence operative living in South Korea, whose life is blown to pieces when consequences of an impossible decision from his past come back to haunt him, and he finds himself pursued by: Rebecca (Reina Hardesty), a deadly, sociopathic young agent assigned to kill him, and also Caddis, the sinister spy organization she works for.\u003c/em\u003e \u003cem\u003eButterfly\u003c/em\u003e is a spy series created and written by \u003cstrong\u003eKen Woodruff\u003c/strong\u003e \u0026amp; \u003cstrong\u003eSteph Cha\u003c/strong\u003e. Additional writing by Dave Kalstein, Sung Rno, Diana Son, Denise Thé. Based on the \u003ca href=\"https://amzn.to/4nNA7Cw\" rel=\"noopener\" target=\"_blank\"\u003egraphic novel\u003c/a\u003e written by Arash Amel. With episodes directed by Japanese-American filmmaker \u003ca href=\"https://www.imdb.com/name/nm0757318/\" rel=\"noopener\" target=\"_blank\"\u003e\u003cstrong\u003eKitao Sakurai\u003c/strong\u003e\u003c/a\u003e, of eps of \u0026#34;Dave\u0026#34; and \u0026#34;Twisted Metal\u0026#34;, and years working for \u0026#34;The Eric Andre Show\u0026#34;. Developed by 3AD. Executive produced by Ken Woodruff, Steph Cha, Daniel Dae Kim, John Cheng, Stephen Christy, Ross Richie, and Arash Amel. Amazon will debut the Butterfly series streaming on Prime Video starting \u003ca href=\"https://www.firstshowing.net/schedule2025/#aug\"\u003e\u003cstrong\u003eAugust 13th, 2025\u003c/strong\u003e\u003c/a\u003e coming soon.\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eFind more posts in:\u003c/strong\u003e \u003ca href=\"https://www.firstshowing.net/category/streaming/\" rel=\"category tag\"\u003eStreaming\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/worthwatching/\" rel=\"category tag\"\u003eTo Watch\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/trailers/\" rel=\"category tag\"\u003eTrailer\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-07-14T13:59:16-04:00",
  "modifiedTime": null
}
