{
  "id": "d8ce4fb1-0438-4189-8685-b307d1ac75b8",
  "title": "Acclaimed Mexican Film 'Sujo' Official Trailer About a Boy Growing Up",
  "link": "https://www.firstshowing.net/2024/acclaimed-mexican-film-sujo-official-trailer-about-a-boy-growing-up/",
  "description": "\"Do you think people can change their life?\" The Forge has unveiled the official US trailer for an acclaimed indie film titled Sujo, a Mexican drama co-directed by the same talented filmmakers behind The Darkest Days of Us and Identifying Features previously. This initially premiered at the 2024 Sundance Film Festival at the start of this year and screened at many other festivals including Miami, Seattle, Munich, London, and San Sebastian. When a cartel gunman is killed, he leaves behind Sujo, his 4-year-old son - left orphaned and at risk. The shadow of violence surrounds Sujo during each stage of his life. As he grows into a man, Sujo grapples with his fate, realizing that fulfilling his father’s legacy may be inescapable. Starring Juan Jesús Varela, Yadira Perez, Alexis Varela, Jairo Hernández, Sandra Lorenzano, Kevin Aguilar, and Karla Garrido. Reviews describe it as \"a gentle film about a harsh world, and its patience and sensitivity give space for a refreshingly different kind of story.\" This absolutely looks like it's worth a watch in theaters. Here's the official trailer (+ poster) for Rondero \u0026 Valadez's film Sujo, direct from The Forge's YouTube: After a cartel gunman from a small Mexican town […]",
  "author": "Alex Billington",
  "published": "Tue, 26 Nov 2024 22:23:09 +0000",
  "source": "https://www.firstshowing.net/feed/",
  "categories": [
    "Foreign Films",
    "Indies",
    "To Watch",
    "Trailer"
  ],
  "byline": "Alex Billington",
  "length": 2436,
  "excerpt": "\"Do you think people can change their life?\" The Forge has unveiled the official US trailer for an acclaimed indie film titled Sujo, a Mexican drama co-directed by the same talented filmmakers behind The Darkest Days of Us and Identifying Features previously. This initially premiered at the 2024 Sundance Film Festival at the start of",
  "siteName": "FirstShowing.net",
  "favicon": "https://www.firstshowing.net/favicon-32x32.png",
  "text": "by November 26, 2024Source: YouTube \"Do you think people can change their life?\" The Forge has unveiled the official US trailer for an acclaimed indie film titled Sujo, a Mexican drama co-directed by the same talented filmmakers behind The Darkest Days of Us and Identifying Features previously. This initially premiered at the 2024 Sundance Film Festival at the start of this year and screened at many other festivals including Miami, Seattle, Munich, London, and San Sebastian. When a cartel gunman is killed, he leaves behind Sujo, his 4-year-old son - left orphaned and at risk. The shadow of violence surrounds Sujo during each stage of his life. As he grows into a man, Sujo grapples with his fate, realizing that fulfilling his father’s legacy may be inescapable. Starring Juan Jesús Varela, Yadira Perez, Alexis Varela, Jairo Hernández, Sandra Lorenzano, Kevin Aguilar, and Karla Garrido. Reviews describe it as \"a gentle film about a harsh world, and its patience and sensitivity give space for a refreshingly different kind of story.\" This absolutely looks like it's worth a watch in theaters. Here's the official trailer (+ poster) for Rondero \u0026 Valadez's film Sujo, direct from The Forge's YouTube: After a cartel gunman from a small Mexican town is murdered, Sujo, his beloved four-year-old son, is left an orphan and in danger. Sujo narrowly escapes death with the help of his aunt who raises him in the isolated countryside amidst hardship, poverty, and the constant peril associated with his identity. When he enters his teens a rebelliousness awakens in him, and like a rite of passage, he joins the local cartel. As a young man, Sujo attempts to make his life anew, away from the violence of his hometown. However, when his father’s legacy catches up with him, he will come face-to-face with what seems to be his destiny. Sujo is co-written and co-directed by two Mexican filmmakers Astrid Rondero (director of The Darkest Days of Us) \u0026 Fernanda Valadez (director of Identifying Features) making their first film together. It's produced by Astrid Rondero, Fernanda Valadez, Diana Arcega, Jewerl Keats Ross, Virginie Devesa, \u0026 Jean-Baptiste Bailly-Maitre. This first premiered at the 2024 Sundance Film Festival earlier this year, and already opened in Mexico in October. The Forge debuts Sujo in select US theaters starting December 6th, 2024. Find more posts: Foreign Films, Indies, To Watch, Trailer",
  "image": "https://media2.firstshowing.net/firstshowing/img16/SujoPosterMexicoMainimageTW1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\n\t\t\t\u003cp\u003eby \t\t\u003cbr/\u003eNovember 26, 2024\u003cbr/\u003e\u003cem\u003eSource:\u003c/em\u003e \u003ca href=\"https://www.youtube.com/watch?v=p_7o6VEzNE4\" rel=\"noopener nofollow\" target=\"_blank\"\u003eYouTube\u003c/a\u003e\u003cbr/\u003e\u003c/p\u003e\n\t\t\u003cp\u003e\u003ca href=\"https://www.firstshowing.net/2024/acclaimed-mexican-film-sujo-official-trailer-about-a-boy-growing-up/\"\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/SujoPosterMexicoMainimageTsr1.jpg\" alt=\"Sujo Trailer\" width=\"350\" height=\"168\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u0026#34;Do you think people can change their life?\u0026#34;\u003c/em\u003e The Forge has unveiled the official US trailer for an acclaimed indie film titled \u003cstrong\u003e\u003cem\u003eSujo\u003c/em\u003e\u003c/strong\u003e, a Mexican drama co-directed by the same talented filmmakers behind \u003cem\u003eThe Darkest Days of Us\u003c/em\u003e and \u003cem\u003eIdentifying Features\u003c/em\u003e previously. This initially premiered at the 2024 Sundance Film Festival at the start of this year and screened at many other festivals including Miami, Seattle, Munich, London, and San Sebastian. When a cartel gunman is killed, he leaves behind Sujo, his 4-year-old son - left orphaned and at risk. The shadow of violence surrounds Sujo during each stage of his life. As he grows into a man, Sujo grapples with his fate, realizing that fulfilling his father’s legacy may be inescapable. Starring \u003cstrong\u003eJuan Jesús Varela\u003c/strong\u003e, \u003cstrong\u003eYadira Perez\u003c/strong\u003e, \u003cstrong\u003eAlexis Varela\u003c/strong\u003e, \u003cstrong\u003eJairo Hernández\u003c/strong\u003e, \u003cstrong\u003eSandra Lorenzano\u003c/strong\u003e, \u003cstrong\u003eKevin Aguilar\u003c/strong\u003e, and \u003cstrong\u003eKarla Garrido\u003c/strong\u003e. Reviews \u003ca href=\"https://awfj.org/blog/2024/08/20/sujo-melbourne-iff-2024-review-by-alexandra-heller-nicholas/\" rel=\"noopener nofollow \" target=\"_blank\"\u003edescribe\u003c/a\u003e it as \u0026#34;a gentle film about a harsh world, and its patience and sensitivity give space for a refreshingly different kind of story.\u0026#34; This absolutely looks like it\u0026#39;s worth a watch in theaters.\u003cspan id=\"more-719856\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eHere\u0026#39;s the official trailer (+ poster) for Rondero \u0026amp; Valadez\u0026#39;s film \u003cstrong\u003e\u003cem\u003eSujo\u003c/em\u003e\u003c/strong\u003e, direct from The Forge\u0026#39;s \u003ca href=\"https://www.youtube.com/watch?v=p_7o6VEzNE4\" rel=\"noopener\" target=\"_blank\"\u003eYouTube\u003c/a\u003e:\u003c/p\u003e\n\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/SujoPosterMexicoMainimage5992.jpg?width=599\" alt=\"Sujo Film\" width=\"599\" height=\"337\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/SujoPosterMexicoMainimage5991.jpg?width=599\" alt=\"Sujo Poster\" width=\"599\" height=\"887\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAfter a cartel gunman from a small Mexican town is murdered, Sujo, his beloved four-year-old son, is left an orphan and in danger. Sujo narrowly escapes death with the help of his aunt who raises him in the isolated countryside amidst hardship, poverty, and the constant peril associated with his identity. When he enters his teens a rebelliousness awakens in him, and like a rite of passage, he joins the local cartel. As a young man, Sujo attempts to make his life anew, away from the violence of his hometown. However, when his father’s legacy catches up with him, he will come face-to-face with what seems to be his destiny.\u003c/em\u003e \u003cem\u003eSujo\u003c/em\u003e is co-written and co-directed by two Mexican filmmakers \u003ca href=\"https://www.imdb.com/name/nm2156418/\" rel=\"noopener\" target=\"_blank\"\u003e\u003cstrong\u003eAstrid Rondero\u003c/strong\u003e\u003c/a\u003e (director of \u003cem\u003eThe Darkest Days of Us\u003c/em\u003e) \u0026amp; \u003ca href=\"https://www.imdb.com/name/nm3635576/\" rel=\"noopener\" target=\"_blank\"\u003e\u003cstrong\u003eFernanda Valadez\u003c/strong\u003e\u003c/a\u003e (director of \u003cem\u003eIdentifying Features\u003c/em\u003e) making their first film together. It\u0026#39;s produced by Astrid Rondero, Fernanda Valadez, Diana Arcega, Jewerl Keats Ross, Virginie Devesa, \u0026amp; Jean-Baptiste Bailly-Maitre. This first premiered at the 2024 Sundance Film Festival earlier this year, and already opened in Mexico in October. The Forge debuts \u003cem\u003eSujo\u003c/em\u003e in select US theaters starting \u003ca href=\"https://www.firstshowing.net/schedule2024/#dec\"\u003e\u003cstrong\u003eDecember 6th, 2024\u003c/strong\u003e\u003c/a\u003e.\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eFind more posts:\u003c/strong\u003e \u003ca href=\"https://www.firstshowing.net/category/foreign-films/\" rel=\"category tag\"\u003eForeign Films\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/indies/\" rel=\"category tag\"\u003eIndies\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/worthwatching/\" rel=\"category tag\"\u003eTo Watch\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/trailers/\" rel=\"category tag\"\u003eTrailer\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-26T17:23:09-05:00",
  "modifiedTime": null
}
