{
  "id": "d9cab10c-1a90-4fe7-8f20-ac15e5d0c00d",
  "title": "Kevin Hart, Keanu Reeves, Arnold Schwarzenegger Among Voice Cast for Amazon Video Game Anthology Series ‘Secret Level’",
  "link": "https://variety.com/2024/tv/news/secret-level-amazon-voice-cast-kevin-hart-keanu-reeves-arnold-schwarzenegger-1236183340/",
  "description": "Amazon Prime Video has revealed the star-studded voice cast for the upcoming adult animated series “Secret Level.” During a panel for the show at New York Comic-Con, it was revealed that the voice cast of the series will include: Arnold Schwarzenegger (“The Terminator” Franchise), Kevin Hart (“Jumanji”), Keanu Reeves (“John Wick”), Temuera Morrison (“The Book […]",
  "author": "Joseph Otterson",
  "published": "Sat, 19 Oct 2024 23:30:00 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Amazon Prime Video",
    "New York Comic-Con",
    "Secret Level"
  ],
  "byline": "Joe Otterson",
  "length": 1806,
  "excerpt": "Amazon Prime Video has revealed the star-studded voice cast for the upcoming adult animated series \"Secret Level.\"",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "Amazon Prime Video has revealed the star-studded voice cast for the upcoming adult animated series “Secret Level.” During a panel for the show at New York Comic-Con, it was revealed that the voice cast of the series will include: Arnold Schwarzenegger (“The Terminator” Franchise), Kevin Hart (“Jumanji”), Keanu Reeves (“John Wick”), Temuera Morrison (“The Book of Boba Fett,” “Chief of War”), Ariana Greenblatt (“Barbie”), Heaven Hart, Emily Swallow (“The Mandalorian”), Gabriel Luna (“The Last of Us,” “Terminator: Dark Fate”), Ricky Whittle (“American Gods,” “Land of Bad”), Patrick Schwarzenegger (“The White Lotus”), Merle Dandridge (“The Last of Us”), Claudia Doumit (“The Boys”), Adewale Akinnuoye-Agbaje (“Lost,” “The Union”), Clive Standen (“Vikings,” “The Morning Show”), Laura Bailey (“The Legend of Vox Machina”), and Michael Beach (“The Perfect Couple,” “Tulsa King”). “Secret Level” will debut on Prime Video on Dec. 10 with two weekly episode drops. The series is described as featuring original stories set within the worlds of some of the world’s most beloved video games, including “Armored Core,” “Dungeons \u0026 Dragons,” and “Spelunky.” Popular on Variety Other games said to be featured in the series are “Concord,” “Crossfire,” “Exodus,” “Honor of Kings,” “Mega Man,” “New World: Aeternum,” “PAC-MAN,” “Sifu,” “The Outer Worlds,” “Unreal Tournament” and “Warhammer 40,000.” The series was created by Tim Miller, who also executive produces. Dave Wilson serves as executive producer and supervising director. It is produced by Amazon MGM Studios and Blur Studio. Blur and Miller previously created the popular Netflix animated anthology “Love, Death + Robots.” Three seasons of that show have aired to date, with a fourth season on the way.",
  "image": "https://variety.com/wp-content/uploads/2024/10/Secret-Level-Amazon-Cast.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\t\u003ca href=\"https://variety.com/t/amazon-prime-video/\" id=\"auto-tag_amazon-prime-video\" data-tag=\"amazon-prime-video\"\u003eAmazon Prime Video\u003c/a\u003e has revealed the star-studded voice cast for the upcoming adult animated series “\u003ca href=\"https://variety.com/t/secret-level/\" id=\"auto-tag_secret-level\" data-tag=\"secret-level\"\u003eSecret Level\u003c/a\u003e.” \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tDuring a panel for the show at \u003ca href=\"https://variety.com/t/new-york-comic-con-2/\" id=\"auto-tag_new-york-comic-con-2\" data-tag=\"new-york-comic-con-2\"\u003eNew York Comic-Con\u003c/a\u003e, it was revealed that the voice cast of the series will include: Arnold Schwarzenegger (“The Terminator” Franchise), Kevin Hart (“Jumanji”), Keanu Reeves (“John Wick”), Temuera Morrison (“The Book of Boba Fett,” “Chief of War”), Ariana Greenblatt (“Barbie”), Heaven Hart, Emily Swallow (“The Mandalorian”), Gabriel Luna (“The Last of Us,” “Terminator: Dark Fate”), Ricky Whittle (“American Gods,” “Land of Bad”), Patrick Schwarzenegger (“The White Lotus”), Merle Dandridge (“The Last of Us”), Claudia Doumit (“The Boys”), Adewale Akinnuoye-Agbaje (“Lost,” “The Union”), Clive Standen (“Vikings,” “The Morning Show”), Laura Bailey (“The Legend of Vox Machina”), and Michael Beach (“The Perfect Couple,” “Tulsa King”).\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\t“Secret Level” will debut on Prime Video on Dec. 10 with two weekly episode drops. The series is described as featuring original stories set within the worlds of some of the world’s most beloved video games, including “Armored Core,” “Dungeons \u0026amp; Dragons,” and “Spelunky.” \n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tOther games said to be featured in the series are “Concord,” “Crossfire,” “Exodus,” “Honor of Kings,” “Mega Man,” “New World: Aeternum,” “PAC-MAN,” “Sifu,” “The Outer Worlds,” “Unreal Tournament” and “Warhammer 40,000.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe series was created by Tim Miller, who also executive produces. Dave Wilson serves as executive producer and supervising director. It is produced by Amazon MGM Studios and Blur Studio. Blur and Miller previously created the popular Netflix animated anthology “Love, Death + Robots.” Three seasons of that show have aired to date, with a fourth season on the way.  \u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-19T23:30:00Z",
  "modifiedTime": "2024-10-19T15:43:03Z"
}
