{
  "id": "ed800302-f5fc-4103-ac24-c0cab798f313",
  "title": "Robert De Niro, Ben Stiller Reunite for ‘Meet the Parents’ 25th Anniversary, Tease Fourth Film With Ariana Grande: ‘The Script Is Really Good’",
  "link": "https://variety.com/2025/film/news/robert-de-niro-ben-stiller-meet-the-parents-25th-anniversary-tribeca-screening-1236418928/",
  "description": "It’s a Focker-Byrnes reunion! Ben Stiller, Robert De Niro, Teri Polo and director Jay Roach gathered for the 25th anniversary of “Meet the Parents,” a comedy of errors about male nurse Greg Focker (Stiller) who endures a lot of painfully awkward hijinx while visiting his girlfriend’s parents for the first time. De Niro plays Polo’s […]",
  "author": "Rebecca Rubin",
  "published": "Sat, 07 Jun 2025 21:57:49 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Ben Stiller",
    "Meet the Parents",
    "Robert De Niro",
    "Tribeca Festival"
  ],
  "byline": "Rebecca Rubin",
  "length": 3648,
  "excerpt": "Ben Stiller, Robert De Niro, Blythe Danner and Teri Polo gathered for the 25th anniversary of \"Meet the Parents.\"",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "It’s a Focker-Byrnes reunion! Ben Stiller, Robert De Niro, Teri Polo and director Jay Roach gathered for the 25th anniversary of “Meet the Parents,” a comedy of errors about male nurse Greg Focker (Stiller) who endures a lot of painfully awkward hijinx while visiting his girlfriend’s parents for the first time. De Niro plays Polo’s character’s father Greg Byrnes, a cat-loving retired CIA agent who rules with a well meaning (maybe?) but iron fist. They reunited at Manhattan’s Tribeca Performing Arts Center as part of this year’s Tribeca Festival, which was co-founded by De Niro and Jane Rosenthal in 2002. “It’s so much fun to hear laughter in a theater with comedy that’s 25 years old,” Stiller said during the Q\u0026A after the screening. “It still works.” Popular on Variety Though a quarter century has passed since “Meet the Parents,” Stiller finds that audiences continue to associate him with Greg Focker. He jokes that he doesn’t always love when people in the wild address him by his character’s name. “When someone yells ‘Focker!’ on the street, it doesn’t necessarily feel respectful,” Stiller said with a laugh. “Whenever I’m treated by a male nurse,” he added, “I feel a connection.” On stage, Roach reminded Stiller that he was almost never in the movie. Steven Spielberg was in talks to direct the film with Jim Carrey as the lead role. When the duo chose to depart the project, Roach was hired as the filmmaker and Stiller as the star. “[Jim Carrey] was going to be me?” Stiller said. “Shit. I totally forgot that part.” Meanwhile, Polo joined the cast as the better half of Stiller’s fiancée-to-be at the last minute. “It was really late in the casting process, a few days before we started shooting,” Roach recalled. “She was thrown into it with these heavyweights.” Polo joked that she spent the entire shoot “just sitting there, listening and reacting” to the ensemble around her. She remembers De Niro telling her that he doesn’t approach comedy any differently than he would a drama. “He said, ‘It’s the same thing, It’s the honestly in which you say the line. You’re not trying to be funny. You say it and really mean it,'” Polo said. “Meet the Parents” was a commercial hit, grossing more than $330 million worldwide against a $55 million budget. The foursome returned for 2004’s sequel “Meet the Fockers,” which introduced Greg’s parents (Barbra Streisand and Dustin Hoffman) who memorably taught audiences of the family’s bathroom policy: “If it’s yellow, let it mellow; if it’s brown, flush it down.” A third movie, 2010’s “Little Fockers,” was critically panned but managed to earned $310 million at the box office. Now, the “Meet the Parents” universe is expanding again. A fourth movie is in development with Ariana Grande among the new cast members. Stiller teased the fourquel, saying they needed an “organic reason” to revisit these characters. “What spurred the idea is that I’m the age that Bob was when we did the first movie,” Stiller said. “It felt like a mirror to the first film, where one of my kids is thinking about introducing his person to the family.” Though they didn’t share any plot details, De Niro revealed he’s read the screenplay. “The script is really fun,” he shared. “I’m looking forward to it.” In fact, De Niro claims he’s been pushing for another sequel for years now. “When we filmed the last one,” he said, “I was sitting with Ben and [screenwriter] John Hamburg. I said, ‘Let’s start writing the next one now.’ And they were just humoring me. Now we are finally doing the next one.”",
  "image": "https://variety.com/wp-content/uploads/2024/12/MSDMETH_EC021-e1733855980700.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tIt’s a Focker-Byrnes reunion! \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003ca href=\"https://variety.com/t/ben-stiller/\" id=\"auto-tag_ben-stiller\" data-tag=\"ben-stiller\"\u003eBen Stiller\u003c/a\u003e, \u003ca href=\"https://variety.com/t/robert-de-niro/\" id=\"auto-tag_robert-de-niro\" data-tag=\"robert-de-niro\"\u003eRobert De Niro\u003c/a\u003e, Teri Polo and director Jay Roach gathered for the 25th anniversary of “\u003ca href=\"https://variety.com/t/meet-the-parents/\" id=\"auto-tag_meet-the-parents\" data-tag=\"meet-the-parents\"\u003eMeet the Parents\u003c/a\u003e,” a comedy of errors about male nurse Greg Focker (Stiller) who endures a lot of painfully awkward hijinx while visiting his girlfriend’s parents for the first time. De Niro plays Polo’s character’s father Greg Byrnes, a cat-loving retired CIA agent who rules with a well meaning (maybe?) but iron fist. They reunited at Manhattan’s Tribeca Performing Arts Center as part of this year’s \u003ca href=\"https://variety.com/t/tribeca-festival/\" id=\"auto-tag_tribeca-festival\" data-tag=\"tribeca-festival\"\u003eTribeca Festival\u003c/a\u003e, which was co-founded by De Niro and Jane Rosenthal in 2002.\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\t“It’s so much fun to hear laughter in a theater with comedy that’s 25 years old,” Stiller said during the Q\u0026amp;A after the screening. “It still works.” \n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tThough a quarter century has passed since “Meet the Parents,” Stiller finds that audiences continue to associate him with Greg Focker. He jokes that he doesn’t always \u003cem\u003elove\u003c/em\u003e when people in the wild address him by his character’s name.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“When someone yells ‘Focker!’ on the street, it doesn’t necessarily feel respectful,” Stiller said with a laugh. “Whenever I’m treated by a male nurse,” he added, “I feel a connection.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tOn stage, Roach reminded Stiller that he was almost never in the movie. Steven Spielberg was in talks to direct the film with Jim Carrey as the lead role. When the duo chose to depart the project, Roach was hired as the filmmaker and Stiller as the star.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“[Jim Carrey] was going to be me?” Stiller said. “Shit. I totally forgot that part.”\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tMeanwhile, Polo joined the cast as the better half of Stiller’s fiancée-to-be at the last minute. “It was really late in the casting process, a few days before we started shooting,” Roach recalled. “She was thrown into it with these heavyweights.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tPolo joked that she spent the entire shoot “just sitting there, listening and reacting” to the ensemble around her. She remembers De Niro telling her that he doesn’t approach comedy any differently than he would a drama.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“He said, ‘It’s the same thing, It’s the honestly in which you say the line. You’re not trying to be funny. You say it and really mean it,\u0026#39;” Polo said.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Meet the Parents” was a commercial hit, grossing more than $330 million worldwide against a $55 million budget. The foursome returned for 2004’s sequel “Meet the Fockers,” which introduced Greg’s parents (Barbra Streisand and Dustin Hoffman) who memorably taught audiences of the family’s bathroom policy: “If it’s yellow, let it mellow; if it’s brown, flush it down.” A third movie, 2010’s “Little Fockers,” was critically panned but managed to earned $310 million at the box office.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tNow, the “Meet the Parents” universe is expanding again. A fourth movie is in development with Ariana Grande among the new cast members. Stiller teased the fourquel, saying they needed an “organic reason” to revisit these characters.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“What spurred the idea is that I’m the age that Bob was when we did the first movie,” Stiller said. “It felt like a mirror to the first film, where one of my kids is thinking about introducing his person to the family.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThough they didn’t share any plot details, De Niro revealed he’s read the screenplay. “The script is really fun,” he shared. “I’m looking forward to it.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn fact, De Niro claims he’s been pushing for another sequel for years now. “When we filmed the last one,” he said, “I was sitting with Ben and [screenwriter] John Hamburg. I said, ‘Let’s start writing the next one now.’ And they were just humoring me. Now we are finally doing the next one.”\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-06-07T21:57:49Z",
  "modifiedTime": "2025-06-07T23:39:16Z"
}
