{
  "id": "efdaa3f4-93bd-4436-bf4e-92a02296daae",
  "title": "Dredd 2 Was Never Going To Happen, So The Just-Announced Reboot Was Inevitable",
  "link": "https://www.slashfilm.com/1915252/dredd-2-never-happen-taika-waititi-reboot-inevitable/",
  "description": "Sorry, Dredd fans: Karl Urban almost certainly isn't going to be donning the helmet for the newly announced reboot from Taika Waititi.",
  "author": "Ryan Scott",
  "published": "Thu, 17 Jul 2025 21:14:10 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Movie News",
    "Action \u0026 Adventure Movies",
    "Science Fiction Movies"
  ],
  "byline": "Ryan Scott",
  "length": 4315,
  "excerpt": "Sorry, Dredd fans: Karl Urban almost certainly isn't going to be donning the helmet for the newly announced reboot from Taika Waititi.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slashfilm-favicon.png",
  "text": "Lionsgate It's official: A \"Judge Dredd\" reboot is in development. This time, \"Thor: Ragnarok\" director and Oscar winner Taika Waititi will be at the helm. He's teaming up with screenwriter Drew Pearce, the screenwriter of \"The Fall Guy\" and \"Mission: Impossible — Rogue Nation\" fame, making for an attractive duo. But fans of 2012's \"Dredd\" may be unhappy as this is a reboot and not a sequel, so don't expect to see Karl Urban putting the helmet back on. According to The Hollywood Reporter, the new \"Judge Dredd\" movie based on the character from the \"2000 AD\" comic series is being shopped to various Hollywood studios, with a bidding war likely to ensue. This project seemingly takes the place of the \"Judge Dredd: Mega-City One\" TV show that had been in the works since 2017. The franchise rights holders, Chris Kingsley, Jason Kingsley, and Ben Smith, are on board as producers alongside Roy Lee, Jeremy Platt, Natalie Viscuso, and Pearce. Plot details are currently under wraps, but the reports says the reboot will \"take inspiration more from the comics than the previous screen iterations, leaning into the world-building and dark humor.\" That sounds right up Waititi's alley, since he's the man who turned the \"Thor\" franchise into a superhero comedy with \"Ragnarok\" to great success. The report further states that it is \"meant to be a fun sci-fi blockbuster that nonetheless speaks to this moment in culture.\" Perhaps not surprisingly, this is also billed as the start of a possible \"Dredd\" universe, with other movies and/or shows to follow. But let's not get too ahead of ourselves just yet. First, this movie needs to find a studio. For fans, this may come as a blow as there was hope for many years that Urban would return for a \"Dredd\" sequel. Unfortunately, that was never going to happen, which made this reboot practically unavoidable. Dredd wasn't successful enough to start a franchise (at least not at first) Disney Directed by Pete Travis (with a major, uncredited assist from writer Alex Garland), \"Dredd\" first hit theaters in 2012 and was a gritty approach to the material found in the comics created by writer John Wagner and artist Carlos Ezquerra in the '70s. The previous big screen effort, 1995's \"Judge Dredd\" starring Sylvester Stallone, was a less serious affair as well as a major flop both critically and commercially. By contrast, \"Dredd\" was widely beloved, particularly by audiences. The only problem? The movie failed to connect at the box office, pulling in just $41 million against a budget of at least $30 million. The movie has since found a sizable audience, which kept hope alive for a sequel, but it never made any sense financially. Hence, \"Dredd 2\" was never a realistic expectation, regardless of any online clamoring. Any backlash from those who wanted the sequel regarding this reboot news will also fall on deaf ears. The post-theatrical interest in \"Dredd\" helped confirm for the rights holders that there is franchise potential in the property — it just has to be in a new direction with new talent. That's where Waititi comes in. He won an Oscar for \"Jojo Rabbit.\" He helped revive the \"Thor\" franchise and made one of Marvel's most beloved movies. He directed \"What We Do in the Shadows,\" which spawned a long-running TV show. He's got that combination of humor and spectacle that could offer something new to help this reboot stand out. On paper, it's easy to see why any studio would get excited about it. Waititi's \"Next Goal Wins\" was a financial disappointment and \"Thor: Love and Thunder\" was met with a mixed reception, but it was still a big hit. All this makes him a logical choice. The larger point, though, is that, be it with Waititi or someone else at the helm, a reboot was always going to happen. It was as inevitable as Thanos. The new \"Judge Dredd\" movie does not currently have a release date.",
  "image": "https://www.slashfilm.com/img/gallery/dredd-2-was-never-going-to-happen-so-the-just-announced-reboot-was-inevitable/l-intro-1752786729.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n        \n\u003cmain id=\"main\" role=\"main\" data-post-type=\"articles\"\u003e\n    \u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                                \n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1915252/dredd-2-never-happen-taika-waititi-reboot-inevitable/\" data-post-title=\"Dredd 2 Was Never Going To Happen, So The Just-Announced Reboot Was Inevitable\" data-slide-num=\"0\" data-post-id=\"1915252\"\u003e\n                                             \u003cpicture id=\"p81ebaf43e59316794007c3576a8a47a8\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/dredd-2-was-never-going-to-happen-so-the-just-announced-reboot-was-inevitable/intro-1752786729.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/dredd-2-was-never-going-to-happen-so-the-just-announced-reboot-was-inevitable/intro-1752786729.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/dredd-2-was-never-going-to-happen-so-the-just-announced-reboot-was-inevitable/intro-1752786729.jpg\" data-slide-url=\"https://www.slashfilm.com/1915252/dredd-2-never-happen-taika-waititi-reboot-inevitable/\" data-post-id=\"1915252\" data-slide-num=\"0\" data-slide-title=\"Dredd 2 Was Never Going To Happen, So The Just-Announced Reboot Was Inevitable: \" width=\"780\" height=\"438\" alt=\"Karl Urban as Judge Dredd standing in front of the flag in Dredd\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eLionsgate\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n                \n                \n\u003cp dir=\"ltr\"\u003eIt\u0026#39;s official: A \u0026#34;Judge Dredd\u0026#34; reboot is in development. This time, \u0026#34;Thor: Ragnarok\u0026#34; director and Oscar winner Taika Waititi will be at the helm. He\u0026#39;s teaming up with screenwriter Drew Pearce, the screenwriter of \u0026#34;The Fall Guy\u0026#34; and \u0026#34;Mission: Impossible — Rogue Nation\u0026#34; fame, making for an attractive duo. But fans of 2012\u0026#39;s \u0026#34;Dredd\u0026#34; may be unhappy as this is a reboot and not a sequel, so don\u0026#39;t expect to see Karl Urban putting the helmet back on.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eAccording to \u003ca href=\"https://www.hollywoodreporter.com/movies/movie-news/taika-waititi-tackling-judge-dredd-movie-1236311752/\" target=\"_blank\"\u003eThe Hollywood Reporter\u003c/a\u003e, the new \u0026#34;Judge Dredd\u0026#34; movie based on the character from the \u0026#34;2000 AD\u0026#34; comic series is being shopped to various Hollywood studios, with a bidding war likely to ensue. This project seemingly takes the place of the \u003ca href=\"https://www.slashfilm.com/559783/judge-dredd-tv-show-script/\" target=\"_blank\"\u003e\u0026#34;Judge Dredd: Mega-City One\u0026#34; TV show that had been in the works since 2017\u003c/a\u003e. The franchise rights holders, Chris Kingsley, Jason Kingsley, and Ben Smith, are on board as producers alongside Roy Lee, Jeremy Platt, Natalie Viscuso, and Pearce.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003ePlot details are currently under wraps, but the reports says the reboot will \u0026#34;take inspiration more from the comics than the previous screen iterations, leaning into the world-building and dark humor.\u0026#34; That sounds right up Waititi\u0026#39;s alley, \u003ca href=\"https://www.slashfilm.com/557784/thor-ragnarok-revisited/\" target=\"_blank\"\u003esince he\u0026#39;s the man who turned the \u0026#34;Thor\u0026#34; franchise into a superhero comedy with \u0026#34;Ragnarok\u0026#34;\u003c/a\u003e to great success. The report further states that it is \u0026#34;meant to be a fun sci-fi blockbuster that nonetheless speaks to this moment in culture.\u0026#34; Perhaps not surprisingly, this is also billed as the start of a possible \u0026#34;Dredd\u0026#34; universe, with other movies and/or shows to follow.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eBut let\u0026#39;s not get too ahead of ourselves just yet. First, this movie needs to find a studio. For fans, this may come as a blow as there was hope for many years that Urban would return for a \u0026#34;Dredd\u0026#34; sequel. Unfortunately, that was never going to happen, which made this reboot practically unavoidable.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eDredd wasn\u0026#39;t successful enough to start a franchise (at least not at first)\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1915252/dredd-2-never-happen-taika-waititi-reboot-inevitable/\" data-post-title=\"Dredd 2 Was Never Going To Happen, So The Just-Announced Reboot Was Inevitable\" data-slide-num=\"1\" data-post-id=\"1915252\"\u003e\n                                             \u003cpicture id=\"pc7f5b51cc9b92c63b231282ddedd4449\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/dredd-2-was-never-going-to-happen-so-the-just-announced-reboot-was-inevitable/dredd-wasnt-successful-enough-to-start-a-franchise-at-least-not-at-first-1752786730.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/dredd-2-was-never-going-to-happen-so-the-just-announced-reboot-was-inevitable/dredd-wasnt-successful-enough-to-start-a-franchise-at-least-not-at-first-1752786730.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/dredd-2-was-never-going-to-happen-so-the-just-announced-reboot-was-inevitable/dredd-wasnt-successful-enough-to-start-a-franchise-at-least-not-at-first-1752786730.jpg\" data-slide-url=\"https://www.slashfilm.com/1915252/dredd-2-never-happen-taika-waititi-reboot-inevitable/\" data-post-id=\"1915252\" data-slide-num=\"1\" data-slide-title=\"Dredd 2 Was Never Going To Happen, So The Just-Announced Reboot Was Inevitable: Dredd wasn\u0026#39;t successful enough to start a franchise (at least not at first)\" width=\"780\" height=\"438\" alt=\"Sylvester Stallone as Judge Dredd shooting his gun in Judge Dredd\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eDisney\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eDirected by Pete Travis (\u003ca href=\"https://www.slashfilm.com/1836535/alex-garland-seemingly-confirms-ghost-directed-sci-fi-classic-dredd/\" target=\"_blank\"\u003ewith a major, uncredited assist from writer Alex Garland\u003c/a\u003e), \u0026#34;Dredd\u0026#34; first hit theaters in 2012 and was a gritty approach to the material found in the comics created by writer John Wagner and artist Carlos Ezquerra in the \u0026#39;70s. The previous big screen effort, 1995\u0026#39;s \u0026#34;Judge Dredd\u0026#34; starring Sylvester Stallone, was a less serious affair as well as a major flop both critically and commercially.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eBy contrast, \u0026#34;Dredd\u0026#34; was widely beloved, particularly by audiences. The only problem? \u003ca href=\"https://www.slashfilm.com/992305/tales-from-the-box-office-the-financial-failure-of-dredd-remains-a-tragedy/\" target=\"_blank\"\u003eThe movie failed to connect at the box office, pulling in just $41 million\u003c/a\u003e against a budget of at least $30 million. The movie has since found a sizable audience, which kept hope alive for a sequel, but it never made any sense financially. Hence, \u0026#34;Dredd 2\u0026#34; was never a realistic expectation, regardless of any online clamoring. Any backlash from those who wanted the sequel regarding this reboot news will also fall on deaf ears.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eThe post-theatrical interest in \u0026#34;Dredd\u0026#34; helped confirm for the rights holders that there is franchise potential in the property — it just has to be in a new direction with new talent. That\u0026#39;s where Waititi comes in. He won an Oscar for \u0026#34;Jojo Rabbit.\u0026#34; He helped revive the \u0026#34;Thor\u0026#34; franchise and made one of Marvel\u0026#39;s most beloved movies. He directed \u0026#34;What We Do in the Shadows,\u0026#34; which spawned a long-running TV show. He\u0026#39;s got that combination of humor and spectacle that could offer something new to help this reboot stand out. On paper, it\u0026#39;s easy to see why any studio would get excited about it.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eWaititi\u0026#39;s \u0026#34;Next Goal Wins\u0026#34; was a financial disappointment and \u003ca href=\"https://www.slashfilm.com/915626/thor-love-and-thunder-review-a-shaky-attempt-to-recapture-lightning-in-a-bottle/\" target=\"_blank\"\u003e\u0026#34;Thor: Love and Thunder\u0026#34; was met with a mixed reception\u003c/a\u003e, but it was still a big hit. All this makes him a logical choice. The larger point, though, is that, be it with Waititi or someone else at the helm, a reboot was always going to happen. It was as inevitable as Thanos.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eThe new \u0026#34;Judge Dredd\u0026#34; movie does not currently have a release date.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\n    \n    \u003c/main\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-07-17T21:14:10Z",
  "modifiedTime": "2025-07-17T21:14:10Z"
}
