{
  "id": "f3e01a91-ea1f-4430-9b5c-86565d02c3c8",
  "title": "Weapons: First Teaser Of Zach Cregger's New Film Released",
  "link": "https://bleedingcool.com/movies/weapons-first-teaser-of-zach-creggers-new-film-released/",
  "description": "Warner Bros. and New Line Cinema have released a brief teaser for Zach Cregger's new film, Weapons, which will be released on August 8, 2025.",
  "author": "Kaitlyn Booth",
  "published": "Mon, 21 Apr 2025 18:19:06 -0500",
  "source": "https://www.bleedingcool.com/movies/feed/",
  "categories": [
    "Movies",
    "New Line Cinema",
    "Warner Bros",
    "weapons"
  ],
  "byline": "Kaitlyn Booth",
  "length": 6332,
  "excerpt": "New Line Cinema and Warner Bros. have released the first teaser for Weapons, the new film from writer/director Zach Cregger. We got to see some footage from the film at CinemaCon earlier this month, and last week, the New Line socials started teasing things. The viral site for the movie, which talks about the inciting incident, also […]",
  "siteName": "Bleeding Cool News",
  "favicon": "",
  "text": "Posted in: Movies, New Line Cinema, Warner Bros | Tagged: weaponsWarner Bros. and New Line Cinema have released a brief teaser for Zach Cregger's new film, Weapons, which will be released on August 8, 2025.Article Summary Warner Bros. releases first teaser for \"Weapons,\" directed by Zach Cregger, set for August 8, 2025 release. The teaser follows previous footage shown at CinemaCon, with a viral site adding more mystery to the plot. The film's website reveals 17 children vanish at 2:17 AM, leaving a small town puzzled and seeking answers. \"Weapons\" promises suspense, drawing comparisons to the surprise success of Cregger's \"Barbarian.\" New Line Cinema and Warner Bros. have released the first teaser for Weapons, the new film from writer/director Zach Cregger. We got to see some footage from the film at CinemaCon earlier this month, and last week, the New Line socials started teasing things. The viral site for the movie, which talks about the inciting incident, also went live. New Line is doing the smart thing and continuing to play this one close to the chest. The movie doesn't come out until August, but the twist in Barbarian worked best if you didn't see it coming, and we can hope that New Line will promote this film in a similar way. Here is the text from the in-universe website about the disappearance: \"17 Local Children Leave Home Simultaneously at 2:17AM A chilling mystery has gripped the small town of Maybrook after 17 children voluntarily left their homes Wednesday morning. Authorities are baffled by the inexplicable disappearance, which has shaken the community to its core. Upon investigation, front door camera footage showed the children leaving their homes at 2:17am Wednesday morning without any signs of force. Since then, little information has surfaced, and the case continues to baffle investigators. In response, a school gathering was held, where growing unease among parents became clear. As the town struggles to understand what happened, officials continue to urge the public for any leads, while Maybrook is left waiting for answers.\" Weapons Screencap. Credit: Warner Bros./New Line Cinema Weapons: Summary, Cast List, Release Date This is where the story really starts. From New Line Cinema and Zach Cregger, the wholly original mind behind Barbarian, comes a new horror/thriller: Weapons. When all but one child from the same class mysteriously vanish on the same night at exactly the same time, a community is left questioning who or what is behind their disappearance. The film stars Josh Brolin, Julia Garner, Alden Ehrenreich, Austin Abrams, Cary Christopher, with Benedict Wong, and Amy Madigan. Cregger directs from his own screenplay, and also produces alongside Roy Lee, Miri Yoon, J.D. Lifshitz and Raphael Margules, with Michelle Morrissey and Josh Brolin executive producing. The filmmaker's creative team behind the camera includes director of photography Larkin Seiple, production designer Tom Hammock, editor Joe Murphy and costume designer Trish Sommerville. The music is by Ryan Holladay, Hays Holladay and Zach Cregger. New Line Cinema Presents a Subconscious/Vertigo Entertainment/Boulderlight Pictures Production, a Zach Cregger Film, Weapons. It will be distributed by Warner Bros. Pictures, and released in theaters and IMAX nationwide on August 8, 2025, and internationally beginning in August 2025. Enjoyed this? Please share on social media! Stay up-to-date and support the site by following Bleeding Cool on Google News today! About Kaitlyn BoothKaitlyn is the Editor-in-Chief at Bleeding Cool. Film critic and pop culture writer since 2013. Ace. Leftist. Nerd. Feminist. Writer. Replicant Translator. Cinephillic Virtue Signaler. She/Her. UFCA/GALECA Member. 🍅 Approved. Follow her Threads, Instagram, and Twitter @katiesmovies.Latest by Kaitlyn BoothWeapons: First Teaser Of Zach Cregger's New Film ReleasedWarner Bros. and New Line Cinema have released a brief teaser for Zach Cregger's new film, Weapons, which will be released on August 8, 2025.How to Train Your Dragon: The Cavaliers Are On Fire In A New TV SpotUniversal has released a new tie-in TV spot with the Cleveland Cavaliers and How to Train Your Dragon. The film will be released on June 13, 2025.Guillermo del Toro's Frankenstein: Elordi Watched Every Creature FilmGuillermo del Toro's Frankenstein star Jacob Elordi says he watched \"every creature film\" with Mike Hill, who designed the creature and ran prosthetics.New Jurassic World Rebirth Tie-In TV Spot With The NBAUniversal has released a new TV spot for Jurassic World Rebirth, a tie-in spot with the NBA. The film will be released on July 2nd.Toy Story 5: Tim Allen Says It Is \"A Lot About Jessie\"Toy Story 5 star Tim Allen can't tell us much about the film, but he says, \"It's a lot about Jessie.\" The film will be released on June 19, 2026.Lilo \u0026 Stitch: New International Poster And 2 HQ Images ReleasedDisney has released a new international poster and two high-quality images from Lilo \u0026 Stitch, the next live-action remake, which hits theaters next month.Latest in MoviesSinners Takes Over Top Spot At Weekend Box OfficeSinners shocked Hollywood by igniting the weekend box office and taking the top spot away from two-time champ A Minecraft Movie.Weapons: First Teaser Of Zach Cregger's New Film ReleasedWarner Bros. and New Line Cinema have released a brief teaser for Zach Cregger's new film, Weapons, which will be released on August 8, 2025.James Gunn Big Fan of John Cena Beating Cody Rhodes: \"That's Right\"James Gunn seems pretty proud that John Cena defended their \"Peacemaker\" honor by beating Cody Rhodes at WWE WrestleMania 41 on Sunday night.Star Wars Series In Development From Carlton Cuse, Nick Cuse: ReportReports are that Carlton Cuse (LOST) and his son, Nick Cuse (Watchmen), are developing a new series set in the \"Star Wars\" universe.Star Wars: Visions Vol. 3 Episode Titles, Overviews \u0026 Images ReleasedArriving this October, here are the episode titles, overviews, and SWCJ images for Lucasfilm and Disney+'s Star Wars: Visions Volume 3.Andor Season 2 Sneak Peek: Cassian Puts His TIE Fighter to Good UseIt's a \"Fight in the Fields\" in a new clip from series creator Tony Gilroy, Disney+, and Lucasfilm's Diego Luna-starring Andor Season 2.",
  "image": "https://bleedingcool.com/wp-content/uploads/2025/04/weapons-screencap-2000x1125.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n\u003csection\u003e\u003carticle id=\"article\" data-post-id=\"2206906\" itemscope=\"\" itemtype=\"http://schema.org/Article\"\u003e\u003cp\u003ePosted in: \u003ca href=\"https://bleedingcool.com/movies/\" rel=\"category\"\u003eMovies\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/movies/new-line-cinema/\" rel=\"category\"\u003eNew Line Cinema\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/movies/warner-bros/\" rel=\"category\"\u003eWarner Bros\u003c/a\u003e | Tagged: \u003ca href=\"https://bleedingcool.com/tag/weapons/\" rel=\"tag\"\u003eweapons\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\u003cp\u003eWarner Bros. and New Line Cinema have released a brief teaser for Zach Cregger\u0026#39;s new film, Weapons, which will be released on August 8, 2025.\u003c/p\u003e\u003chr/\u003e\u003chr/\u003e\u003cdiv id=\"post_summary\"\u003e\u003ch2\u003eArticle Summary\u003c/h2\u003e\u003cul\u003e\n\u003cli\u003eWarner Bros. releases first teaser for \u0026#34;Weapons,\u0026#34; directed by Zach Cregger, set for August 8, 2025 release.\u003c/li\u003e\n\u003cli\u003eThe teaser follows previous footage shown at CinemaCon, with a viral site adding more mystery to the plot.\u003c/li\u003e\n\u003cli\u003eThe film\u0026#39;s website reveals 17 children vanish at 2:17 AM, leaving a small town puzzled and seeking answers.\u003c/li\u003e\n\u003cli\u003e\u0026#34;Weapons\u0026#34; promises suspense, drawing comparisons to the surprise success of Cregger\u0026#39;s \u0026#34;Barbarian.\u0026#34;\u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003chr/\u003e\u003cp\u003e\u003ciframe width=\"1170\" height=\"658\" srcdoc=\"\u0026lt;style\u0026gt;*{padding:0;margin:0;overflow:hidden}html,body{height:100%}img,span{position:absolute;width:100%;top:0;bottom:0;margin:auto}span{height:1.5em;text-align:center;font:48px/1.5 sans-serif;color:white;text-shadow:0 0 0.5em black}\u0026lt;/style\u0026gt;\u0026lt;a href=https://www.youtube.com/embed/I3qtHlROEuc?feature=oembed?autoplay=1\u0026gt;\u0026lt;img src=https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://img.youtube.com/vi/I3qtHlROEuc/hqdefault.jpg loading=\u0026#34;lazy\u0026#34; alt=\u0026#34;Link to play video.\u0026#34;\u0026gt;\u0026lt;span\u0026gt;▶\u0026lt;/span\u0026gt;\u0026lt;/a\u0026gt;\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture; fullscreen;\" loading=\"lazy\" src=\"https://www.youtube.com/embed/I3qtHlROEuc?feature=oembed\" title=\"Youtube Video\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003cp\u003eNew Line Cinema and Warner Bros. have released the first teaser for \u003cem\u003eWeapons\u003c/em\u003e, the new film from writer/director \u003cstrong\u003eZach Cregger\u003c/strong\u003e. We got to see some footage from the film \u003ca href=\"https://bleedingcool.com/movies/cinemacon-2025-warner-bros-the-big-picture-presentation-liveblog/\"\u003eat CinemaCon\u003c/a\u003e earlier this month, and last week, the New Line socials started teasing things. \u003ca href=\"https://www.maybrookmissing.net/\"\u003eThe viral site\u003c/a\u003e for the movie, which talks about the inciting incident, also went live. New Line is doing the smart thing and continuing to play this one close to the chest. The movie doesn\u0026#39;t come out until August, but the twist in \u003cem\u003eBarbarian\u003c/em\u003e worked best if you didn\u0026#39;t see it coming, and we can hope that New Line will promote this film in a similar way. Here is the text from the in-universe website about the disappearance:\u003c/p\u003e\n\u003cp\u003e\u0026#34;17 Local Children Leave Home Simultaneously at 2:17AM\u003c/p\u003e\n\u003cp\u003eA chilling mystery has gripped the small town of Maybrook after 17 children voluntarily left their homes Wednesday morning. Authorities are baffled by the inexplicable disappearance, which has shaken the community to its core. Upon investigation, front door camera footage showed the children leaving their homes at 2:17am Wednesday morning without any signs of force. Since then, little information has surfaced, and the case continues to baffle investigators.\u003c/p\u003e\n\u003cp\u003eIn response, a school gathering was held, where growing unease among parents became clear. As the town struggles to understand what happened, officials continue to urge the public for any leads, while Maybrook is left waiting for answers.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"attachment_2206907\" aria-describedby=\"caption-attachment-2206907\"\u003e\u003ca href=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://bleedingcool.com/wp-content/uploads/2025/04/weapons-screencap.jpg\"\u003e\u003cimg src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:252/q:75/https://bleedingcool.com/wp-content/uploads/2025/04/weapons-screencap.jpg\" alt=\"A young child is running on an empty, dimly lit street at night, with shadows cast on the wet pavement from streetlights and trees.\" width=\"600\" height=\"252\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:252/q:75/https://bleedingcool.com/wp-content/uploads/2025/04/weapons-screencap.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20600%20252%22%20width%3D%22600%22%20height%3D%22252%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2206907\"\u003eWeapons Screencap. Credit: Warner Bros./New Line Cinema\u003c/figcaption\u003e\u003c/figure\u003e\n\u003ch2\u003e\u003cem\u003eWeapons:\u003c/em\u003e Summary, Cast List, Release Date\u003c/h2\u003e\n\u003cp\u003e\u003cspan dir=\"auto\"\u003eThis is where the story really starts.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan dir=\"auto\"\u003eFrom New Line Cinema and \u003cstrong\u003eZach Cregger\u003c/strong\u003e, the wholly original mind behind \u003cem\u003eBarbarian\u003c/em\u003e, comes a new horror/thriller: \u003cem\u003eWeapons\u003c/em\u003e. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan dir=\"auto\"\u003eWhen all but one child from the same class mysteriously vanish on the same night at exactly the same time, a community is left questioning who or what is behind their disappearance. The film stars \u003cstrong\u003eJosh Brolin\u003c/strong\u003e, \u003cstrong\u003eJulia Garner\u003c/strong\u003e, \u003cstrong\u003eAlden Ehrenreich\u003c/strong\u003e, \u003cstrong\u003eAustin Abrams\u003c/strong\u003e, \u003cstrong\u003eCary Christopher\u003c/strong\u003e, with \u003cstrong\u003eBenedict Wong\u003c/strong\u003e, and \u003cstrong\u003eAmy Madigan\u003c/strong\u003e. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan dir=\"auto\"\u003eCregger directs from his own screenplay, and also produces alongside \u003cstrong\u003eRoy Lee\u003c/strong\u003e, \u003cstrong\u003eMiri Yoon\u003c/strong\u003e, \u003cstrong\u003eJ.D. Lifshitz\u003c/strong\u003e and \u003cstrong\u003eRaphael Margules\u003c/strong\u003e, with \u003cstrong\u003eMichelle Morrissey\u003c/strong\u003e and Josh Brolin executive producing. The filmmaker\u0026#39;s creative team behind the camera includes director of photography \u003cstrong\u003eLarkin Seiple\u003c/strong\u003e, production designer \u003cstrong\u003eTom Hammock\u003c/strong\u003e, editor \u003cstrong\u003eJoe Murphy\u003c/strong\u003e and costume designer \u003cstrong\u003eTrish Sommerville\u003c/strong\u003e. The music is by \u003cstrong\u003eRyan Holladay\u003c/strong\u003e, \u003cstrong\u003eHays Holladay\u003c/strong\u003e and Zach Cregger. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan dir=\"auto\"\u003eNew Line Cinema Presents a Subconscious/Vertigo Entertainment/Boulderlight Pictures Production, a Zach Cregger Film, \u003cem\u003eWeapons\u003c/em\u003e. It will be distributed by Warner Bros. Pictures, and released in theaters and IMAX nationwide on August 8, 2025, and internationally beginning in August 2025.\u003c/span\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cdiv id=\"bc_sharing_is_caring\"\u003e\u003ccenter\u003e\u003cp\u003e\u003cstrong\u003eEnjoyed this? Please share on social media!\u003c/strong\u003e\u003c/p\u003e\u003ca href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fweapons-first-teaser-of-zach-creggers-new-film-released%2F\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://twitter.com/share?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fweapons-first-teaser-of-zach-creggers-new-film-released%2F\u0026amp;text=Weapons%3A+First+Teaser+Of+Zach+Cregger%27s+New+Film+Released\u0026amp;via=bleedingcool\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"http://pinterest.com/pin/create/button/?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fweapons-first-teaser-of-zach-creggers-new-film-released%2F\u0026amp;description=Weapons%3A+First+Teaser+Of+Zach+Cregger%27s+New+Film+Released\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://reddit.com/submit?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fweapons-first-teaser-of-zach-creggers-new-film-released%2F\u0026amp;title=Weapons%3A+First+Teaser+Of+Zach+Cregger%27s+New+Film+Released\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003c/center\u003e\u003c/div\u003e\n    \u003ca id=\"google_follow\" href=\"https://news.google.com/publications/CAAqBwgKMPHflgsw1IauAw?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n        \u003cp\u003e\u003cimg width=\"100\" height=\"81\u0026#34;\" src=\"https://bleedingcool.com/Google_News_icon.png\"/\u003e\n        \u003c/p\u003e\n        \u003cp\u003e\n            Stay up-to-date and support the site by following Bleeding Cool on Google News today!\n        \u003c/p\u003e\n    \u003c/a\u003e\u003c/article\u003e\u003csection\u003e\u003ch2\u003e\u003cimg data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:150/h:150/q:75/https://www.gravatar.com/avatar/c6bcaa58a7b5119a6d358a10f6547af6?s=150\" src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20150%20150%22%20width%3D%22150%22%20height%3D%22150%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\" width=\"150px\" height=\"150px\" alt=\"Kaitlyn Booth\"/\u003eAbout \u003ca href=\"https://bleedingcool.com/author/kbooth/\"\u003eKaitlyn Booth\u003c/a\u003e\u003c/h2\u003eKaitlyn is the Editor-in-Chief at Bleeding Cool. Film critic and pop culture writer since 2013. Ace. Leftist. Nerd. Feminist. Writer. Replicant Translator. Cinephillic Virtue Signaler. She/Her. UFCA/GALECA Member. 🍅 Approved. Follow her Threads, Instagram, and Twitter @katiesmovies.\u003c/section\u003e\u003c/section\u003e\u003cdiv id=\"read_more\"\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca href=\"https://bleedingcool.com/author/kbooth/\" rel=\"bookmark\"\u003eLatest by Kaitlyn Booth\u003c/a\u003e\u003c/h2\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/weapons-first-teaser-of-zach-creggers-new-film-released/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/04/weapons-screencap-350x350.jpg\" alt=\"A young child is running on an empty, dimly lit street at night, with shadows cast on the wet pavement from streetlights and trees.\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/04/weapons-screencap-350x350.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/weapons-first-teaser-of-zach-creggers-new-film-released/\"\u003e\u003ch3 rel=\"bookmark\"\u003eWeapons: First Teaser Of Zach Cregger\u0026#39;s New Film Released\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eWarner Bros. and New Line Cinema have released a brief teaser for Zach Cregger\u0026#39;s new film, Weapons, which will be released on August 8, 2025.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/how-to-train-your-dragon-the-cavaliers-are-on-fire-in-a-new-tv-spot/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/02/2569_TP2_00053R-350x350.jpg\" alt=\"How to Train Your Dragon:\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/02/2569_TP2_00053R-350x350.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/how-to-train-your-dragon-the-cavaliers-are-on-fire-in-a-new-tv-spot/\"\u003e\u003ch3 rel=\"bookmark\"\u003eHow to Train Your Dragon: The Cavaliers Are On Fire In A New TV Spot\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eUniversal has released a new tie-in TV spot with the Cleveland Cavaliers and How to Train Your Dragon. The film will be released on June 13, 2025.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/guillermo-del-toros-frankenstein-elordi-watched-every-creature-film/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2024/01/shutterstock_2148955687-350x350.jpg\" alt=\"Auto Draft\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2024/01/shutterstock_2148955687-350x350.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/guillermo-del-toros-frankenstein-elordi-watched-every-creature-film/\"\u003e\u003ch3 rel=\"bookmark\"\u003eGuillermo del Toro\u0026#39;s Frankenstein: Elordi Watched Every Creature Film\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eGuillermo del Toro\u0026#39;s Frankenstein star Jacob Elordi says he watched \u0026#34;every creature film\u0026#34; with Mike Hill, who designed the creature and ran prosthetics.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/new-jurassic-world-rebirth-tie-in-tv-spot-with-the-nba/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/02/2583_D010_01066R-350x350.jpg\" alt=\"New Jurassic World Rebirth Tie-In TV Spot With The NBA\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/02/2583_D010_01066R-350x350.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/new-jurassic-world-rebirth-tie-in-tv-spot-with-the-nba/\"\u003e\u003ch3 rel=\"bookmark\"\u003eNew Jurassic World Rebirth Tie-In TV Spot With The NBA\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eUniversal has released a new TV spot for Jurassic World Rebirth, a tie-in spot with the NBA. The film will be released on July 2nd.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/toy-story-5-tim-allen-says-it-is-a-lot-about-jessie/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2024/11/TOYSTORY5-ONLINE-USE_D23B_008_C.pub16-350x350.jpg\" alt=\"Toy Story 5\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2024/11/TOYSTORY5-ONLINE-USE_D23B_008_C.pub16-350x350.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/toy-story-5-tim-allen-says-it-is-a-lot-about-jessie/\"\u003e\u003ch3 rel=\"bookmark\"\u003eToy Story 5: Tim Allen Says It Is \u0026#34;A Lot About Jessie\u0026#34;\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eToy Story 5 star Tim Allen can\u0026#39;t tell us much about the film, but he says, \u0026#34;It\u0026#39;s a lot about Jessie.\u0026#34; The film will be released on June 19, 2026.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/lilo-stitch-new-international-poster-and-2-hq-images-released/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/03/LNS-TP-00087564-350x350.jpg\" alt=\"Lilo \u0026amp; Stitch\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/03/LNS-TP-00087564-350x350.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/lilo-stitch-new-international-poster-and-2-hq-images-released/\"\u003e\u003ch3 rel=\"bookmark\"\u003eLilo \u0026amp; Stitch: New International Poster And 2 HQ Images Released\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eDisney has released a new international poster and two high-quality images from Lilo \u0026amp; Stitch, the next live-action remake, which hits theaters next month.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca href=\"https://bleedingcool.com/movies/\" rel=\"bookmark\"\u003eLatest in Movies\u003c/a\u003e\u003c/h2\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/weekend-box-office-sinners-a-minecraft-movie-king-of-kings/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/02/rev-1-GRC-FP-001r_High_Res_JPEG-350x350.jpeg\" alt=\"Sinners:\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/02/rev-1-GRC-FP-001r_High_Res_JPEG-350x350.jpeg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/weekend-box-office-sinners-a-minecraft-movie-king-of-kings/\"\u003e\u003ch3 rel=\"bookmark\"\u003eSinners Takes Over Top Spot At Weekend Box Office\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eSinners shocked Hollywood by igniting the weekend box office and taking the top spot away from two-time champ A Minecraft Movie.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/weapons-first-teaser-of-zach-creggers-new-film-released/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/04/weapons-screencap-350x350.jpg\" alt=\"A young child is running on an empty, dimly lit street at night, with shadows cast on the wet pavement from streetlights and trees.\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/04/weapons-screencap-350x350.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/weapons-first-teaser-of-zach-creggers-new-film-released/\"\u003e\u003ch3 rel=\"bookmark\"\u003eWeapons: First Teaser Of Zach Cregger\u0026#39;s New Film Released\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eWarner Bros. and New Line Cinema have released a brief teaser for Zach Cregger\u0026#39;s new film, Weapons, which will be released on August 8, 2025.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/tv/james-gunn-big-fan-of-john-cena-beating-cody-rhodes-thats-right/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/04/MixCollage-21-Apr-2025-05-25-PM-2393-350x350.jpg\" alt=\"James Gunn Big Fan of John Cena Beating Cody Rhodes: \u0026#34;That\u0026#39;s Right\u0026#34;\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/04/MixCollage-21-Apr-2025-05-25-PM-2393-350x350.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/tv/james-gunn-big-fan-of-john-cena-beating-cody-rhodes-thats-right/\"\u003e\u003ch3 rel=\"bookmark\"\u003eJames Gunn Big Fan of John Cena Beating Cody Rhodes: \u0026#34;That\u0026#39;s Right\u0026#34;\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eJames Gunn seems pretty proud that John Cena defended their \u0026#34;Peacemaker\u0026#34; honor by beating Cody Rhodes at WWE WrestleMania 41 on Sunday night.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/tv/star-wars-series-in-development-from-carlton-cuse-nick-cuse-report/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/04/MixCollage-21-Apr-2025-04-41-PM-945-350x350.jpg\" alt=\"Star Wars\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/04/MixCollage-21-Apr-2025-04-41-PM-945-350x350.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/tv/star-wars-series-in-development-from-carlton-cuse-nick-cuse-report/\"\u003e\u003ch3 rel=\"bookmark\"\u003eStar Wars Series In Development From Carlton Cuse, Nick Cuse: Report\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eReports are that Carlton Cuse (LOST) and his son, Nick Cuse (Watchmen), are developing a new series set in the \u0026#34;Star Wars\u0026#34; universe.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/tv/star-wars-visions-vol-3-episode-titles-overviews-images-released/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/04/StarWarsCelebration25Tokyo_235_dRXtcrRj-350x350.jpg\" alt=\"Star Wars: Visions Vol. 3 Episode Titles, Overviews \u0026amp;#038; Images Released\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/04/StarWarsCelebration25Tokyo_235_dRXtcrRj-350x350.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/tv/star-wars-visions-vol-3-episode-titles-overviews-images-released/\"\u003e\u003ch3 rel=\"bookmark\"\u003eStar Wars: Visions Vol. 3 Episode Titles, Overviews \u0026amp; Images Released\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eArriving this October, here are the episode titles, overviews, and SWCJ images for Lucasfilm and Disney+\u0026#39;s Star Wars: Visions Volume 3.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/tv/andor-season-2-sneak-peek-cassian-puts-his-tie-fighter-to-good-use/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/04/PGM2-FF-001959-2-350x350.jpg\" alt=\"Andor\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/04/PGM2-FF-001959-2-350x350.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/tv/andor-season-2-sneak-peek-cassian-puts-his-tie-fighter-to-good-use/\"\u003e\u003ch3 rel=\"bookmark\"\u003eAndor Season 2 Sneak Peek: Cassian Puts His TIE Fighter to Good Use\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eIt\u0026#39;s a \u0026#34;Fight in the Fields\u0026#34; in a new clip from series creator Tony Gilroy, Disney+, and Lucasfilm\u0026#39;s Diego Luna-starring Andor Season 2.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-04-21T18:19:06-05:00",
  "modifiedTime": "2025-04-21T18:19:06-05:00"
}
