{
  "id": "f943b4da-2576-4e6c-8519-593a1c275f71",
  "title": "Arienne Mandi Joins ‘Chicago P.D.’ For Season 13 As New Series Regular",
  "link": "https://deadline.com/2025/07/arienne-mandi-cast-chicago-pd-season-13-1236465450/",
  "description": "Arienne Mandi (The Night Agent) has joined the cast of Chicago P.D. as a series regular for Season 13. Sources close to production tell Deadline, Mandi will play Chicago P.D. officer Naomi Kerr. She is a former soldier and military contractor who is said to thrive in dangerous situations. She is described as a fearless […]",
  "author": "Rosy Cordero",
  "published": "Wed, 23 Jul 2025 00:00:00 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "Casting",
    "News",
    "Arienne Mandi",
    "Chicago P.D.",
    "NBC"
  ],
  "byline": "Rosy Cordero",
  "length": 2096,
  "excerpt": "Arienne Mandi Joins 'Chicago P.D.' For Season 13 As New Series Regular",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "Arienne Mandi (The Night Agent) has joined the cast of Chicago P.D. as a series regular for Season 13. Sources close to production tell Deadline, Mandi will play Chicago P.D. officer Naomi Kerr. She is a former soldier and military contractor who is said to thrive in dangerous situations. She is described as a fearless outsider who keeps her cards close to the vest. Names and character descriptions could be changed at any stage of production. Chicago P.D. follows the men and women of the Chicago Police Department’s elite Intelligence Unit, combatting the city’s most heinous offenses – organized crime, drug trafficking, high-profile murders and beyond. Naomi arrives at a particularly chaotic time for the team, following the murder of Deputy Chief Charlie Reid (Shawn Hatosy), orchestrated by Sergeant Hank Voight (Jason Beghe). Although Detective Kim Burgess (Marina Squerciati) and Officer Dante Torres (Benjamin Levy Aguilar) are off the hook for the latter’s affair with his CI and the former covering it up, there’s no telling what the fallout will be just yet. Watch on Deadline LaRoyce Hawkins and Patrick Flueger also star. The addition of Mandi follows Deadline’s exclusive news last month that Toya Turner exited the NBC police procedural as Kiana Cook and will not appear in Season 13. She told us at the time, “I’m grateful for the time I had bringing Kiana to life. Thank you to everyone who welcomed me so warmly.” Chicago P.D. is executive produced by Dick Wolf, Gwen Sigan, Chad Saxton, Gavin Harris,Jason Beghe and Peter Jankowski. Universal Television, a division of Universal Studio Group, in association with Wolf Entertainment, produces the series. Mandi currently stars in Season 2 of Netflix’s The Night Agent. She co-stars in Guy Nattiv’s award-winning feature Tatami, which premiered at the Venice Film Festival.  She will next be seen starring opposite Jon Hamm in season 2 of Apple TV+’s Your Friends \u0026 Neighbors. Mandi is represented by Greene Talent, Rikki Dale Management, and Myman Greenspan Fox.",
  "image": "https://deadline.com/wp-content/uploads/2025/07/Arienne-Mandi.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\t\u003ca href=\"https://deadline.com/tag/arienne-mandi/\" id=\"auto-tag_arienne-mandi\" data-tag=\"arienne-mandi\"\u003eArienne Mandi\u003c/a\u003e (\u003cem\u003eThe Night Agent)\u003c/em\u003e has joined the cast of \u003cem\u003e\u003ca href=\"https://deadline.com/tag/chicago-p-d/\" id=\"auto-tag_chicago-p-d\" data-tag=\"chicago-p-d\"\u003eChicago P.D.\u003c/a\u003e \u003c/em\u003eas a series regular for Season 13.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSources close to production tell Deadline, Mandi will play Chicago P.D. officer Naomi Kerr. She is a former soldier and military contractor who is said to thrive in dangerous situations. She is described as a fearless outsider who keeps her cards close to the vest. Names and character descriptions could be changed at any stage of production.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cem\u003eChicago P.D. \u003c/em\u003efollows the men and women of the Chicago Police Department’s elite Intelligence Unit, combatting the city’s most heinous offenses – organized crime, drug trafficking, high-profile murders and beyond. \n\n\t\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\n\tNaomi arrives at a particularly chaotic time for the team, following the murder of Deputy Chief Charlie Reid (Shawn Hatosy), orchestrated by Sergeant Hank Voight (Jason Beghe). Although Detective Kim Burgess (Marina Squerciati) and Officer Dante Torres (Benjamin Levy Aguilar) are off the hook for the latter’s affair with his CI and the former covering it up, there’s no telling what the fallout will be just yet.\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234771711\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tLaRoyce Hawkins and Patrick Flueger also star.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe addition of Mandi follows \u003ca href=\"https://deadline.com/2025/06/toya-turner-leaving-chicago-p-d-kiana-cook-1236443842/\"\u003eDeadline’s exclusive news last month that Toya Turner exited the NBC police procedural as Kiana Cook \u003c/a\u003eand will not appear in Season 13. She told us at the time, “I’m grateful for the time I had bringing Kiana to life. Thank you to everyone who welcomed me so warmly.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cem\u003eChicago P.D.\u003c/em\u003e is executive produced by Dick Wolf, Gwen Sigan, Chad Saxton, Gavin Harris,Jason Beghe and Peter Jankowski. Universal Television, a division of Universal Studio Group, in association with Wolf Entertainment, produces the series.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tMandi currently stars in Season 2 of Netflix’s \u003cem\u003eThe Night Agent. \u003c/em\u003eShe co-stars in Guy Nattiv’s award-winning feature \u003cem\u003eTatami\u003c/em\u003e, which premiered at the Venice Film Festival.  She will next be seen starring opposite Jon Hamm in season 2 of Apple TV+’s \u003cem\u003eYour Friends \u0026amp; Neighbors\u003c/em\u003e. Mandi is represented by Greene Talent, Rikki Dale Management, and Myman Greenspan Fox.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-07-23T00:00:00Z",
  "modifiedTime": "2025-07-23T00:05:40Z"
}
