{
  "id": "0833c321-44aa-41c7-8f17-fc682b590134",
  "title": "Scent Master: Nicole Eckels of Glasshouse Fragrances",
  "link": "https://www.popsugar.com/beauty/nicole-eckels-glasshouse-fragrance-interview-49446287",
  "description": "Nicole Eckels has been surrounded by beauty for much of her life. Starting out as a resident makeup artist at Chanel's Fifth Avenue store in New York City - working there was \"my first interaction with fragrance\" and \"one of my first jobs of my life,\" Eckels says - to working for Equinox managing its corporate wellness program, she knows the beauty industry inside and out. But with time, she learned that fragrance is her true calling. \"I realized that my memory as a super creative person with ADHD is really, really bad, but with fragrance, I remember everything,\" Eckels says. \"I was the person who would walk into an elevator, and I could tell what fragrance they were wearing. I knew the scent, and I only had to smell it once.\" Between her talent for sniffing out any perfume and \"the fact that I just adore the power of fragrance so much so that I was always drawn to scent,\" she says, it's no surprise that Eckels would ultimately build such an iconic and storied home and personal fragrance brand. Enter: Glasshouse Fragrances, a home and personal fragrance brand that sells candles, diffusers, bath and body products, perfumes, and even car fragrances. For Eckels, all roads would lead to, well, not Rome. Rather, they would lead to Australia. After a friend told her she'd love it there, she booked a ticket thinking she'd return to the States within a few years. But, as with most expats, this wouldn't be the case. She stayed in Sydney, Australia full-time for 15 years and still splits time between there and the United States. It was in Sydney where she launched Glasshouse Fragrances as a result of noticing a gap in the market for home fragrance options. Today, Glasshouse Fragrances is one of the most recognizable (and loved – just read the reviews!) fragrance brands in Australia, and the passion has taken off worldwide as well. Eckels' destiny as a beauty leader was forged by her fascination, which has also contributed to her success as an entrepreneur. In 2005, when she launched Glasshouse Fragrances, she single-handedly invented a new category of \"destination fragrances\" designed to evoke an enchanting locale, with an early focus on home fragrance (though she ultimately would also create equally captivating personal fragrances as well). She has gone on to build out additional innovative categories like \"perfume pencils,\" a solid, portable perfume that you can easily bring with you on the go. From bestselling candles like Kyoto in Bloom ($55) to favorite eau de parfums like Forever Florence ($140), Eckels has created a destination fragrance for everyone. Keep reading to learn more about her and her brand. PS: What inspired you to launch Glasshouse Fragrances? Nicole Eckels: I moved to Australia, and when I arrived there, I loved it and I loved my work, but it was being there that I realized the huge gap in the marketplace for a bath and body [category] challenger to Bath and Body Works. I wanted super high-quality, glamorous, unique scents in all the formats that I used every single day. And when I moved to Australia, there wasn't much, really. There were L'Occitane, The Body Shop, and Crabtree and Evelyn. Those were my choices. I started with a candle because I couldn't find those at all, and in doing so, created the scented candle category down under. That was my first professional experience in scent. PS: What originally brought you to Australia? NE: I didn't go there for a job - that's why I stayed. I went there for adventure. I went there because I wanted to see change. I thought I was going to live in Europe. I had a friend in New York who said to me, in his thick Aussie accent, \"You've got to go to Australia. You're absolutely going to love it.\" I said OK, and I just bought a ticket. I went over and I thought, \"Wow, this place is so amazing. I think that this could be a nice life for my son.\" I was a single mother, [wondering], how do I raise a son safely in [New York City] when I'm working all the time? I thought I needed to go somewhere where it's safer, and where there's a better work/life balance. And that is why I went. The original idea is that I would just go there for a few years [until my son graduated], and then I would move back. And that ended when I started Glasshouse, because that just took over everything. We have 220 people now, and we make everything ourselves. It's just become this huge thing, and it's been my life's work. It will be 20 years old next year. PS: What is your process of creating a new product? NE: You meet some of the best perfumers, and that's the key. It's very easy to develop a scent. It's hard to have the technology and the understanding of scent design and work with the masters to create an incredible scent that's long-lasting, that's different, that's unusual in some way, that's unique in some way. And that's a journey that I'm on. That's one of my key focuses, and that's what really interests me now on the home fragrance side. I have a triangle with three points: The effect that it has on you, if it's different in some way, and product efficacy - and I'm trying to always find something in the middle. And it moves all the time. For example, I might launch something and it's an iconic, unusual, different fragrance, and then everyone will mimic that, and then it no longer is. People don't realize that we were the first to name our candles after places. That wasn't done when we did it. That is the approach I take for home fragrance, and that is also the approach I take for fine fragrance. The perfumers [for home fragrance and fine fragrance] are different. We always start with [formulating] a fine fragrance because of the materials and the system. Your skin is 96℉ and a candle is a completely different system. A fragrance diffuser is a different system. The way you experience fragrance is different, so they have to be built differently. The costs are different; the pH levels are different. But the olfactive idea can be a sketch of something and then built out based on how you're going to use it. Having the right team is so important if you're really serious about competing in the fine fragrance world. PS: How do you go about choosing a new scent and deciding what to launch? NE: A lot of it comes from the customers. The customers will tell us before we even think of it. We have such a massive following of customers all over the world, and we listen to them. They have fan groups set up. They'll say, \"I want this, I want that.\" And then we'll read those. We're listening. I'm also in the background with my team. I have the most wonderful team of developers. We're thinking about what people want. And you can't ask people that, because they don't know yet. So instead, we say, \"What problems are out there that we can solve through fragrance, through product, through personal care?\" Customers tend to want fragrances that we no longer make. That is the most common request. The next common one is them asking for a particular product that we don't make yet, whether it's a body cream or a body serum or something they want to incorporate into their life. The car diffuser came from people asking for that, so it goes both ways. We also certainly stay on top of what's happening in the market and what trends we see globally. PS: What are some fragrance trends you've noticed lately? NE: We look at product and we look at scent. The inspiration for scent often comes internally. It's more artist-led than trend-led. We don't do focus groups; we don't do any of that. We're more concerned about creating something unique, special, and beautiful. And that's really where it begins, always. And the test is seeing if it's ticking those three boxes for us and our customers. If it is, then we'll try it. We will try anything. It's fine if it doesn't work. If you don't try things, then that is, in my opinion, a disaster. Our responsibility is to give people something new and different so that they can explore and have a wonderful time with fragrance and the power of fragrance. That's what we want to do all the time. Catharine Malzahn is a beauty writer and editor with nearly half a decade of experience covering everything from skin care and makeup to spas and injectables. She has held editorial positions at Good Housekeeping, Woman's Day, and Prevention; you can find her work in those publications and in PS, NewBeauty, CR Fashion Book, Makeup.com, Skincare.com, and more.",
  "author": "Catharine Malzahn",
  "published": "Thu, 05 Jun 2025 10:35:02 -0700",
  "source": "https://www.popsugar.com/beauty/feed",
  "categories": [
    "Beauty Interview",
    "Perfume",
    "Scent Master",
    "Candles"
  ],
  "byline": "Catharine Malzahn",
  "length": 8633,
  "excerpt": "A profile on Nicole Eckels, founder and nose of Glasshouse Fragrances. Learn more about her success and what goes into launching a new scent.",
  "siteName": "Popsugar",
  "favicon": "",
  "text": "While each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our Product Review Guidelines here.Nicole Eckels has been surrounded by beauty for much of her life. Starting out as a resident makeup artist at Chanel's Fifth Avenue store in New York City — working there was \"my first interaction with fragrance\" and \"one of my first jobs of my life,\" Eckels says — to working for Equinox managing its corporate wellness program, she knows the beauty industry inside and out. But with time, she learned that fragrance is her true calling. \"I realized that my memory as a super creative person with ADHD is really, really bad, but with fragrance, I remember everything,\" Eckels says. \"I was the person who would walk into an elevator, and I could tell what fragrance they were wearing. I knew the scent, and I only had to smell it once.\"Between her talent for sniffing out any perfume and \"the fact that I just adore the power of fragrance so much so that I was always drawn to scent,\" she says, it's no surprise that Eckels would ultimately build such an iconic and storied home and personal fragrance brand. Enter: Glasshouse Fragrances, a home and personal fragrance brand that sells candles, diffusers, bath and body products, perfumes, and even car fragrances.For Eckels, all roads would lead to, well, not Rome. Rather, they would lead to Australia. After a friend told her she'd love it there, she booked a ticket thinking she'd return to the States within a few years. But, as with most expats, this wouldn't be the case. She stayed in Sydney, Australia full-time for 15 years and still splits time between there and the United States. It was in Sydney where she launched Glasshouse Fragrances as a result of noticing a gap in the market for home fragrance options. Today, Glasshouse Fragrances is one of the most recognizable (and loved – just read the reviews!) fragrance brands in Australia, and the passion has taken off worldwide as well.Eckels' destiny as a beauty leader was forged by her fascination, which has also contributed to her success as an entrepreneur. In 2005, when she launched Glasshouse Fragrances, she single-handedly invented a new category of \"destination fragrances\" designed to evoke an enchanting locale, with an early focus on home fragrance (though she ultimately would also create equally captivating personal fragrances as well). She has gone on to build out additional innovative categories like \"perfume pencils,\" a solid, portable perfume that you can easily bring with you on the go. From bestselling candles like Kyoto in Bloom ($55) to favorite eau de parfums like Forever Florence ($140), Eckels has created a destination fragrance for everyone. Keep reading to learn more about her and her brand.PS: What inspired you to launch Glasshouse Fragrances?Nicole Eckels: I moved to Australia, and when I arrived there, I loved it and I loved my work, but it was being there that I realized the huge gap in the marketplace for a bath and body [category] challenger to Bath and Body Works. I wanted super high-quality, glamorous, unique scents in all the formats that I used every single day. And when I moved to Australia, there wasn't much, really. There were L'Occitane, The Body Shop, and Crabtree and Evelyn. Those were my choices. I started with a candle because I couldn't find those at all, and in doing so, created the scented candle category down under. That was my first professional experience in scent.PS: What originally brought you to Australia?NE: I didn't go there for a job — that's why I stayed. I went there for adventure. I went there because I wanted to see change. I thought I was going to live in Europe. I had a friend in New York who said to me, in his thick Aussie accent, \"You've got to go to Australia. You're absolutely going to love it.\" I said OK, and I just bought a ticket. I went over and I thought, \"Wow, this place is so amazing. I think that this could be a nice life for my son.\" I was a single mother, [wondering], how do I raise a son safely in [New York City] when I'm working all the time? I thought I needed to go somewhere where it's safer, and where there's a better work/life balance. And that is why I went.The original idea is that I would just go there for a few years [until my son graduated], and then I would move back. And that ended when I started Glasshouse, because that just took over everything. We have 220 people now, and we make everything ourselves. It's just become this huge thing, and it's been my life's work. It will be 20 years old next year.PS: What is your process of creating a new product?NE: You meet some of the best perfumers, and that's the key. It's very easy to develop a scent. It's hard to have the technology and the understanding of scent design and work with the masters to create an incredible scent that's long-lasting, that's different, that's unusual in some way, that's unique in some way. And that's a journey that I'm on. That's one of my key focuses, and that's what really interests me now on the home fragrance side.I have a triangle with three points: The effect that it has on you, if it's different in some way, and product efficacy — and I'm trying to always find something in the middle. And it moves all the time. For example, I might launch something and it's an iconic, unusual, different fragrance, and then everyone will mimic that, and then it no longer is. People don't realize that we were the first to name our candles after places. That wasn't done when we did it. That is the approach I take for home fragrance, and that is also the approach I take for fine fragrance.The perfumers [for home fragrance and fine fragrance] are different. We always start with [formulating] a fine fragrance because of the materials and the system. Your skin is 96℉ and a candle is a completely different system. A fragrance diffuser is a different system. The way you experience fragrance is different, so they have to be built differently. The costs are different; the pH levels are different. But the olfactive idea can be a sketch of something and then built out based on how you're going to use it. Having the right team is so important if you're really serious about competing in the fine fragrance world.PS: How do you go about choosing a new scent and deciding what to launch?NE: A lot of it comes from the customers. The customers will tell us before we even think of it. We have such a massive following of customers all over the world, and we listen to them. They have fan groups set up. They'll say, \"I want this, I want that.\" And then we'll read those. We're listening. I'm also in the background with my team. I have the most wonderful team of developers. We're thinking about what people want. And you can't ask people that, because they don't know yet. So instead, we say, \"What problems are out there that we can solve through fragrance, through product, through personal care?\"Customers tend to want fragrances that we no longer make. That is the most common request. The next common one is them asking for a particular product that we don't make yet, whether it's a body cream or a body serum or something they want to incorporate into their life. The car diffuser came from people asking for that, so it goes both ways. We also certainly stay on top of what's happening in the market and what trends we see globally.PS: What are some fragrance trends you've noticed lately?NE: We look at product and we look at scent. The inspiration for scent often comes internally. It's more artist-led than trend-led. We don't do focus groups; we don't do any of that. We're more concerned about creating something unique, special, and beautiful. And that's really where it begins, always. And the test is seeing if it's ticking those three boxes for us and our customers. If it is, then we'll try it. We will try anything. It's fine if it doesn't work. If you don't try things, then that is, in my opinion, a disaster. Our responsibility is to give people something new and different so that they can explore and have a wonderful time with fragrance and the power of fragrance. That's what we want to do all the time.Catharine Malzahn is a beauty writer and editor with nearly half a decade of experience covering everything from skin care and makeup to spas and injectables. She has held editorial positions at Good Housekeeping, Woman's Day, and Prevention; you can find her work in those publications and in PS, NewBeauty, CR Fashion Book, Makeup.com, Skincare.com, and more.",
  "image": "https://media1.popsugar-assets.com/files/thumbor/i3xmn92OHOOmND_2NfP7V10Qej0=/0x0:1200x630/fit-in/1200x630/top/filters:format_auto():quality(85):upscale()/2025/06/05/721/n/1922153/ad5025986841c39c204873.54288324_.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eWhile each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our \u003ca href=\"https://www.popsugar.com/ps-product-review-guidelines-disclosures\" target=\"_blank\"\u003eProduct Review Guidelines here\u003c/a\u003e.\u003c/p\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"2\"\u003e\u003cp data-element-index=\"0\"\u003eNicole Eckels has been surrounded by beauty for much of her life. Starting out as a resident makeup artist at Chanel\u0026#39;s Fifth Avenue store in New York City — working there was \u0026#34;my first interaction with fragrance\u0026#34; and \u0026#34;one of my first jobs of my life,\u0026#34; Eckels says — to working for Equinox managing its corporate wellness program, she knows the beauty industry inside and out. But with time, she learned that fragrance is her true calling. \u003c/p\u003e\u003cp data-element-index=\"1\"\u003e\u0026#34;I realized that my memory as a super creative person with ADHD is really, really bad, but with fragrance, I remember everything,\u0026#34; Eckels says. \u0026#34;I was the person who would walk into an elevator, and I could tell what fragrance they were wearing. I knew the scent, and I only had to smell it once.\u0026#34;\u003c/p\u003e\u003cp data-element-index=\"2\"\u003eBetween her talent for sniffing out any perfume and \u0026#34;the fact that I just adore the power of fragrance so much so that I was always drawn to scent,\u0026#34; she says, it\u0026#39;s no surprise that Eckels would ultimately build such an iconic and storied home and personal fragrance brand. Enter: Glasshouse Fragrances, a home and personal fragrance brand that sells \u003ca href=\"https://www.popsugar.com/home/best-scented-candles-26757680\"\u003ecandles\u003c/a\u003e, diffusers, bath and body products, \u003ca href=\"https://www.popsugar.com/beauty/best-perfumes-48761428\"\u003eperfumes\u003c/a\u003e, and even car fragrances.\u003c/p\u003e\u003cp data-element-index=\"3\"\u003eFor Eckels, all roads would lead to, well, not Rome. Rather, they would lead to Australia. After a friend told her she\u0026#39;d love it there, she booked a ticket thinking she\u0026#39;d return to the States within a few years. But, as with most expats, this wouldn\u0026#39;t be the case. She stayed in Sydney, Australia full-time for 15 years and still splits time between there and the United States. It was in Sydney where she launched Glasshouse Fragrances as a result of noticing a gap in the market for \u003ca href=\"https://www.popsugar.com/home/best-home-fragrance-by-aesthetic-49343400\"\u003ehome fragrance\u003c/a\u003e options. Today, Glasshouse Fragrances is one of the most recognizable (and loved – just read the reviews!) fragrance brands in Australia, and the passion has taken off worldwide as well.\u003c/p\u003e\u003cp data-element-index=\"4\"\u003eEckels\u0026#39; destiny as a beauty leader was forged by her fascination, which has also contributed to her success as an entrepreneur. In 2005, when she launched Glasshouse Fragrances, she single-handedly invented a new category of \u0026#34;destination fragrances\u0026#34; designed to evoke an enchanting locale, with an early focus on home fragrance (though she ultimately would also create equally captivating personal fragrances as well). She has gone on to build out additional innovative categories like \u0026#34;perfume pencils,\u0026#34; a solid, portable perfume that you can easily bring with you on the go. From bestselling candles like \u003ca href=\"https://www.amazon.com/Glasshouse-Fragrances-Scented-Natural-Camellia/dp/B08FZMFQMQ/?th=1\u0026amp;tag=popsugarshopx-20\u0026amp;asc_source=health/\u0026amp;asc_campaign=news_share\u0026amp;asc_refurl=https://www.popsugar.com/beauty/nicole-eckels-glasshouse-fragrance-interview-49446287\u0026amp;ascsubtag=___psv__p_49446287__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eKyoto in Bloom\u003c/a\u003e ($55) to favorite eau de parfums like \u003ca href=\"https://www.amazon.com/Glasshouse-Fragrances-Forever-Florence-Intense/dp/B0BTH381X8/?tag=popsugarshopx-20\u0026amp;asc_source=health/\u0026amp;asc_campaign=news_share\u0026amp;asc_refurl=https://www.popsugar.com/beauty/nicole-eckels-glasshouse-fragrance-interview-49446287\u0026amp;ascsubtag=___psv__p_49446287__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eForever Florence\u003c/a\u003e ($140), Eckels has created a destination fragrance for everyone. Keep reading to learn more about her and her brand.\u003c/p\u003e\u003cdiv\u003e\u003ca href=\"https://www.amazon.com/Glasshouse-Fragrances-Scented-Natural-Camellia/dp/B08FZMFQMQ/?th=1\u0026amp;tag=popsugarshopx-20\u0026amp;asc_source=health/\u0026amp;asc_campaign=news_share\u0026amp;asc_refurl=https://www.popsugar.com/beauty/nicole-eckels-glasshouse-fragrance-interview-49446287\u0026amp;ascsubtag=___psv__p_49446287__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\" aria-label=\"\" data-vars-action=\"product image\" data-vars-retailer=\"amazon\" data-vars-price=\"$55\" data-vars-href=\"https://www.amazon.com/Glasshouse-Fragrances-Scented-Natural-Camellia/dp/B08FZMFQMQ/?th=1\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/jrilTZ14XxHXxiualse1KZUXE3U=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/06/05/722/n/1922153/ac152a7b6841c3d71a21e0.84341016_Screenshot_2.png\" media=\"(min-width: 1024px)\" data-size=\"desktop\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/jrilTZ14XxHXxiualse1KZUXE3U=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/06/05/722/n/1922153/ac152a7b6841c3d71a21e0.84341016_Screenshot_2.png\" media=\"(min-width: 768px) and (max-width: 1023px)\" data-size=\"tablet\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/e-nA21d4eq1wLWadKaHApr3NyZY=/fit-in/700x700/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/06/05/722/n/1922153/ac152a7b6841c3d71a21e0.84341016_Screenshot_2.png\" media=\"(max-width: 767px)\" data-size=\"mobile\" width=\"350\" height=\"350\"/\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/BMlXou-ZGJvc0Lb8szHT93HsH18=/fit-in/350x350/filters:format_auto():quality(70):extract_cover():upscale():fill(ffffff)/2025/06/05/722/n/1922153/ac152a7b6841c3d71a21e0.84341016_Screenshot_2.png\" alt=\"Main Image\" width=\"350\" height=\"350\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"https://www.amazon.com/Glasshouse-Fragrances-Forever-Florence-Intense/dp/B0BTH381X8/?tag=popsugarshopx-20\u0026amp;asc_source=health/\u0026amp;asc_campaign=news_share\u0026amp;asc_refurl=https://www.popsugar.com/beauty/nicole-eckels-glasshouse-fragrance-interview-49446287\u0026amp;ascsubtag=___psv__p_49446287__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\" aria-label=\"\" data-vars-action=\"product image\" data-vars-retailer=\"amazon\" data-vars-price=\"$140\" data-vars-href=\"https://www.amazon.com/Glasshouse-Fragrances-Forever-Florence-Intense/dp/B0BTH381X8/\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/NNZ3oUIMd1e_TwDVBCjrgoxkMR4=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/06/05/722/n/1922153/344957d26841c3d0d5ca96.78469404_Screenshot_2.png\" media=\"(min-width: 1024px)\" data-size=\"desktop\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/NNZ3oUIMd1e_TwDVBCjrgoxkMR4=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/06/05/722/n/1922153/344957d26841c3d0d5ca96.78469404_Screenshot_2.png\" media=\"(min-width: 768px) and (max-width: 1023px)\" data-size=\"tablet\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/pnAkyCVxL8ln5Jqdu_PbUvb9c1k=/fit-in/700x700/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/06/05/722/n/1922153/344957d26841c3d0d5ca96.78469404_Screenshot_2.png\" media=\"(max-width: 767px)\" data-size=\"mobile\" width=\"350\" height=\"350\"/\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/da2FkKYU6HV6ywfzRb8fZxaGpzU=/fit-in/350x350/filters:format_auto():quality(70):extract_cover():upscale():fill(ffffff)/2025/06/05/722/n/1922153/344957d26841c3d0d5ca96.78469404_Screenshot_2.png\" alt=\"Main Image\" width=\"350\" height=\"350\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/div\u003e\u003cp data-element-index=\"5\"\u003e\u003cstrong\u003ePS: What inspired you to launch Glasshouse Fragrances?\u003c/strong\u003e\u003c/p\u003e\u003cp data-element-index=\"6\"\u003e\u003cstrong\u003eNicole Eckels: \u003c/strong\u003eI moved to Australia, and when I arrived there, I loved it and I loved my work, but it was being there that I realized the huge gap in the marketplace for a bath and body [category] challenger to Bath and Body Works. I wanted super high-quality, glamorous, unique scents in all the formats that I used every single day. And when I moved to Australia, there wasn\u0026#39;t much, really. There were L\u0026#39;Occitane, The Body Shop, and Crabtree and Evelyn. Those were my choices. I started with a candle because I couldn\u0026#39;t find those at all, and in doing so, created the scented candle category down under. That was my first professional experience in scent.\u003c/p\u003e\u003cp data-element-index=\"7\"\u003e\u003cstrong\u003ePS: What originally brought you to Australia\u003c/strong\u003e\u003cstrong\u003e?\u003c/strong\u003e\u003c/p\u003e\u003cp data-element-index=\"8\"\u003e\u003cstrong\u003eNE: \u003c/strong\u003eI didn\u0026#39;t go there for a job — that\u0026#39;s why I stayed. I went there for adventure. I went there because I wanted to see change. I thought I was going to live in Europe. I had a friend in New York who said to me, in his thick Aussie accent, \u0026#34;You\u0026#39;ve got to go to Australia. You\u0026#39;re absolutely going to love it.\u0026#34; I said OK, and I just bought a ticket. I went over and I thought, \u0026#34;Wow, this place is so amazing. I think that this could be a nice life for my son.\u0026#34; I was a single mother, [wondering], how do I raise a son safely in [New York City] when I\u0026#39;m working all the time? I thought I needed to go somewhere where it\u0026#39;s safer, and where there\u0026#39;s a better work/life balance. And that is why I went.\u003c/p\u003e\u003cp data-element-index=\"9\"\u003eThe original idea is that I would just go there for a few years [until my son graduated], and then I would move back. And that ended when I started Glasshouse, because that just took over everything. We have 220 people now, and we make everything ourselves. It\u0026#39;s just become this huge thing, and it\u0026#39;s been my life\u0026#39;s work. It will be 20 years old next year.\u003c/p\u003e\u003cp data-element-index=\"10\"\u003e\u003cstrong\u003ePS: What is your process of creating a ne\u003c/strong\u003e\u003cstrong\u003ew product?\u003c/strong\u003e\u003c/p\u003e\u003cp data-element-index=\"11\"\u003e\u003cstrong\u003eNE: \u003c/strong\u003eYou meet some of the best perfumers, and that\u0026#39;s the key. It\u0026#39;s very easy to develop a scent. It\u0026#39;s hard to have the technology and the understanding of scent design and work with the masters to create an incredible scent that\u0026#39;s long-lasting, that\u0026#39;s different, that\u0026#39;s unusual in some way, that\u0026#39;s unique in some way. And that\u0026#39;s a journey that I\u0026#39;m on. That\u0026#39;s one of my key focuses, and that\u0026#39;s what really interests me now on the home fragrance side.\u003c/p\u003e\u003cp data-element-index=\"12\"\u003eI have a triangle with three points: The effect that it has on you, if it\u0026#39;s different in some way, and product efficacy — and I\u0026#39;m trying to always find something in the middle. And it moves all the time. For example, I might launch something and it\u0026#39;s an iconic, unusual, different fragrance, and then everyone will mimic that, and then it no longer is. People don\u0026#39;t realize that we were the first to name our candles after places. That wasn\u0026#39;t done when we did it. That is the approach I take for home fragrance, and that is also the approach I take for fine fragrance.\u003c/p\u003e\u003cp data-element-index=\"13\"\u003eThe perfumers [for home fragrance and fine fragrance] are different. We always start with [formulating] a fine fragrance because of the materials and the system. Your skin is 96℉ and a candle is a completely different system. A fragrance diffuser is a different system. The way you experience fragrance is different, so they have to be built differently. The costs are different; the pH levels are different. But the olfactive idea can be a sketch of something and then built out based on how you\u0026#39;re going to use it. Having the right team is so important if you\u0026#39;re really serious about competing in the fine fragrance world.\u003c/p\u003e\u003cp data-element-index=\"14\"\u003e\u003cstrong\u003ePS: How do you go about choosing a new scent and deciding what to launch?\u003c/strong\u003e\u003c/p\u003e\u003cp data-element-index=\"15\"\u003e\u003cstrong\u003eNE: \u003c/strong\u003eA lot of it comes from the customers. The customers will tell us before we even think of it. We have such a massive following of customers all over the world, and we listen to them. They have fan groups set up. They\u0026#39;ll say, \u0026#34;I want this, I want that.\u0026#34; And then we\u0026#39;ll read those. We\u0026#39;re listening. I\u0026#39;m also in the background with my team. I have the most wonderful team of developers. We\u0026#39;re thinking about what people want. And you can\u0026#39;t ask people that, because they don\u0026#39;t know yet. So instead, we say, \u0026#34;What problems are out there that we can solve through fragrance, through product, through personal care?\u0026#34;\u003c/p\u003e\u003cp data-element-index=\"16\"\u003eCustomers tend to want fragrances that we no longer make. That is the most common request. The next common one is them asking for a particular product that we don\u0026#39;t make yet, whether it\u0026#39;s a body cream or a body serum or something they want to incorporate into their life. The car diffuser came from people asking for that, so it goes both ways. We also certainly stay on top of what\u0026#39;s happening in the market and what trends we see globally.\u003c/p\u003e\u003cp data-element-index=\"17\"\u003e\u003cstrong\u003ePS: What are some fragrance trends you\u0026#39;ve noticed lately?\u003c/strong\u003e\u003c/p\u003e\u003cp data-element-index=\"18\"\u003e\u003cstrong\u003eNE:\u003c/strong\u003e We look at product and we look at scent. The inspiration for scent often comes internally. It\u0026#39;s more artist-led than trend-led. We don\u0026#39;t do focus groups; we don\u0026#39;t do any of that. We\u0026#39;re more concerned about creating something unique, special, and beautiful. And that\u0026#39;s really where it begins, always. And the test is seeing if it\u0026#39;s ticking those three boxes for us and our customers. If it is, then we\u0026#39;ll try it. We will try anything. It\u0026#39;s fine if it doesn\u0026#39;t work. If you don\u0026#39;t try things, then that is, in my opinion, a disaster. Our responsibility is to give people something new and different so that they can explore and have a wonderful time with fragrance and the power of fragrance. That\u0026#39;s what we want to do all the time.\u003c/p\u003e\u003cp data-element-index=\"21\"\u003e\u003cem\u003e\u003ca href=\"https://www.popsugar.com/authors/catharine-malzahn\"\u003eCatharine Malzahn\u003c/a\u003e is a beauty writer and editor with nearly half a decade of experience covering everything from skin care and makeup to spas and injectables. She has held editorial positions at Good Housekeeping, Woman\u0026#39;s Day, and Prevention; you can find her work in those publications and in PS, NewBeauty, CR Fashion Book, Makeup.com, Skincare.com, and more.\u003c/em\u003e\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-06-05T17:35:02Z",
  "modifiedTime": "2025-06-05T17:35:02Z"
}
