{
  "id": "084d7040-1f99-49a9-9106-9e15de412056",
  "title": "I Never Knew My Lips Were Sunburned — Until I Talked To A Dermatologist",
  "link": "https://www.refinery29.com/en-us/sunburned-lips-dermatologist-advice?utm_source=feed\u0026utm_medium=rss",
  "description": ".disclaimer{width:90%;margin-bottom:1rem}.disclaimer__lines{width:100%;margin:0 auto;border-bottom:1px solid #999;padding:0;max-width:150px}.disclaimer__copy{width:100%;max-width:355px;font-family:Brown Regular,sans-serif;font-size:.9rem;font-weight:300;line-height:1.3em;color:#333;padding:0 0 .4rem;margin:1rem auto;text-align:center} All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. Something strange has been happening to my lips. While I tend to go heavy on lip care in colder months, they normally require minimal maintenance in the summer, thanks to the increased humidity in warmer air. This year, however, I’ve noticed the complete opposite. My lips have been feeling extra raw and dehydrated, with bits of skin peeling off like fish scales. Slathering on my go-to hydrating lip balm hasn’t helped one bit. I attributed my lip troubles to recovering from a nasty flu at the beginning of summer but it didn’t seem to explain this prolonged period of dryness. It wasn’t until I spoke to a dermatologist that I got an a-ha moment: My cracked lips might have something to do with sun damage. Despite diligently wearing sunscreen daily (on my face and body and reapplying every two hours), I’ll be the first to admit that I often forget SPF protection on my lips. Many SPF lip balms have a weird, unctuous texture that doesn’t sit nicely under my favorite lip stains and glosses, while plenty taste bitter. Regardless, skipping SPF on your lips might not be the best idea: “The skin on your lips differs from that of the rest of your body,” explains consultant dermatologist Dr. Derrick Phillips. “It’s thin, sensitive, and prone to loss of moisture. Your lips are also constantly exposed to UV radiation from the sun, which over time causes further thinning, redness, pigmentation and increases the risk of developing skin cancer.” Put simply, burnt lips are just as common as burnt shoulders. But the aftermath might look a little different. With that in mind, I asked dermatologists and skin experts to give me the lowdown on the warning signs, as well as the products that can help protect, soothe, and repair sun-damaged lips — this summer and beyond. DashDividers_1_500x100 What is the cause of sunburned lips and what are the signs to look out for? There are a few telltale signs of sunburned lips. According to Dr. Anjali Mahto, consultant dermatologist and founder of Self London, sun-damaged lips often appear dry, rough,h and scaly. The skin may show discoloration, ranging from a white, pale appearance to darkened or uneven patches. Fine lines or deep cracks can develop, making the lips feel sore or sensitive, and there might be persistent swelling and redness. These signs might be more prominent on the lower lip since it’s more exposed to the sun. “In more severe cases, you might notice a condition known as actinic cheilitis [a precancerous condition also known as ‘sailor’s lip’], characterized by thickened, scaly patches or even a slightly raised, rough texture,” adds Dr. Mahto. This can be a precursor to more serious conditions. For example, melanoma — a type of cancer that can spread to other areas of the body — can be triggered on the border of your lips. DashDividers_1_500x100 Are there certain ingredients that people with sunburned lips should avoid? If your lips are sunburned, using an SPF lip balm to prevent further UV damage is key. SPF 30 or higher is ideal, though higher SPF formulations can affect the texture, feel, and appearance of the lip product, making it thicker or less comfortable to wear. Dr Mahto recommends avoiding products containing ingredients like menthol, camphor, or salicylic acid, as they can be drying or irritating. Fragrances and certain chemical UV filters, such as oxybenzone, may also cause irritation in some people. “If you have sensitive lips, look for lip sunscreens with moisturizing ingredients like beeswax, shea butter, or natural oils,” she adds. “Physical UV blockers such as zinc oxide or titanium dioxide, which are less likely to cause irritation and offer broad-spectrum protection, are also a good choice.” Dr. Mahto swears by Paula’s Choice Lipscreen SPF 50, $13, as well as Ultrasun Ultralip SPF 30, $19. DashDividers_1_500x100 The best products to help repair sunburned lips When you have sunburned lips, soothing and repairing products are essential. Advanced skin nurse practitioner Emma Wedgwood recommends looking for products that contain humectants (which draw moisture into the skin) and emollients (which lock in moisture) like lanolin, hyaluronic acid, and glycerin. These will replenish the hydration levels of your skin barrier, the outermost layer of your skin. I asked skincare experts to share the best lip balms, sleeping masks, and serums to help alleviate damage caused by UV exposure — and here’s everything they chose. CeraVe Healing Ointment, $9.99 “This is a top choice for managing sunburned lips. The ointment contains hyaluronic acid, which is a deeply hydrating ingredient, and three essential ceramides to repair and restore the skin barrier. In addition, the presence of petrolatum provides a protective seal, locking in moisture and allowing the lips to heal.” — Dr. Derrick Phillips, consultant dermatologist Shop Dermstore DashDividers_1_500x100 Eucerin Aquaphor Healing Ointment, $18.37 “This is a versatile, fragrance-free ointment that provides deep hydration and forms a protective barrier to lock in moisture. It’s especially beneficial for sunburned lips because it contains petrolatum, which helps to seal in moisture and prevent further drying. The addition of glycerin [which draws moisture to the skin] and vitamin B5 [which helps the skin retain moisture] aids in skin repair and soothes irritation, promoting faster healing of the damaged skin.” — Dr. Anjali Mahto, consultant dermatologist and founder of Self London Shop Amazon DashDividers_1_500x100 Chanel Hydra Beauty Micro Sérum, $60 “When my chapped lips were at their worst, I relied on this lip serum to smooth over the cracks and alleviate irritation. It contains micro-droplets of white camellia extract, which calms and moisturizes the skin without greasiness, and hyaluronic acid — my go-to ingredient for reducing moisture loss. I love how the product applies like a lip jelly and transforms into a more serum-oil hybrid texture after a few minutes. It absorbs into my lips so quickly and is so effective at reducing flakiness. I often use this as a base before I apply my favorite lip color.” — Venus Wong, senior writer Shop Chanel DashDividers_1_500x100 Laneige Lip Sleeping Mask, $24 “This popular overnight treatment is known for its deeply moisturizing properties, making it perfect for sunburned lips. It contains hyaluronic acid and a mix of grape, pomegranate, and raspberry juices rich in antioxidants, which help to soothe and repair the lips while you sleep. The mask’s thick consistency ensures that it stays on the lips all night, providing long-lasting hydration.” — Emma Wedgwood, advanced skin nurse practitioner and founder of Emma Wedgwood Aesthetics Shop Sephora DashDividers_1_500x100 Aveeno 1% Hydrocortisone Anti-Itch Cream, $10.88 “Hydrocortisone is a mild steroid with anti-inflammatory properties that should be applied twice a day for the first 48 hours. It will reduce redness, swelling, and discomfort, and hasten recovery.” — Dr Derrick Phillips, consultant dermatologist Editor’s note: While this is a weaker 1% steroid suitable for areas with thinner skin such as lips, it is always recommended to consult a skincare professional or dermatologist before you go ahead and buy. Shop Amazon DashDividers_1_500x100 The Ordinary Squalane + Amino Acids Lip Balm, $9.50 “This lip balm is like no other I’ve tried. The texture is silky, not sticky, so it sinks into parched lips fast. The star ingredients are squalane, which creates a barrier on the skin to prevent further moisture loss, as well as amino acids. These are the ‘building blocks’ of proteins, which are important for creating the likes of collagen and elastin — two things that keep skin soft and supple. I apply one layer and massage it in with my fingers, then apply a second layer and let it sit there, protecting my lips from the elements.” — Jacqueline Kilikita, Refinery29 deputy beauty director Shop The Ordinary DashDividers_1_500x100 Burt’s Bees Overnight Intensive Lip Treatment, $9.99 “This treatment is another great option for sunburned lips. It contains ceramides, which help to restore the lips’ natural barrier, and it’s infused with natural oils like jojoba and shea butter for deep moisturization. [It’s] a solid choice for those with sensitive or damaged lips.” — Emma Wedgwood, advanced skin nurse practitioner and founder of Emma Wedgwood Aesthetics Shop Amazon Like what you see? How about some more R29 goodness, right here?I Tried 8 Peptide Lip Balms \u0026 The Cheapest WonWhy Is Everyone Obsessed With Lip Liner?\"Lip Basting\" Is The Winter Beauty Trend We Love",
  "author": "Venus Wong",
  "published": "Mon, 24 Mar 2025 21:07:30 +0000",
  "source": "https://www.refinery29.com/beauty/rss.xml",
  "categories": null,
  "byline": "Venus Wong",
  "length": 8085,
  "excerpt": "We talk to a dermatologist about the causes and symptoms of sunburned lips, and what products to use to alleviate the problem.",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. Photographed by Ashley Armitage.Something strange has been happening to my lips. While I tend to go heavy on lip care in colder months, they normally require minimal maintenance in the summer, thanks to the increased humidity in warmer air. This year, however, I’ve noticed the complete opposite. My lips have been feeling extra raw and dehydrated, with bits of skin peeling off like fish scales. Slathering on my go-to hydrating lip balm hasn’t helped one bit.I attributed my lip troubles to recovering from a nasty flu at the beginning of summer but it didn’t seem to explain this prolonged period of dryness. It wasn’t until I spoke to a dermatologist that I got an a-ha moment: My cracked lips might have something to do with sun damage.AdvertisementADVERTISEMENTDespite diligently wearing sunscreen daily (on my face and body and reapplying every two hours), I’ll be the first to admit that I often forget SPF protection on my lips. Many SPF lip balms have a weird, unctuous texture that doesn't sit nicely under my favorite lip stains and glosses, while plenty taste bitter. Regardless, skipping SPF on your lips might not be the best idea: “The skin on your lips differs from that of the rest of your body,” explains consultant dermatologist Dr. Derrick Phillips. “It’s thin, sensitive, and prone to loss of moisture. Your lips are also constantly exposed to UV radiation from the sun, which over time causes further thinning, redness, pigmentation and increases the risk of developing skin cancer.”Put simply, burnt lips are just as common as burnt shoulders. But the aftermath might look a little different. With that in mind, I asked dermatologists and skin experts to give me the lowdown on the warning signs, as well as the products that can help protect, soothe, and repair sun-damaged lips — this summer and beyond.What is the cause of sunburned lips and what are the signs to look out for?There are a few telltale signs of sunburned lips. According to Dr. Anjali Mahto, consultant dermatologist and founder of Self London, sun-damaged lips often appear dry, rough,h and scaly. The skin may show discoloration, ranging from a white, pale appearance to darkened or uneven patches. Fine lines or deep cracks can develop, making the lips feel sore or sensitive, and there might be persistent swelling and redness.AdvertisementADVERTISEMENTThese signs might be more prominent on the lower lip since it’s more exposed to the sun. “In more severe cases, you might notice a condition known as actinic cheilitis [a precancerous condition also known as ‘sailor’s lip’], characterized by thickened, scaly patches or even a slightly raised, rough texture,” adds Dr. Mahto. This can be a precursor to more serious conditions. For example, melanoma — a type of cancer that can spread to other areas of the body — can be triggered on the border of your lips.Are there certain ingredients that people with sunburned lips should avoid?If your lips are sunburned, using an SPF lip balm to prevent further UV damage is key. SPF 30 or higher is ideal, though higher SPF formulations can affect the texture, feel, and appearance of the lip product, making it thicker or less comfortable to wear.Dr Mahto recommends avoiding products containing ingredients like menthol, camphor, or salicylic acid, as they can be drying or irritating. Fragrances and certain chemical UV filters, such as oxybenzone, may also cause irritation in some people. “If you have sensitive lips, look for lip sunscreens with moisturizing ingredients like beeswax, shea butter, or natural oils,” she adds. “Physical UV blockers such as zinc oxide or titanium dioxide, which are less likely to cause irritation and offer broad-spectrum protection, are also a good choice.” Dr. Mahto swears by Paula’s Choice Lipscreen SPF 50, $13, as well as Ultrasun Ultralip SPF 30, $19.AdvertisementADVERTISEMENTThe best products to help repair sunburned lipsWhen you have sunburned lips, soothing and repairing products are essential. Advanced skin nurse practitioner Emma Wedgwood recommends looking for products that contain humectants (which draw moisture into the skin) and emollients (which lock in moisture) like lanolin, hyaluronic acid, and glycerin. These will replenish the hydration levels of your skin barrier, the outermost layer of your skin.I asked skincare experts to share the best lip balms, sleeping masks, and serums to help alleviate damage caused by UV exposure — and here's everything they chose.“This is a top choice for managing sunburned lips. The ointment contains hyaluronic acid, which is a deeply hydrating ingredient, and three essential ceramides to repair and restore the skin barrier. In addition, the presence of petrolatum provides a protective seal, locking in moisture and allowing the lips to heal.” — Dr. Derrick Phillips, consultant dermatologist“This is a versatile, fragrance-free ointment that provides deep hydration and forms a protective barrier to lock in moisture. It's especially beneficial for sunburned lips because it contains petrolatum, which helps to seal in moisture and prevent further drying. The addition of glycerin [which draws moisture to the skin] and vitamin B5 [which helps the skin retain moisture] aids in skin repair and soothes irritation, promoting faster healing of the damaged skin.” — Dr. Anjali Mahto, consultant dermatologist and founder of Self LondonAdvertisementADVERTISEMENT“When my chapped lips were at their worst, I relied on this lip serum to smooth over the cracks and alleviate irritation. It contains micro-droplets of white camellia extract, which calms and moisturizes the skin without greasiness, and hyaluronic acid — my go-to ingredient for reducing moisture loss. I love how the product applies like a lip jelly and transforms into a more serum-oil hybrid texture after a few minutes. It absorbs into my lips so quickly and is so effective at reducing flakiness. I often use this as a base before I apply my favorite lip color.” — Venus Wong, senior writer“This popular overnight treatment is known for its deeply moisturizing properties, making it perfect for sunburned lips. It contains hyaluronic acid and a mix of grape, pomegranate, and raspberry juices rich in antioxidants, which help to soothe and repair the lips while you sleep. The mask’s thick consistency ensures that it stays on the lips all night, providing long-lasting hydration.” — Emma Wedgwood, advanced skin nurse practitioner and founder of Emma Wedgwood Aesthetics“Hydrocortisone is a mild steroid with anti-inflammatory properties that should be applied twice a day for the first 48 hours. It will reduce redness, swelling, and discomfort, and hasten recovery.” — Dr Derrick Phillips, consultant dermatologistAdvertisementADVERTISEMENTEditor’s note: While this is a weaker 1% steroid suitable for areas with thinner skin such as lips, it is always recommended to consult a skincare professional or dermatologist before you go ahead and buy.“This lip balm is like no other I’ve tried. The texture is silky, not sticky, so it sinks into parched lips fast. The star ingredients are squalane, which creates a barrier on the skin to prevent further moisture loss, as well as amino acids. These are the ‘building blocks’ of proteins, which are important for creating the likes of collagen and elastin — two things that keep skin soft and supple. I apply one layer and massage it in with my fingers, then apply a second layer and let it sit there, protecting my lips from the elements.” — Jacqueline Kilikita, Refinery29 deputy beauty director“This treatment is another great option for sunburned lips. It contains ceramides, which help to restore the lips’ natural barrier, and it’s infused with natural oils like jojoba and shea butter for deep moisturization. [It’s] a solid choice for those with sensitive or damaged lips.” — Emma Wedgwood, advanced skin nurse practitioner and founder of Emma Wedgwood AestheticsAdvertisementADVERTISEMENT",
  "image": "https://www.refinery29.com/images/11765472.jpg?crop=40%3A21",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"editorial-content\"\u003e\u003cdiv\u003e\n\n\u003cp\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.\u003c/p\u003e\n\n\u003c/div\u003e\u003cdiv\u003e\u003cp\u003ePhotographed by Ashley Armitage.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eSomething strange has been happening to \u003ca href=\"https://www.refinery29.com/en-us/best-peptide-lip-treatment-balm\"\u003emy lips\u003c/a\u003e. While I tend to go heavy on lip care in colder months, they normally require minimal maintenance in the summer, thanks to the increased humidity in warmer air. This year, however, I’ve noticed the complete opposite. My lips have been feeling extra raw and dehydrated, with bits of skin peeling off like fish scales. Slathering on my go-to \u003ca href=\"https://www.refinery29.com/en-us/best-lip-balm-dry-chapped-lips\"\u003ehydrating lip balm\u003c/a\u003e hasn’t helped one bit.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eI attributed my lip troubles to recovering from a nasty flu at the beginning of summer but it didn’t seem to explain this prolonged period of dryness. It wasn’t until I spoke to a dermatologist that I got an a-ha moment: My cracked lips might have something to do with \u003ca href=\"https://www.refinery29.com/en-us/reverse-sun-damage-skin\"\u003esun damage\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eDespite diligently wearing sunscreen daily (on my face and body and reapplying every two hours), I’ll be the first to admit that I often forget SPF protection on my lips. Many SPF \u003ca href=\"https://www.refinery29.com/en-us/lip-balm\"\u003elip balms\u003c/a\u003e have a weird, unctuous texture that doesn\u0026#39;t sit nicely under my favorite \u003ca href=\"https://www.refinery29.com/en-us/best-lip-stain-tint\"\u003elip stains\u003c/a\u003e and glosses, while plenty taste bitter. Regardless, skipping SPF on your lips might not be the best idea: “The skin on your lips differs from that of the rest of your body,” explains consultant dermatologist \u003ca href=\"https://drderrickphillips.com/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eDr. Derrick Phillips\u003c/a\u003e. “It’s thin, sensitive, and prone to loss of moisture. Your lips are also constantly exposed to UV radiation from the sun, which over time causes further thinning, redness, pigmentation and increases the risk of developing \u003ca href=\"https://www.refinery29.com/en-us/skin-cancer-melanoma-from-tanning-under-30\"\u003eskin cancer.\u003c/a\u003e”\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003ePut simply, burnt lips are just as common as burnt shoulders. But the aftermath might look a little different. With that in mind, I asked dermatologists and skin experts to give me the lowdown on the warning signs, as well as the products that can help protect, soothe, and repair sun-damaged lips — this summer and beyond.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003e\u003cstrong\u003eWhat is the cause of sunburned lips and what are the signs to look out for?\u003c/strong\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThere are a few telltale signs of sunburned lips. According to Dr. Anjali Mahto, consultant dermatologist and founder of \u003ca href=\"https://selflondon.com/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eSelf London\u003c/a\u003e, sun-damaged lips often appear dry, rough,h and scaly. The skin may show discoloration, ranging from a white, pale appearance to darkened or uneven patches. Fine lines or deep cracks can develop, making the lips feel sore or sensitive, and there might be persistent swelling and redness.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThese signs might be more prominent on the lower lip since it’s more exposed to the sun. “In more severe cases, you might notice a condition known as actinic cheilitis [a precancerous condition also known as ‘sailor’s lip’], characterized by thickened, scaly patches or even a slightly raised, rough texture,” adds Dr. Mahto. This can be a precursor to more serious conditions. For example, melanoma — a type of cancer that can spread to other areas of the body — can be triggered on the border of your lips.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eAre there certain ingredients that people with sunburned lips should avoid?\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIf your lips are sunburned, using an SPF lip balm to prevent further UV damage is key. SPF 30 or higher is ideal, though higher SPF formulations can affect the texture, feel, and appearance of the lip product, making it thicker or less comfortable to wear.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eDr Mahto recommends avoiding products containing ingredients like menthol, camphor, or salicylic acid, as they can be drying or irritating. Fragrances and certain chemical UV filters, such as oxybenzone, may also cause irritation in some people. “If you have sensitive lips, look for lip sunscreens with moisturizing ingredients like beeswax, shea butter, or natural oils,” she adds. “Physical UV blockers such as \u003ca href=\"https://www.refinery29.com/en-us/best-zinc-oxide-sunscreen\"\u003ezinc oxide\u003c/a\u003e or titanium dioxide, which are less likely to cause irritation and offer broad-spectrum protection, are also a good choice.” Dr. Mahto swears by \u003ca href=\"https://www.paulaschoice.com/lipscreen-spf-50/256.html\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003ePaula’s Choice Lipscreen SPF 50, $13\u003c/a\u003e, as well as \u003ca href=\"https://amzn.to/3MeQnez\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eUltrasun Ultralip SPF 30, $19\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eThe best products to help repair sunburned lips\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWhen you have sunburned lips, soothing and repairing products are essential. Advanced skin nurse practitioner \u003ca href=\"https://www.emmawedgwoodaesthetics.co.uk/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eEmma Wedgwood\u003c/a\u003e recommends looking for products that contain humectants (which draw moisture into the skin) and emollients (which lock in moisture) like lanolin, hyaluronic acid, and glycerin. These will replenish the hydration levels of your skin barrier, the outermost layer of your skin.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eI asked skincare experts to share the best lip balms, sleeping masks, and serums to help alleviate damage caused by UV exposure — and here\u0026#39;s everything they chose.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“This is a top choice for managing sunburned lips. The ointment contains \u003ca href=\"https://www.refinery29.com/en-us/hyaluronic-acid-skin-benefits\"\u003ehyaluronic acid\u003c/a\u003e, which is a deeply hydrating ingredient, and three \u003ca href=\"https://www.refinery29.com/en-us/ceramides-skincare-eczema-dermatitis\"\u003eessential ceramides\u003c/a\u003e to repair and restore the skin barrier. In addition, the presence of petrolatum provides a protective seal, locking in moisture and allowing the lips to heal.” \u003cem\u003e— \u003ca href=\"https://drderrickphillips.com/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eDr. Derrick Phillips\u003c/a\u003e, consultant dermatologist\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“This is a versatile, fragrance-free ointment that provides deep hydration and forms a protective barrier to lock in moisture. It\u0026#39;s especially beneficial for sunburned lips because it contains petrolatum, which helps to seal in moisture and prevent further drying. The addition of glycerin [which draws moisture to the skin] and \u003ca href=\"https://www.refinery29.com/en-us/vitamin-b5-hyaluronic-acid-serum-combination\"\u003evitamin B5\u003c/a\u003e [which helps the skin retain moisture] aids in skin repair and soothes irritation, promoting faster healing of the damaged skin.” \u003cem\u003e— Dr. Anjali Mahto, consultant dermatologist and founder of \u003ca href=\"https://selflondon.com/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eSelf London\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“When my chapped lips were at their worst, I relied on this lip serum to smooth over the cracks and alleviate irritation. It contains micro-droplets of white camellia extract, which calms and moisturizes the skin without greasiness, and hyaluronic acid — my go-to ingredient for reducing moisture loss. I love how the product applies like a lip jelly and transforms into a more serum-oil hybrid texture after a few minutes. It absorbs into my lips so quickly and is so effective at reducing flakiness. I often use this as a base before I apply my favorite lip color.”\u003cem\u003e — \u003ca href=\"https://www.instagram.com/venus.onthego/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eVenus Wong\u003c/a\u003e, senior writer\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“This popular overnight treatment is known for its deeply moisturizing properties, making it perfect for sunburned lips. It contains hyaluronic acid and a mix of grape, pomegranate, and raspberry juices rich in antioxidants, which help to soothe and repair the lips while you sleep. The mask’s thick consistency ensures that it stays on the lips all night, providing long-lasting hydration.” \u003cem\u003e— Emma Wedgwood, advanced skin nurse practitioner and founder of \u003ca href=\"https://www.emmawedgwoodaesthetics.co.uk/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eEmma Wedgwood Aesthetics\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“Hydrocortisone is a mild steroid with anti-inflammatory properties that should be applied twice a day for the first 48 hours. It will reduce redness, swelling, and discomfort, and hasten recovery.” \u003cem\u003e— \u003ca href=\"https://drderrickphillips.com/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eDr Derrick Phillips\u003c/a\u003e, consultant dermatologist\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003e\u003cem\u003eEditor’s note: \u003c/em\u003e\u003c/strong\u003e\u003cem\u003eWhile this is a weaker 1% steroid suitable for areas with thinner skin such as lips, it is always recommended to consult a skincare professional or dermatologist before you go ahead and buy.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“This lip balm is like no other I’ve tried. The texture is silky, not sticky, so it sinks into parched lips fast. The star ingredients are squalane, which creates a barrier on the skin to prevent further moisture loss, as well as amino acids. These are the ‘building blocks’ of proteins, which are important for creating the likes of collagen and elastin — two things that keep skin soft and supple. I apply one layer and massage it in with my fingers, then apply a second layer and let it sit there, protecting my lips from the elements.” \u003cem\u003e— Jacqueline Kilikita, Refinery29 deputy beauty director\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“This treatment is another great option for sunburned lips. It contains ceramides, which help to restore the lips’ natural barrier, and it’s infused with natural oils like jojoba and shea butter for deep moisturization. [It’s] a solid choice for those with sensitive or damaged lips.” — \u003cem\u003eEmma Wedgwood, advanced skin nurse practitioner and founder of Emma Wedgwood Aesthetics\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-03-24T21:07:30Z",
  "modifiedTime": null
}
