{
  "id": "12df0c77-53dd-4c3c-b659-7ba30ef72cfc",
  "title": "I Finally Embraced My Feminine Side - and Learned Much More About Masculinity",
  "link": "https://www.popsugar.com/beauty/embracing-femininity-masculinity-personal-essay-49429845",
  "description": "It's difficult to pinpoint the exact moment I learned that who I am at my core wasn't what the world wanted from someone born a boy. As far back as I can remember, I've been labeled feminine. How I walked, talked, moved, held a pencil, or even laughed seemed to invite commentary, ridicule, and insult. I understood very early on as a child that the things I naturally gravitated toward - softness, creativity, beauty - were considered for girls and therefore not meant for me. But for me, femininity didn't feel soft. It felt powerful. I was mesmerized watching my mother transform with a fresh blowout, her makeup like war paint, her carefully chosen outfits exuding confidence. To my young mind, femininity was a kind of armor - unwavering, knowing, and sharp as steel in a world set up to see women and the feminine self as lesser than. I escaped into my imagination, developing a love for comic books like \"X-Men\" and characters like Chun Li from \"Street Fighter.\" They reinforced the notion of strong, powerful women with flowing hair, grace, and powers to match any man. Femininity was strength, beauty, and an ethereal wisdom that seemed to lack from the men I was supposed to model myself after, wrapped in one. Yet society told me otherwise: I quickly learned that boys aren't allowed to be dimensional. We're expected to be stoic, rough-edged cardboard cutouts of each other. Everything I admired and wanted to emulate as I grew up was filed under the category of \"For Girls,\" off-limits to me. Painting? For girls. Ceramics? For girls. Playing with dolls? For girls. Skipping? For girls. Singing and performing? For girls. Over time, phrases like \"Why do you talk like that?\" \"You walk like a girl,\" or \"You write like a girl,\" taught me to shrink myself. I began to internalize society's disdain for femininity, masking the parts of myself that felt natural, vibrant, and alive. By age 11, I had learned to hate everything feminine about myself. It was a survival mechanism. Each comment about my mannerisms, my voice, or interests felt like a spotlight, making me exposed and vulnerable. At new schools, instead of being asked where I was from or what games I liked, the first questions were always, \"Why do you talk like that?\" or \"Why is your handwriting so girly?\" These small, cutting observations reminded me that my genuine nature was not meant for me…a future man. When a person's identity makes them a target, they begin to hide. Not only was I unknowingly hiding my \"brownness\" as a Puerto Rican, but I was now also hiding the essence of what made me me. And hiding comes at a cost: The quote \"Desperation holds hands with degradation\" resonates with me. In my desperation to fit in, I began degrading myself - and, by extension, degrading others who were like me. My ADHD had already started to teach me how to mask early on, and now that skill was transferred to my everyday life. I began to mask so well that I completely erased who I was. I shortened the sway in my hips, deepened my voice, and learned the handshake-pat that still makes me uneasy. I puffed my chest, feigned anger when I felt vulnerable, and did everything I could to blend in with the boys who didn't have to think twice about their place in the world. I relied heavily on the character I had created throughout my 20s and into my 30s. Even with the amount of masking I did, I was still \"clocked\" as gay almost immediately by nearly every person I came into contact with my entire life. After coming out, I learned the gay community also relies heavily on heteronormative ideologies to determine worth. I relied on my ability to erase the feminine as much as possible. Makeup? Didn't know her. The first time a guy I was dating asked if I was wearing concealer, I almost fainted from embarrassment. I straightened my hair and chased the whitest, most palatable version of myself. Suffice it to say, even through all that masking, I was still seen as feminine by some standards (both gay and straight). Then, in 2019, I decided to become more transparent on social media about skin care. I started sharing tips, like how to easily hide undereye bags with concealer. Soon, cis men flocked to my DMs asking for advice: \"How do I pick a concealer?\" \"How do I wear makeup without anyone noticing?\" That's when my personal brand started to develop and where the exploration and rehabilitation of my feminine side began to bloom. But as I embraced my femininity, I also had to unpack all the ways I had internalized and perpetuated a misogynistic worldview. Rejecting femininity wasn't just about survival - it was about upholding the same rigid masculinity that complicated my life to begin with. The more I leaned into my femininity, the more I saw how masculinity - especially the toxic version that dominates so much of our culture - has harmed not just me but the entire world. It forces men into emotional repression and women into subservience. It breeds violence, control, and insecurity. And I had to admit: I was complicit. On social media, I express my gender subversively - and that's my intention. It turns the way we think about gender on its head. It is an extreme version of what someone else might experience in smaller, more personal, or more meaningful ways. Some people might never wear a wig or a full makeup beat, but they might feel a little freer in how they express themselves. And if what I do opens that door, I've done my job. View this post on Instagram A post shared by David Lopez (@davidlopezzz) In a time when some believe society is crumbling, I see it differently: I see the world being rebuilt. People are waking up, questioning old structures, and rejecting outdated roles that no longer serve them. Yes, change is uncomfortable, but it's also necessary. The backlash against gender expression, against fluidity, against anything that dares to challenge the status quo - that's the fear of a system that knows it's losing control. And that? That's progress. True masculinity isn't about dominance or suppressing vulnerability, it's about balance, authenticity, and the courage to show up as your full self. True masculinity isn't about dominance or suppressing vulnerability, it's about balance, authenticity, and the courage to show up as your full self. For me, leaning into the feminine is reclaiming my power, reconnecting with the awe I felt as a child watching my mother's strength, or marveling at the beauty and power of the characters I admired. It has allowed me to break free from the narrow box I was forced into and define manhood on my own terms. I've realized that masculinity can be expansive, not restrictive. It could hold space for softness, vulnerability, and care - qualities often mislabeled as feminine. I relearned how to connect with others, not through posturing or bravado, but through genuine emotional intimacy. The relationships I've built since shedding my many masks and dismantling the structures I created to protect myself have been richer, more fulfilling, and more authentic than I ever thought possible. By allowing myself to cry, to express fear or uncertainty, and to lean on others, put on the skirt, and let my wrist hang limp when it feels like it, I've dismantled the walls I built around myself. And in doing so, I've been able to show up for the people in my life - not as a caricature of what a man is supposed to be, but as the multifaceted, deeply human person I am. Embracing my feminine side didn't take anything away from me. It gave me everything. It made me whole. And maybe just maybe, it can do the same for you. David Lopez (he/him) is a New York-based hairstylist, beauty expert, and creative consultant known for his mission to degenderize and demystify the beauty industry. Through inclusivity and transparency, his work supports and inspires individuals on their journey to self-confidence. David has worked with celebrities like Ashley Graham and Chrissy Teigen and brands like Ulta Beauty, Kenra, and Bumble and Bumble, showcasing his versatility in front of and behind the camera. He is a member of the PS Council.",
  "author": "David Lopez",
  "published": "Mon, 17 Mar 2025 16:10:01 -0700",
  "source": "https://www.popsugar.com/beauty/feed",
  "categories": [
    "Identity",
    "Personal Essay",
    "Out Loud"
  ],
  "byline": "David Lopez",
  "length": 8019,
  "excerpt": "By age 11, I learned to hate everything feminine about myself. Here’s how embracing my feminine side and subverting gender ideas on social media helped.",
  "siteName": "Popsugar",
  "favicon": "",
  "text": "It's difficult to pinpoint the exact moment I learned that who I am at my core wasn't what the world wanted from someone born a boy. As far back as I can remember, I've been labeled feminine. How I walked, talked, moved, held a pencil, or even laughed seemed to invite commentary, ridicule, and insult. I understood very early on as a child that the things I naturally gravitated toward — softness, creativity, beauty — were considered for girls and therefore not meant for me.But for me, femininity didn't feel soft. It felt powerful. I was mesmerized watching my mother transform with a fresh blowout, her makeup like war paint, her carefully chosen outfits exuding confidence. To my young mind, femininity was a kind of armor — unwavering, knowing, and sharp as steel in a world set up to see women and the feminine self as lesser than. I escaped into my imagination, developing a love for comic books like \"X-Men\" and characters like Chun Li from \"Street Fighter.\" They reinforced the notion of strong, powerful women with flowing hair, grace, and powers to match any man. Femininity was strength, beauty, and an ethereal wisdom that seemed to lack from the men I was supposed to model myself after, wrapped in one.Yet society told me otherwise: I quickly learned that boys aren't allowed to be dimensional. We're expected to be stoic, rough-edged cardboard cutouts of each other. Everything I admired and wanted to emulate as I grew up was filed under the category of \"For Girls,\" off-limits to me. Painting? For girls. Ceramics? For girls. Playing with dolls? For girls. Skipping? For girls. Singing and performing? For girls. Over time, phrases like \"Why do you talk like that?\" \"You walk like a girl,\" or \"You write like a girl,\" taught me to shrink myself. I began to internalize society's disdain for femininity, masking the parts of myself that felt natural, vibrant, and alive. By age 11, I had learned to hate everything feminine about myself. It was a survival mechanism. Each comment about my mannerisms, my voice, or interests felt like a spotlight, making me exposed and vulnerable. At new schools, instead of being asked where I was from or what games I liked, the first questions were always, \"Why do you talk like that?\" or \"Why is your handwriting so girly?\" These small, cutting observations reminded me that my genuine nature was not meant for me…a future man.When a person's identity makes them a target, they begin to hide. Not only was I unknowingly hiding my \"brownness\" as a Puerto Rican, but I was now also hiding the essence of what made me me. And hiding comes at a cost: The quote \"Desperation holds hands with degradation\" resonates with me. In my desperation to fit in, I began degrading myself — and, by extension, degrading others who were like me. My ADHD had already started to teach me how to mask early on, and now that skill was transferred to my everyday life. I began to mask so well that I completely erased who I was. I shortened the sway in my hips, deepened my voice, and learned the handshake-pat that still makes me uneasy. I puffed my chest, feigned anger when I felt vulnerable, and did everything I could to blend in with the boys who didn't have to think twice about their place in the world.I relied heavily on the character I had created throughout my 20s and into my 30s. Even with the amount of masking I did, I was still \"clocked\" as gay almost immediately by nearly every person I came into contact with my entire life. After coming out, I learned the gay community also relies heavily on heteronormative ideologies to determine worth. I relied on my ability to erase the feminine as much as possible. Makeup? Didn't know her. The first time a guy I was dating asked if I was wearing concealer, I almost fainted from embarrassment. I straightened my hair and chased the whitest, most palatable version of myself. Suffice it to say, even through all that masking, I was still seen as feminine by some standards (both gay and straight).Then, in 2019, I decided to become more transparent on social media about skin care. I started sharing tips, like how to easily hide undereye bags with concealer. Soon, cis men flocked to my DMs asking for advice: \"How do I pick a concealer?\" \"How do I wear makeup without anyone noticing?\" That's when my personal brand started to develop and where the exploration and rehabilitation of my feminine side began to bloom.But as I embraced my femininity, I also had to unpack all the ways I had internalized and perpetuated a misogynistic worldview. Rejecting femininity wasn't just about survival — it was about upholding the same rigid masculinity that complicated my life to begin with. The more I leaned into my femininity, the more I saw how masculinity — especially the toxic version that dominates so much of our culture — has harmed not just me but the entire world. It forces men into emotional repression and women into subservience. It breeds violence, control, and insecurity. And I had to admit: I was complicit. On social media, I express my gender subversively — and that's my intention. It turns the way we think about gender on its head. It is an extreme version of what someone else might experience in smaller, more personal, or more meaningful ways. Some people might never wear a wig or a full makeup beat, but they might feel a little freer in how they express themselves. And if what I do opens that door, I've done my job.In a time when some believe society is crumbling, I see it differently: I see the world being rebuilt. People are waking up, questioning old structures, and rejecting outdated roles that no longer serve them. Yes, change is uncomfortable, but it's also necessary. The backlash against gender expression, against fluidity, against anything that dares to challenge the status quo — that's the fear of a system that knows it's losing control. And that? That's progress.True masculinity isn't about dominance or suppressing vulnerability, it's about balance, authenticity, and the courage to show up as your full self.True masculinity isn't about dominance or suppressing vulnerability, it's about balance, authenticity, and the courage to show up as your full self. For me, leaning into the feminine is reclaiming my power, reconnecting with the awe I felt as a child watching my mother's strength, or marveling at the beauty and power of the characters I admired. It has allowed me to break free from the narrow box I was forced into and define manhood on my own terms.I've realized that masculinity can be expansive, not restrictive. It could hold space for softness, vulnerability, and care — qualities often mislabeled as feminine. I relearned how to connect with others, not through posturing or bravado, but through genuine emotional intimacy. The relationships I've built since shedding my many masks and dismantling the structures I created to protect myself have been richer, more fulfilling, and more authentic than I ever thought possible.By allowing myself to cry, to express fear or uncertainty, and to lean on others, put on the skirt, and let my wrist hang limp when it feels like it, I've dismantled the walls I built around myself. And in doing so, I've been able to show up for the people in my life — not as a caricature of what a man is supposed to be, but as the multifaceted, deeply human person I am.Embracing my feminine side didn't take anything away from me. It gave me everything. It made me whole. And maybe just maybe, it can do the same for you.David Lopez (he/him) is a New York-based hairstylist, beauty expert, and creative consultant known for his mission to degenderize and demystify the beauty industry. Through inclusivity and transparency, his work supports and inspires individuals on their journey to self-confidence. David has worked with celebrities like Ashley Graham and Chrissy Teigen and brands like Ulta Beauty, Kenra, and Bumble and Bumble, showcasing his versatility in front of and behind the camera. He is a member of the PS Council.",
  "image": "https://media1.popsugar-assets.com/files/thumbor/lbOrAXvZb0xJf3xXynoCWuc8ANA=/0x0:1200x630/fit-in/1200x630/top/filters:format_auto():quality(85):upscale()/2025/03/17/992/n/1922153/130a7aff67d8a6e39d7c78.48577470_.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"2\"\u003e\u003cp data-element-index=\"0\"\u003eIt\u0026#39;s difficult to pinpoint the exact moment I learned that who I am at my core wasn\u0026#39;t what the world wanted from someone born a boy. As far back as I can remember, I\u0026#39;ve been \u003ca href=\"https://www.popsugar.com/news/Kyle-Fitzpatrick-Pride-Month-Personal-Essay-43569527\"\u003elabeled feminine.\u003c/a\u003e How I walked, talked, moved, held a pencil, or even laughed seemed to invite commentary, ridicule, and insult. I understood very early on as a child that the things I naturally gravitated toward — softness, creativity, beauty — were considered for girls and therefore not meant for me.\u003c/p\u003e\u003cp data-element-index=\"1\"\u003eBut for me, femininity didn\u0026#39;t feel soft. It \u003ca href=\"https://www.popsugar.com/latest/Feminism\"\u003efelt powerful\u003c/a\u003e. I was mesmerized watching my mother transform with a fresh blowout, her makeup like war paint, her carefully chosen outfits exuding confidence. To my young mind, femininity was a kind of armor — unwavering, knowing, and sharp as steel in a world set up to see women and the feminine self as lesser than. I escaped into my imagination, developing a love for comic books like \u0026#34;X-Men\u0026#34; and characters like Chun Li from \u0026#34;Street Fighter.\u0026#34; They reinforced the notion of strong, powerful women with flowing hair, grace, and powers to match any man. Femininity was strength, beauty, and an ethereal wisdom that seemed to lack from the men I was supposed to model myself after, wrapped in one.\u003c/p\u003e\u003cp data-element-index=\"2\"\u003eYet society told me otherwise: I quickly learned that boys aren\u0026#39;t allowed to be dimensional. We\u0026#39;re expected to be stoic, rough-edged cardboard cutouts of each other. Everything I admired and wanted to emulate as I grew up was filed under the category of \u0026#34;For Girls,\u0026#34; off-limits to me. Painting? For girls. Ceramics? For girls. Playing with dolls? For girls. Skipping? For girls. Singing and performing? For girls. Over time, phrases like \u0026#34;Why do you talk like that?\u0026#34; \u0026#34;You walk like a girl,\u0026#34; or \u0026#34;You write like a girl,\u0026#34; taught me to shrink myself. I began to internalize society\u0026#39;s disdain for femininity, masking the parts of myself that felt natural, vibrant, and alive. \u003c/p\u003e\u003cp data-element-index=\"3\"\u003eBy age 11, I had learned to hate everything feminine about myself. It was a survival mechanism. Each comment about my mannerisms, my voice, or interests felt like a spotlight, making me exposed and vulnerable. At new schools, instead of being asked where I was from or what games I liked, the first questions were always, \u0026#34;Why do you talk like that?\u0026#34; or \u0026#34;Why is your handwriting so girly?\u0026#34; These small, cutting observations reminded me that my genuine nature was not meant for me…a future man.\u003c/p\u003e\u003cp data-element-index=\"4\"\u003eWhen a person\u0026#39;s identity makes them a target, they begin to hide. Not only was I unknowingly hiding my \u0026#34;brownness\u0026#34; as a Puerto Rican,  but I was now also hiding the essence of what made me \u003cem\u003eme\u003c/em\u003e. And hiding comes at a cost: The quote \u0026#34;Desperation holds hands with degradation\u0026#34; resonates with me. \u003c/p\u003e\u003cp data-element-index=\"5\"\u003eIn my desperation to fit in, I began degrading myself — and, by extension, degrading others who were like me. My \u003ca href=\"https://www.popsugar.com/health/adhd-48865492\"\u003eADHD\u003c/a\u003e had already started to teach me how to mask early on, and now that skill was transferred to my everyday life. I began to mask so well that I completely erased who I was. I shortened the sway in my hips, deepened my voice, and learned the handshake-pat that still makes me uneasy. I puffed my chest, feigned anger when I felt vulnerable, and did everything I could to blend in with the boys who didn\u0026#39;t have to think twice about their place in the world.\u003c/p\u003e\u003cp data-element-index=\"6\"\u003eI relied heavily on the character I had created throughout my 20s and into my 30s. Even with the amount of masking I did, I was still \u0026#34;clocked\u0026#34; as gay almost immediately by nearly every person I came into contact with my entire life. \u003c/p\u003e\u003cp data-element-index=\"7\"\u003eAfter coming out, I learned the gay community also relies heavily on heteronormative ideologies to determine worth. I relied on my ability to erase the feminine as much as possible. Makeup? Didn\u0026#39;t know her. The first time a guy I was dating asked if I was \u003ca href=\"https://www.popsugar.com/beauty/makeup-queer-men-find-confidence-48902166\"\u003ewearing concealer\u003c/a\u003e, I almost fainted from embarrassment. I straightened my hair and chased the whitest, most palatable version of myself. Suffice it to say, even through all that masking, I was still seen as feminine by some standards (both gay and straight).\u003c/p\u003e\u003cp data-element-index=\"8\"\u003eThen, in 2019, I decided to become more transparent on social media about skin care. I started sharing tips, like how to easily hide \u003ca href=\"https://www.popsugar.com/beauty/How-Do-I-Apply-Concealer-Under-Eyes-44044176\"\u003eundereye bags with concealer\u003c/a\u003e. Soon, cis men flocked to my DMs asking for advice: \u0026#34;How do I pick a concealer?\u0026#34; \u0026#34;How do I wear makeup without anyone noticing?\u0026#34; That\u0026#39;s when my personal brand started to develop and where the exploration and rehabilitation of my feminine side began to bloom.\u003c/p\u003e\u003cp data-element-index=\"9\"\u003eBut as I embraced my femininity, I also had to unpack all the ways I had internalized and perpetuated a misogynistic worldview. Rejecting femininity wasn\u0026#39;t just about survival — it was about upholding the same rigid masculinity that complicated my life to begin with. The more I leaned into my femininity, the more I saw how \u003ca href=\"https://www.popsugar.com/relationships/how-machismo-shaped-my-views-on-love-relationships-49417367\"\u003emasculinity\u003c/a\u003e — especially the toxic version that dominates so much of our culture — has harmed not just me but the entire world. It forces men into emotional repression and women into subservience. It breeds violence, control, and insecurity. And I had to admit: I was complicit. \u003c/p\u003e\u003cp data-element-index=\"10\"\u003eOn social media, I express my gender subversively — and that\u0026#39;s my intention. It turns the way we think about gender on its head. It is an extreme version of what someone else might experience in smaller, more personal, or more meaningful ways. Some people might never wear a wig or a full makeup beat, but they might feel a little freer in how they express themselves. And if what I do opens that door, I\u0026#39;ve done my job.\u003c/p\u003e\u003c/div\u003e\u003cp data-element-index=\"0\"\u003eIn a time when some believe society is crumbling, I see it differently: I see the world being rebuilt. People are waking up, questioning old structures, and rejecting outdated roles that no longer serve them. Yes, change is uncomfortable, but it\u0026#39;s also necessary. The backlash against \u003ca href=\"https://www.popsugar.com/identity/blue-states-lgbtq-rights-trump-49422687\"\u003egender expression\u003c/a\u003e, against fluidity, against anything that dares to challenge the status quo — that\u0026#39;s the fear of a system that knows it\u0026#39;s losing control. And that? That\u0026#39;s progress.\u003c/p\u003e\u003cp\u003eTrue masculinity isn\u0026#39;t about dominance or suppressing vulnerability, it\u0026#39;s about balance, authenticity, and the courage to show up as your full self.\u003c/p\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"7\"\u003e\u003cp data-element-index=\"0\"\u003eTrue masculinity isn\u0026#39;t about dominance or suppressing vulnerability, it\u0026#39;s about balance, authenticity, and the courage to show up as your full self. For me, leaning into the feminine is reclaiming my power, reconnecting with the awe I felt as a child watching my mother\u0026#39;s strength, or marveling at the beauty and power of the characters I admired. It has allowed me to break free from the narrow box I was forced into and define manhood on my own terms.\u003c/p\u003e\u003cp data-element-index=\"1\"\u003eI\u0026#39;ve realized that masculinity can be expansive, not restrictive. It could hold space for softness, vulnerability, and care — qualities often mislabeled as feminine. I relearned how to connect with others, not through posturing or bravado, but through genuine emotional intimacy. The relationships I\u0026#39;ve built since shedding my many masks and dismantling the structures I created to protect myself have been richer, more fulfilling, and more authentic than I ever thought possible.\u003c/p\u003e\u003cp data-element-index=\"2\"\u003eBy allowing myself to cry, to express fear or uncertainty, and to lean on others, put on the skirt, and let my wrist hang limp when it feels like it, I\u0026#39;ve dismantled the walls I built around myself. And in doing so, I\u0026#39;ve been able to show up for the people in my life — not as a caricature of what a man is supposed to be, but as the multifaceted, deeply human person I am.\u003c/p\u003e\u003cp data-element-index=\"3\"\u003eEmbracing my feminine side didn\u0026#39;t take anything away from me. It gave me everything. It made me whole. And maybe just maybe, it can do the same for you.\u003c/p\u003e\u003cp data-element-index=\"5\"\u003e\u003cem\u003e\u003ca href=\"https://www.popsugar.com/author/david-lopez\"\u003eDavid Lopez\u003c/a\u003e (he/him) is a New York-based hairstylist, beauty expert, and creative consultant known for his mission to degenderize and demystify the beauty industry. Through inclusivity and transparency, his work supports and inspires individuals on their journey to self-confidence. David has worked with celebrities like Ashley Graham and Chrissy Teigen and brands like Ulta Beauty, Kenra, and Bumble and Bumble, showcasing his versatility in front of and behind the camera. He is a member of the \u003ca href=\"https://www.popsugar.com/meet-the-ps-council\"\u003ePS Council\u003c/a\u003e.\u003c/em\u003e\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-03-17T23:10:01Z",
  "modifiedTime": "2025-03-17T23:10:01Z"
}
