{
  "id": "1c43869f-0786-4729-9447-6fff4e03ba64",
  "title": "Ring In New Year's Eve With a Makeup Look Based on Your Zodiac Sign",
  "link": "https://www.popsugar.com/beauty/new-years-eve-makeup-based-zodiac-sign-48087326",
  "description": "Break out your most festive manicure, throw on the fanciest outfit in your closet, and pop a bottle of bubbly because New Year's Eve is finally here and it's time to kiss 2024 goodbye. Whether you have a lavish party to attend or an intimate get-together at home, it's still fun to go all out - just because. You'll want to be prepared to take all of the hot Instagram selfies and start 2025 off in style. There's no better way to do that than get dressed to the nines and look your absolute best. Meaning, it's the perfect time to try out a new beauty look that you've never done before. But if the idea of thinking about one more thing amid this holiday frenzy is too overwhelming, why not pick your New Year's Eve makeup based on your zodiac sign? Blue graphic eyeliner? Sure. Glitter lipstick? Why not? Rhinestone embellishments? The more the better. If you're really up for a challenge, step out of your comfort zone and have a little fun by allowing your zodiac sign to dictate your hair, too. Start 2024 off feeling inspired and find your perfect New Year's Eve makeup look based on your zodiac sign, ahead.",
  "author": "Jessica Harrington",
  "published": "Fri, 27 Dec 2024 06:10:02 -0800",
  "source": "https://www.popsugar.com/beauty/feed",
  "categories": [
    "Holiday Beauty",
    "Astrology",
    "Makeup",
    "New Year's Eve"
  ],
  "byline": "Jessica Harrington",
  "length": 4569,
  "excerpt": "Step outside of your comfort zone for your New Year's Eve makeup look by allowing your zodiac sign to dictate your glam.",
  "siteName": "Popsugar",
  "favicon": "",
  "text": "Break out your most festive manicure, throw on the fanciest outfit in your closet, and pop a bottle of bubbly because New Year's Eve is finally here and it's time to kiss 2024 goodbye. Whether you have a lavish party to attend or an intimate get-together at home, it's still fun to go all out — just because. You'll want to be prepared to take all of the hot Instagram selfies and start 2025 off in style. There's no better way to do that than get dressed to the nines and look your absolute best. Meaning, it's the perfect time to try out a new beauty look that you've never done before. But if the idea of thinking about one more thing amid this holiday frenzy is too overwhelming, why not pick your New Year's Eve makeup based on your zodiac sign? Blue graphic eyeliner? Sure. Glitter lipstick? Why not? Rhinestone embellishments? The more the better. If you're really up for a challenge, step out of your comfort zone and have a little fun by allowing your zodiac sign to dictate your hair, too. Start 2024 off feeling inspired and find your perfect New Year's Eve makeup look based on your zodiac sign, ahead.Capricorn (Dec. 22-Jan. 19): Classic Winged Liner and Red LipAs a Capricorn, your makeup style probably falls on the more practical side most of the time. Add rhinestones to a classic winged liner and bold red lip makeup look to make it feel special.Aquarius (Jan. 20-Feb. 18): Bold Winged EyeshadowIn true Aquarius form, you like when your makeup look showcases your bold personality. A deep maroon winged eyeshadow look shaped in a wing will make you stand out.Pisces (Feb. 19-March 20): Bright Eyeshadow and a Soft LipYou have a kind and sensitive spirit but are also very imaginative. A bright eyeshadow look, like this yellow moment, that extends up to the brows is your perfect match. Pair it with a soft lipstick shade to keep it from feeling too overpowering. Aries (March 21-April 19): Metallic Star EyeshadowIf you're an Aries, no makeup look is too bold or too adventurous for you. This starry metallic eyeshadow look that meets the brows will have you looking like the true star that you are. Editor's note: use star-shaped stickers and liquid eyeshadow to make recreating this look easy.Taurus (April 20-May 20): Frosty Blue EyeshadowTauruses are notoriously strong-willed but they're not without a sensitive side. A frosty blue eyeshadow look and bold red lip matches your strong personality.Gemini (May 21-June 20): Glossy Eyelid and Bold LipstickAs a Gemini, you're dynamic and hate to feel like you're limited in any way, including your makeup. A glossy eyelid and bold red lip are versatile enough that you won't grow tired of them after a few hours. Cancer (June 21-July 22): Soft, Pastel Shimmery Eye and Neutral LipImaginative, sensitive, romantic — those are just a few words used to describe a Cancer. Nothing says romantic like a soft, pastel shimmery eye makeup look and a neutral, matte lip.Leo (July 23-Aug. 22): Gold Glitter Eye and Bold Red LipstickIf you're a Leo, you probably feel most like yourself when you're the center of attention in full glam. A gold, glittery eye makeup look — complete with false lashes and a wing — with a bold red lip is for you. Virgo (Aug. 23-Sept. 22): Black Graphic EyelinerAs a Virgo, your everyday makeup look is probably more on the minimal side. This New Year's Eve, give your simple black eyeliner an upgrade by drawing it on in a graphic shape.Libra (Sept. 23-Oct. 22): Smoky Eye Makeup and Neutral LipstickA smoky eye makeup look and neutral lip will appeal to a Libra's easy-going personality. By adding a gloss to your lips and layering on the mascara, this look feels special enough for New Year's Eve.Scorpio (Oct. 23-Nov. 21): Neon Graphic EyelinerScorpios have a bold and magnetic personality. Only an out-of-the-box, neon graphic eyeliner look will do for ringing in the new year. Sagittarius (Nov. 22-Dec. 21): Star and Rhinestone Eye MakeupNothing says fun-loving, free-spirited Sagittarius quite like a hand-drawn eye makeup look. Get creative and draw on whatever shapes feel best to make this rhinestone and star eye makeup look feel unique to you. Jessica Harrington (she/her) is the senior editor of PS Beauty, where she oversees coverage around makeup, skin care, hair, tattoos, and more. With more than eight years of industry experience, she has interviewed countless celebrities, reported on hundreds of beauty trends, and swatched more lipsticks than she can count. Prior to PS, Jessica worked for publications such as Makeup.com, Skincare.com, and The Zoe Report.",
  "image": "https://media1.popsugar-assets.com/files/thumbor/Yn5YwMgqoLNNDtrX7uk_IWUvZCM=/8x828:5385x3651/fit-in/5395x8089/filters:format_auto():quality(85):upscale()/2024/12/19/884/n/1922153/fcb9c94f67647e4a84b417.49666875_.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main-content\" data-pinnacle-page-type=\"gallery\"\u003e\u003carticle data-article-index=\"0\" data-article-nid=\"5140925\"\u003e\u003cdiv width=\"1\"\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"2\"\u003e\u003cp data-element-index=\"0\"\u003eBreak out your \u003ca href=\"https://www.popsugar.com/beauty/New-Year-Eve-Nail-Art-Ideas-36323748\"\u003emost festive manicure\u003c/a\u003e, throw on the fanciest outfit in your closet, and pop a bottle of bubbly because New Year\u0026#39;s Eve is finally here and it\u0026#39;s time to kiss 2024 goodbye.  \u003c/p\u003e\u003cp data-element-index=\"1\"\u003eWhether you have a lavish party to attend or an intimate get-together at home, it\u0026#39;s still fun to go all out — just because. You\u0026#39;ll want to be prepared to take all of the hot Instagram selfies and start 2025 off in style. There\u0026#39;s no better way to do that than get dressed to the nines and look your absolute best. Meaning, it\u0026#39;s the perfect time to try out a new beauty look that you\u0026#39;ve never done before. But if the idea of thinking about \u003cem\u003eone more thing\u003c/em\u003e amid this holiday frenzy is too overwhelming, why not pick your New Year\u0026#39;s Eve makeup based on your zodiac sign? Blue graphic eyeliner? Sure. Glitter lipstick? Why not? Rhinestone embellishments? The more the better. If you\u0026#39;re really up for a challenge, step out of your comfort zone and have a little fun by allowing your \u003ca href=\"https://www.popsugar.com/beauty/holiday-hairstyle-zodiac-sign-47961175\"\u003ezodiac sign to dictate your hair\u003c/a\u003e, too. \u003c/p\u003e\u003cp data-element-index=\"2\"\u003eStart 2024 off feeling inspired and find your perfect New Year\u0026#39;s Eve makeup look based on your zodiac sign, ahead.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"photo-48087361\" data-element-type=\"ParagraphSlide\" data-element-index=\"3\"\u003e\u003ch2\u003eCapricorn (Dec. 22-Jan. 19): Classic Winged Liner and Red Lip\u003c/h2\u003e\u003cdiv\u003e\u003cp data-element-index=\"0\"\u003eAs a Capricorn, your makeup style probably falls on the more practical side most of the time. Add rhinestones to a classic winged liner and bold red lip makeup look to make it feel special.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"photo-48087364\" data-element-type=\"ParagraphSlide\" data-element-index=\"5\"\u003e\u003ch2\u003eAquarius (Jan. 20-Feb. 18): Bold Winged Eyeshadow\u003c/h2\u003e\u003cdiv\u003e\u003cp data-element-index=\"0\"\u003eIn true Aquarius form, you like when your makeup look showcases your bold personality. A deep maroon winged eyeshadow look shaped in a wing will make you stand out.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"photo-48087356\" data-element-type=\"ParagraphSlide\" data-element-index=\"6\"\u003e\u003ch2\u003ePisces (Feb. 19-March 20): Bright Eyeshadow and a Soft Lip\u003c/h2\u003e\u003cdiv\u003e\u003cp data-element-index=\"0\"\u003eYou have a kind and sensitive spirit but are also very imaginative. A bright eyeshadow look, like this yellow moment, that extends up to the brows is your perfect match. Pair it with a soft lipstick shade to keep it from feeling too overpowering. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"photo-48087360\" data-element-type=\"ParagraphSlide\" data-element-index=\"7\"\u003e\u003ch2\u003eAries (March 21-April 19): Metallic Star Eyeshadow\u003c/h2\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"1\"\u003e\u003cp data-element-index=\"0\"\u003eIf you\u0026#39;re an Aries, no makeup look is too bold or too adventurous for you. This starry metallic eyeshadow look that meets the brows will have you looking like the true star that you are. \n\u003c/p\u003e\u003cp data-element-index=\"1\"\u003eEditor\u0026#39;s note: use star-shaped stickers and liquid eyeshadow to make recreating this look easy.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"photo-48087359\" data-element-type=\"ParagraphSlide\" data-element-index=\"8\"\u003e\u003ch2\u003eTaurus (April 20-May 20): Frosty Blue Eyeshadow\u003c/h2\u003e\u003cdiv\u003e\u003cp data-element-index=\"0\"\u003eTauruses are notoriously strong-willed but they\u0026#39;re not without a sensitive side. A frosty blue eyeshadow look and bold red lip matches your strong personality.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"photo-48087403\" data-element-type=\"ParagraphSlide\" data-element-index=\"9\"\u003e\u003ch2\u003eGemini (May 21-June 20): Glossy Eyelid and Bold Lipstick\u003c/h2\u003e\u003cdiv\u003e\u003cp data-element-index=\"0\"\u003eAs a Gemini, you\u0026#39;re dynamic and hate to feel like you\u0026#39;re limited in any way, including your makeup. A glossy eyelid and bold red lip are versatile enough that you won\u0026#39;t grow tired of them after a few hours. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"photo-48087357\" data-element-type=\"ParagraphSlide\" data-element-index=\"10\"\u003e\u003ch2\u003eCancer (June 21-July 22): Soft, Pastel Shimmery Eye and Neutral Lip\u003c/h2\u003e\u003cdiv\u003e\u003cp data-element-index=\"0\"\u003eImaginative, sensitive, romantic — those are just a few words used to describe a Cancer. Nothing says romantic like a soft, pastel shimmery eye makeup look and a neutral, matte lip.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"photo-48087368\" data-element-type=\"ParagraphSlide\" data-element-index=\"11\"\u003e\u003ch2\u003eLeo (July 23-Aug. 22): Gold Glitter Eye and Bold Red Lipstick\u003c/h2\u003e\u003cdiv\u003e\u003cp data-element-index=\"0\"\u003eIf you\u0026#39;re a Leo, you probably feel most like yourself when you\u0026#39;re the center of attention in full glam. A gold, glittery eye makeup look — complete with false lashes and a wing — with a bold red lip is for you. \u003cem\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"photo-48087404\" data-element-type=\"ParagraphSlide\" data-element-index=\"12\"\u003e\u003ch2\u003eVirgo (Aug. 23-Sept. 22): Black Graphic Eyeliner\u003c/h2\u003e\u003cdiv\u003e\u003cp data-element-index=\"0\"\u003eAs a Virgo, your everyday makeup look is probably more on the minimal side. This New Year\u0026#39;s Eve, give your simple black eyeliner an upgrade by drawing it on in a graphic shape.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"photo-48087362\" data-element-type=\"ParagraphSlide\" data-element-index=\"13\"\u003e\u003ch2\u003eLibra (Sept. 23-Oct. 22): Smoky Eye Makeup and Neutral Lipstick\u003c/h2\u003e\u003cdiv\u003e\u003cp data-element-index=\"0\"\u003eA smoky eye makeup look and neutral lip will appeal to a Libra\u0026#39;s easy-going personality. By adding a gloss to your lips and layering on the mascara, this look feels special enough for New Year\u0026#39;s Eve.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"photo-48087405\" data-element-type=\"ParagraphSlide\" data-element-index=\"14\"\u003e\u003ch2\u003eScorpio (Oct. 23-Nov. 21): Neon Graphic Eyeliner\u003c/h2\u003e\u003cdiv\u003e\u003cp data-element-index=\"0\"\u003eScorpios have a bold and magnetic personality. Only an out-of-the-box, neon graphic eyeliner look will do for ringing in the new year. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"photo-48087421\" data-element-type=\"ParagraphSlide\" data-element-index=\"15\"\u003e\u003ch2\u003eSagittarius (Nov. 22-Dec. 21): Star and Rhinestone Eye Makeup\u003c/h2\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"1\"\u003e\u003cp data-element-index=\"0\"\u003eNothing says fun-loving, free-spirited Sagittarius quite like a hand-drawn eye makeup look. Get creative and draw on whatever shapes feel best to make this rhinestone and star eye makeup look feel unique to you.\n\u003c/p\u003e\u003cp data-element-index=\"2\"\u003e\u003cem\u003e\u003ca href=\"https://www.popsugar.com/author/jessicalharrington\"\u003eJessica Harrington\u003c/a\u003e (she/her) is the senior editor of PS Beauty, where she oversees coverage around makeup, skin care, hair, tattoos, and more. With more than eight years of industry experience, she has interviewed countless celebrities, reported on hundreds of beauty trends, and swatched more lipsticks than she can count. Prior to PS, Jessica worked for publications such as Makeup.com, Skincare.com, and The Zoe Report.\u003c/em\u003e\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2020-12-31T18:55:04Z",
  "modifiedTime": "2024-12-27T14:10:02Z"
}
