{
  "id": "3a358ab5-c162-4d77-9422-ed32d8cd6bd3",
  "title": "I’m Showing Up For My Community, Thanks To The Power Of Makeup",
  "link": "https://www.refinery29.com/en-us/ndeye-peinda-black-community-makeup?utm_source=feed\u0026utm_medium=rss",
  "description": "For some, a lipstick is just a lipstick. But for others, it’s a source of strength, creativity, and expression. In our series Power Faces, we’ll explore the relationship between strong women and the makeup they choose to wear — or not. In partnership with NYX, our latest subject is beauty content creator and rising social media star Ndeye Peinda. This story was told to Shawna Hudson and edited for length and clarity. My passion for beauty started long before I began creating content online. As a young, dark-skinned Senegalese girl growing up in Harlem, I was captivated by content creators on YouTube and how they would do their hair and makeup — but none of them looked like me. Even so, I couldn’t wait to try everything they were doing. I’d run to the drugstore to buy the same products and follow the same steps. Did I look like an ashy, gray mess at first? Yes, but I didn’t care — I was just excited to find something I loved.  Fast forward a few years to college when I was hit with a revelation: There was a gap. There were no Black makeup content creators — I was taking tips from people who were three or four shades lighter than me. So I thought to myself, Why don’t I see if I can do this? At first, I was scared. This was in 2017 when there was still a lack of inclusivity in the content creation community. Originally, I didn’t even want to be the face of my own content. I tried my hand at being a makeup artist because I wanted to provide the best makeup tips for deeper skin tones. But it was disheartening in the beginning — I wasn’t getting booked enough. So I pivoted and started to share tips using myself as a model. I was afraid of putting myself out there, of mean remarks, of haters. But the responses exceeded all my expectations. I was on a mission to be of service to people who look like me, and I finally started to feel like the content I was making really resonated with people and I was calling back my power. Black women are often left out of the conversation or are an afterthought when it comes to most makeup products. When I first started posting, there weren’t many brands that had inclusive foundation shade ranges, which made it harder to do my job. Now, I have plenty of foundations that I can use, but when it comes to other products like blush, contour, and bronzer, there aren’t as many options that work for my skin tone.  I’ve noticed (even to this day) that few brands go above and beyond for Black beauty consumers. There doesn’t seem to be much excitement around products that cater to Black women. NYX is one exception — the brand’s Butter Gloss in Gingersnap was the first lip gloss I fell in love with. It’s this stunning shade with incredible color payoff, and it just complements Black skin so well. Every time I wear it, I always get compliments. I felt like NYX, which offers these beautiful products that blend artistry with value, was one of the first beauty brands that made me feel seen. The fact that I can find shades in multiple makeup categories that work for me is nothing short of revolutionary.  My content now is all about representing folks who look like me and showing up as my authentic self. This confidence I have stems from within, and when it matches my appearance (especially when my makeup is on point, my hair is done, I’ve spritzed on a fragrance), there’s a completely new energy. I feel like I belong in whatever room I step into. Makeup gives me that freedom to create whatever look I want and feel like my best self.  And that’s important to me as a Black creator in a world where things look uncertain for us right now, from less diversity in the workplace to few Black women at the C-suite level. I see that and it makes me want to champion our community even more. I’m always going to show up for the community that I’ve fostered. It’s time to show brands that we’re still here, we still want to buy their products, and we shouldn’t be forgotten about.  Inclusivity is important because everyone deserves to feel like they belong — regardless of race, gender, religion, sexuality, or identity. We live in a society with these “rules” that are set out for us before we’re born and your value is based on where you “fit” into society. We’re told that only thinness, whiteness, and proximity to whiteness is what beauty is, so every day, I work toward breaking that stereotypical beauty mold. That’s why an inclusive beauty campaign is everything to me — it makes me feel like I fit in, that I belong. People need to know that they’re valued, beautiful, and that they deserve access. If I could speak to my younger self right now, I would tell her that the things you get made fun of are going to be the things that people clap for in the future. Don’t feel bad about yourself — everyone else will catch up. Shop Ndeye’s makeup look: Like what you see? How about some more R29 goodness, right here?",
  "author": "Shawna Hudson",
  "published": "Wed, 18 Dec 2024 16:22:06 +0000",
  "source": "https://www.refinery29.com/beauty/rss.xml",
  "categories": null,
  "byline": "Shawna Hudson",
  "length": 4979,
  "excerpt": "In our series Power Faces, we'll explore the relationship between strong women and the makeup they choose to wear — or not. Our latest subject is beauty content creator and rising social media star Ndeye Peinda.",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "For some, a lipstick is just a lipstick. But for others, it's a source of strength, creativity, and expression. In our series Power Faces, we'll explore the relationship between strong women and the makeup they choose to wear — or not. In partnership with NYX, our latest subject is beauty content creator and rising social media star Ndeye Peinda. This story was told to Shawna Hudson and edited for length and clarity.My passion for beauty started long before I began creating content online. As a young, dark-skinned Senegalese girl growing up in Harlem, I was captivated by content creators on YouTube and how they would do their hair and makeup — but none of them looked like me. Even so, I couldn’t wait to try everything they were doing. I’d run to the drugstore to buy the same products and follow the same steps. Did I look like an ashy, gray mess at first? Yes, but I didn’t care — I was just excited to find something I loved. AdvertisementADVERTISEMENTFast forward a few years to college when I was hit with a revelation: There was a gap. There were no Black makeup content creators — I was taking tips from people who were three or four shades lighter than me. So I thought to myself, Why don’t I see if I can do this?Photographed by Josefina SantosAt first, I was scared. This was in 2017 when there was still a lack of inclusivity in the content creation community. Originally, I didn’t even want to be the face of my own content. I tried my hand at being a makeup artist because I wanted to provide the best makeup tips for deeper skin tones. But it was disheartening in the beginning — I wasn’t getting booked enough. So I pivoted and started to share tips using myself as a model. I was afraid of putting myself out there, of mean remarks, of haters. But the responses exceeded all my expectations. I was on a mission to be of service to people who look like me, and I finally started to feel like the content I was making really resonated with people and I was calling back my power.Black women are often left out of the conversation or are an afterthought when it comes to most makeup products. When I first started posting, there weren’t many brands that had inclusive foundation shade ranges, which made it harder to do my job. Now, I have plenty of foundations that I can use, but when it comes to other products like blush, contour, and bronzer, there aren't as many options that work for my skin tone. AdvertisementADVERTISEMENTI’ve noticed (even to this day) that few brands go above and beyond for Black beauty consumers. There doesn’t seem to be much excitement around products that cater to Black women. NYX is one exception — the brand’s Butter Gloss in Gingersnap was the first lip gloss I fell in love with. It’s this stunning shade with incredible color payoff, and it just complements Black skin so well. Every time I wear it, I always get compliments. I felt like NYX, which offers these beautiful products that blend artistry with value, was one of the first beauty brands that made me feel seen. The fact that I can find shades in multiple makeup categories that work for me is nothing short of revolutionary. My content now is all about representing folks who look like me and showing up as my authentic self. This confidence I have stems from within, and when it matches my appearance (especially when my makeup is on point, my hair is done, I’ve spritzed on a fragrance), there’s a completely new energy. I feel like I belong in whatever room I step into. Makeup gives me that freedom to create whatever look I want and feel like my best self. Photographed by Josefina SantosAnd that’s important to me as a Black creator in a world where things look uncertain for us right now, from less diversity in the workplace to few Black women at the C-suite level. I see that and it makes me want to champion our community even more. I’m always going to show up for the community that I’ve fostered. It’s time to show brands that we’re still here, we still want to buy their products, and we shouldn’t be forgotten about. AdvertisementADVERTISEMENTInclusivity is important because everyone deserves to feel like they belong — regardless of race, gender, religion, sexuality, or identity. We live in a society with these “rules” that are set out for us before we’re born and your value is based on where you “fit” into society. We’re told that only thinness, whiteness, and proximity to whiteness is what beauty is, so every day, I work toward breaking that stereotypical beauty mold. That’s why an inclusive beauty campaign is everything to me — it makes me feel like I fit in, that I belong. People need to know that they’re valued, beautiful, and that they deserve access.If I could speak to my younger self right now, I would tell her that the things you get made fun of are going to be the things that people clap for in the future. Don’t feel bad about yourself — everyone else will catch up.Shop Ndeye's makeup look:AdvertisementADVERTISEMENT",
  "image": "https://www.refinery29.com/images/11823386.jpg?crop=40%3A21",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"editorial-content\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eFor some, a lipstick is just a lipstick. But for others, it\u0026#39;s a source of strength, creativity, and expression. In our series \u003c/em\u003e\u003ca href=\"https://r29.co/2RcLZ2B\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003e\u003cem\u003ePower Faces\u003c/em\u003e\u003c/a\u003e\u003cem\u003e, we\u0026#39;ll explore the relationship between strong women and the makeup they choose to wear — or not. In partnership with \u003c/em\u003e\u003ca href=\"https://www.nyxcosmetics.com/?srsltid=AfmBOorMprOPAHJfrMhgZnsVC8nKg-ALaiG913auFx-6RnxuiVumICM1\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003e\u003cem\u003eNYX\u003c/em\u003e\u003c/a\u003e\u003cem\u003e, our latest subject is beauty content creator and rising social media star \u003c/em\u003e\u003ca href=\"https://www.instagram.com/ndeye.peinda\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003e\u003cem\u003eNdeye Peinda\u003c/em\u003e\u003c/a\u003e\u003cem\u003e. This story was told to Shawna Hudson and edited for length and clarity.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eMy passion for beauty started long before I began creating content online. As a young, dark-skinned Senegalese girl growing up in Harlem, I was captivated by content creators on YouTube and how they would do their hair and makeup — but none of them looked like me. Even so, I couldn’t wait to try everything they were doing. I’d run to the drugstore to buy the same products and follow the same steps. Did I look like an ashy, gray mess at first? Yes, but I didn’t care — I was just excited to find something I loved. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eFast forward a few years to college when I was hit with a revelation: There was a gap. There were no Black makeup content creators — I was taking tips from people who were three or four shades lighter than me. So I thought to myself, \u003cem\u003eWhy don’t I see if I can do this?\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003ePhotographed by Josefina Santos\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAt first, I was scared. This was in 2017 when there was still a lack of inclusivity in the content creation community. Originally, I didn’t even want to be the face of my own content. I tried my hand at being a makeup artist because I wanted to provide the best makeup tips for deeper skin tones. But it was disheartening in the beginning — I wasn’t getting booked enough. So I pivoted and started to share tips using myself as a model. I was afraid of putting myself out there, of mean remarks, of haters. But the responses exceeded all my expectations. I was on a mission to be of service to people who look like me, and I finally started to feel like the content I was making really resonated with people and I was calling back my power.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eBlack women are often left out of the conversation or are an afterthought when it comes to most makeup products. When I first started posting, there weren’t many brands that had inclusive foundation shade ranges, which made it harder to do my job. Now, I have plenty of foundations that I can use, but when it comes to other products like blush, contour, and bronzer, there aren\u0026#39;t as many options that work for my skin tone. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eI’ve noticed (even to this day) that few brands go above and beyond for Black beauty consumers. There doesn’t seem to be much excitement around products that cater to Black women. NYX is one exception — the brand’s \u003ca href=\"https://www.nyxcosmetics.com/lip/lip-gloss/butter-gloss-non-sticky-lip-gloss/800897828387.html\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eButter Gloss in Gingersnap\u003c/a\u003e was the first lip gloss I fell in love with. It’s this stunning shade with incredible color payoff, and it just complements Black skin so well. Every time I wear it, I always get compliments. I felt like NYX, which offers these beautiful products that blend artistry with value, was one of the first beauty brands that made me feel \u003cem\u003eseen\u003c/em\u003e. The fact that I can find shades in \u003cem\u003emultiple\u003c/em\u003e makeup categories that work for me is nothing short of revolutionary. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eMy content now is all about representing folks who look like me and showing up as my authentic self. This confidence I have stems from within, and when it matches my appearance (especially when my makeup is on point, my hair is done, I’ve spritzed on a fragrance), there’s a completely new energy. I feel like I \u003cem\u003ebelong\u003c/em\u003e in whatever room I step into. Makeup gives me that freedom to create whatever look I want and feel like my best self. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003ePhotographed by Josefina Santos\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAnd that’s important to me as a Black creator in a world where things look uncertain for us right now, from less diversity in the workplace to few Black women at the C-suite level. I see that and it makes me want to champion our community even more. I’m \u003cem\u003ealways \u003c/em\u003egoing to show up for the community that I’ve fostered. It’s time to show brands that we’re still here, we still want to buy their products, and we shouldn’t be forgotten about. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eInclusivity is important because everyone deserves to feel like they belong — regardless of race, gender, religion, sexuality, or identity. We live in a society with these “rules” that are set out for us before we’re born and your value is based on where you “fit” into society. We’re told that only thinness, whiteness, and proximity to whiteness is what beauty is, so every day, I work toward breaking that stereotypical beauty mold. That’s why an inclusive beauty campaign is everything to me — it makes me feel like I fit in, that I belong. People need to know that they’re valued, beautiful, and that they deserve access.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIf I could speak to my younger self right now, I would tell her that the things you get made fun of are going to be the things that people clap for in the future. Don’t feel bad about yourself — everyone else will catch up.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eShop Ndeye\u0026#39;s makeup look:\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-12-18T16:22:06Z",
  "modifiedTime": null
}
