{
  "id": "3c5d9e3e-e85f-47b4-9cc4-4a6462d34a4f",
  "title": "\"Euphoria\" Makeup Artist Donni Davy Shares 10 Favorites From Her Kit",
  "link": "https://www.popsugar.com/beauty/makeup-artist-donni-davy-favorite-products-49436608",
  "description": "The Expert Edit features interviews with specialists about the products they swear by in their chosen field. For the latest installment, we spoke to Emmy-winning celebrity makeup artist Donni Davy, the visionary behind \"Euphoria\"'s trendsetting beauty looks. From her must-have complexion products to the eye-catching pigments she reaches for on set and in everyday life, Davy shares the beauty staples she can't live without. The bold, shimmering makeup of \"Euphoria\" is just as iconic as the show itself. But for Donni Davy, the makeup artist behind HBO's hit series, creating viral-worthy makeup moments wasn't always part of her plan. \"I never thought I would be a makeup artist,\" she says. \"I was never really a makeup girly growing up. I was more of a shy art kid.\" Davy's artistic roots run deep - she studied photography at Pratt Institute, initially envisioning a career behind the camera. But after a conversation with a family friend, she realized makeup artistry could merge her love for painting, drawing, and storytelling. That revelation set her on a path that would change her life. Her breakthrough came when HBO tapped her for \"Euphoria\", drawn to the dreamy, avant-garde aesthetic she crafted for the 2018 film \"Under the Silver Lake.\" On set, Davy particularly loves working with Hunter Schafer, whose looks are often the most unpredictable. \"Sometimes, when you have that much freedom, you almost have no idea what to do,\" she says. But that creative challenge is what keeps her inspired. Davy's work has become legendary, earning her a second Emmy in 2022 for Outstanding Contemporary Makeup. As production for season three is officially underway, she continues to treat each character's look as an emotional extension of their journey, meticulously considering lighting, wardrobe, and script cues. \"Makeup communicates so much to the audience,\" she says. \"It's extra info; a storytelling tool.\" Beyond her work in television, Davy is making her mark in the beauty industry. In 2022, she co-founded Half Magic Beauty with A24, bringing a bold, boundary-pushing aesthetic to everyday beauty lovers. With her signature blend of art, emotion, and self-expression, Davy continues to redefine what makeup can be - one shimmering, rhinestone-studded look at a time. Here, Davy shares her must-have beauty picks, the essentials in her makeup bag, and the go-to products that help her power through the day.",
  "author": "Deena Campbell",
  "published": "Thu, 03 Apr 2025 06:25:02 -0700",
  "source": "https://www.popsugar.com/beauty/feed",
  "categories": [
    "Beauty Interview",
    "Beauty Shopping",
    "Makeup",
    "Celebrity Beauty",
    "Euphoria",
    "Expert Edit"
  ],
  "byline": "Deena Campbell",
  "length": 2631,
  "excerpt": "Celebrity makeup artist Donni Davy of “Euphoria” shares beauty staples she can’t live without on and off set.",
  "siteName": "Popsugar",
  "favicon": "",
  "text": "While each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our Product Review Guidelines here.The Expert Edit features interviews with specialists about the products they swear by in their chosen field. For the latest installment, we spoke to Emmy-winning celebrity makeup artist Donni Davy, the visionary behind \"Euphoria\"'s trendsetting beauty looks. From her must-have complexion products to the eye-catching pigments she reaches for on set and in everyday life, Davy shares the beauty staples she can't live without.The bold, shimmering makeup of \"Euphoria\" is just as iconic as the show itself. But for Donni Davy, the makeup artist behind HBO's hit series, creating viral-worthy makeup moments wasn't always part of her plan. \"I never thought I would be a makeup artist,\" she says. \"I was never really a makeup girly growing up. I was more of a shy art kid.\"Davy's artistic roots run deep — she studied photography at Pratt Institute, initially envisioning a career behind the camera. But after a conversation with a family friend, she realized makeup artistry could merge her love for painting, drawing, and storytelling. That revelation set her on a path that would change her life.Her breakthrough came when HBO tapped her for \"Euphoria\", drawn to the dreamy, avant-garde aesthetic she crafted for the 2018 film \"Under the Silver Lake.\" On set, Davy particularly loves working with Hunter Schafer, whose looks are often the most unpredictable. \"Sometimes, when you have that much freedom, you almost have no idea what to do,\" she says. But that creative challenge is what keeps her inspired.Davy's work has become legendary, earning her a second Emmy in 2022 for Outstanding Contemporary Makeup. As production for season three is officially underway, she continues to treat each character's look as an emotional extension of their journey, meticulously considering lighting, wardrobe, and script cues. \"Makeup communicates so much to the audience,\" she says. \"It's extra info; a storytelling tool.\"Beyond her work in television, Davy is making her mark in the beauty industry. In 2022, she co-founded Half Magic Beauty with A24, bringing a bold, boundary-pushing aesthetic to everyday beauty lovers. With her signature blend of art, emotion, and self-expression, Davy continues to redefine what makeup can be — one shimmering, rhinestone-studded look at a time.Here, Davy shares her must-have beauty picks, the essentials in her makeup bag, and the go-to products that help her power through the day.",
  "image": "https://media1.popsugar-assets.com/files/thumbor/R97NEHoECIHckrPG0BeiuBrYrNQ=/0x0:1198x629/fit-in/1200x630/top/filters:format_auto():quality(85):upscale()/2025/04/02/850/n/1922153/01932a1b67ed8f07806e32.95485388_.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eWhile each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our \u003ca href=\"https://www.popsugar.com/ps-product-review-guidelines-disclosures\" target=\"_blank\"\u003eProduct Review Guidelines here\u003c/a\u003e.\u003c/p\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"2\"\u003e\u003cp data-element-index=\"0\"\u003e\u003cem\u003eThe Expert Edit features interviews with specialists about the products they swear by in their chosen field. For the latest installment, we spoke to Emmy-winning celebrity makeup artist \u003c/em\u003e\u003ca href=\"https://www.instagram.com/donni.davy/?hl=en\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_49436608__t_w_\" target=\"_blank\"\u003e\u003cem\u003eDonni Davy\u003c/em\u003e\u003c/a\u003e\u003cem\u003e, the visionary behind \u0026#34;Euphoria\u0026#34;\u0026#39;s trendsetting beauty looks. From her must-have complexion products to the eye-catching pigments she reaches for on set and in everyday life, Davy shares the beauty staples she can\u0026#39;t live without.\u003c/em\u003e\u003c/p\u003e\u003cp data-element-index=\"1\"\u003eThe bold, shimmering makeup of \u003ca href=\"https://www.popsugar.com/beauty/best-euphoria-makeup-looks-48695796\"\u003e\u0026#34;Euphoria\u0026#34;\u003c/a\u003e is just as iconic as the \u003ca href=\"https://www.popsugar.com/beauty/euphoria-maddy-makeup-season-2-48678379\"\u003eshow itself\u003c/a\u003e. But for \u003ca href=\"https://www.popsugar.com/beauty/euphoria-makeup-how-to-46754229\"\u003eDonni Davy\u003c/a\u003e, the makeup artist behind HBO\u0026#39;s hit series, creating viral-worthy makeup moments wasn\u0026#39;t always part of her plan. \u0026#34;I never thought I would be a makeup artist,\u0026#34; she says. \u0026#34;I was never really a makeup girly growing up. I was more of a shy art kid.\u0026#34;\u003c/p\u003e\u003cp data-element-index=\"2\"\u003eDavy\u0026#39;s artistic roots run deep — she studied photography at Pratt Institute, initially envisioning a career behind the camera. But after a conversation with a family friend, she realized makeup artistry could merge her love for painting, drawing, and storytelling. That revelation set her on a path that would change her life.\u003c/p\u003e\u003cp data-element-index=\"3\"\u003eHer breakthrough came when HBO tapped her for \u0026#34;Euphoria\u0026#34;, drawn to the dreamy, avant-garde aesthetic she crafted for the 2018 film \u0026#34;Under the Silver Lake.\u0026#34; On set, Davy particularly loves working with Hunter Schafer, whose looks are often the most unpredictable. \u0026#34;Sometimes, when you have that much freedom, you almost have no idea what to do,\u0026#34; she says. But that creative challenge is what keeps her inspired.\u003c/p\u003e\u003cp data-element-index=\"4\"\u003eDavy\u0026#39;s work has become legendary, earning her a second Emmy in 2022 for Outstanding Contemporary Makeup. As production for \u003ca href=\"https://www.popsugar.com/entertainment/euphoria-season-3-details-48728084\"\u003eseason three is officially underway\u003c/a\u003e, she continues to treat \u003ca href=\"https://www.popsugar.com/beauty/euphoria-makeup-season-2-character-looks-48670833\"\u003eeach character\u0026#39;s look\u003c/a\u003e as an emotional extension of their journey, meticulously considering lighting, wardrobe, and script cues. \u0026#34;Makeup communicates so much to the audience,\u0026#34; she says. \u0026#34;It\u0026#39;s extra info; a storytelling tool.\u0026#34;\u003c/p\u003e\u003cp data-element-index=\"5\"\u003eBeyond her work in television, Davy is making her mark in the beauty industry. In 2022, she co-founded \u003ca href=\"https://www.popsugar.com/beauty/half-magic-euphoria-makeup-product-review-48826592\"\u003eHalf Magic Beauty\u003c/a\u003e with A24, bringing a bold, boundary-pushing aesthetic to everyday beauty lovers. With her signature blend of art, emotion, and self-expression, Davy continues to redefine what makeup can be — one shimmering, \u003ca href=\"https://www.popsugar.com/beauty/crystal-eye-makeup-editor-experiment-48978282\"\u003erhinestone-studded\u003c/a\u003e look at a time.\u003c/p\u003e\u003cp data-element-index=\"6\"\u003eHere, Davy shares her must-have beauty picks, the essentials in her makeup bag, and the go-to products that help her power through the day.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-03T13:25:03Z",
  "modifiedTime": "2025-04-03T13:25:03Z"
}
