{
  "id": "49c2929b-3c6f-43d2-a194-a5a016104d09",
  "title": "5 Little-Known Tips For Eczema That Actually Work, According to Derms",
  "link": "https://www.popsugar.com/beauty/eczema-hacks-49428472",
  "description": "Does eczema have your skin feeling itchy and looking red and scaly no matter what you try, making you wonder if there will ever be relief ahead? Don't worry, you're not alone – according to the National Eczema Association, nearly 32 million Americans (more than 10 percent of all people in the United States) have some form of eczema. Eczema, aka atopic dermatitis, is a \"chronic inflammatory skin condition characterized by dry, scaly, and itchy skin due to an impaired skin barrier,\" says board-certified dermatologist Supriya Rastogi, MD. But what causes eczema in the first place? Though everyone has different triggers, factors like dry, cold weather, emotional or physical stress, or environmental allergens and irritants can cause eczema flare-ups, says double board-certified dermatologist Karan Lal, DO, MS. It can also develop from a genetic predisposition, Dr. Rastogi adds. To help you learn how to effectively treat your eczema when you feel like you've already tried it all, we chatted with both of these dermatologists to get their best out-of-the-box tricks and tips. Ahead, find five hacks that'll actually help your eczema, as recommended by dermatologists. Experts Featured in This Article Karan Lal, DO, MS, is a double board-certified adult, pediatric, and cosmetic dermatologist in Scottsdale, Arizona. Supriya Rastogi, MD, is a board-certified dermatologist at Schweiger Dermatology Group - Park Ave in New York City. 1. Diluted Bleach Baths If you've been trying to treat your eczema with topical products to no avail, it may be time to get in the bath. More specifically, get in a diluted bleach bath (yes, you read that correctly – bleach can help). It can help suppress bacteria on the skin that can contribute to flare-ups and inflammation, and it's also cost-effective, says Dr. Rastogi. \"To prepare, add ¼ cup of household bleach to a half-full bathtub (or ½ cup for a full tub) and soak for 10 minutes,\" she says. She recommends doing this two to three times a week. 2. Layering Products Effectively \u0026 Strategically Turns out, there is a right way and a wrong way to layer your skin-care products, including your prescriptions. If you use eczema medication such as a topical steroid, apply the medication first and follow with a moisturizer, says Dr. Lal. Wait five to 10 minutes before adding the moisturizer to help increase effectiveness, adds Dr. Rastogi. If you don't use any topical eczema medications, simply make sure you're strategically layering skin-care products. For eczema, Dr. Rastogi recommends the popular TikTok trend of slugging. \"Apply a fast-absorbing humectant like hyaluronic acid serum first, followed by a rich ceramide cream, and then seal with an occlusive such as petrolatum to enhance hydration retention,\" she says. 3. Wet Wraps Maximum moisturization is key to any successful eczema treatment. Both Dr. Lal and Dr. Rastogi recommend this wet wrap method for an extra boost of moisturization: Apply a thick layer of moisturizer (an occlusive can work well), and then place damp soft cotton or gauze (or socks or gloves if your hands and feet are affected) at night. \"The water and moist environment will help lock in moisture,\" says Dr. Lal. It's especially effective for severe dryness or scaling as it can also enhance absorption, reduce inflammation, and soothe itching, Dr. Rastogi adds. 4. Hydrotherapy Continuing the aquatic theme, this hydrotherapy technique helps \"increase product absorption, enhance the skin barrier, and maximize hydration,\" says Dr. Rastogi. Rather than moisturizing followed by wet cloth as you would with wet wraps, you can try flipping the order: \"For example, for hand eczema, soak hands in lukewarm water for five to 10 minutes, then apply a thick moisturizer,\" Dr. Rastogi advises. 5. Consciously Clean Hands Though it can be tempting to constantly wash your hands (especially during flu season), if you have eczema on your hands, take note of what you're using to wash. Overusing hand soaps or hand sanitizers can dry out the skin and exacerbate flare-ups. Instead, \"use a gentle face cleanser in place of soap to wash your hands,\" Dr. Lal says. \"You should only use soap if your hands are visibly soiled.\" Catharine Malzahn is a beauty writer and editor with nearly half a decade of experience covering everything from skin care and makeup to spas and injectables.",
  "author": "Catharine Malzahn",
  "published": "Mon, 17 Feb 2025 05:50:02 -0800",
  "source": "https://www.popsugar.com/beauty/feed",
  "categories": [
    "Body Care",
    "Skin Care",
    "Eczema",
    "Skinposium",
    "Condition Center"
  ],
  "byline": "Catharine Malzahn",
  "length": 4345,
  "excerpt": "The best out-of-the-box tricks to treat atopic dermatitis (eczema), according to expert dermatologists, plus products to try.",
  "siteName": "Popsugar",
  "favicon": "",
  "text": "Does eczema have your skin feeling itchy and looking red and scaly no matter what you try, making you wonder if there will ever be relief ahead? Don't worry, you're not alone – according to the National Eczema Association, nearly 32 million Americans (more than 10 percent of all people in the United States) have some form of eczema. Eczema, aka atopic dermatitis, is a \"chronic inflammatory skin condition characterized by dry, scaly, and itchy skin due to an impaired skin barrier,\" says board-certified dermatologist Supriya Rastogi, MD.But what causes eczema in the first place? Though everyone has different triggers, factors like dry, cold weather, emotional or physical stress, or environmental allergens and irritants can cause eczema flare-ups, says double board-certified dermatologist Karan Lal, DO, MS. It can also develop from a genetic predisposition, Dr. Rastogi adds.To help you learn how to effectively treat your eczema when you feel like you've already tried it all, we chatted with both of these dermatologists to get their best out-of-the-box tricks and tips. Ahead, find five hacks that'll actually help your eczema, as recommended by dermatologists.Experts Featured in This ArticleKaran Lal, DO, MS, is a double board-certified adult, pediatric, and cosmetic dermatologist in Scottsdale, Arizona.Supriya Rastogi, MD, is a board-certified dermatologist at Schweiger Dermatology Group - Park Ave in New York City.1. Diluted Bleach BathsIf you've been trying to treat your eczema with topical products to no avail, it may be time to get in the bath. More specifically, get in a diluted bleach bath (yes, you read that correctly – bleach can help). It can help suppress bacteria on the skin that can contribute to flare-ups and inflammation, and it's also cost-effective, says Dr. Rastogi. \"To prepare, add ¼ cup of household bleach to a half-full bathtub (or ½ cup for a full tub) and soak for 10 minutes,\" she says. She recommends doing this two to three times a week.2. Layering Products Effectively \u0026 StrategicallyTurns out, there is a right way and a wrong way to layer your skin-care products, including your prescriptions. If you use eczema medication such as a topical steroid, apply the medication first and follow with a moisturizer, says Dr. Lal. Wait five to 10 minutes before adding the moisturizer to help increase effectiveness, adds Dr. Rastogi.If you don't use any topical eczema medications, simply make sure you're strategically layering skin-care products. For eczema, Dr. Rastogi recommends the popular TikTok trend of slugging. \"Apply a fast-absorbing humectant like hyaluronic acid serum first, followed by a rich ceramide cream, and then seal with an occlusive such as petrolatum to enhance hydration retention,\" she says.3. Wet WrapsMaximum moisturization is key to any successful eczema treatment. Both Dr. Lal and Dr. Rastogi recommend this wet wrap method for an extra boost of moisturization: Apply a thick layer of moisturizer (an occlusive can work well), and then place damp soft cotton or gauze (or socks or gloves if your hands and feet are affected) at night. \"The water and moist environment will help lock in moisture,\" says Dr. Lal. It's especially effective for severe dryness or scaling as it can also enhance absorption, reduce inflammation, and soothe itching, Dr. Rastogi adds.4. HydrotherapyContinuing the aquatic theme, this hydrotherapy technique helps \"increase product absorption, enhance the skin barrier, and maximize hydration,\" says Dr. Rastogi. Rather than moisturizing followed by wet cloth as you would with wet wraps, you can try flipping the order: \"For example, for hand eczema, soak hands in lukewarm water for five to 10 minutes, then apply a thick moisturizer,\" Dr. Rastogi advises.5. Consciously Clean HandsThough it can be tempting to constantly wash your hands (especially during flu season), if you have eczema on your hands, take note of what you're using to wash. Overusing hand soaps or hand sanitizers can dry out the skin and exacerbate flare-ups. Instead, \"use a gentle face cleanser in place of soap to wash your hands,\" Dr. Lal says. \"You should only use soap if your hands are visibly soiled.\"Catharine Malzahn is a beauty writer and editor with nearly half a decade of experience covering everything from skin care and makeup to spas and injectables.",
  "image": "https://media1.popsugar-assets.com/files/thumbor/GSonDfO54kICxl8OnUk4zMacLhU=/0x54:1943x1074/fit-in/1950x2924/filters:format_auto():quality(85):upscale()/2025/02/14/978/n/1922153/1be9923867afc3d24ea376.40653689_.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"2\"\u003e\u003cp data-element-index=\"0\"\u003eDoes \u003ca href=\"https://www.popsugar.com/beauty/What-Eczema-42299866\"\u003eeczema\u003c/a\u003e have your skin feeling itchy and looking red and scaly no matter what you try, making you wonder if there will ever be relief ahead? Don\u0026#39;t worry, you\u0026#39;re not alone – according to the \u003ca href=\"https://nationaleczema.org/research/eczema-facts/?ref=popsugar.com\u0026amp;=___psv__p_49428472__t_w_\" target=\"_blank\"\u003eNational Eczema Association\u003c/a\u003e, nearly 32 million Americans (more than 10 percent of all people in the United States) have some form of eczema. Eczema, aka atopic dermatitis, is a \u0026#34;chronic inflammatory skin condition characterized by dry, scaly, and itchy skin due to an impaired skin barrier,\u0026#34; says board-certified dermatologist Supriya Rastogi, MD.\u003c/p\u003e\u003cp data-element-index=\"1\"\u003eBut what causes eczema in the first place? Though everyone has different triggers, factors like dry, cold weather, emotional or physical stress, or environmental allergens and irritants can cause eczema flare-ups, says double board-certified dermatologist Karan Lal, DO, MS. It can also develop from a genetic predisposition, Dr. Rastogi adds.\u003c/p\u003e\u003cp data-element-index=\"2\"\u003eTo help you learn how to effectively treat your eczema when you feel like you\u0026#39;ve already tried it all, we chatted with both of these dermatologists to get their best out-of-the-box tricks and tips. Ahead, find five hacks that\u0026#39;ll actually help your eczema, as \u003ca href=\"https://www.popsugar.com/beauty/best-eczema-products-49371759\"\u003erecommended by dermatologists\u003c/a\u003e.\u003c/p\u003e\u003cp data-element-index=\"4\" data-element-has-ending-title=\"true\"\u003e\u003ch3\u003eExperts Featured in This Article\u003c/h3\u003e\u003c/p\u003e\u003cp data-element-index=\"5\"\u003e\u003ca href=\"https://www.instagram.com/sirdermzalot/?hl=en\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_49428472__t_w_\" target=\"_blank\"\u003eKaran Lal, DO, MS\u003c/a\u003e, is a double board-certified adult, pediatric, and cosmetic dermatologist in Scottsdale, Arizona.\u003c/p\u003e\u003cp data-element-index=\"6\"\u003e\u003ca href=\"https://www.schweigerderm.com/providers/supriya-rastogi-md/?ref=popsugar.com\u0026amp;=___psv__p_49428472__t_w_\" target=\"_blank\"\u003eSupriya Rastogi, MD\u003c/a\u003e, is a board-certified dermatologist at Schweiger Dermatology Group - Park Ave in New York City.\u003c/p\u003e\u003cp data-element-index=\"8\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003e1. Diluted Bleach Baths\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"9\"\u003eIf you\u0026#39;ve been trying to treat your eczema with topical products to no avail, it may be time to get in the bath. More specifically, get in a diluted \u003ca href=\"https://www.popsugar.com/beauty/bleach-baths-for-eczema-49373974\"\u003ebleach bath\u003c/a\u003e (yes, you read that correctly – bleach can help). It can help suppress bacteria on the skin that can contribute to flare-ups and inflammation, and it\u0026#39;s also cost-effective, says Dr. Rastogi. \u0026#34;To prepare, add ¼ cup of household bleach to a half-full bathtub (or ½ cup for a full tub) and soak for 10 minutes,\u0026#34; she says. She recommends doing this two to three times a week.\u003c/p\u003e\u003cp data-element-index=\"10\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003e2. Layering Products Effectively \u0026amp; Strategically\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"11\"\u003eTurns out, there is a right way and a wrong way to \u003ca href=\"https://www.popsugar.com/beauty/skin-care-routine-order-49120974\"\u003elayer your skin-care products\u003c/a\u003e, including your prescriptions. If you use eczema medication such as a \u003ca href=\"https://www.popsugar.com/beauty/topical-steroid-withdrawal-49366047\"\u003etopical steroid\u003c/a\u003e, apply the medication first and follow with a moisturizer, says Dr. Lal. Wait five to 10 minutes before adding the moisturizer to help increase effectiveness, adds Dr. Rastogi.\u003c/p\u003e\u003cp data-element-index=\"12\"\u003eIf you don\u0026#39;t use any topical eczema medications, simply make sure you\u0026#39;re strategically layering skin-care products. For eczema, Dr. Rastogi recommends the popular TikTok trend of \u003ca href=\"https://www.popsugar.com.au/beauty/skin-slugging-48785543-2\"\u003eslugging\u003c/a\u003e. \u0026#34;Apply a fast-absorbing humectant like hyaluronic acid serum first, followed by a rich ceramide cream, and then seal with an occlusive such as petrolatum to enhance hydration retention,\u0026#34; she says.\u003c/p\u003e\u003cp data-element-index=\"13\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003e3. Wet Wraps\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"14\"\u003eMaximum moisturization is key to any successful eczema treatment. Both Dr. Lal and Dr. Rastogi recommend this wet wrap method for an extra boost of moisturization: Apply a thick layer of moisturizer (an occlusive can work well), and then place damp soft cotton or gauze (or socks or gloves if your hands and feet are affected) at night. \u0026#34;The water and moist environment will help lock in moisture,\u0026#34; says Dr. Lal. It\u0026#39;s especially effective for severe dryness or scaling as it can also enhance absorption, reduce inflammation, and soothe itching, Dr. Rastogi adds.\u003c/p\u003e\u003cp data-element-index=\"15\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003e4. Hydrotherapy\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"16\"\u003eContinuing the aquatic theme, this hydrotherapy technique helps \u0026#34;increase product absorption, enhance the skin barrier, and maximize hydration,\u0026#34; says Dr. Rastogi. Rather than moisturizing followed by wet cloth as you would with wet wraps, you can try flipping the order: \u0026#34;For example, for hand eczema, soak hands in lukewarm water for five to 10 minutes, then apply a thick moisturizer,\u0026#34; Dr. Rastogi advises.\u003c/p\u003e\u003cp data-element-index=\"17\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003e5. Consciously Clean Hands\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"18\"\u003eThough it can be tempting to constantly wash your hands (especially during flu season), if you have eczema on your hands, take note of what you\u0026#39;re using to wash. Overusing hand soaps or hand sanitizers can dry out the skin and exacerbate flare-ups. Instead, \u0026#34;use a gentle face cleanser in place of soap to wash your hands,\u0026#34; Dr. Lal says. \u0026#34;You should only use soap if your hands are visibly soiled.\u0026#34;\u003c/p\u003e\u003cp data-element-index=\"20\"\u003e\u003cem\u003e\u003ca href=\"https://www.popsugar.com/authors/catharine-malzahn\"\u003eCatharine Malzahn\u003c/a\u003e is a beauty writer and editor with nearly half a decade of experience covering everything from skin care and makeup to spas and injectables.\u003cbr/\u003e \u003c/em\u003e\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-02-17T13:50:02Z",
  "modifiedTime": "2025-02-17T13:50:02Z"
}
