{
  "id": "5a91c32f-3c0f-4115-acc5-5b2d7379434f",
  "title": "Kate Hudson on ‘Running Point,’ Her Go-To Hair Routine \u0026 Finding Joy Again",
  "link": "https://www.refinery29.com/en-us/kate-hudson-hair-routine-interview?utm_source=feed\u0026utm_medium=rss",
  "description": "To be in a room with Kate Hudson is to be filled with energy. Walking into our interview, I catch the tail end of a conversation she’s having about moon and rising signs (Hudson is a prototypical Aries). Repositioning herself on the white cloud sectional at the Baccarat Hotel in New York City, Hudson effortlessly bounces the conversation to basketball. Her new Netflix series, Running Point, streams on the flatscreen on the wall in front of us. “Oh, I love this scene,” she says gesturing to the TV. Even without sound, Hudson’s presence is magnetic—her white power suit, high heels, and signature blonde waves commanding the screen. Hudson, being a native Angeleno, felt equipped to take on the role of Isla (a character inspired by the president of the L.A. Lakers, Jeanie Buss). “When you grow up in L.A., you have to know about basketball and the Los Angeles Lakers,” she explains. “Also, my best friend from high school [Baron Davis] became a professional basketball player, so my whole life was going to his games.”  Of course, if you’ve seen the first few episodes, you know that Running Point is focused on the family-business side of the NBA (Succession-coded), which was new territory for Hudson. “I’m not a big follower of trading — like, who is going where — but when we started doing the show, that started to change,” she adds. “But also, the show is really about the family, their dysfunctional hilarity.” While I can’t wait to stream the entire Running Point series, I want to discuss her iconic hair. It’s just been announced that Hudson is the Global Celebrity Spokesperson for Joico, heading their new campaign, Find Your Joi. Ahead, Hudson speaks to Refinery29 about her love for extensions, hair maintenance, and how she finds joy. The following interview was edited for length and clarity. R29: Your hair is so long and blonde in this show, are you wearing extensions?Kate Hudson: Yes, I love extensions. My hair is super healthy but it’s probably there [gestures to shoulder]. I just change it with extensions when I want to or need to. R29: How would you describe your hair type? KH: I’ve had hair that was unruly and defiant my whole life so I’ve just learned to go with it. I either have to defuse my hair to make it curly, or blow it out to make it straight. Thank God for these [Joico] products, but it’s a lot of buns in my life. View this post on Instagram A post shared by Kate Hudson (@katehudson) R29: What does wash-day look like to you? How often are you washing your hair and what are you using to style it? KH: I used to go four or five days and not wash my hair. But then I just [filmed] this movie where I had to wash my hair every day and my hair got so healthy. In the movie, I chose to use no extensions, nothing, it’s just my own hair. We used hot rollers and spray, and then I’d go home and wash my hair every night — and this was for like three months — and my hair got very healthy. I think it needs to be washed. For some reason, if I’m not washing my hair, it starts to break. I love the Defy Damage shampoo and conditioner. The mask is also good for anyone who colors their hair, which I do once a week. View this post on Instagram A post shared by Kate Hudson (@katehudson) R29: What does a good hair day look like for you? KH: I strongly believe that when your hair looks good, it really does change the way you feel about everything. A good hair day is much more important than a good makeup day. But it’s hit or miss for me. If I have to do my hair myself and it didn’t dry nicely, I’m going to put it in a bun. If it’s really not great, I’ll do a slick thing: I’ll take something like this oil, that’s kind of weighted and moisturizes your hair. I usually do a ballerina-type of bun. View this post on Instagram A post shared by Kate Hudson (@katehudson) R29: What do you use for your buns? Do you use a claw clip or scrunchie? KH: I like the big wig pins; they look like bobby pina. I just take my hair, twist it up, and pin it with that. Then I like my big silk scrunchies, and I have a ton of those clips that keep my bangs out of my face. R29: What do you ask for when you’re getting your hair colored? KH: I like a warmer blonde. I started going to Tracey [Cunningham] and she’s given me the most amazing warm blonde. I have so much red in my hair. My natural colors are a dirty red blonde. I have a lot of copper. Actually, we’re all red in my family. My grandma on my dad’s side, redhead. My grandma on my mom’s mom, redhead. My aunt, redhead. All my brother’s beards, red. [My soon] Ryder came out looking like Conan O’Brien, but then he went to caramel. But yeah all my brothers’ beards are red. R29: What about your hair cut? KH: Right now, my curtain bangs are grown out. But usually I like a little curtain bang, like a little wispy bang.  View this post on Instagram A post shared by Kate Hudson (@katehudson) R29: Because this campaign is about Finding Your Joi, what is something that has brought you joy recently? KH: My kids always bring me so much joy. It’s been a tough time. We live in the Palisades. It’s been one of those life-altering experiences for all of my children. We were lucky that our house survived. But it’s really something when you go through that type of traumatic experience with your community. I think the thing that has brought me the most joy in this moment that’s been challenging: seeing how strong communities can be when things are so profoundly sad. You find strength in each other. And being with the people from my show recently. This whole show experience. They all bring me joy: Mindy [Kaling], Ike [Barinholtz], Dave [Stassen], all my show bros. Shop Kate Hudson’s must-have hair products, below: All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. Like what you see? How about some more R29 goodness, right here?This Hair Growth Range Genuinely Blew Me AwayWhy Does My Hair Look Oily Right After I Wash It?6 Tips That Helped Me Grow Longer, Stronger Hair",
  "author": "Megan Decker",
  "published": "Thu, 06 Mar 2025 21:12:43 +0000",
  "source": "https://www.refinery29.com/beauty/rss.xml",
  "categories": null,
  "byline": "Megan Decker",
  "length": 5528,
  "excerpt": "\"I strongly believe that when your hair looks good, it really does change the way you feel about everything.\"",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "To be in a room with Kate Hudson is to be filled with energy. Walking into our interview, I catch the tail end of a conversation she’s having about moon and rising signs (Hudson is a prototypical Aries). Repositioning herself on the white cloud sectional at the Baccarat Hotel in New York City, Hudson effortlessly bounces the conversation to basketball. Her new Netflix series, Running Point, streams on the flatscreen on the wall in front of us. “Oh, I love this scene,” she says gesturing to the TV. Even without sound, Hudson’s presence is magnetic—her white power suit, high heels, and signature blonde waves commanding the screen.AdvertisementADVERTISEMENTHudson, being a native Angeleno, felt equipped to take on the role of Isla (a character inspired by the president of the L.A. Lakers, Jeanie Buss). “When you grow up in L.A., you have to know about basketball and the Los Angeles Lakers,” she explains. “Also, my best friend from high school [Baron Davis] became a professional basketball player, so my whole life was going to his games.” Of course, if you’ve seen the first few episodes, you know that Running Point is focused on the family-business side of the NBA (Succession-coded), which was new territory for Hudson. “I'm not a big follower of trading — like, who is going where — but when we started doing the show, that started to change,” she adds. “But also, the show is really about the family, their dysfunctional hilarity.”While I can’t wait to stream the entire Running Point series, I want to discuss her iconic hair. It’s just been announced that Hudson is the Global Celebrity Spokesperson for Joico, heading their new campaign, Find Your Joi. Ahead, Hudson speaks to Refinery29 about her love for extensions, hair maintenance, and how she finds joy.The following interview was edited for length and clarity.R29: Your hair is so long and blonde in this show, are you wearing extensions?Kate Hudson: Yes, I love extensions. My hair is super healthy but it's probably there [gestures to shoulder]. I just change it with extensions when I want to or need to.AdvertisementADVERTISEMENTR29: How would you describe your hair type?KH: I've had hair that was unruly and defiant my whole life so I've just learned to go with it. I either have to defuse my hair to make it curly, or blow it out to make it straight. Thank God for these [Joico] products, but it’s a lot of buns in my life.R29: What does wash-day look like to you? How often are you washing your hair and what are you using to style it?KH: I used to go four or five days and not wash my hair. But then I just [filmed] this movie where I had to wash my hair every day and my hair got so healthy. In the movie, I chose to use no extensions, nothing, it's just my own hair. We used hot rollers and spray, and then I'd go home and wash my hair every night — and this was for like three months — and my hair got very healthy. I think it needs to be washed. For some reason, if I'm not washing my hair, it starts to break.R29: What does a good hair day look like for you?KH: I strongly believe that when your hair looks good, it really does change the way you feel about everything. A good hair day is much more important than a good makeup day.AdvertisementADVERTISEMENTBut it's hit or miss for me. If I have to do my hair myself and it didn't dry nicely, I'm going to put it in a bun. If it's really not great, I'll do a slick thing: I'll take something like this oil, that's kind of weighted and moisturizes your hair. I usually do a ballerina-type of bun.R29: What do you use for your buns? Do you use a claw clip or scrunchie?KH: I like the big wig pins; they look like bobby pina. I just take my hair, twist it up, and pin it with that. Then I like my big silk scrunchies, and I have a ton of those clips that keep my bangs out of my face.R29: What do you ask for when you’re getting your hair colored?KH: I like a warmer blonde. I started going to Tracey [Cunningham] and she's given me the most amazing warm blonde. I have so much red in my hair. My natural colors are a dirty red blonde. I have a lot of copper. Actually, we're all red in my family. My grandma on my dad's side, redhead. My grandma on my mom's mom, redhead. My aunt, redhead. All my brother's beards, red. [My soon] Ryder came out looking like Conan O'Brien, but then he went to caramel. But yeah all my brothers' beards are red.R29: What about your hair cut?KH: Right now, my curtain bangs are grown out. But usually I like a little curtain bang, like a little wispy bang. AdvertisementADVERTISEMENTR29: Because this campaign is about Finding Your Joi, what is something that has brought you joy recently?KH: My kids always bring me so much joy. It's been a tough time. We live in the Palisades. It's been one of those life-altering experiences for all of my children. We were lucky that our house survived. But it's really something when you go through that type of traumatic experience with your community. I think the thing that has brought me the most joy in this moment that's been challenging: seeing how strong communities can be when things are so profoundly sad. You find strength in each other.And being with the people from my show recently. This whole show experience. They all bring me joy: Mindy [Kaling], Ike [Barinholtz], Dave [Stassen], all my show bros.Shop Kate Hudson's must-have hair products, below:All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.AdvertisementADVERTISEMENT",
  "image": "https://www.refinery29.com/images/11862390.jpg?crop=4500%2C2364%2Cx0%2Cy67",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"editorial-content\"\u003e\u003cdiv\u003e\u003cp\u003eTo be in a room with \u003ca href=\"https://www.refinery29.com/en-us/kate-hudson-fabletics-entrepreneur-interview\"\u003eKate Hudson\u003c/a\u003e is to be filled with energy. Walking into our interview, I catch the tail end of a conversation she’s having about moon and rising signs (Hudson is a prototypical Aries). Repositioning herself on the white cloud sectional at the Baccarat Hotel in New York City, Hudson effortlessly bounces the conversation to basketball.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e Her new Netflix series, \u003cem\u003e\u003ca href=\"https://www.refinery29.com/en-us/2025/01/11848588/new-netflix-tv-shows-movies-february-2025\"\u003eRunning Point\u003c/a\u003e\u003c/em\u003e, streams on the flatscreen on the wall in front of us. “Oh, I love this scene,” she says gesturing to the TV. Even without sound, Hudson’s presence is magnetic—her white power suit, high heels, and signature blonde waves commanding the screen.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eHudson, being a native Angeleno, felt equipped to take on the role of Isla (a character inspired by the president of the L.A. Lakers, \u003ca href=\"https://www.npr.org/2025/02/28/nx-s1-5286664/running-point-jeanie-buss\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Jeanie Buss (opens in a new tab)\"\u003eJeanie Buss\u003c/a\u003e). “When you grow up in L.A., you \u003cem\u003ehave\u003c/em\u003e to know about basketball and the Los Angeles Lakers,” she explains. “Also, my best friend from high school [Baron Davis] became a professional basketball player, so my whole life was going to his games.” \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eOf course, if you’ve seen the first few episodes, you know that \u003cem\u003eRunning Point\u003c/em\u003e is focused on the family-business side of the NBA (\u003cem\u003eSuccession\u003c/em\u003e-coded), which was new territory for Hudson. “I\u0026#39;m not a big follower of trading — like, who is going where — but when we started doing the show, that started to change,” she adds. “But also, the show is really about the family, their dysfunctional hilarity.”\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWhile I can’t wait to stream the entire \u003cem\u003eRunning Point series\u003c/em\u003e, I want to discuss her iconic hair. It’s just been announced that Hudson is the Global Celebrity Spokesperson for Joico, heading their new campaign, \u003ca href=\"https://www.joico.com/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eFind Your Joi\u003c/a\u003e. Ahead, Hudson speaks to Refinery29 about her love for extensions, hair maintenance, and how she finds joy.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eThe following interview was edited for length and clarity.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eR29: Your hair is so long and blonde in this show, are you wearing extensions?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eKate Hudson: \u003c/strong\u003eYes, I love extensions. My hair is super healthy but it\u0026#39;s probably there [gestures to shoulder]. I just change it with extensions when I want to or need to.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eR29: How would you describe your hair type?\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eKH:\u003c/strong\u003e I\u0026#39;ve had hair that was unruly and defiant my whole life so I\u0026#39;ve just learned to go with it. I either have to defuse my hair to make it curly, or blow it out to make it straight. Thank God for these [Joico] products, but it’s a lot of buns in my life.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eR29: What does wash-day look like to you? How often are you washing your hair and what are you using to style it?\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eKH\u003c/strong\u003e: I used to go four or five days and not wash my hair. But then I just [filmed] this movie where I had to wash my hair every day and my hair got so healthy. In the movie, I chose to use no extensions, nothing, it\u0026#39;s just my own hair. We used hot rollers and spray, and then I\u0026#39;d go home and wash my hair every night — and this was for like three months — and my hair got very healthy. I think it needs to be washed. For some reason, if I\u0026#39;m not washing my hair, it starts to break.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eR29: What does a good hair day look like for you?\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eKH: \u003c/strong\u003eI strongly believe that when your hair looks good, it really does change the way you feel about everything. A good hair day is much more important than a good makeup day.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eBut it\u0026#39;s hit or miss for me. If I have to do my hair myself and it didn\u0026#39;t dry nicely, I\u0026#39;m going to put it in a bun. If it\u0026#39;s really not great, I\u0026#39;ll do a slick thing: I\u0026#39;ll take something like \u003ca href=\"https://www.amazon.com/dp/B07NXVWVG2/ref=dp_ccx_cts_image_luxe_1?th=1\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003ethis oil\u003c/a\u003e, that\u0026#39;s kind of weighted and moisturizes your hair. I usually do a ballerina-type of bun.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eR29: What do you use for your buns? Do you use a claw clip or scrunchie?\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eKH:\u003c/strong\u003e I like the \u003ca href=\"https://www.amazon.com/Shaped-YINGFENG-2-4inch-Storage-Accessories/dp/B0CFTDKD6C/ref=sr_1_2_sspa?dib=eyJ2IjoiMSJ9.HBz4stpmrCDg3pocp4U1vDhM-w7SAog2zMV76yWVOZbOxMIiHn_QokhcelklQY2QMZOmmC2APT7jbvOEukwAHWjAc-n3qxGGRrZmt4hZlF-xZUQ7-yfwnyBYuTEiYXuHtUB-_3xnr36_zkUNnmNBjdhOrM3xT8tYy0qjPJZpzjyl-8sCtlOq_mFTiUzhs_nX25ctlFoPaQtq1ttmkC_cjvTX4MNhkbcEyhgCadS94XpjgDaC3VABeg9-nesrdgYeNp4N9YrRK81U8AbjdqbWHYX7-DmZGSynPaU056RUEZ8.AFFS4dWWk7Vno3Opa8Wb9X418e_cIYz3s4cMVgN2eVQ\u0026amp;dib_tag=se\u0026amp;keywords=wig%2Bpins\u0026amp;qid=1741044597\u0026amp;sr=8-2-spons\u0026amp;sp_csd=d2lkZ2V0TmFtZT1zcF9hdGY\u0026amp;th=1\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003ebig wig pins\u003c/a\u003e; they look like bobby pina. I just take my hair, twist it up, and pin it with that. Then I like my \u003ca href=\"https://www.slip.com/collections/hair-accessories/products/belleflower-large-scrunchies\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003ebig silk scrunchies\u003c/a\u003e, and I have a ton of those \u003ca href=\"https://www.amazon.com/Alligator-Barrettes-Hairstyle-Hairdressing-Application/dp/B07G97CRLY/ref=asc_df_B07G97CRLY?mcid=3291f4a043b630a1b2f39aa28098867b\u0026amp;hvocijid=6359356353141099823-B07G97CRLY-\u0026amp;hvexpln=73\u0026amp;tag=hyprod-20\u0026amp;linkCode=df0\u0026amp;hvadid=730434177080\u0026amp;hvpos=\u0026amp;hvnetw=g\u0026amp;hvrand=6359356353141099823\u0026amp;hvpone=\u0026amp;hvptwo=\u0026amp;hvqmt=\u0026amp;hvdev=c\u0026amp;hvdvcmdl=\u0026amp;hvlocint=\u0026amp;hvlocphy=9067609\u0026amp;hvtargid=pla-2281435179058\u0026amp;th=1\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eclips\u003c/a\u003e that keep my bangs out of my face.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eR29: What do you ask for when you’re getting your hair colored?\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eKH:\u003c/strong\u003e I like a warmer blonde. I started going to \u003ca href=\"https://www.instagram.com/traceycunningham1/?hl=en\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eTracey [Cunningham]\u003c/a\u003e and she\u0026#39;s given me the most amazing warm blonde. I have so much red in my hair. My natural colors are a dirty red blonde. I have a lot of copper. Actually, we\u0026#39;re all red in my family. My grandma on my dad\u0026#39;s side, redhead. My grandma on my mom\u0026#39;s mom, redhead. My aunt, redhead. All my brother\u0026#39;s beards, red. [My soon] Ryder came out looking like Conan O\u0026#39;Brien, but then he went to caramel. But yeah all my brothers\u0026#39; beards are red.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eR29: What about your hair cut?\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eKH:\u003c/strong\u003e Right now, my curtain bangs are grown out. But usually I like a little curtain bang, like a little wispy bang. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eR29: Because this campaign is about Finding Your Joi, what is something that has brought you joy recently?\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eKH: \u003c/strong\u003eMy kids always bring me so much joy. It\u0026#39;s been a tough time. We live in the Palisades. It\u0026#39;s been one of those life-altering experiences for all of my children. We were lucky that our house survived. But it\u0026#39;s really something when you go through that type of traumatic experience with your community. I think the thing that has brought me the most joy in this moment that\u0026#39;s been challenging: seeing how strong communities can be when things are so profoundly sad. You find strength in each other.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAnd being with the people from my show recently. This whole show experience. They all bring me joy: Mindy [Kaling], Ike [Barinholtz], Dave [Stassen], all my show bros.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eShop Kate Hudson\u0026#39;s must-have hair products, below:\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-03-06T21:12:43Z",
  "modifiedTime": null
}
