{
  "id": "69a2bd85-cd22-4af2-9243-86e1b9e36553",
  "title": "News Flash: 2 Celebrity Beauty Brands Can Be Successful at the Same Time",
  "link": "https://www.popsugar.com/beauty/hailey-bieber-rhode-selena-gomez-rare-comparisons-49445207",
  "description": "Image Source: Lionel Hahn/Getty Images/ Karwai Tang/WireImage It's safe to say the May 28 news that e.l.f. Beauty is acquiring Hailey Bieber's brand Rhode for $1 billion rattled the beauty world. Whether you're a Rhode loyalist or someone who merely has a TikTok account and likes beauty, chances are you've heard of the massive impact this brand has had on the market. The deal itself shows its value: the partnership is the fastest sale of its size in beauty, and Rhode's valuation is likely due to the brand's equity and stock value, plus the fact that it routinely does over $200 million in sales each year since its 2022 launch. The move will also help facilitate Rhode's expansion into Sephora, making the brand more accessible than ever. As a beauty writer whose job it is to scour headlines, trending topics, and hot-button conversations, I was expecting to see endless reposts of this news with, of course, a combination of Bieber supporter and hate - such is the internet. What I wasn't expecting to see was Selena Gomez's name buzzing this morning on Google Trends and social media. While \"Rhode beauty sold,\" \"Rhode elf,\" and \"Hailey Bieber net worth\" made up the first three trending searches when you looked at topics related to \"beauty,\" \"Rare Beauty valuation\" was listed in spot four. \"Selena Gomez net worth\" was also trending this morning, seeing a 4,450 percent increase in search inquiries. People all over the internet are also comparing the success of the two beauty founders. Rare Beauty is successful, and Rhode is successful, and neither of those successes negates the other. I get it: headlines about these women have been circulating online for, what, nearly 10 years? But I think we can give it a rest now. Justin Bieber and Gomez broke up in March 2018, and a lot has happened since then. Yet, once again, comparisons between Gomez and Bieber continue. In an interview with PS in 2022, Bieber addressed this very issue head-on: \"I've struggled enough with comparison to other people, and I don't want that for this brand,\" she said. \"There is space for every woman to succeed and thrive in this industry. We don't need to compare brands, people, whatever it may be - that's something that's been very sensitive for me.\" Gomez's brand, Rare Beauty, has been a customer favorite since it launched in 2020, and its liquid blush has garnered a cult following. The brand is still going strong to this day and has since expanded into lip oils, perfumes, and more. Rare Beauty is successful, and Rhode is successful, and neither of those successes negates the other. Women are often pitted against each other, being forced to compare and contrast opportunities, successes, relationships, looks - you name it. But the beauty industry is vast, and there is more than enough room at the table for everyone. In fact, according to IBIS World, a business industry analysis website, there are over 5,000 cosmetic and beauty brands operating in the United States alone as of 2025. But fans who are nostalgic, bored, or just still heartbroken over an old relationship refuse to stop acting like these two women - and their brands - are dueling. According to Forbes, the beauty industry is valued at $570 billion in sales in 2023 per year (and that number has only gone up since then). Bottom line: one woman's success is not another's failure. There's no need to choose between clapping for Bieber on this iconic win and buying Rare Beauty's lip gloss. Brittany Leitner (she/her) is a New York-based contributing beauty writer at PS. She has over 10 years of experience working in beauty, health, wellness, travel, and celebrity news. Brittany holds a degree in magazine journalism from Syracuse University and previously held editorial positions at Elite Daily and \"The Dr. Oz Show\" before working as a freelance journalist for the past three years.",
  "author": "Brittany Leitner",
  "published": "Thu, 29 May 2025 12:15:02 -0700",
  "source": "https://www.popsugar.com/beauty/feed",
  "categories": [
    "Selena Gomez",
    "Hailey Bieber",
    "Beauty News",
    "Celebrity Makeup",
    "Celebrity Beauty",
    "Opinion"
  ],
  "byline": "Brittany Leitner",
  "length": 3798,
  "excerpt": "Hailey Bieber and Selena Gomez have been compared for years. With the announcement of e.l.f. purchasing Rhode, it continues.",
  "siteName": "Popsugar",
  "favicon": "",
  "text": "It's safe to say the May 28 news that e.l.f. Beauty is acquiring Hailey Bieber's brand Rhode for $1 billion rattled the beauty world. Whether you're a Rhode loyalist or someone who merely has a TikTok account and likes beauty, chances are you've heard of the massive impact this brand has had on the market. The deal itself shows its value: the partnership is the fastest sale of its size in beauty, and Rhode's valuation is likely due to the brand's equity and stock value, plus the fact that it routinely does over $200 million in sales each year since its 2022 launch. The move will also help facilitate Rhode's expansion into Sephora, making the brand more accessible than ever.As a beauty writer whose job it is to scour headlines, trending topics, and hot-button conversations, I was expecting to see endless reposts of this news with, of course, a combination of Bieber supporter and hate — such is the internet. What I wasn't expecting to see was Selena Gomez's name buzzing this morning on Google Trends and social media. While \"Rhode beauty sold,\" \"Rhode elf,\" and \"Hailey Bieber net worth\" made up the first three trending searches when you looked at topics related to \"beauty,\" \"Rare Beauty valuation\" was listed in spot four. \"Selena Gomez net worth\" was also trending this morning, seeing a 4,450 percent increase in search inquiries. People all over the internet are also comparing the success of the two beauty founders.Rare Beauty is successful, and Rhode is successful, and neither of those successes negates the other.I get it: headlines about these women have been circulating online for, what, nearly 10 years? But I think we can give it a rest now. Justin Bieber and Gomez broke up in March 2018, and a lot has happened since then. Yet, once again, comparisons between Gomez and Bieber continue. In an interview with PS in 2022, Bieber addressed this very issue head-on: \"I've struggled enough with comparison to other people, and I don't want that for this brand,\" she said. \"There is space for every woman to succeed and thrive in this industry. We don't need to compare brands, people, whatever it may be — that's something that's been very sensitive for me.\"Gomez's brand, Rare Beauty, has been a customer favorite since it launched in 2020, and its liquid blush has garnered a cult following. The brand is still going strong to this day and has since expanded into lip oils, perfumes, and more. Rare Beauty is successful, and Rhode is successful, and neither of those successes negates the other. Women are often pitted against each other, being forced to compare and contrast opportunities, successes, relationships, looks — you name it. But the beauty industry is vast, and there is more than enough room at the table for everyone. In fact, according to IBIS World, a business industry analysis website, there are over 5,000 cosmetic and beauty brands operating in the United States alone as of 2025. But fans who are nostalgic, bored, or just still heartbroken over an old relationship refuse to stop acting like these two women — and their brands — are dueling. According to Forbes, the beauty industry is valued at $570 billion in sales in 2023 per year (and that number has only gone up since then). Bottom line: one woman's success is not another's failure. There's no need to choose between clapping for Bieber on this iconic win and buying Rare Beauty's lip gloss. Brittany Leitner (she/her) is a New York-based contributing beauty writer at PS. She has over 10 years of experience working in beauty, health, wellness, travel, and celebrity news. Brittany holds a degree in magazine journalism from Syracuse University and previously held editorial positions at Elite Daily and \"The Dr. Oz Show\" before working as a freelance journalist for the past three years.",
  "image": "https://media1.popsugar-assets.com/files/thumbor/vR967aJGOcUm7h6Uhht6gL9oIlo=/0x0:1200x630/fit-in/1200x630/top/filters:format_auto():quality(85):upscale()/2025/05/29/802/n/1922153/0c4f6cf76838a47358f301.43193611_.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"2\"\u003e\u003cp data-element-index=\"0\"\u003eIt\u0026#39;s safe to say the May 28 news that e.l.f. Beauty is acquiring \u003ca href=\"https://www.popsugar.com/beauty/hailey-bieber-rhode-beauty-details-48611581\" target=\"_blank\"\u003eHailey Bieber\u0026#39;s brand Rhode\u003c/a\u003e for \u003ca href=\"http://www.businesswire.com/news/home/20250528613364/en/e.l.f.-Beauty-Announces-Definitive-Agreement-to-Acquire-rhode-in-%241-Billion-Deal?ref=popsugar.com\u0026amp;=___psv__p_49445207__t_w_\" target=\"_blank\"\u003e$1 billion\u003c/a\u003e rattled the beauty world. Whether you\u0026#39;re a \u003ca href=\"https://www.popsugar.com/beauty/rhode-peptide-lip-treatment-review-48872388\" target=\"_blank\"\u003eRhode loyalist\u003c/a\u003e or someone who merely has a TikTok account and likes beauty, chances are you\u0026#39;ve heard of the massive impact this brand has had on the market. The deal itself shows its value: the partnership is the fastest sale of its size in beauty, and Rhode\u0026#39;s valuation is likely due to the brand\u0026#39;s equity and stock value, plus the fact that it routinely does over $200 million in sales each year since its 2022 launch. The move will also help facilitate Rhode\u0026#39;s expansion into Sephora, making the brand more accessible than ever.\u003c/p\u003e\u003cp data-element-index=\"1\"\u003eAs a beauty writer whose job it is to scour headlines, trending topics, and hot-button conversations, I was expecting to see endless reposts of this news with, of course, a combination of Bieber supporter and hate — such is the internet. What I wasn\u0026#39;t expecting to see was Selena Gomez\u0026#39;s name buzzing this morning on Google Trends and social media. \u003c/p\u003e\u003cp data-element-index=\"2\"\u003eWhile \u0026#34;Rhode beauty sold,\u0026#34; \u0026#34;Rhode elf,\u0026#34; and \u0026#34;Hailey Bieber net worth\u0026#34; made up the first three trending searches when you looked at topics related to \u0026#34;beauty,\u0026#34; \u0026#34;Rare Beauty valuation\u0026#34; was listed in spot four. \u0026#34;Selena Gomez net worth\u0026#34; was also trending this morning, seeing a 4,450 percent increase in search inquiries. People all over the internet are also comparing the success of the two beauty founders.\u003c/p\u003e\u003c/div\u003e\u003cp\u003eRare Beauty is successful, and Rhode is successful, and neither of those successes negates the other.\u003c/p\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"4\"\u003e\u003cp data-element-index=\"0\"\u003eI get it: headlines about these women have been circulating online for, what, nearly 10 years? But I think we can give it a rest now. Justin Bieber and Gomez broke up in March 2018, and a lot has happened since then. Yet, once again, comparisons between Gomez and Bieber continue. \u003c/p\u003e\u003cp data-element-index=\"1\"\u003eIn an \u003ca href=\"https://www.popsugar.com/beauty/hailey-bieber-rhode-interview-49361558\" target=\"_blank\"\u003einterview with PS in 2022\u003c/a\u003e, Bieber addressed this very issue head-on: \u0026#34;I\u0026#39;ve struggled enough with comparison to other people, and I don\u0026#39;t want that for this brand,\u0026#34; she said. \u0026#34;There is space for every woman to succeed and thrive in this industry. We don\u0026#39;t need to compare brands, people, whatever it may be — that\u0026#39;s something that\u0026#39;s been very sensitive for me.\u0026#34;\u003c/p\u003e\u003cp data-element-index=\"2\"\u003eGomez\u0026#39;s brand, \u003ca href=\"https://www.popsugar.com/beauty/rare-beauty-liquid-blush-review-47792442\" target=\"_blank\"\u003eRare Beauty\u003c/a\u003e, has been a customer favorite since it launched in 2020, and its liquid blush has garnered a cult following. The brand is still going strong to this day and has since expanded into lip oils, perfumes, and more. Rare Beauty is successful, and Rhode is successful, and neither of those successes negates the other. \u003c/p\u003e\u003cp data-element-index=\"3\"\u003eWomen are often pitted against each other, being forced to compare and contrast opportunities, successes, relationships, looks — you name it. But the beauty industry is vast, and there is more than enough room at the table for everyone. In fact, according to \u003ca href=\"http://www.ibisworld.com/united-states/industry/cosmetic-beauty-products-manufacturing/499/?ref=popsugar.com\u0026amp;=___psv__p_49445207__t_w_\" target=\"_blank\"\u003eIBIS World\u003c/a\u003e, a business industry analysis website, there are over 5,000 cosmetic and beauty brands operating in the United States alone as of 2025. But fans who are nostalgic, bored, or just still heartbroken over an old relationship refuse to stop acting like these two women — and their brands — are dueling. According to \u003ca href=\"http://www.forbes.com/sites/richardkestenbaum/2024/06/27/the-beauty-business-keeps-growing-but-its-missing-a-huge-opportunity/?ref=popsugar.com\u0026amp;=___psv__p_49445207__t_w_\" target=\"_blank\"\u003eForbes\u003c/a\u003e, the beauty industry is valued at $570 billion in sales in 2023 per year (and that number has only gone up since then). \u003c/p\u003e\u003cp data-element-index=\"4\"\u003eBottom line: one woman\u0026#39;s success is not another\u0026#39;s failure. There\u0026#39;s no need to choose between clapping for Bieber on this iconic win and buying Rare Beauty\u0026#39;s lip gloss. \u003c/p\u003e\u003cp data-element-index=\"6\"\u003e\u003cem\u003e\u003ca href=\"https://www.popsugar.com/author/brittany-leitner\"\u003eBrittany Leitner\u003c/a\u003e (she/her) is a New York-based contributing beauty writer at PS. She has over 10 years of experience working in beauty, health, wellness, travel, and celebrity news. Brittany holds a degree in magazine journalism from Syracuse University and previously held editorial positions at Elite Daily and \u0026#34;The Dr. Oz Show\u0026#34; before working as a freelance journalist for the past three years.\u003c/em\u003e\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-05-29T19:15:02Z",
  "modifiedTime": "2025-05-29T19:15:02Z"
}
