{
  "id": "99a43e20-bc35-4552-b092-0cda63349f65",
  "title": "Valentino’s New Fragrance Collection Is Inspired By Haute Couture",
  "link": "https://www.refinery29.com/en-us/valentino-anatomy-of-dreams-review?utm_source=feed\u0026utm_medium=rss",
  "description": ".disclaimer{width:90%;margin-bottom:1rem}.disclaimer__lines{width:100%;margin:0 auto;border-bottom:1px solid #999;padding:0;max-width:150px}.disclaimer__copy{width:100%;max-width:355px;font-family:Brown Regular,sans-serif;font-size:.9rem;font-weight:300;line-height:1.3em;color:#333;padding:0 0 .4rem;margin:1rem auto;text-align:center} All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. Perfume and luxury go hand in hand, but let’s be honest — sometimes you’re paying more for the name on the bottle than the scent inside (and if it brings you joy, that’s perfectly fine). Valentino’s latest fragrance collection, Anatomy of Dreams, completely flipped the script on what I thought I knew about haute perfumery. It’s not just perfume — it’s a sensory experience, blending couture artistry with bold, unexpected ingredient pairings that linger in your memory as much as on your skin. Rooted in the maison’s Rome heritage — though I got my sneak peek in Paris this summer (very fitting) — the collection takes classic notes like white florals, musk, and oud and shakes things up with unexpected Italian twists. Think: couture-level infusions broken out into seven olfactive “dreams,” crafted by different master perfumers — cappuccino accord, Calabrian citrus, and olive wood. It’s Valentino’s ode to la dolce vita, and trust me, it’s as dreamy as it sounds. And because this is Valentino, the bottles are just as jaw-dropping. Picture studded caps straight out of the Rockstud playbook and hand-cut canvas labels made from the same fabric as their couture gown boxes. It’s the kind of thoughtful, over-the-top luxury we don’t see enough of these days. Each one is priced at $330 for a 100mL bottle or $165 for 30mL (launching early next year). “The strength of this collection is found in the unexpected duos of ingredients, creating surprise and modernity,” says perfumer Andrew Everett, the nose behind one of Valentino’s new scents, Club Couture. Picking a favorite is nearly impossible, but here’s what stood out for me: L’Innocence de L’air is a daytime dream — light, airy, and bursting with rose and citrus. For nighttime, Punk Romantic stole the show with its mix of vanilla bean and earthy olive wood, like the fragrance equivalent of a dirty martini. To call them perfumes feels like an understatement; they’re moods, vibes, and moments bottled to perfection. “To create a perfume that breaks the rules, you must dare,” perfumer Fanny Bal, who created Punk Romantic, tells Refinery29. “Dare to go too far, dare to make surprising associations, dare to blur gender codes.”  Ahead, take a closer look at these seven dreamy scents — and prepare to wish you could smell them through the screen. DashDividers_1_500x100 Sogno In Rosso “When I composed Sogno in Rosso, I had two elements in mind [from] Valentino’s DNA,” perfumer Fabrice Pellegrin tells Refinery29. “The first element was this idea of red, which is the iconic color of Valentino. It’s the story of a strong contrast, of a chiaroscuro between notes of spicy black pepper and creamy milk foam.” Notte d’Oro  “Oud was the starting point of the creation,” shares perfumer Paul Guerlain. “It’s an ultra-luxurious ingredient — one of the rarest of the perfumer’s palette. To create a clash, a surprise, almond was a perfect choice because it’s soft and comforting. I wanted to bring an immediate delight.” L’Innocence de L’Air “L’Innocence de L’air combines what I love most about Valentino: the blend of timeless elegance, impeccable and modern cuts, all imbued with Italian sophistication,” perfumer Nathalie Lorson tells us of her rose and mandarin scent. “I wanted a certain fluidity in this composition.“I want people to feel a sense of beauty and strength with a touch of magic.”  Private Talk “The inspiration came from a personal memory of having a coffee on my terrace in Paris during the summer, surrounded by tuberoses,” says perfumer Nicolas Bonneville. “This unexpected encounter made me want to translate it into perfume.” The result: A sensual, not sexy, scent that leaves a lasting impression. Club Couture “I want people who wear Club Couture to feel energized, super elegant, with a sense of joy,,” Everett shares. “As the fig is very green and modern, we thought to blend it with patchouli, which is more classic, a little darker, but undeniably chic.” Punk Romantic “Vanilla allows so many creative possibilities — I was looking for a new twist with the olive wood accord, which adds a distinctive earthy depth, balancing the sweetness and spice,” Bal says of her creation. “The fragrance is designed to evoke a sense of boldness and confidence while creating a unique blend of warmth and intrigue. Even the name ‘Punk Romantic’ captures this contrast.”  Behind The Seen “Behind The Seen is inspired by a childhood memory,” perfumer Delphine Lebeau tells me, citing her great-aunt’s South of France home, surrounded by hazelnut trees. “I put everything I love in this fragrance: joyful memories with hazelnut wood, iris in the heart notes, and the powerful elegance of vetiver, which is one of my favorite raw materials in perfumery.” Like what you see? How about some more R29 goodness, right here?",
  "author": "Karina Hoshikawa",
  "published": "Mon, 16 Dec 2024 19:27:29 +0000",
  "source": "https://www.refinery29.com/beauty/rss.xml",
  "categories": null,
  "byline": "Karina Hoshikawa",
  "length": 4896,
  "excerpt": "We have all the details on Valentino's new haute couture-inspired collection of fragrances, Anatomy of Dreams. Read along as the perfumers walks us through all seven scents.",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. Perfume and luxury go hand in hand, but let’s be honest — sometimes you’re paying more for the name on the bottle than the scent inside (and if it brings you joy, that’s perfectly fine). Valentino’s latest fragrance collection, Anatomy of Dreams, completely flipped the script on what I thought I knew about haute perfumery. It’s not just perfume — it’s a sensory experience, blending couture artistry with bold, unexpected ingredient pairings that linger in your memory as much as on your skin.Rooted in the maison’s Rome heritage — though I got my sneak peek in Paris this summer (very fitting) — the collection takes classic notes like white florals, musk, and oud and shakes things up with unexpected Italian twists. Think: couture-level infusions broken out into seven olfactive “dreams,” crafted by different master perfumers — cappuccino accord, Calabrian citrus, and olive wood. It’s Valentino’s ode to la dolce vita, and trust me, it’s as dreamy as it sounds. And because this is Valentino, the bottles are just as jaw-dropping. Picture studded caps straight out of the Rockstud playbook and hand-cut canvas labels made from the same fabric as their couture gown boxes. It’s the kind of thoughtful, over-the-top luxury we don’t see enough of these days. Each one is priced at $330 for a 100mL bottle or $165 for 30mL (launching early next year). “The strength of this collection is found in the unexpected duos of ingredients, creating surprise and modernity,” says perfumer Andrew Everett, the nose behind one of Valentino’s new scents, Club Couture.AdvertisementADVERTISEMENTPicking a favorite is nearly impossible, but here’s what stood out for me: L’Innocence de L’air is a daytime dream — light, airy, and bursting with rose and citrus. For nighttime, Punk Romantic stole the show with its mix of vanilla bean and earthy olive wood, like the fragrance equivalent of a dirty martini. To call them perfumes feels like an understatement; they’re moods, vibes, and moments bottled to perfection.“To create a perfume that breaks the rules, you must dare,” perfumer Fanny Bal, who created Punk Romantic, tells Refinery29. “Dare to go too far, dare to make surprising associations, dare to blur gender codes.”  Ahead, take a closer look at these seven dreamy scents — and prepare to wish you could smell them through the screen.Sogno In Rosso“When I composed Sogno in Rosso, I had two elements in mind [from] Valentino’s DNA,” perfumer Fabrice Pellegrin tells Refinery29. “The first element was this idea of red, which is the iconic color of Valentino. It’s the story of a strong contrast, of a chiaroscuro between notes of spicy black pepper and creamy milk foam.”Notte d’Oro “Oud was the starting point of the creation,” shares perfumer Paul Guerlain. “It’s an ultra-luxurious ingredient — one of the rarest of the perfumer’s palette. To create a clash, a surprise, almond was a perfect choice because it’s soft and comforting. I wanted to bring an immediate delight.”L’Innocence de L’Air“L’Innocence de L’air combines what I love most about Valentino: the blend of timeless elegance, impeccable and modern cuts, all imbued with Italian sophistication,” perfumer Nathalie Lorson tells us of her rose and mandarin scent. “I wanted a certain fluidity in this composition.“I want people to feel a sense of beauty and strength with a touch of magic.” AdvertisementADVERTISEMENTPrivate Talk“The inspiration came from a personal memory of having a coffee on my terrace in Paris during the summer, surrounded by tuberoses,” says perfumer Nicolas Bonneville. “This unexpected encounter made me want to translate it into perfume.” The result: A sensual, not sexy, scent that leaves a lasting impression.Club Couture“I want people who wear Club Couture to feel energized, super elegant, with a sense of joy,,” Everett shares. “As the fig is very green and modern, we thought to blend it with patchouli, which is more classic, a little darker, but undeniably chic.”Punk Romantic“Vanilla allows so many creative possibilities — I was looking for a new twist with the olive wood accord, which adds a distinctive earthy depth, balancing the sweetness and spice,” Bal says of her creation. “The fragrance is designed to evoke a sense of boldness and confidence while creating a unique blend of warmth and intrigue. Even the name ‘Punk Romantic’ captures this contrast.” Behind The Seen“Behind The Seen is inspired by a childhood memory,” perfumer Delphine Lebeau tells me, citing her great-aunt’s South of France home, surrounded by hazelnut trees. “I put everything I love in this fragrance: joyful memories with hazelnut wood, iris in the heart notes, and the powerful elegance of vetiver, which is one of my favorite raw materials in perfumery.”AdvertisementADVERTISEMENT",
  "image": "https://www.refinery29.com/images/11828518.jpg?crop=40%3A21",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"editorial-content\"\u003e\u003cdiv\u003e\n\n\u003cp\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.refinery29.com/en-us/perfume-fragrance-editor-favorites\"\u003ePerfume\u003c/a\u003e and luxury go hand in hand, but let’s be honest — sometimes you’re paying more for the name on the bottle than \u003ca href=\"https://www.refinery29.com/en-us/perfume-elitism-snobbery-explained\"\u003ethe scent inside\u003c/a\u003e (and if it brings you joy, that’s perfectly fine). Valentino’s latest fragrance collection, \u003ca href=\"https://www.valentino.com/en-us/experience/anatomy-of-dreams-fragrances\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eAnatomy of Dreams\u003c/a\u003e, completely flipped the script on what I thought I knew about haute perfumery. It’s not just perfume — it’s a sensory experience, blending couture artistry with bold, unexpected ingredient pairings that linger in your memory as much as on your skin.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eRooted in the maison’s Rome heritage — though I got my sneak peek in Paris this summer (very fitting) — the collection takes classic notes like white florals, musk, and oud and shakes things up with unexpected Italian twists. Think: couture-level infusions broken out into seven olfactive “dreams,” crafted by different master perfumers — cappuccino accord, Calabrian citrus, and olive wood. It’s Valentino’s ode to \u003cem\u003ela dolce vita,\u003c/em\u003e and trust me, it’s \u003ca href=\"https://www.refinery29.com/en-us/perfume-layering-astrology-manifestation\"\u003eas dreamy\u003c/a\u003e as it sounds. And because this is Valentino, the bottles are just as jaw-dropping. Picture studded caps straight out of the Rockstud playbook and hand-cut canvas labels made from the same fabric as their couture gown boxes. It’s the kind of thoughtful, over-the-top luxury we don’t see enough of these days. Each one is priced at $330 for a 100mL bottle or $165 for 30mL (launching early next year). “The strength of this collection is found in the unexpected duos of ingredients, creating surprise and modernity,” says perfumer Andrew Everett, the nose behind one of Valentino’s new scents, Club Couture.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003ePicking a favorite is nearly impossible, but here’s what stood out for me: \u003ca href=\"https://www.valentino.com/en-us/product-anatomy-of-dreams---l-innocence-de-l-air-parfum-100ml-8AOD04100_000\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eL’Innocence de L’air\u003c/a\u003e is a daytime dream — light, airy, and bursting with rose and citrus. For nighttime, \u003ca href=\"https://www.valentino.com/en-us/product-anatomy-of-dreams---punk-romantic-parfum-100ml-8AOD01100_000\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003ePunk Romantic\u003c/a\u003e stole the show with its mix of vanilla bean and earthy olive wood, like the fragrance equivalent of a dirty martini. To call them perfumes feels like an understatement; they’re moods, vibes, and moments bottled to perfection.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“To create a perfume that breaks the rules, you must dare,” perfumer Fanny Bal, who created Punk Romantic, tells Refinery29. “Dare to go too far, dare to make surprising associations, dare to blur gender codes.”  Ahead, take a closer look at these seven dreamy scents — and prepare to wish you could smell them through the screen.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eSogno In Rosso\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“When I composed Sogno in Rosso, I had two elements in mind [from] Valentino’s DNA,” perfumer Fabrice Pellegrin tells Refinery29. “The first element was this idea of red, which is the iconic color of Valentino. It’s the story of a strong contrast, of a \u003cem\u003echiaroscuro\u003c/em\u003e between notes of spicy black pepper and creamy milk foam.”\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eNotte d’Oro \u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“Oud was the starting point of the creation,” shares perfumer Paul Guerlain. “It’s an ultra-luxurious ingredient — one of the rarest of the perfumer’s palette. To create a clash, a surprise, almond was a perfect choice because it’s soft and comforting. I wanted to bring an immediate delight.”\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eL’Innocence de L’Air\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“L’Innocence de L’air combines what I love most about Valentino: the blend of timeless elegance, impeccable and modern cuts, all imbued with Italian sophistication,” perfumer Nathalie Lorson tells us of her rose and mandarin scent. “I wanted a certain fluidity in this composition.“I want people to feel a sense of beauty and strength with a touch of magic.” \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003ePrivate Talk\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“The inspiration came from a personal memory of having a coffee on my terrace in Paris during the summer, surrounded by tuberoses,” says perfumer Nicolas Bonneville. “This unexpected encounter made me want to translate it into perfume.” The result: A sensual, not sexy, scent that leaves a lasting impression.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eClub Couture\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“I want people who wear Club Couture to feel energized, super elegant, with a sense of joy,,” Everett shares. “As the fig is very green and modern, we thought to blend it with patchouli, which is more classic, a little darker, but undeniably chic.”\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003ePunk Romantic\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“\u003ca href=\"https://www.refinery29.com/en-us/best-fall-perfume\"\u003eVanilla\u003c/a\u003e allows so many creative possibilities — I was looking for a new twist with the olive wood accord, which adds a distinctive earthy depth, balancing the sweetness and spice,” Bal says of her creation. “The fragrance is designed to evoke a sense of boldness and confidence while creating a unique blend of warmth and intrigue. Even the name ‘Punk Romantic’ captures this contrast.” \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eBehind The Seen\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“Behind The Seen is inspired by a childhood memory,” perfumer Delphine Lebeau tells me, citing her great-aunt’s South of France home, surrounded by hazelnut trees. “I put everything I love in this fragrance: joyful memories with hazelnut wood, iris in the heart notes, and the powerful elegance of vetiver, which is one of my favorite raw materials in perfumery.”\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-12-16T19:27:29Z",
  "modifiedTime": null
}
