{
  "id": "9aa9c963-702b-4195-a5eb-8eaa04677cc0",
  "title": "Is Day of the Dead Skull Makeup on Halloween Offensive?",
  "link": "https://www.popsugar.com/beauty/day-of-the-dead-makeup-cultural-appropriation-47804284",
  "description": "Image Source: Getty Images / Jair Cabrera Torres It's a scenario like so many others in recent years: you're scrolling through Instagram for Halloween costume inspiration, weaving through hashtags and grids for makeup ideas or hairstyles that stand out in a sea of the same. You spot a celebrity in a beautiful, intricate Día de los Muertos (or Day of the Dead) get-up, their face painted with decorated skulls in the style of La Catrina. Then, you read the comments. \"It'd be great if you didn't appropriate Mexican culture like this,\" one of many people wrote of Ashley Tisdale's Day of the Dead Halloween look back in 2016. Another responded, \"Lighten up ppl. It's a costume.\" Of course, it's not just Tisdale who has sparked debates on the matter across social media. Stars like Kate Hudson and Hilary Duff and countless Instagram influencers have also stepped out on All Hallows' Eve wearing what's often referred to as \"sugar skull\" makeup, followed by dozens of critics calling it cultural appropriation. But is it? View this post on Instagram A post shared by Ashley Tisdale (@ashleytisdale) As a Latina who lived in Mexico City during the formative years of my childhood, and who continues to regularly visit the country with deep appreciation for the culture, I'll admit I was initially confused by the backlash. While Día de los Muertos is in no way related to Halloween - in fact, the two holidays are entirely separate - nor is it solely observed in Mexico, it was one of my favorites to celebrate growing up. Over the course of three days, from Oct. 31 to Nov. 2, we would paint plates and figurines with bright patterns and shapes, bake delicious pan de muerto (sweet bread), and decorate calaveras de azúcar (sugar skulls) with shiny tissue paper to bring to the altar - all to honor the death of loved ones. Still, for people outside of the culture, not acknowledging the tradition's origins (which is part-indigenous and part-Catholic), and instead seeing it as nothing but a great Halloween costume, is offensive - but it doesn't have to be. \"Once people understand how sacred the holiday is, I invite them to join, participate, and appreciate the culture.\" \"As a makeup artist, I've seen the sugar skull makeup trend blow up and fall in the line of appropriation, but I also love seeing people expressing their art and representing my culture,\" Mexican-American makeup artist Valeria Leyva tells PS. \"Día de los Muertos is more than just painting your face with the shape of a sugar skull; we are honoring our loved ones that have left this earth. We see death as the beginning of another life, so there is a very fine line between appropriation and appreciation. It depends on the way you see it and also how people carry a tradition that's not originally theirs.\" The biggest point of contention, adds Regina Merson, Mexican-American beauty entrepreneur and founder of Reina Rebelde, is the many points of differentiation between Día de los Muertos and any other holiday where dressing in costume is ritualized, like Halloween. \"It is not a holiday about fantasy or horror, but rather something that is meant to be soulful and uplifting and positive,\" says Merson. \"One of the most offensive things is when people paint a Catrina and make the look intersect with something scary and bloody. That Catrina represents your dead relative, not a comic book character.\" Instead, sugar skull makeup has a place when done with the right intentions, and with respect and understanding of its significance. That's also why Merson created three new Reina Rebelde products - a 4 Play Wet Dry Eye Color in Azteca ($23), On Your Face Contour + Color Trio in Coqueta ($23), and Lip Brilliance color in Bomba ($18) - in honor of the holiday: to celebrate all things beautiful about the tradition. \"Once people understand how sacred the holiday is, I invite them to join, participate, and appreciate the culture,\" says Merson. \"The makeup you create [in honor of Día de los Muertos] should be beautiful, colorful, and uplifting. You are channeling someone you loved, you are celebrating their life on earth and their soul's return visit from the afterlife. That feeling of love and respect should inform the makeup.\" Related: This Mexico-Based Makeup Artist Will Give You Major Día de los Muertos Catrina Inspiration Kelsey Castañon is a Brooklyn-based writer, editor, and content strategist with more than 13 years of experience in publishing. She is currently the senior content director at PS, where you can find her stockpiling (and reporting on) everything from skin care to wine.",
  "author": "Kelsey Castañon",
  "published": "Thu, 17 Oct 2024 13:05:02 -0700",
  "source": "https://www.popsugar.com/beauty/feed",
  "categories": [
    "Halloween",
    "Juntos Style",
    "Juntos",
    "Antiracism",
    "Halloween Beauty"
  ],
  "byline": "Kelsey Castañon",
  "length": 4584,
  "excerpt": "Are Day of the Dead costumes on Halloween cultural appropriation? Before you paint your face with skeleton makeup, read this.",
  "siteName": "Popsugar",
  "favicon": "",
  "text": "While each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our Product Review Guidelines here.It's a scenario like so many others in recent years: you're scrolling through Instagram for Halloween costume inspiration, weaving through hashtags and grids for makeup ideas or hairstyles that stand out in a sea of the same. You spot a celebrity in a beautiful, intricate Día de los Muertos (or Day of the Dead) get-up, their face painted with decorated skulls in the style of La Catrina. Then, you read the comments. \"It'd be great if you didn't appropriate Mexican culture like this,\" one of many people wrote of Ashley Tisdale's Day of the Dead Halloween look back in 2016. Another responded, \"Lighten up ppl. It's a costume.\" Of course, it's not just Tisdale who has sparked debates on the matter across social media. Stars like Kate Hudson and Hilary Duff and countless Instagram influencers have also stepped out on All Hallows' Eve wearing what's often referred to as \"sugar skull\" makeup, followed by dozens of critics calling it cultural appropriation. But is it? As a Latina who lived in Mexico City during the formative years of my childhood, and who continues to regularly visit the country with deep appreciation for the culture, I'll admit I was initially confused by the backlash. While Día de los Muertos is in no way related to Halloween — in fact, the two holidays are entirely separate — nor is it solely observed in Mexico, it was one of my favorites to celebrate growing up. Over the course of three days, from Oct. 31 to Nov. 2, we would paint plates and figurines with bright patterns and shapes, bake delicious pan de muerto (sweet bread), and decorate calaveras de azúcar (sugar skulls) with shiny tissue paper to bring to the altar — all to honor the death of loved ones. Still, for people outside of the culture, not acknowledging the tradition's origins (which is part-indigenous and part-Catholic), and instead seeing it as nothing but a great Halloween costume, is offensive — but it doesn't have to be. \"Once people understand how sacred the holiday is, I invite them to join, participate, and appreciate the culture.\"\"As a makeup artist, I've seen the sugar skull makeup trend blow up and fall in the line of appropriation, but I also love seeing people expressing their art and representing my culture,\" Mexican-American makeup artist Valeria Leyva tells PS. \"Día de los Muertos is more than just painting your face with the shape of a sugar skull; we are honoring our loved ones that have left this earth. We see death as the beginning of another life, so there is a very fine line between appropriation and appreciation. It depends on the way you see it and also how people carry a tradition that's not originally theirs.\" The biggest point of contention, adds Regina Merson, Mexican-American beauty entrepreneur and founder of Reina Rebelde, is the many points of differentiation between Día de los Muertos and any other holiday where dressing in costume is ritualized, like Halloween. \"It is not a holiday about fantasy or horror, but rather something that is meant to be soulful and uplifting and positive,\" says Merson. \"One of the most offensive things is when people paint a Catrina and make the look intersect with something scary and bloody. That Catrina represents your dead relative, not a comic book character.\" Instead, sugar skull makeup has a place when done with the right intentions, and with respect and understanding of its significance. That's also why Merson created three new Reina Rebelde products — a 4 Play Wet Dry Eye Color in Azteca ($23), On Your Face Contour + Color Trio in Coqueta ($23), and Lip Brilliance color in Bomba ($18) — in honor of the holiday: to celebrate all things beautiful about the tradition. \"Once people understand how sacred the holiday is, I invite them to join, participate, and appreciate the culture,\" says Merson. \"The makeup you create [in honor of Día de los Muertos] should be beautiful, colorful, and uplifting. You are channeling someone you loved, you are celebrating their life on earth and their soul's return visit from the afterlife. That feeling of love and respect should inform the makeup.\" Kelsey Castañon is a Brooklyn-based writer, editor, and content strategist with more than 13 years of experience in publishing. She is currently the senior content director at PS, where you can find her stockpiling (and reporting on) everything from skin care to wine.",
  "image": "https://media1.popsugar-assets.com/files/thumbor/OMjYGUQ_W17P87AJC539xQhPJG4=/0x0:6000x3150/fit-in/6000x4000/top/filters:format_auto():quality(85):upscale()/2021/10/22/910/n/1922153/2dc939bf61732411958596.72700701_.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eWhile each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our \u003ca href=\"https://www.popsugar.com/ps-product-review-guidelines-disclosures\" target=\"_blank\"\u003eProduct Review Guidelines here\u003c/a\u003e.\u003c/p\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"2\"\u003e\u003cp data-element-index=\"0\"\u003eIt\u0026#39;s a scenario like so many others in recent years: you\u0026#39;re scrolling through Instagram for \u003ca href=\"https://www.popsugar.com/beauty/Last-Minute-Easy-Halloween-Makeup-Tutorials-44166751\"\u003eHalloween costume inspiration\u003c/a\u003e, weaving through hashtags and grids for makeup ideas or hairstyles that stand out in a sea of the same. You spot a celebrity in a beautiful, intricate Día de los Muertos (or Day of the Dead) get-up, their face painted with decorated skulls in the style of La Catrina. Then, you read the comments. \n\u003c/p\u003e\u003cp data-element-index=\"1\"\u003e\u0026#34;It\u0026#39;d be great if you didn\u0026#39;t appropriate Mexican culture like this,\u0026#34; one of many people wrote of \u003ca href=\"https://www.instagram.com/p/BMMeHQ_gpJr/?ref=popsugar.com\u0026amp;=___psv__p_47804284__t_w_\" target=\"_blank\"\u003eAshley Tisdale\u0026#39;s Day of the Dead Halloween look\u003c/a\u003e back in 2016. Another responded, \u0026#34;Lighten up ppl. It\u0026#39;s a costume.\u0026#34; Of course, it\u0026#39;s not just Tisdale who has sparked debates on the matter across social media. Stars like Kate Hudson and Hilary Duff and countless Instagram influencers have also stepped out on All Hallows\u0026#39; Eve wearing what\u0026#39;s often referred to as \u0026#34;sugar skull\u0026#34; makeup, followed by dozens of critics calling it \u003ca href=\"https://www.popsugar.com/latina/What-Meaning-Behind-Day-Dead-Sugar-Skulls-42083035\"\u003ecultural appropriation\u003c/a\u003e. But is it?\n\u003c/p\u003e\u003c/div\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"5\"\u003e\u003cp data-element-index=\"0\"\u003eAs a Latina who lived in Mexico City during the formative years of my childhood, and who continues to regularly visit the country with deep appreciation for the culture, I\u0026#39;ll admit I was initially confused by the backlash. While \u003ca href=\"https://www.popsugar.com/latina/What-Day-Dead-43897468\"\u003eDía de los Muertos\u003c/a\u003e is in no way related to Halloween — in fact, the two holidays are entirely separate — nor is it solely observed in Mexico, it was one of my favorites to celebrate growing up. \n\u003c/p\u003e\u003cp data-element-index=\"1\"\u003eOver the course of three days, from Oct. 31 to Nov. 2, we would paint plates and figurines with bright patterns and shapes, bake delicious pan de muerto (sweet bread), and decorate calaveras de azúcar (sugar skulls) with shiny tissue paper to bring to the altar — all to honor the death of loved ones. Still, for people outside of the culture, not acknowledging the tradition\u0026#39;s origins (which is part-indigenous and part-Catholic), and instead seeing it as nothing but a great Halloween costume, \u003cem\u003eis\u003c/em\u003e offensive — but it doesn\u0026#39;t have to be.\n\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u0026#34;Once people understand how sacred the holiday is, I invite them to join, participate, and appreciate the culture.\u0026#34;\u003c/p\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"7\"\u003e\u003cp data-element-index=\"0\"\u003e\u0026#34;As a makeup artist, I\u0026#39;ve seen the sugar skull makeup trend blow up and fall in the line of appropriation, but I also love seeing people expressing their art and representing my culture,\u0026#34; Mexican-American makeup artist \u003ca href=\"https://www.instagram.com/itsvalleyva/?ref=popsugar.com\u0026amp;=___psv__p_47804284__t_w_\" target=\"_blank\"\u003eValeria Leyva\u003c/a\u003e tells PS. \u0026#34;Día de los Muertos is more than just painting your face with the shape of a sugar skull; we are honoring our loved ones that have left this earth. We see death as the beginning of another life, so there is a very \u003ca href=\"https://www.popsugar.com/beauty/history-black-hairstyles-cultural-appropriation-47659501\"\u003efine line between appropriation and appreciation\u003c/a\u003e. It depends on the way you see it and also how people carry a tradition that\u0026#39;s not originally theirs.\u0026#34; \n\u003c/p\u003e\u003cp data-element-index=\"1\"\u003eThe biggest point of contention, adds \u003ca href=\"https://www.instagram.com/reginamerson/?hl=en\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_47804284__t_w_\" target=\"_blank\"\u003eRegina Merson\u003c/a\u003e, Mexican-American beauty entrepreneur and founder of \u003ca href=\"https://reinarebelde.com/?ref=popsugar.com\u0026amp;=___psv__p_47804284__t_w_\" target=\"_blank\"\u003eReina Rebelde\u003c/a\u003e, is the many points of differentiation between Día de los Muertos and any other holiday where dressing in costume is ritualized, like Halloween. \n\u003c/p\u003e\u003cp data-element-index=\"2\"\u003e\u0026#34;It is not a holiday about fantasy or horror, but rather something that is meant to be soulful and uplifting and positive,\u0026#34; says Merson. \u0026#34;One of the most offensive things is when people paint a Catrina and make the look intersect with something scary and bloody. That Catrina represents your dead relative, not a comic book character.\u0026#34;\n\u003c/p\u003e\u003cp data-element-index=\"3\"\u003eInstead, sugar skull makeup has a place when done with the right intentions, and with respect and understanding of its significance. That\u0026#39;s also why Merson created three new Reina Rebelde products — a \u003ca href=\"https://reinarebelde.com/products/azteca?ref=popsugar.com\u0026amp;=___psv__p_47804284__t_w_\" target=\"_blank\"\u003e4 Play Wet Dry Eye Color in Azteca\u003c/a\u003e ($23), \u003ca href=\"https://reinarebelde.com/products/coqueta?_pos=3\u0026amp;_sid=2fe67b8bc\u0026amp;_ss=r\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_47804284__t_w_\" target=\"_blank\"\u003eOn Your Face Contour + Color Trio in Coqueta\u003c/a\u003e ($23), and \u003ca href=\"https://reinarebelde.com/products/bomba?_pos=1\u0026amp;_sid=56542d201\u0026amp;_ss=r\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_47804284__t_w_\" target=\"_blank\"\u003eLip Brilliance color in Bomba\u003c/a\u003e ($18) — in honor of the holiday: to celebrate all things beautiful about the tradition. \n\u003c/p\u003e\u003cdiv\u003e\u003ca href=\"https://reinarebelde.com/products/azteca?ref=popsugar.com\u0026amp;=___psv__p_47804284__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\" aria-label=\"\" data-vars-action=\"product image\" data-vars-retailer=\"reinarebelde.com\" data-vars-price=\"$23\" data-vars-href=\"https://reinarebelde.com/products/azteca\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/_jR_D2mM5ZukYJTgRo6sUaTwIcI=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2023/07/17/977/n/1922153/88f6792d64b5c069980042.91761879_98_e75b2ba2-.webp\" media=\"(min-width: 1024px)\" data-size=\"desktop\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/_jR_D2mM5ZukYJTgRo6sUaTwIcI=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2023/07/17/977/n/1922153/88f6792d64b5c069980042.91761879_98_e75b2ba2-.webp\" media=\"(min-width: 768px) and (max-width: 1023px)\" data-size=\"tablet\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/VHSejOQPhgMvgI5EU6q2ugDGF2s=/fit-in/700x700/filters:format_auto():extract_cover():upscale():fill(ffffff)/2023/07/17/977/n/1922153/88f6792d64b5c069980042.91761879_98_e75b2ba2-.webp\" media=\"(max-width: 767px)\" data-size=\"mobile\" width=\"350\" height=\"350\"/\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/yildl4FetTMBjjuOR8wMwqJQ67o=/fit-in/350x350/filters:format_auto():quality(70):extract_cover():upscale():fill(ffffff)/2023/07/17/977/n/1922153/88f6792d64b5c069980042.91761879_98_e75b2ba2-.webp\" alt=\"Main Image\" width=\"350\" height=\"350\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"https://reinarebelde.com/products/coqueta?_pos=3\u0026amp;_sid=2fe67b8bc\u0026amp;_ss=r\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_47804284__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\" aria-label=\"\" data-vars-action=\"product image\" data-vars-retailer=\"reinarebelde.com\" data-vars-price=\"$23\" data-vars-href=\"https://reinarebelde.com/products/coqueta?_pos=3\u0026amp;_sid=2fe67b8bc\u0026amp;_ss=r\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/LvCW_iDwAaw91sAl7PQ_t_g-gb0=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2023/10/23/765/n/44344577/shop9avkaU.png\" media=\"(min-width: 1024px)\" data-size=\"desktop\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/LvCW_iDwAaw91sAl7PQ_t_g-gb0=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2023/10/23/765/n/44344577/shop9avkaU.png\" media=\"(min-width: 768px) and (max-width: 1023px)\" data-size=\"tablet\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/KTHFfqEBNrUkaXxIDsQeEDfxlE8=/fit-in/700x700/filters:format_auto():extract_cover():upscale():fill(ffffff)/2023/10/23/765/n/44344577/shop9avkaU.png\" media=\"(max-width: 767px)\" data-size=\"mobile\" width=\"350\" height=\"350\"/\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/F2jJe3LCsUObNk0tBff_GWGSGJw=/fit-in/350x350/filters:format_auto():quality(70):extract_cover():upscale():fill(ffffff)/2023/10/23/765/n/44344577/shop9avkaU.png\" alt=\"Main Image\" width=\"350\" height=\"350\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"https://reinarebelde.com/products/bomba?_pos=1\u0026amp;_sid=56542d201\u0026amp;_ss=r\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_47804284__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\" aria-label=\"\" data-vars-action=\"product image\" data-vars-retailer=\"reinarebelde.com\" data-vars-price=\"$17\" data-vars-href=\"https://reinarebelde.com/products/bomba?_pos=1\u0026amp;_sid=56542d201\u0026amp;_ss=r\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/uY_DtoJ3cE5wF6KAjyoCiTyH55M=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2023/07/17/977/n/1922153/e2b9e12464b5c077a23f41.07603605_87_3b2610b3-.webp\" media=\"(min-width: 1024px)\" data-size=\"desktop\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/uY_DtoJ3cE5wF6KAjyoCiTyH55M=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2023/07/17/977/n/1922153/e2b9e12464b5c077a23f41.07603605_87_3b2610b3-.webp\" media=\"(min-width: 768px) and (max-width: 1023px)\" data-size=\"tablet\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/iYj7tvq1TN95m-KTGS_Sa67GmsU=/fit-in/700x700/filters:format_auto():extract_cover():upscale():fill(ffffff)/2023/07/17/977/n/1922153/e2b9e12464b5c077a23f41.07603605_87_3b2610b3-.webp\" media=\"(max-width: 767px)\" data-size=\"mobile\" width=\"350\" height=\"350\"/\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/n4EzEmmNjbfgJB5QvoR-ZQ23FQM=/fit-in/350x350/filters:format_auto():quality(70):extract_cover():upscale():fill(ffffff)/2023/07/17/977/n/1922153/e2b9e12464b5c077a23f41.07603605_87_3b2610b3-.webp\" alt=\"Main Image\" width=\"350\" height=\"350\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/div\u003e\u003cp data-element-index=\"4\"\u003e\u0026#34;Once people understand how sacred the holiday is, I invite them to join, participate, and appreciate the culture,\u0026#34; says Merson. \u0026#34;The makeup you create [in honor of Día de los Muertos] should be beautiful, colorful, and uplifting. You are channeling someone you loved, you are celebrating their life on earth and their soul\u0026#39;s return visit from the afterlife. That feeling of love and respect should inform the makeup.\u0026#34;\n\u003c/p\u003e\u003c/div\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"9\"\u003e\u003cp data-element-index=\"1\"\u003e\u003cem\u003e\u003ca href=\"https://www.popsugar.com/author/jessicalharrington\"\u003eKelsey Castañon\u003c/a\u003e is a Brooklyn-based writer, editor, and content strategist with more than 13 years of experience in publishing. She is currently the senior content director at PS, where you can find her stockpiling (and reporting on) everything from skin care to wine.\u003c/em\u003e\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2020-10-08T13:15:02Z",
  "modifiedTime": "2024-10-17T20:05:02Z"
}
