{
  "id": "ab961606-b377-4e7e-b175-366fdddaee44",
  "title": "7 Cute \u0026 Actually Wearable Makeup Trends To Try In 2025",
  "link": "https://www.refinery29.com/en-us/makeup-trends-2025?utm_source=feed\u0026utm_medium=rss",
  "description": "From red blush to the “cinnamon girl” aesthetic, TikTok was the driving force behind countless viral makeup trends in 2024. It was the year we ditched foundation in favor of using only concealer, embraced Eras Tour makeup, and saw the return of all things blue. That’s not to mention the hundreds of sell-out products. Refy’s Lash Sculpt and Rhode’s Pocket Blush were on everyone’s shopping lists, Rhode’s so much so that diehard fans stood in line for up to seven hours to enter the brand’s London pop-up to get their hands on one. So what can we expect from 2025? We asked some of the coolest makeup artists around to share their predictions for the upcoming year. From “cherry girl” to a continued fascination with blush, here are the most wearable makeup trends to get on board with in January and beyond. Introducing the “cherry girl” View this post on Instagram A post shared by Franny (@frannfyne) Moving on from the “tomato girl” aesthetic of 2023, and Hailey Bieber’s cinnamon roll-inspired palette that rounded out 2024, the new year will spotlight cherry — and its multiple tones — as the new hue du jour. Cherry red nails are here to stay, of course, but now it’s about lips and cheeks, too. “Cherry is versatile and wearable, ranging from bright cherry reds to deep burgundy tones,” says Chanel makeup artist Ninni Nummela. “It works beautifully as a matte [cheek] stain or a perfected lip with a juicy texture.” Take inspiration from digital creator Franny on Instagram. Hannah Murray, global artistic director at Bobbi Brown, agrees. “Cherry can be both glamorous and tough,” she says. “I think it’s an evolution of the ’90s trends we’ve seen for a while,” like latte and aubergine shades. Try combining a cherry lipstick like Merit Signature Lip in Fashion, $26, with a soft cream blush such as Refy Cream Blush in Cherry, $20, for a monochrome look. It’s all about the eyes View this post on Instagram A post shared by Clo (｡◕‿◕｡) (@chloeisabellah_) The focus for 2025 is mostly on the eyes, says Nummela, and it’s dealer’s choice how you dress them. For Nummela, it’s all about “soft washes of muted colors” in shades like baby blue and powder pink, which look especially cool swept haphazardly across the lids. That’s not all. We’ll be inspired by the spring/summer 2025 fashion shows, where we saw everything from colorful lashes, courtesy of Bottega Veneta and Dries Van Noten, to graphic liner. “The trend will lean towards easy-to-achieve, minimalist lines like a single, clean swipe of liner along the upper lash line, extended into a soft wing or a geometric shape [at the outer corner],” says Simone Otis, makeup artist for 19/99 Beauty. Try ONE/SIZE by Patrick Starrr Point Made Waterproof Liquid Eyeliner Pen, $26, with a felt-tip nib that makes light work of wings, and look to Chloe Isabellah for inspiration. Balance out bold liner with a black or brown mascara like Benefit Cosmetics Fan Fest Fanning \u0026 Volumizing Mascara, $39, or experiment with at-home extensions. Isamaya Ffrench’s collaboration with Lashify will help you achieve your dream lashes. The new no-makeup makeup View this post on Instagram A post shared by Rachael Alisedaghat (@rachaela_) There’s a new take on the no-makeup makeup trend most weeks but this year’s iteration presents something fresh: a more matte and blurred approach to skin, as opposed to an obvious glow. “This is more of a soft-focus effect with a sophisticated, velvety finish,” explains Nummela. “[Think] less shine and more subtle luminosity,” as seen on digital fashion, beauty and lifestyle creator Rachael Alisedaghat. Rather than enlisting shimmer-laden powder highlighter, the effect is achieved by strategically applying balm textures to the high points of the face, like cheekbones and the bridge of the nose, for a naturally radiant touch. For that perfect, “in-between” soft skin look, mix a little Saie Glowy Super Gel, $28, with Chanel Ultra Le Teint Velvet, $55, and apply all over. Blurred and bitten lips View this post on Instagram A post shared by NESSA (@vanessawhite) Speaking of blurred beauty, your new go-to lip will be all about undefined edges and a just-bitten look. At Carolina Herrera, lightly glossed plum lip stains took centre stage, while at Grace Ling, lips were dressed in an understated nude, blurred at the edges. But there’s more of a just-kissed feel in 2025. “[The new blurred lips] fit perfectly into the ongoing movement towards low-maintenance beauty while allowing for playful experimentation with color,” Otis says. “Whether you’re after a soft wash of color or a bold bitten lip, this look is all about embracing effortless beauty.” She recommends choosing your favorite lip stain (try Victoria Beckham Beauty Bitten Lip Tint in Cherie, $34, or Milk Makeup Cooling Water Jelly Tint in Splash, $24) and dabbing the product onto the centre of your lips using your finger or a lip brush. “[To blur] use your finger or a cotton [bud] to gently blend the color outwards, softening the edges so they fade into your natural lip line,” says Otis. Grungy greige View this post on Instagram A post shared by KATIE JANE HUGHES (@katiejanehughes) This year, Murray suggests that grey-meets-beige, aka greige, will be the new neutral. “[At fashion week] Rick Owens, Marni and Roksanda embraced all things greige, coloring the lips and eyes in this flattering, cool-toned neutral,” she says. It’s ideal for those who want to embrace the grunge aesthetic with a chic and modern twist. The easiest way to wear it is on your eyes à la makeup artist Katie Jane Hughes. Try Bobbi Brown Long-Wear Cream Shadow Stick in Stone, $34, or RMS Eyelights Cream Eyeshadow, $28, which offers more of a shimmery take. This looks super pretty with a neutral lipstick and NARS has an excellent selection for all skin tones. The return of shimmer View this post on Instagram A post shared by Alexandra French (@alexandraafrench) No longer the preserve of the ’00s, shimmer is set to make a comeback in 2025. This time around, it’s all grown up. Think tiny pops of metallic and subtle shimmer accents on eyes and atop cheekbones. At Alice + Olivia spring/summer 2025, hints of shimmer were placed at the inner corners and concentrated to the middle of the lids to brighten up eyes. Take a cue from makeup artist Alexandra French. “For 2025, the shimmer is more refined: delicate, pearlescent tones rather than chunky glitter,” explains Aimee Connolly, makeup artist and founder of Sculpted By Aimee. It’s pretty easy to achieve, adds Jorge Balzaretti, senior makeup artist for SUQQU. “You don’t need much to make an impact. Just a swipe of shimmer on your lids or a little dab of highlighter on your cheekbones instantly takes your look from everyday to effortlessly glowing.” For the most impressive shimmering eyes, there’s no brand better than Half Magic. Its Chromaddiction Shimmer Eye Paint \u0026 Liner, $25.50, offers dramatic yet refined sparkle in a number of beautiful colors. Modern blush View this post on Instagram A post shared by MYLA (@pradaolic) Thanks to brands like Rhode and Milk Makeup, blush had a main character moment in 2024 — and it’ll continue its reign in the new year. But pink could be out. Instead, natural red and burgundy tints (as seen on Myla aka @pradaolic on Instagram) as well as fall-inspired brown (yes, brown) will see us reinvent a natural-looking flush that works across all skin tones. “I love the sun-kissed look that you can get from using warmer blush tones, and I think this [year], the shift is in the placement, bringing the color higher up on the apples of the cheeks to almost under the eyes where you would naturally catch the sun,” says Murray. Balzaretti thinks that 2025 is going to push things even further color-wise. “I’m loving the rise of experimental shades like mauve and rust,” he says. “These colors add such beautiful depth and warmth to the skin without feeling too traditional.” After a warmer hue? Try Rhode Pocket Blush in Sleepy Girl, $24, or the viral Huda Beauty Icy Nude Blush Filter in Latte, $21. Above, Myla wears Milk Makeup Cooling Water Jelly Tint in Splash, $22. Like what you see? How about some more R29 goodness, right here?We Tried $779 Of Victoria Beckham BeautyBrides Share Their Biggest Wedding Makeup RegretsI Tried $317 Worth Of Kosas \u0026 Here's What I'd Buy",
  "author": "Rebecca Fearn",
  "published": "Mon, 06 Jan 2025 10:46:18 +0000",
  "source": "https://www.refinery29.com/beauty/rss.xml",
  "categories": null,
  "byline": "Rebecca Fearn",
  "length": 5919,
  "excerpt": "From blurred lips to the new no-makeup makeup, here are seven beauty trends to try in 2025.",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "AdvertisementADVERTISEMENTSo what can we expect from 2025? We asked some of the coolest makeup artists around to share their predictions for the upcoming year. From “cherry girl” to a continued fascination with blush, here are the most wearable makeup trends to get on board with in January and beyond.Introducing the “cherry girl”Moving on from the “tomato girl” aesthetic of 2023, and Hailey Bieber’s cinnamon roll-inspired palette that rounded out 2024, the new year will spotlight cherry — and its multiple tones — as the new hue du jour. Cherry red nails are here to stay, of course, but now it's about lips and cheeks, too. “Cherry is versatile and wearable, ranging from bright cherry reds to deep burgundy tones,” says Chanel makeup artist Ninni Nummela. “It works beautifully as a matte [cheek] stain or a perfected lip with a juicy texture.” Take inspiration from digital creator Franny on Instagram.AdvertisementADVERTISEMENTIt's all about the eyesThe focus for 2025 is mostly on the eyes, says Nummela, and it’s dealer’s choice how you dress them. For Nummela, it’s all about “soft washes of muted colors” in shades like baby blue and powder pink, which look especially cool swept haphazardly across the lids.That's not all. We'll be inspired by the spring/summer 2025 fashion shows, where we saw everything from colorful lashes, courtesy of Bottega Veneta and Dries Van Noten, to graphic liner. “The trend will lean towards easy-to-achieve, minimalist lines like a single, clean swipe of liner along the upper lash line, extended into a soft wing or a geometric shape [at the outer corner],” says Simone Otis, makeup artist for 19/99 Beauty. Try ONE/SIZE by Patrick Starrr Point Made Waterproof Liquid Eyeliner Pen, $26, with a felt-tip nib that makes light work of wings, and look to Chloe Isabellah for inspiration.AdvertisementADVERTISEMENTThe new no-makeup makeupThere’s a new take on the no-makeup makeup trend most weeks but this year’s iteration presents something fresh: a more matte and blurred approach to skin, as opposed to an obvious glow. “This is more of a soft-focus effect with a sophisticated, velvety finish,” explains Nummela. “[Think] less shine and more subtle luminosity,” as seen on digital fashion, beauty and lifestyle creator Rachael Alisedaghat. Rather than enlisting shimmer-laden powder highlighter, the effect is achieved by strategically applying balm textures to the high points of the face, like cheekbones and the bridge of the nose, for a naturally radiant touch.Blurred and bitten lipsSpeaking of blurred beauty, your new go-to lip will be all about undefined edges and a just-bitten look. At Carolina Herrera, lightly glossed plum lip stains took centre stage, while at Grace Ling, lips were dressed in an understated nude, blurred at the edges. But there’s more of a just-kissed feel in 2025.“[The new blurred lips] fit perfectly into the ongoing movement towards low-maintenance beauty while allowing for playful experimentation with color,” Otis says. “Whether you’re after a soft wash of color or a bold bitten lip, this look is all about embracing effortless beauty.” She recommends choosing your favorite lip stain (try Victoria Beckham Beauty Bitten Lip Tint in Cherie, $34, or Milk Makeup Cooling Water Jelly Tint in Splash, $24) and dabbing the product onto the centre of your lips using your finger or a lip brush. “[To blur] use your finger or a cotton [bud] to gently blend the color outwards, softening the edges so they fade into your natural lip line,” says Otis.AdvertisementADVERTISEMENTGrungy greigeThis year, Murray suggests that grey-meets-beige, aka greige, will be the new neutral. “[At fashion week] Rick Owens, Marni and Roksanda embraced all things greige, coloring the lips and eyes in this flattering, cool-toned neutral,” she says. It's ideal for those who want to embrace the grunge aesthetic with a chic and modern twist.The return of shimmerNo longer the preserve of the '00s, shimmer is set to make a comeback in 2025. This time around, it’s all grown up. Think tiny pops of metallic and subtle shimmer accents on eyes and atop cheekbones. At Alice + Olivia spring/summer 2025, hints of shimmer were placed at the inner corners and concentrated to the middle of the lids to brighten up eyes. Take a cue from makeup artist Alexandra French.“For 2025, the shimmer is more refined: delicate, pearlescent tones rather than chunky glitter,” explains Aimee Connolly, makeup artist and founder of Sculpted By Aimee. It’s pretty easy to achieve, adds Jorge Balzaretti, senior makeup artist for SUQQU. “You don’t need much to make an impact. Just a swipe of shimmer on your lids or a little dab of highlighter on your cheekbones instantly takes your look from everyday to effortlessly glowing.” For the most impressive shimmering eyes, there’s no brand better than Half Magic. Its Chromaddiction Shimmer Eye Paint \u0026 Liner, $25.50, offers dramatic yet refined sparkle in a number of beautiful colors.AdvertisementADVERTISEMENTModern blushThanks to brands like Rhode and Milk Makeup, blush had a main character moment in 2024 — and it'll continue its reign in the new year. But pink could be out. Instead, natural red and burgundy tints (as seen on Myla aka @pradaolic on Instagram) as well as fall-inspired brown (yes, brown) will see us reinvent a natural-looking flush that works across all skin tones.“I love the sun-kissed look that you can get from using warmer blush tones, and I think this [year], the shift is in the placement, bringing the color higher up on the apples of the cheeks to almost under the eyes where you would naturally catch the sun,” says Murray. Balzaretti thinks that 2025 is going to push things even further color-wise. “I’m loving the rise of experimental shades like mauve and rust,” he says. “These colors add such beautiful depth and warmth to the skin without feeling too traditional.”AdvertisementADVERTISEMENT",
  "image": "https://www.refinery29.com/images/11832745.jpg?crop=40%3A21",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"editorial-content\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eSo what can we expect from 2025? We asked some of the coolest makeup artists around to share their predictions for the upcoming year. From “cherry girl” to a continued fascination with blush, here are the most wearable makeup trends to get on board with in January and beyond.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eIntroducing the “cherry girl”\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eMoving on from the \u003ca href=\"https://www.refinery29.com/en-au/tomato-girl-aesthetic-trend\"\u003e“tomato girl” aesthetic\u003c/a\u003e of 2023, and Hailey Bieber’s cinnamon roll-inspired palette that rounded out 2024, the new year will spotlight cherry — and its multiple tones — as the new hue du jour. Cherry red nails are here to stay, of course, but now it\u0026#39;s about lips and cheeks, too. “Cherry is versatile and wearable, ranging from bright cherry reds to deep burgundy tones,” says \u003ca href=\"https://www.chanel.com/us/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Chanel (opens in a new tab)\"\u003eChanel\u003c/a\u003e makeup artist \u003ca href=\"https://www.instagram.com/ninninummela/?hl=en\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eNinni Nummela\u003c/a\u003e. “It works beautifully as a matte [cheek] stain or a perfected lip with a juicy texture.” Take inspiration from digital creator \u003ca rel=\"noreferrer noopener\" aria-label=\"Franny on Instagram (opens in a new tab)\" href=\"https://www.instagram.com/frannfyne/\" target=\"_blank\"\u003eFranny on Instagram\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eIt\u0026#39;s all about the eyes\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThe focus for 2025 is mostly on the eyes, says Nummela, and it’s dealer’s choice how you dress them. For Nummela, it’s all about “soft washes of muted colors” in shades like baby blue and powder pink, which look especially cool swept haphazardly across the lids.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThat\u0026#39;s not all. We\u0026#39;ll be inspired by the spring/summer 2025 fashion shows, where we saw everything from colorful lashes, courtesy of Bottega Veneta and Dries Van Noten, to graphic liner. “The trend will lean towards easy-to-achieve, minimalist lines like a single, clean swipe of liner along the upper lash line, extended into a soft wing or a geometric shape [at the outer corner],” says \u003ca href=\"https://www.instagram.com/simoneotis/?hl=en\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eSimone Otis\u003c/a\u003e, makeup artist for \u003ca href=\"https://www.instagram.com/1999.beauty/?hl=en\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003e19/99 Beauty\u003c/a\u003e. Try \u003ca href=\"https://go.skimresources.com?id=30283X879131\u0026amp;xs=1\u0026amp;url=https%3A%2F%2Fwww.sephora.com%2Fca%2Fen%2Fproduct%2Fone-size-point-made-24-hour-liquid-eyeliner-pen-P461665%3FskuId%3D2380764%26icid2%3Dproducts%2520grid%3Ap461665%3Aproduct\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"ONE/SIZE by Patrick Starrr Point Made Waterproof Liquid Eyeliner Pen, $26 (opens in a new tab)\"\u003eONE/SIZE by Patrick Starrr Point Made Waterproof Liquid Eyeliner Pen, $26\u003c/a\u003e, with a felt-tip nib that makes light work of wings, and look to \u003ca rel=\"noreferrer noopener\" aria-label=\"Chloe Isabellah (opens in a new tab)\" href=\"https://www.instagram.com/chloeisabellah_/?utm_source=ig_embed\" target=\"_blank\"\u003eChloe Isabellah\u003c/a\u003e for inspiration.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eThe new no-makeup makeup\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThere’s a new take on the \u003ca href=\"https://www.refinery29.com/en-us/natural-makeup-tips-professional-artist\"\u003eno-makeup makeup\u003c/a\u003e trend most weeks but this year’s iteration presents something fresh: a more matte and blurred approach to skin, as opposed to an obvious glow. “This is more of a soft-focus effect with a sophisticated, velvety finish,” explains Nummela. “[Think] less shine and more subtle luminosity,” as seen on digital fashion, beauty and lifestyle creator \u003ca rel=\"noreferrer noopener\" aria-label=\"Rachael Alisedaghat (opens in a new tab)\" href=\"https://www.instagram.com/rachaela_/?hl=en\" target=\"_blank\"\u003eRachael Alisedaghat\u003c/a\u003e. Rather than enlisting shimmer-laden powder highlighter, the effect is achieved by strategically applying balm textures to the high points of the face, like cheekbones and the bridge of the nose, for a naturally radiant touch.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eBlurred and bitten lips\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eSpeaking of blurred beauty, your new go-to lip will be all about undefined edges and a just-bitten look. At Carolina Herrera, lightly glossed plum lip stains took centre stage, while at Grace Ling, lips were dressed in an understated nude, blurred at the edges. But there’s more of a just-kissed feel in 2025.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“[The new blurred lips] fit perfectly into the ongoing movement towards low-maintenance beauty while allowing for playful experimentation with color,” Otis says. “Whether you’re after a soft wash of color or a bold bitten lip, this look is all about embracing effortless beauty.” She recommends choosing your favorite lip stain (try \u003ca rel=\"noreferrer noopener\" aria-label=\"Victoria Beckham Beauty Bitten Lip Tint in Cherie, $34 (opens in a new tab)\" href=\"https://go.skimresources.com?id=30283X879131\u0026amp;xs=1\u0026amp;url=https%3A%2F%2Fvictoriabeckhambeauty.com%2Fproducts%2Fbitten-lip-tint\" target=\"_blank\"\u003eVictoria Beckham Beauty Bitten Lip Tint in Cherie, $34\u003c/a\u003e, or \u003ca rel=\"noreferrer noopener\" aria-label=\"Milk Makeup Cooling Water Jelly Tint in Splash, $24 (opens in a new tab)\" href=\"https://go.skimresources.com?id=30283X879131\u0026amp;xs=1\u0026amp;url=https%3A%2F%2Fwww.sephora.com%2Fca%2Fen%2Fproduct%2Fmilk-makeup-cooling-water-jelly-tint-lip-cheek-blush-stain-P509414\" target=\"_blank\"\u003eMilk Makeup Cooling Water Jelly Tint in Splash, $24\u003c/a\u003e) and dabbing the product onto the centre of your lips using your finger or a lip brush. “[To blur] use your finger or a cotton [bud] to gently blend the color outwards, softening the edges so they fade into your natural lip line,” says Otis.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eGrungy greige\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThis year, Murray suggests that grey-meets-beige, aka greige, will be the new neutral. “[At fashion week] Rick Owens, Marni and Roksanda embraced all things greige, coloring the lips and eyes in this flattering, cool-toned neutral,” she says. It\u0026#39;s ideal for those who want to embrace the grunge aesthetic with a chic and modern twist.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eThe return of shimmer\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eNo longer the preserve of the \u0026#39;00s, shimmer is set to make a comeback in 2025. This time around, it’s all grown up. Think tiny pops of metallic and subtle shimmer accents on eyes and atop cheekbones. At Alice + Olivia spring/summer 2025, hints of shimmer were placed at the inner corners and concentrated to the middle of the lids to brighten up eyes. Take a cue from makeup artist \u003ca rel=\"noreferrer noopener\" aria-label=\"Alexandra French (opens in a new tab)\" href=\"https://www.instagram.com/alexandraafrench/?hl=en\" target=\"_blank\"\u003eAlexandra French\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“For 2025, the shimmer is more refined: delicate, pearlescent tones rather than chunky glitter,” explains \u003ca href=\"https://www.instagram.com/aimeeconnolly_com/?hl=en\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eAimee Connolly\u003c/a\u003e, makeup artist and founder of \u003ca href=\"https://www.instagram.com/sculptedbyaimee/?hl=en\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eSculpted By Aimee\u003c/a\u003e. It’s pretty easy to achieve, adds \u003ca rel=\"noreferrer noopener\" aria-label=\"Jorge Balzaretti (opens in a new tab)\" href=\"https://www.instagram.com/jorgemakeup/?hl=en\" target=\"_blank\"\u003eJorge Balzaretti\u003c/a\u003e, senior makeup artist for \u003ca rel=\"noreferrer noopener\" aria-label=\"SUQQU (opens in a new tab)\" href=\"https://www.suqqu.com/en/\" target=\"_blank\"\u003eSUQQU\u003c/a\u003e. “You don’t need much to make an impact. Just a swipe of shimmer on your lids or a little dab of highlighter on your cheekbones instantly takes your look from everyday to effortlessly glowing.” For the most impressive shimmering eyes, there’s no brand better than Half Magic. Its \u003ca rel=\"noreferrer noopener\" aria-label=\"Chromaddiction Shimmer Eye Paint \u0026amp; Liner, $25.50 (opens in a new tab)\" href=\"https://go.skimresources.com?id=30283X879131\u0026amp;xs=1\u0026amp;url=https%3A%2F%2Fhalfmagicbeauty.com%2Fproducts%2Fchromaddiction-shimmer-1\" target=\"_blank\"\u003eChromaddiction Shimmer Eye Paint \u0026amp; Liner, $25.50\u003c/a\u003e, offers dramatic yet refined sparkle in a number of beautiful colors.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eModern blush\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThanks to brands like Rhode and Milk Makeup, blush had a main character moment in 2024 — and it\u0026#39;ll continue its reign in the new year. But pink could be out. Instead, natural red and burgundy tints (as seen on Myla aka \u003ca rel=\"noreferrer noopener\" aria-label=\"@pradolic on Instagram (opens in a new tab)\" href=\"https://www.instagram.com/pradaolic/\" target=\"_blank\"\u003e@pradaolic on Instagram\u003c/a\u003e) as well as fall-inspired brown (\u003ca rel=\"noreferrer noopener\" href=\"https://www.tiktok.com/discover/brown-blush?lang=en\" target=\"_blank\"\u003eyes, brown\u003c/a\u003e) will see us reinvent a natural-looking flush that works across all skin tones.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“I love the sun-kissed look that you can get from using warmer blush tones, and I think this [year], the shift is in the placement, bringing the color higher up on the apples of the cheeks to almost under the eyes where you would naturally catch the sun,” says Murray. Balzaretti thinks that 2025 is going to push things even further color-wise. “I’m loving the rise of experimental shades like mauve and rust,” he says. “These colors add such beautiful depth and warmth to the skin without feeling too traditional.”\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-01-06T10:46:18Z",
  "modifiedTime": null
}
