{
  "id": "bbe4b395-19cc-4399-9ff8-45eb257f6d13",
  "title": "Blurring Is The New Matte — \u0026 It’s Summer’s Softest Makeup Trend",
  "link": "https://www.refinery29.com/en-us/blur-makeup-trend-products?utm_source=feed\u0026utm_medium=rss",
  "description": "It doesn’t seem like that long ago that our feeds were flooded with images of hyper-glowy skin that looked fresh (but never sweaty), with a healthy sheen. (Dewy makeup got so big, it even permeated pop culture; “my skin is gleamin,’” whisper-sang Ariana Grande in 2019’s “7 rings.”) Glow was the antithesis of the “Instaglam” look that predated it in the mid-2010s; think heavy highlight and contour, a full-coverage base, and bold, matte lipstick. But if there’s one thing we can count on, it’s that trends come, go…and find a way of coming back again. And sure enough, one word has been popping up everywhere in beauty launches lately: Blur. It’s not quite matte, but not quite glowy either. The blurred makeup trend occupies an interesting place between dualities that seems to be striking a chord these days. It delivers all the luminosity of dewy makeup with the diffused velvetiness of ultra-matte glam.  “The trend seems to be gaining momentum in response to the sharp makeup looks that have dominated social media for years,” makeup artist and Sephora Beauty Director David Razzano tells Refinery29. “Bold black cat eyeliner, graphic eyeshadow, intense contouring, and ultra-defined lip lines are beginning to feel a bit dated and overdone.” In comparison, ‘blurred’ makeup has a “fresh, effortless vibe,” per Razzano, that lends the skin a “filtered,” poreless effect. (I never thought I’d say this, but was Maybelline Dream Matte Mousse…ahead of its time?) The more I thought about it, the less surprising the trend was. After all, digitally airbrushed skin via social media filters had given way to products like e.l.f.’s Poreless Putty Primer and Milk Makeup’s (sadly discontinued) Blur Stick. But the 2025 version of blurred-finish products isn’t just about poreless, diffused skin. Instead of bottling blur in primers and touchup products, the soft-focus effect has made its way into lipstick, blush, eyeshadows, and more. Ahead, get the scoop on how to wear blurred makeup from lids to lips — and the pro-approved products to get the look this summer and beyond. DashDividers_1_500x100 Eyes When it comes to eyes, there are several ways to achieve a soft, diffused wash of color. I personally find cream-to-powder eyeshadows like Glossier Skywash or Merit’s new Solo Shadow the quickest, most foolproof way to get a blurred finish. “The Sephora Collection PRO Eyeshadow Brush #18 is my go-to ‘blurring brush’ for both eyes and lips,” says Razzano. “It has a small domed tip, which can be used to blur eyeliner or lipstick out – just gently sweep on the edge of any area.”  DashDividers_1_500x100 Skin When I hear “blurred makeup,” I first think of a soft, creamy complexion resembling something from a Vermeer portrait. Foundations like R29’s Beauty Innovator Award-winning Huda Beauty’s Easy Blur and Covergirl’s new (and already sold out) Clean Fresh Blurring Skin Tint SPF 30 are great options for one-and-done coverage with a petal-soft finish. You can also achieve a beautiful, blurred effect with your finishing products. Razzano loves Kosas’ Cloud Set Baked Setting \u0026 Smoothing Powder for lending a soft veil that reduces shine, not glow. “I’m obsessed with this powder! It sets your makeup in place while delivering an ultra-soft blurring effect, all while maintaining a natural, radiant finish,” he says. “This powder works particularly well when it comes to setting concealer — it blurs out fine lines and wrinkles, without creating dryness under the eyes.” DashDividers_1_500x100 Cheeks The blush craze shows no signs of slowing down anytime soon, and the latest launches all seem to have blur as a priority. There’s the Dua Lipa-fronted YSL Beauty’s new Make Me Blush, which comes in eight candy-colored shades and contains squalane to lend an optical blurring effect on skin. Some of Razzano’s go-to’s include Lawless’ Pinch My Cheeks Soft-Blur Cream Blush, which our editors also loved for its longwear properties and beautiful pigmentation. Another fave comes in the form of Danessa Myricks’ Yummy Skin Blurring Balm Powder, which also happens to be among my most-used products as well. “This formula is nothing short of pure brilliant beauty innovation,” Razzano declares. “Danessa created a hydrating balm-to-powder that instantly blurs the skin, while maintaining a hyper-natural look and feel. Plus, she has carried this formula into blushes and highlighters – so you can blur and add glow simultaneously.” On the bronzer side of things, Makeup By Mario’s SoftSculpt Blurring Bronzer offers the same sun-kissed glow you’d get from a bronzing powder with ingredients like spherical powders that provide an optical blurring effect. DashDividers_1_500x100 Lips Make it a summer of blurred kisses with products that have a soft, romantic finish that’s never dry or flat. “Refy’s Blur Liner boasts a domed tip, creating a natural, soft, and blurred look — an easy step in your routine,” Razzano explains. He also loves Prada Beauty’s Monochrome Soft Matte Blur Lipstick, which has the creamy texture of your favorite lippie but with a velvet finish. “No need to perfectly line your lips, since it softly blurs itself,” he says. “A few taps of your finger will blend it to perfection.” We also love Rhode’s Peptide Lip Shape crayons, which come in a variety of beautiful neutral tones with a soft matte finish. Like what you see? How about some more R29 goodness, right here?",
  "author": "Karina Hoshikawa",
  "published": "Fri, 06 Jun 2025 20:02:45 +0000",
  "source": "https://www.refinery29.com/beauty/rss.xml",
  "categories": null,
  "byline": "Karina Hoshikawa",
  "length": 5274,
  "excerpt": "From blush to lipstick, \"blur\" is the new beauty buzzword that's trending everywhere. Here, we break down the summer's softest beauty trend with makeup artist tips on what products to try.",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. Photo: Courtesy of YSL Beauty.It doesn’t seem like that long ago that our feeds were flooded with images of hyper-glowy skin that looked fresh (but never sweaty), with a healthy sheen. (Dewy makeup got so big, it even permeated pop culture; “my skin is gleamin,’” whisper-sang Ariana Grande in 2019’s “7 rings.”) Glow was the antithesis of the “Instaglam” look that predated it in the mid-2010s; think heavy highlight and contour, a full-coverage base, and bold, matte lipstick.But if there’s one thing we can count on, it’s that trends come, go…and find a way of coming back again. And sure enough, one word has been popping up everywhere in beauty launches lately: Blur. It’s not quite matte, but not quite glowy either. The blurred makeup trend occupies an interesting place between dualities that seems to be striking a chord these days. It delivers all the luminosity of dewy makeup with the diffused velvetiness of ultra-matte glam. AdvertisementADVERTISEMENT“The trend seems to be gaining momentum in response to the sharp makeup looks that have dominated social media for years,” makeup artist and Sephora Beauty Director David Razzano tells Refinery29. “Bold black cat eyeliner, graphic eyeshadow, intense contouring, and ultra-defined lip lines are beginning to feel a bit dated and overdone.” In comparison, ‘blurred’ makeup has a “fresh, effortless vibe,” per Razzano, that lends the skin a “filtered,” poreless effect. (I never thought I’d say this, but was Maybelline Dream Matte Mousse...ahead of its time?)The more I thought about it, the less surprising the trend was. After all, digitally airbrushed skin via social media filters had given way to products like e.l.f.’s Poreless Putty Primer and Milk Makeup’s (sadly discontinued) Blur Stick. But the 2025 version of blurred-finish products isn’t just about poreless, diffused skin. Instead of bottling blur in primers and touchup products, the soft-focus effect has made its way into lipstick, blush, eyeshadows, and more.Ahead, get the scoop on how to wear blurred makeup from lids to lips — and the pro-approved products to get the look this summer and beyond.EyesWhen it comes to eyes, there are several ways to achieve a soft, diffused wash of color. I personally find cream-to-powder eyeshadows like Glossier Skywash or Merit’s new Solo Shadow the quickest, most foolproof way to get a blurred finish. “The Sephora Collection PRO Eyeshadow Brush #18 is my go-to ‘blurring brush’ for both eyes and lips,” says Razzano. “It has a small domed tip, which can be used to blur eyeliner or lipstick out – just gently sweep on the edge of any area.” AdvertisementADVERTISEMENTSkinWhen I hear “blurred makeup,” I first think of a soft, creamy complexion resembling something from a Vermeer portrait. Foundations like R29’s Beauty Innovator Award-winning Huda Beauty’s Easy Blur and Covergirl’s new (and already sold out) Clean Fresh Blurring Skin Tint SPF 30 are great options for one-and-done coverage with a petal-soft finish.You can also achieve a beautiful, blurred effect with your finishing products. Razzano loves Kosas’ Cloud Set Baked Setting \u0026 Smoothing Powder for lending a soft veil that reduces shine, not glow. “I’m obsessed with this powder! It sets your makeup in place while delivering an ultra-soft blurring effect, all while maintaining a natural, radiant finish,” he says. “This powder works particularly well when it comes to setting concealer — it blurs out fine lines and wrinkles, without creating dryness under the eyes.”CheeksThe blush craze shows no signs of slowing down anytime soon, and the latest launches all seem to have blur as a priority. There’s the Dua Lipa-fronted YSL Beauty’s new Make Me Blush, which comes in eight candy-colored shades and contains squalane to lend an optical blurring effect on skin. Some of Razzano’s go-to’s include Lawless’ Pinch My Cheeks Soft-Blur Cream Blush, which our editors also loved for its longwear properties and beautiful pigmentation. Another fave comes in the form of Danessa Myricks’ Yummy Skin Blurring Balm Powder, which also happens to be among my most-used products as well. “This formula is nothing short of pure brilliant beauty innovation,” Razzano declares. “Danessa created a hydrating balm-to-powder that instantly blurs the skin, while maintaining a hyper-natural look and feel. Plus, she has carried this formula into blushes and highlighters – so you can blur and add glow simultaneously.”AdvertisementADVERTISEMENTLipsMake it a summer of blurred kisses with products that have a soft, romantic finish that’s never dry or flat. “Refy’s Blur Liner boasts a domed tip, creating a natural, soft, and blurred look — an easy step in your routine,” Razzano explains. He also loves Prada Beauty’s Monochrome Soft Matte Blur Lipstick, which has the creamy texture of your favorite lippie but with a velvet finish. “No need to perfectly line your lips, since it softly blurs itself,” he says. “A few taps of your finger will blend it to perfection.” We also love Rhode’s Peptide Lip Shape crayons, which come in a variety of beautiful neutral tones with a soft matte finish.AdvertisementADVERTISEMENT",
  "image": "https://www.refinery29.com/images/11902662.jpg?crop=40%3A21",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"editorial-content\"\u003e\u003cdiv\u003e\n\n\u003cp\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\u003cp\u003ePhoto: Courtesy of YSL Beauty.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIt doesn’t seem like that long ago that our feeds were flooded with images of hyper-glowy skin that looked fresh (but never sweaty), with a healthy sheen. (\u003ca href=\"https://www.refinery29.com/en-us/dewy-skin-makeup-products\"\u003eDewy makeup\u003c/a\u003e got so big, it even permeated pop culture; “my skin is gleamin,’” whisper-sang Ariana Grande in 2019’s “7 rings.”) Glow was the antithesis of the “Instaglam” look that predated it in the mid-2010s; think heavy \u003ca href=\"https://www.refinery29.com/en-us/glowing-skin-highlighting-makeup-products\"\u003ehighlight\u003c/a\u003e and contour, a full-coverage base, and bold, matte lipstick.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eBut if there’s one thing we can count on, it’s that trends come, go…and find a way of coming back again. And sure enough, one word has been popping up everywhere in beauty launches lately: \u003cem\u003eBlur\u003c/em\u003e. It’s not quite matte, but not quite glowy either. The blurred makeup trend occupies an interesting place between dualities that seems to be striking a chord these days. It delivers all the luminosity of dewy makeup with the diffused velvetiness of ultra-matte glam. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“The trend seems to be gaining momentum in response to the sharp makeup looks that have dominated social media for years,” makeup artist and Sephora Beauty Director David Razzano tells Refinery29. “Bold black cat eyeliner, graphic eyeshadow, intense contouring, and ultra-defined lip lines are beginning to feel a bit dated and overdone.” In comparison, ‘blurred’ makeup has a “fresh, effortless vibe,” per Razzano, that lends the skin a “filtered,” poreless effect. (I never thought I’d say this, but was Maybelline Dream Matte Mousse...ahead of its time?)\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThe more I thought about it, the less surprising the trend was. After all, digitally airbrushed skin via social media filters had given way to products like \u003ca href=\"https://www.refinery29.com/en-us/elf-poreless-putty-primer-review\"\u003ee.l.f.’s Poreless Putty Primer\u003c/a\u003e and Milk Makeup’s (sadly discontinued) Blur Stick. But the 2025 version of blurred-finish products isn’t just about poreless, diffused skin. Instead of bottling blur in primers and touchup products, the soft-focus effect has made its way into lipstick, blush, eyeshadows, and more.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAhead, get the scoop on how to wear blurred makeup from lids to lips — and the pro-approved products to get the look this summer and beyond.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eEyes\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWhen it comes to eyes, there are several ways to achieve a soft, diffused wash of color. I personally find cream-to-powder eyeshadows like \u003ca href=\"https://www.glossier.com/products/skywash?\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eGlossier Skywash\u003c/a\u003e or Merit’s new \u003ca href=\"https://www.sephora.com/product/solo-shadow-soft-matte-cream-single-eyeshadow-P506671?\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eSolo Shadow\u003c/a\u003e the quickest, most foolproof way to get a blurred finish. “The \u003ca href=\"https://www.sephora.com/product/sephora-collection-pro-shadow-18-P455660?\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eSephora Collection PRO Eyeshadow Brush #18\u003c/a\u003e is my go-to ‘blurring brush’ for both eyes and lips,” says Razzano. “It has a small domed tip, which can be used to blur eyeliner or lipstick out – just gently sweep on the edge of any area.” \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eSkin\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWhen I hear “blurred makeup,” I first think of a soft, creamy complexion resembling something from a Vermeer portrait. Foundations like R29’s Beauty Innovator Award-winning \u003ca href=\"https://www.sephora.com/product/huda-beauty-easy-blur-smoothing-foundation-P512640?\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Huda Beauty’s Easy Blur (opens in a new tab)\"\u003eHuda Beauty’s Easy Blur\u003c/a\u003e and Covergirl’s new (and already sold out) \u003ca href=\"https://www.ulta.com/p/clean-fresh-blurring-skin-tint-spf-30-pimprod2051963?sku=2641566\u0026amp;cmpid=PS_Non!google!Product_Listing_Ads\u0026amp;utm_source=google\u0026amp;utm_medium=paidsearch\u0026amp;cagpspn=pla\u0026amp;CATCI=aud-880489734931:pla-1898473638629\u0026amp;CAAGID=18002902230\u0026amp;CAWELAID=330000200003329852\u0026amp;CATARGETID=330000200002825550\u0026amp;CADevice=c\u0026amp;gad_source=1\u0026amp;gad_campaignid=232907070\u0026amp;gbraid=0AAAAAD9rLH69Cyc4YlpAV6TEcvCUs5V_n\u0026amp;gclid=CjwKCAjwi-DBBhA5EiwAXOHsGeIKaEYLI7d6eOMHZnF0ae05ykC-P3-MmXuHqKY36wqOpx9wTOET0xoCz6QQAvD_BwE\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eClean Fresh Blurring Skin Tint SPF 30\u003c/a\u003e are great options for one-and-done coverage with a petal-soft finish.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eYou can also achieve a beautiful, blurred effect with your finishing products. Razzano loves \u003ca href=\"https://url.us.m.mimecastprotect.com/s/1FxhCpY6V5fQEr9wUvIGfGhWSZ?domain=sephora.com\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eKosas’ Cloud Set Baked Setting \u0026amp; Smoothing Powder\u003c/a\u003e for lending a soft veil that reduces shine, not glow. “I’m obsessed with this powder! It sets your makeup in place while delivering an ultra-soft blurring effect, all while maintaining a natural, radiant finish,” he says. “This powder works particularly well when it comes to setting concealer — it blurs out fine lines and wrinkles, without creating dryness under the eyes.”\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eCheeks\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThe \u003ca href=\"https://www.refinery29.com/en-us/2021/09/10686205/best-new-blush-makeup\"\u003eblush craze\u003c/a\u003e shows no signs of slowing down anytime soon, and the latest launches all seem to have blur as a priority. There’s the Dua Lipa-fronted \u003ca href=\"https://www.sephora.com/product/make-me-blush-24h-buildable-powder-blush-P514568\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eYSL Beauty’s new Make Me Blush\u003c/a\u003e, which comes in eight candy-colored shades and contains squalane to lend an optical blurring effect on skin. Some of Razzano’s go-to’s include Lawless’ \u003ca href=\"https://www.sephora.com/product/lawless-pinch-my-cheeks-soft-blur-cream-blush-P510360?\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003ePinch My Cheeks Soft-Blur Cream Blush\u003c/a\u003e, which our \u003ca href=\"https://www.refinery29.com/en-us/lawless-cream-blush-review\"\u003eeditors also loved\u003c/a\u003e for its longwear properties and beautiful pigmentation. Another fave comes in the form of \u003ca href=\"https://www.sephora.com/product/danessa-myricks-beauty-yummy-skin-blurring-balm-powder-flushed-P504051?\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eDanessa Myricks’ Yummy Skin Blurring Balm Powder\u003c/a\u003e, which also happens to be among my most-used products as well. “This formula is nothing short of pure brilliant beauty innovation,” Razzano declares. “Danessa created a hydrating balm-to-powder that instantly blurs the skin, while maintaining a hyper-natural look and feel. Plus, she has carried this formula into \u003ca href=\"https://url.us.m.mimecastprotect.com/s/nXAECgJVX4SP5XqBH2iNf4eLJt?domain=sephora.com\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eblushes\u003c/a\u003e and \u003ca href=\"https://url.us.m.mimecastprotect.com/s/VazNCjRVJ4Sl1LYOT7swfmQEJ_?domain=sephora.com\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003ehighlighters\u003c/a\u003e – so you can blur and add glow simultaneously.”\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eLips\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eMake it a summer of blurred kisses with products that have a soft, romantic finish that’s never dry or flat. “\u003ca rel=\"noreferrer noopener\" aria-label=\"Refy’s Blur Liner (opens in a new tab)\" href=\"https://us.refybeauty.com/products/blur-liner\" target=\"_blank\"\u003eRefy’s Blur Liner\u003c/a\u003e boasts a domed tip, creating a natural, soft, and blurred look — an easy step in your routine,” Razzano explains. He also loves \u003ca href=\"https://www.sephora.com/product/prada-beauty-monochrome-soft-matte-refillable-lipstick-P509660?\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Prada Beauty’s Monochrome Soft Matte Blur Lipstick (opens in a new tab)\"\u003ePrada Beauty’s Monochrome Soft Matte Blur Lipstick\u003c/a\u003e, which has the creamy texture of your favorite lippie but with a velvet finish. “No need to perfectly line your lips, since it softly blurs itself,” he says. “A few taps of your finger will blend it to perfection.” We also love \u003ca href=\"https://www.refinery29.com/en-us/rhode-peptide-lip-shape-review\"\u003eRhode’s Peptide Lip Shape\u003c/a\u003e crayons, which come in a variety of beautiful neutral tones with a soft matte finish.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-06-06T20:02:45Z",
  "modifiedTime": null
}
