{
  "id": "bc459de8-4780-4f1b-905e-a6da2523b70f",
  "title": "Lindsay Lohan’s Pink Cat-Eye Nails Shone at the \"Freakier Friday\" Premiere",
  "link": "https://www.popsugar.com/beauty/lindsay-lohan-cat-eye-nails-49453018",
  "description": "Image Source: Getty Lindsay Lohan just gave the cat-eye manicure a dreamy, pastel twist. On July 22, she stepped out for the Los Angeles premiere of Disney's \"Freakier Friday,\" the highly anticipated sequel to her 2003 cult classic \"Freaky Friday,\" and channeled full Disney princess energy. Every detail of Lohan's look worked in harmony, down to the nails. Her frosty pink cat-eye manicure matched her blush-toned makeup and soft blond waves, creating a monochromatic moment that felt polished, feminine, and tied together from head to toe. Lohan's nail artist, Eri Ishizu, said, \"Lindsay's been really into cat-eye nails lately, so we wanted to match the sparkly vibe of her pink crystal dress while keeping the look subtle and classic.\" She started with Après Nail's Base Gelcoat X ($13) and cured it as directed, then applied one coat of Astral Gel Couleur in The Lovers ($15), a cotton-candy pink magnetic gel polish with a dreamy shimmer. Before curing, Ishizu used a magnet stick to manipulate the metallic sparkles into a soft dimensional wave across the nail. \"Hold a magnet close to the nails for about five seconds to guide the metallic particles into your desired pattern,\" says Après Nail educator Priscilla Nguyen. \"Flash cure immediately to lock in the look before moving on to the next nail.\" Ishizu then finished the look with a non-wipe gel top coat to lock in the shine and give it a glassy, long-lasting finish. Curious how this special polish works? \"Cat-eye polish contains magnetic shimmer particles that can be manipulated using a magnet,\" says Nguyen. \"The movement and placement of the magnet determine the final design, allowing for customizable effects like sharp lines, waves, or galaxy swirls. The possibilities are endless.\" Image Source: Instagram user eriishizu Cat-eye nails, first popular in the early 2010s, are officially back in 2025 for a subtler, more luminous refresh. Celebrities like Jenna Dewan, Sydney Sweeney, and Ashley Tisdale have all been spotted wearing the magnetic manicure, each adding her own spin to the trend. Most recently, Lizzo wore a shimmering silver version, proving just how versatile (and camera-ready) the look can be. And it's fitting for the moment. \"Freakier Friday,\" which hits theaters Aug. 8, reunites Lohan and Jamie Lee Curtis as they reprise their iconic mother-daughter roles. This time, it's not just Anna and Tess swapping bodies, but Anna's daughter and her soon-to-be stepsister as two families attempt to merge. A little retro, a little fun, and fully grown-up - just like the mani. Olivia Tauber is a freelance writer based in New York, pursuing her Master's in Journalism at NYU. She's the assistant beauty editor at PopSugar and contributor to Interview, Bustle, SELF, and HuffPost. Her career began in corporate publicity at Showtime, followed by production for \"The Pivot,\" an Emmy-nominated series.",
  "author": "Olivia Tauber",
  "published": "Wed, 23 Jul 2025 10:55:02 -0700",
  "source": "https://www.popsugar.com/beauty/feed",
  "categories": [
    "Lindsay Lohan",
    "Beauty News",
    "Nails",
    "Celebrity Beauty",
    "Celebrity Nails"
  ],
  "byline": "Olivia Tauber",
  "length": 3081,
  "excerpt": "Lindsay Lohan channeled her inner princess at the Freakier Friday premiere with a pink cat-eye manicure.",
  "siteName": "Popsugar",
  "favicon": "",
  "text": "Skip to main contentWhile each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our Product Review Guidelines here.Lindsay Lohan just gave the cat-eye manicure a dreamy, pastel twist. On July 22, she stepped out for the Los Angeles premiere of Disney's \"Freakier Friday,\" the highly anticipated sequel to her 2003 cult classic \"Freaky Friday,\" and channeled full Disney princess energy. Every detail of Lohan's look worked in harmony, down to the nails. Her frosty pink cat-eye manicure matched her blush-toned makeup and soft blond waves, creating a monochromatic moment that felt polished, feminine, and tied together from head to toe. Lohan's nail artist, Eri Ishizu, said, \"Lindsay's been really into cat-eye nails lately, so we wanted to match the sparkly vibe of her pink crystal dress while keeping the look subtle and classic.\" She started with Après Nail's Base Gelcoat X ($13) and cured it as directed, then applied one coat of Astral Gel Couleur in The Lovers ($15), a cotton-candy pink magnetic gel polish with a dreamy shimmer. Before curing, Ishizu used a magnet stick to manipulate the metallic sparkles into a soft dimensional wave across the nail. \"Hold a magnet close to the nails for about five seconds to guide the metallic particles into your desired pattern,\" says Après Nail educator Priscilla Nguyen. \"Flash cure immediately to lock in the look before moving on to the next nail.\" Ishizu then finished the look with a non-wipe gel top coat to lock in the shine and give it a glassy, long-lasting finish.Curious how this special polish works? \"Cat-eye polish contains magnetic shimmer particles that can be manipulated using a magnet,\" says Nguyen. \"The movement and placement of the magnet determine the final design, allowing for customizable effects like sharp lines, waves, or galaxy swirls. The possibilities are endless.\"Instagram | eriishizuCat-eye nails, first popular in the early 2010s, are officially back in 2025 for a subtler, more luminous refresh. Celebrities like Jenna Dewan, Sydney Sweeney, and Ashley Tisdale have all been spotted wearing the magnetic manicure, each adding her own spin to the trend. Most recently, Lizzo wore a shimmering silver version, proving just how versatile (and camera-ready) the look can be.And it's fitting for the moment. \"Freakier Friday,\" which hits theaters Aug. 8, reunites Lohan and Jamie Lee Curtis as they reprise their iconic mother-daughter roles. This time, it's not just Anna and Tess swapping bodies, but Anna's daughter and her soon-to-be stepsister as two families attempt to merge. A little retro, a little fun, and fully grown-up — just like the mani. Olivia Tauber is a freelance writer based in New York, pursuing her Master's in Journalism at NYU. She's the assistant beauty editor at PopSugar and contributor to Interview, Bustle, SELF, and HuffPost. Her career began in corporate publicity at Showtime, followed by production for \"The Pivot,\" an Emmy-nominated series.",
  "image": "https://media1.popsugar-assets.com/files/thumbor/Sqh7iC_oJWoWtsuWOM2lH7wRCWQ=/0x200:4785x2712/fit-in/4800x3200/top/filters:format_auto():quality(85):upscale()/2025/07/23/770/n/1922153/045c979c68811bfa9feb40.03962365_.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"__next\"\u003e\u003cp\u003e\u003ca href=\"#main-content\" aria-label=\"Skip to main content\"\u003eSkip to main content\u003c/a\u003e\u003c/p\u003e\u003cheader id=\"main-header\"\u003e\u003c/header\u003e\u003cdiv id=\"main-content\" data-pinnacle-page-type=\"article\"\u003e\u003carticle data-article-index=\"0\" data-article-nid=\"5462678\"\u003e\u003cdiv width=\"1\"\u003e\u003cp\u003eWhile each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our \u003ca href=\"https://www.popsugar.com/ps-product-review-guidelines-disclosures\" target=\"_blank\"\u003eProduct Review Guidelines here\u003c/a\u003e.\u003c/p\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"2\"\u003e\u003cp data-element-index=\"0\"\u003eLindsay Lohan just gave the \u003ca href=\"https://www.popsugar.com/beauty/cat-eye-nail-art-trend-46687815\"\u003ecat-eye manicure\u003c/a\u003e a dreamy, pastel twist. On July 22, she stepped out for the Los Angeles premiere of Disney\u0026#39;s \u0026#34;Freakier Friday,\u0026#34; the highly anticipated sequel to her 2003 cult classic \u0026#34;Freaky Friday,\u0026#34; and channeled full Disney princess energy. Every detail of Lohan\u0026#39;s look worked in harmony, down to the nails. Her frosty pink cat-eye manicure matched her blush-toned makeup and soft blond\u003cdel\u003e\u003c/del\u003e waves, creating a monochromatic moment that felt polished, feminine, and tied together from head to toe. \u003c/p\u003e\u003cp data-element-index=\"1\"\u003eLohan\u0026#39;s nail artist, \u003ca href=\"http://www.instagram.com/eriishizu/?ref=popsugar.com\u0026amp;=___psv__p_49453018__t_w_\" target=\"_blank\"\u003eEri Ishizu\u003c/a\u003e, said, \u0026#34;Lindsay\u0026#39;s been really into cat-eye nails lately, so we wanted to match the sparkly vibe of her pink crystal dress while keeping the look subtle and classic.\u0026#34; \u003c/p\u003e\u003cp data-element-index=\"2\"\u003eShe started with \u003ca href=\"http://apresnail.com/products/apres-base-coat-x?sku=APBASECX\u0026amp;im_ref=1234567\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_49453018__t_w_\" target=\"_blank\"\u003eAprès Nail\u0026#39;s Base Gelcoat X\u003c/a\u003e ($13) and cured it as directed, then applied one coat of \u003ca href=\"http://apresnail.com/products/the-lovers-ce03-10ml?sku=AP-5GCCE03\u0026amp;im_ref=1234567\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_49453018__t_w_\" target=\"_blank\"\u003eAstral Gel Couleur in The Lovers\u003c/a\u003e ($15), a cotton-candy pink magnetic gel polish with a dreamy shimmer. Before curing, Ishizu used a magnet stick to manipulate the metallic sparkles into a soft dimensional wave across the nail. \u0026#34;Hold a magnet close to the nails for about five seconds to guide the metallic particles into your desired pattern,\u0026#34; says Après Nail educator \u003ca href=\"http://www.instagram.com/roguepnails/?ref=popsugar.com\u0026amp;=___psv__p_49453018__t_w_\" target=\"_blank\"\u003ePriscilla Nguyen\u003c/a\u003e. \u0026#34;Flash cure immediately to lock in the look before moving on to the next nail.\u0026#34; Ishizu then finished the look with a non-wipe gel top coat to lock in the shine and give it a glassy, long-lasting finish.\u003c/p\u003e\u003cdiv\u003e\u003ca href=\"http://apresnail.com/products/apres-base-coat-x?sku=APBASECX\u0026amp;im_ref=1234567\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_49453018__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\" aria-label=\"\" data-vars-action=\"product image\" data-vars-retailer=\"apresnail.com\" data-vars-price=\"$13\" data-vars-href=\"http://apresnail.com/products/apres-base-coat-x?sku=APBASECX\u0026amp;im_ref=1234567\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/ELomBa7zBlHcI2Z9dkBr5Dp9ca4=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/23/770/n/1922153/045c979c68811bfa9feb40.03962365_.jpg\" media=\"(min-width: 1024px)\" data-size=\"desktop\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/ELomBa7zBlHcI2Z9dkBr5Dp9ca4=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/23/770/n/1922153/045c979c68811bfa9feb40.03962365_.jpg\" media=\"(min-width: 768px) and (max-width: 1023px)\" data-size=\"tablet\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/kgRSa1wO-gkd7SQCc-jbMzaME8E=/fit-in/700x700/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/23/770/n/1922153/045c979c68811bfa9feb40.03962365_.jpg\" media=\"(max-width: 767px)\" data-size=\"mobile\" width=\"350\" height=\"350\"/\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/WjXOWyLKVCE5tBOi3YxGwesbzEw=/fit-in/350x350/filters:format_auto():quality(70):extract_cover():upscale():fill(ffffff)/2025/07/23/770/n/1922153/045c979c68811bfa9feb40.03962365_.jpg\" alt=\"Main Image\" width=\"350\" height=\"350\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"http://apresnail.com/products/the-lovers-ce03-10ml?sku=AP-5GCCE03\u0026amp;im_ref=1234567\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_49453018__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\" aria-label=\"\" data-vars-action=\"product image\" data-vars-retailer=\"apresnail.com\" data-vars-price=\"$15\" data-vars-href=\"http://apresnail.com/products/the-lovers-ce03-10ml?sku=AP-5GCCE03\u0026amp;im_ref=1234567\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/ELomBa7zBlHcI2Z9dkBr5Dp9ca4=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/23/770/n/1922153/045c979c68811bfa9feb40.03962365_.jpg\" media=\"(min-width: 1024px)\" data-size=\"desktop\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/ELomBa7zBlHcI2Z9dkBr5Dp9ca4=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/23/770/n/1922153/045c979c68811bfa9feb40.03962365_.jpg\" media=\"(min-width: 768px) and (max-width: 1023px)\" data-size=\"tablet\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/kgRSa1wO-gkd7SQCc-jbMzaME8E=/fit-in/700x700/filters:format_auto():extract_cover():upscale():fill(ffffff)/2025/07/23/770/n/1922153/045c979c68811bfa9feb40.03962365_.jpg\" media=\"(max-width: 767px)\" data-size=\"mobile\" width=\"350\" height=\"350\"/\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/WjXOWyLKVCE5tBOi3YxGwesbzEw=/fit-in/350x350/filters:format_auto():quality(70):extract_cover():upscale():fill(ffffff)/2025/07/23/770/n/1922153/045c979c68811bfa9feb40.03962365_.jpg\" alt=\"Main Image\" width=\"350\" height=\"350\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/div\u003e\u003cp data-element-index=\"3\"\u003eCurious how this special polish works? \u0026#34;Cat-eye polish contains magnetic shimmer particles that can be manipulated using a magnet,\u0026#34; says Nguyen. \u0026#34;The movement and placement of the magnet determine the final design, allowing for customizable effects like sharp lines, waves, or galaxy swirls. The possibilities are endless.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cfigure data-element-type=\"ParagraphImage\" data-element-index=\"4\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/GhUu86SiqQLdMZ6W2v5Jn-1Gqf4=/fit-in/792x845/filters:format_auto():upscale()/2025/07/23/768/n/1922153/tmp_wpovq5_4f7e4884ddeabff6__image_-_2930511.jpeg\" width=\"792\" height=\"845\" srcset=\"https://media1.popsugar-assets.com/files/thumbor/GhUu86SiqQLdMZ6W2v5Jn-1Gqf4=/fit-in/792x845/filters:format_auto():upscale()/2025/07/23/768/n/1922153/tmp_wpovq5_4f7e4884ddeabff6__image_-_2930511.jpeg 1000w, https://media1.popsugar-assets.com/files/thumbor/AW3IKM8B-x_GZqYF9cPxncQ-JwE=/fit-in/1584x1690/filters:format_auto():upscale()/2025/07/23/768/n/1922153/tmp_wpovq5_4f7e4884ddeabff6__image_-_2930511.jpeg 2000w\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003e\u003ca href=\"http://instagram.com\" data-vars-href=\"http://instagram.com\" data-vars-ga-action=\"click\"\u003e\u003cspan\u003eInstagram | eriishizu\u003c/span\u003e\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"5\"\u003e\u003cp data-element-index=\"0\"\u003eCat-eye nails, first popular in the early 2010s, are officially back in 2025 for a subtler, more luminous refresh. Celebrities like \u003ca href=\"https://www.popsugar.com/beauty/jenna-dewan-cat-eye-nails-49001998\"\u003eJenna Dewan\u003c/a\u003e, \u003ca href=\"https://www.popsugar.com/beauty/sydney-sweeney-cat-eye-nails-49004165\"\u003eSydney Sweeney\u003c/a\u003e, and \u003ca href=\"https://www.popsugar.com/beauty/ashley-tisdale-cat-eye-nails-48964848\"\u003eAshley Tisdale\u003c/a\u003e have all been spotted wearing the magnetic manicure, each adding her own spin to the trend. Most recently, \u003ca href=\"https://www.popsugar.com/beauty/lizzo-cat-eye-nails-49451924\"\u003eLizzo wore a shimmering silver version\u003c/a\u003e, proving just how versatile (and camera-ready) the look can be.\u003c/p\u003e\u003cp data-element-index=\"1\"\u003eAnd it\u0026#39;s fitting for the moment. \u0026#34;Freakier Friday,\u0026#34; which hits theaters Aug. 8, reunites Lohan and \u003ca href=\"https://www.popsugar.co.uk/celebrity/jamie-lee-curtis-response-lindsay-lohan-birth-49229357\"\u003eJamie Lee Curtis\u003c/a\u003e as they reprise their iconic mother-daughter roles. This time, it\u0026#39;s not just Anna and Tess swapping bodies, but Anna\u0026#39;s daughter and her soon-to-be stepsister as two families attempt to merge. A little retro, a little fun, and fully grown-up — just like the mani. \u003c/p\u003e\u003cp data-element-index=\"3\"\u003e\u003cem\u003e\u003ca href=\"https://www.popsugar.com/author/olivia-tauber\"\u003eOlivia Tauber\u003c/a\u003e is a freelance writer based in New York, pursuing her Master\u0026#39;s in Journalism at NYU. She\u0026#39;s the assistant beauty editor at PopSugar and contributor to Interview, Bustle, SELF, and HuffPost. Her career began in corporate publicity at Showtime, followed by production for \u0026#34;The Pivot,\u0026#34; an Emmy-nominated series.\u003c/em\u003e\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-07-23T17:55:02Z",
  "modifiedTime": "2025-07-23T17:55:02Z"
}
