{
  "id": "eff31e14-f9f4-4124-ba73-e18ac425655d",
  "title": "Synthetic Braiding Hair Could Be Harming Black Women \u0026 We Deserve Answers",
  "link": "https://www.refinery29.com/en-us/synthetic-braids-health-concerns-alternative?utm_source=feed\u0026utm_medium=rss",
  "description": "Black women’s metaphorical pledge of allegiance to braids dates back thousands of years. In the 60s, advancements in polymer technology (the manufacture of materials such as plastics, paints, rubber, foam, etc) allowed for the mass production of affordable hair alternatives turning synthetic braiding hair into a cornerstone of Black hair culture and it has since grown into a multi-billion-dollar market. Its affordability, versatility, and wide availability have made synthetic hair the go-to choice for countless women seeking protective styles with extra length, extra volume, and more longevity like box braids, twists, cornrows, wigs, and so on.  I for one don’t know life without it. I’ve been getting my hair braided since it was long enough to do so and started adding a bit of synthetic hair by the time I was old enough to ask for it. While synthetic hair offered a cost-effective solution for protective styles, new concerns about its long-term effects are now coming to light. Recently there has been a wave of viral videos across socials that show Black women experiencing allergic reactions, scalp inflammations, and respiratory issues. From studies indicating links between synthetic hair and cancer, as well as ethical concerns prompting anxiety over its environmental impact, some Black women are reconsidering their use of synthetic braiding hair. But how warranted are these concerns and what alternatives exist? DashDividers_1_500x100 Should Black women be worried about the health implications of wearing synthetic hair? A study published in 2020 in the Journal of Occupational and Environmental Hygiene found that synthetic hair products such as braiding hair can emit volatile organic compounds (VOCs) when heated. These VOCs can be toxic and may contribute to respiratory issues and other health problems.  Synthetic hair is made from various types of plastic fibers, including polyethylene terephthalate (PET), polypropylene (PP), and polyvinyl chloride (PVC) – VOCs. These fibers are engineered to mimic the look and feel of human hair and are often coated with chemicals to enhance its durability, and texture and give it that post-braid sheen we love. The production process involves melting and stretching these plastics into thin strands, which are then dyed and styled to resemble natural hair. Ever wondered why your freshly done braids itch so much, or why you are experiencing a scalp rash soon after your braider gave you the slickest lemonade braids? Well, once these materials are heated, burned, or degraded, they can release these toxic chemicals, which have been linked to skin irritation, respiratory problems, and even cancer. Meanwhile, another study in 2023 corroborated these findings of the correlation of prolonged exposure to the harmful chemicals and ingredients used in some types of synthetic braiding hair and carcinogens. Although the studies aren’t new, they’re not particularly thorough and seem to have gone under the radar, especially when discussing the more sinister effects of excessive use of synthetic hair.  As with many products regularly used by Black women, the business of synthetic braiding hair is highly unregulated, and subsequently, there is still limited knowledge of its effects under different conditions… After a viral video by Molecular Biologist Dr. Raven the Science Maven shared a succinct explainer of the results found in that 2020 study concerning the risks of burning plastic fibers (VOCs), other women have since come out of the woodwork to share their negative experiences with using synthetic braiding hair. “As a Black woman scientist, I don’t use synthetic braiding hair,” stated Dr. Raven. “Most of the synthetic braiding hair that we use found in beauty stores are made of toxic chemicals like acrylonitrile which has been labelled as a probable carcinogen,” she says. Other Black women corroborated across socials. “I have psoriasis and I recently got box braids and my scalp started itching and burning,” says a user on TikTok. Dr. Ify Aniebo RV, an Associate Professor of Genomics and Molecular Biology jumped in on the conversation sharing on the ‘X’ app that she is “no longer confident in the use of synthetic hair for braids and weaves” referencing a 2022 study from The Environmental Protection Agency’ that classifies acrylonitrile “as a probable human carcinogen”. Meanwhile, another woman on TikTok shared a video saying: “Tell me why every time I try to braid my hair with X-Pression my scalp is on fire.”* While a video by TikTok creator @semascreation showcasing how to cleanse synthetic hair to protect your skin and scalp has gathered millions of views.  Tea is being spilled. As with many products regularly used by Black women, the business of synthetic braiding hair is highly unregulated, and subsequently, there is still limited knowledge of its effects under different conditions, such as the difference between having it burned to seal or being dipped in hot water, etc. What exactly is being released in the air when synthetic hair is being heated is still being studied. View this post on Instagram A post shared by Dr. Raven Baxter | Science Expert + Communicator (@raventhesciencemaven) Do experts agree that synthetic braiding hair is toxic? Or is it fearmongering?  The line between informed caution and fearmongering can be blurry. The research is essential, but it’s important to contextualize the findings. For instance, a study on burning synthetic hair might highlight potential risks, but it doesn’t necessarily translate to everyday exposure during normal use. What’s clear, is we need more comprehensive data to help mitigate any risks to women’s health. Dr. Elissia Franklin, a chemist and postdoctoral research associate at Silent Spring Institute, is currently conducting the most comprehensive research on the chemical composition of synthetic braiding hair and its potential health implications we’ve ever had. Her work focuses on evaluating chemical exposure injustices among women, particularly concerning the use of synthetic hair products. While specific findings from Dr Franklin’s studies are not yet publicly available, she says: “Now I’m a scientist at Science Spring and they’re talking about flame retardant this, and flame retardant that…they’re bad…’ and I’m like, ‘what you mean flame retardant is bad, I was just at the beauty supply store the other day and it’s on all the [synthetic] hair, what you mean they bad?’ I thought that was good, I don’t want to catch on fire. Point is, seeing that flame retardants are bad you can go to the beauty supply store and it’s all labeled [on the products].” Once Science Spring published the paper, Dr. Franklin’s team found that flame retardants are so bad they should not be used on couches that are used in the household repeatedly. Given this development, she was concerned as to why this wasn’t a concern when used on women’s hair and decided to make it a study. In a post on ‘X’ she says: “Ain’t for nothing that I am concerned about the adverse effects of hair extensions. I have had multiple outbreaks while wearing braids. Anyone else experienced something like this?” “… when a synthetic fibre [is braided into] your hair, which is a natural fibre, often the synthetic fibre wins out [and it becomes] a battle between your hair and the braiding hair.” Stephanie Sey, Clinical trichologist Despite this, anecdotal reports of allergic reactions and sensitivities continue to circulate. Clinical trichologist Stephanie Sey tells Unbothered that these findings certainly have legs, and are things she sees in the clinic. “The most common thing I see in clinic — as well as from personal experience — is allergic dermatitis in the scalp, so people develop allergies to the synthetic braiding hair due to the chemicals in them. I suspect this is to do with the alkaline coating that aggravates the scalp to the point that it’s unbearable.” “If synthetic hair isn’t washed before use, residues from manufacturing processes can irritate the scalp. No harm in trying an apple cider vinegar solution to mitigate this,” she adds. “However, the efficacy of these rinses remains debated.” Sey also mentions: “People also often forget that when a synthetic fiber [is braided into] your hair, which is a natural fiber, often the synthetic fiber wins out [and it becomes] a battle between your hair and the braiding hair. Once we mix the two, the synthetic hair can cut into our hair and cause areas of fracture and breakage against our natural fibers leaving the hair chronically dry and brittle.”  While all of these findings may be concerning, it’s important for us as Black women consumers to interpret them with discernment and caution. Health concerns surrounding Black haircare products in general are not new. Back in 2022 a study carried out by the National Institutes of Health (NIH), uncovered that there was substantial evidence to show that frequent use of chemical hair-straightening products may double the risk of uterine cancer, and this led to a slew of lawsuits against manufacturers of chemical relaxers. It’s clear that Black women – a demographic that spends an estimated $2.5 billion annually on haircare – are often misinformed about the potential risks of the products they use and need greater transparency. While all of these findings may be concerning, it’s important for us as Black women consumers to interpret them with discernment and caution. Sure, we won’t know the extent of the effects of excessive use of synthetic hair until the full studies are released. However, until then the experts advise us to be real real wary! Or at the very least reduce the use of it. What are the environmental and ethical concerns surrounding synthetic hair? The environmental impact of synthetic hair is another growing concern. The synthetic hair industry, valued at billions of pounds, relies heavily on non-biodegradable plastics. Discarded synthetic hair releases microplastics into the environment and then ends up in landfills, where it can take centuries to decompose. In an already heavily strained ecosystem, having nice long hair is hardly a logical reason to contribute to the complex and fraught issue of plastic pollution globally. Ethical issues also plague the industry. Some synthetic hair products are blended with unethically sourced human hair to improve quality while lowering costs. The industry is riddled with unethical sourcing practices, which exploit vulnerable women, often in developing countries, who sell their hair for meager compensation. In some cases, women are pressured and coerced into selling their hair, to provide for their families, while some are outright forced to do so without consent. So what are the best alternatives to synthetic braiding hair? If you’ve been put off and are looking to reduce your reliance on synthetic hair, the options are limited but growing. Non-toxic and sustainable alternatives, such as braiding hair made from banana or pineapple fibers, are gaining traction. Brands like Nourie Hair and Rebundle offer promising solutions, though you might have to weigh up whether factors such as texture adaption, and higher price points will make the switch worth it. “I’m glad that innovative plant-based alternatives to synthetic hair are now available,” explains Donna Auguste, PhD, to Unbothered. Auguste was one of the scientists behind the 2020 VOCs in synthetic hair research. “As consumers, we’re learning more about how haircare can support our health goals.” Although I personally haven’t tried these alternatives (albeit extremely keen too), the general consensus around these plant-based alternatives seems overwhelmingly positive, however, with slight caveats that although better than the alternative, the technology may not be there yet to fully emulate natural hair. Some users have reported struggling with grip during the braiding process as there is a stark difference in texture to synthetic hair. “By week four, I felt like my skin was covered in a tiny layer of fibers, and I was finding them everywhere — in my bed, on my robe, in my moisturizer…” says Amanda Mitchell, a contributor at Refinery 29 when reviewing Norie plant based braiding hair. “Little strands of hair (which feel a little like stuffed fabric fiber or straw) poke out from the braids in the days immediately following them being put in. But I just trimmed them off and they went away after a few days. Additionally, the ends need to be moisturized more often than usual hair, or else they start looking frizzy,” reports a user on Reddit while reviewing Rebundle’s plant-based hair. Human hair is another alternative but its cost comes with its own mixed back of ethical sourcing issues. Plus, if we’re moving away from synthetic hair, we need to ensure that human hair is sourced ethically and transparently. In the meantime, here are some expert-recommended practical steps to minimize risks when using synthetic hair: — Wash Before Use: Rinse synthetic hair with a light shampoo or apple cider vinegar solution to remove manufacturing residues. “Soaking it in apple cider vinegar to remove some of that alkaline coating and bring it into more of an acid base is probably a good idea – there is no harm in that, – but my suggestion is to simply wash the hair in a light shampoo solution before use,” says Sey.  — Limit Use: Rotate between styles that require synthetic hair and those that don’t to give your scalp a break. “If you can avoid using it regularly it is better, as opposed to back-to-back braids, maybe for special occasions, but try not to use it often.” — Choose Trusted Brands: Opt for synthetic hair from brands that prioritize safety and transparency like Rebundle and Norie Hair. I get it, it’s unlikely we Black women will proactively choose to abandon braids and other styles requiring synthetic hair anytime soon. These styles are deeply rooted in our identity and practical necessity. After all, braiding is more than a hairstyle; it’s a cultural expression, it’s a nuanced beauty ritual, with deep historical meaning and it’s truly a form of self-care, we just need to find a way to make it safer, that’s all. Can the gurls just have one nice thing? *X-Pression has been contacted for comment. This article was originally published on Unbothered UK Like what you see? How about some more R29 goodness, right here?Why This Black Woman Is Suing Hair Relaxer BrandsBlack Women's Hair Relaxers Could Be Harming Us",
  "author": "Sheilla Mamona",
  "published": "Thu, 20 Mar 2025 13:00:42 +0000",
  "source": "https://www.refinery29.com/beauty/rss.xml",
  "categories": null,
  "byline": "Sheilla Mamona",
  "length": 14174,
  "excerpt": "From studies indicating links between synthetic hair and cancer, as well as ethical concerns prompting anxiety over its environmental impact, some Black women are reconsidering their use of synthetic braiding hair. But how warranted are these concerns and what alternatives exist?",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "Photographed by Rochelle Brock.Black women’s metaphorical pledge of allegiance to braids dates back thousands of years. In the 60s, advancements in polymer technology (the manufacture of materials such as plastics, paints, rubber, foam, etc) allowed for the mass production of affordable hair alternatives turning synthetic braiding hair into a cornerstone of Black hair culture and it has since grown into a multi-billion-dollar market. Its affordability, versatility, and wide availability have made synthetic hair the go-to choice for countless women seeking protective styles with extra length, extra volume, and more longevity like box braids, twists, cornrows, wigs, and so on.  I for one don’t know life without it. I’ve been getting my hair braided since it was long enough to do so and started adding a bit of synthetic hair by the time I was old enough to ask for it.AdvertisementADVERTISEMENTWhile synthetic hair offered a cost-effective solution for protective styles, new concerns about its long-term effects are now coming to light. Recently there has been a wave of viral videos across socials that show Black women experiencing allergic reactions, scalp inflammations, and respiratory issues. From studies indicating links between synthetic hair and cancer, as well as ethical concerns prompting anxiety over its environmental impact, some Black women are reconsidering their use of synthetic braiding hair. But how warranted are these concerns and what alternatives exist?Should Black women be worried about the health implications of wearing synthetic hair?A study published in 2020 in the Journal of Occupational and Environmental Hygiene found that synthetic hair products such as braiding hair can emit volatile organic compounds (VOCs) when heated. These VOCs can be toxic and may contribute to respiratory issues and other health problems. Synthetic hair is made from various types of plastic fibers, including polyethylene terephthalate (PET), polypropylene (PP), and polyvinyl chloride (PVC) – VOCs. These fibers are engineered to mimic the look and feel of human hair and are often coated with chemicals to enhance its durability, and texture and give it that post-braid sheen we love. The production process involves melting and stretching these plastics into thin strands, which are then dyed and styled to resemble natural hair. Ever wondered why your freshly done braids itch so much, or why you are experiencing a scalp rash soon after your braider gave you the slickest lemonade braids? Well, once these materials are heated, burned, or degraded, they can release these toxic chemicals, which have been linked to skin irritation, respiratory problems, and even cancer.AdvertisementADVERTISEMENTMeanwhile, another study in 2023 corroborated these findings of the correlation of prolonged exposure to the harmful chemicals and ingredients used in some types of synthetic braiding hair and carcinogens. Although the studies aren’t new, they’re not particularly thorough and seem to have gone under the radar, especially when discussing the more sinister effects of excessive use of synthetic hair. “As with many products regularly used by Black women, the business of synthetic braiding hair is highly unregulated, and subsequently, there is still limited knowledge of its effects under different conditions...”After a viral video by Molecular Biologist Dr. Raven the Science Maven shared a succinct explainer of the results found in that 2020 study concerning the risks of burning plastic fibers (VOCs), other women have since come out of the woodwork to share their negative experiences with using synthetic braiding hair. “As a Black woman scientist, I don’t use synthetic braiding hair,” stated Dr. Raven. “Most of the synthetic braiding hair that we use found in beauty stores are made of toxic chemicals like acrylonitrile which has been labelled as a probable carcinogen,” she says.Other Black women corroborated across socials. “I have psoriasis and I recently got box braids and my scalp started itching and burning,” says a user on TikTok. Dr. Ify Aniebo RV, an Associate Professor of Genomics and Molecular Biology jumped in on the conversation sharing on the ‘X’ app that she is “no longer confident in the use of synthetic hair for braids and weaves” referencing a 2022 study from The Environmental Protection Agency’ that classifies acrylonitrile “as a probable human carcinogen”. Meanwhile, another woman on TikTok shared a video saying: “Tell me why every time I try to braid my hair with X-Pression my scalp is on fire.”* While a video by TikTok creator @semascreation showcasing how to cleanse synthetic hair to protect your skin and scalp has gathered millions of views. AdvertisementADVERTISEMENTTea is being spilled. As with many products regularly used by Black women, the business of synthetic braiding hair is highly unregulated, and subsequently, there is still limited knowledge of its effects under different conditions, such as the difference between having it burned to seal or being dipped in hot water, etc. What exactly is being released in the air when synthetic hair is being heated is still being studied.Do experts agree that synthetic braiding hair is toxic? Or is it fearmongering? The line between informed caution and fearmongering can be blurry. The research is essential, but it’s important to contextualize the findings. For instance, a study on burning synthetic hair might highlight potential risks, but it doesn’t necessarily translate to everyday exposure during normal use. What’s clear, is we need more comprehensive data to help mitigate any risks to women’s health.Dr. Elissia Franklin, a chemist and postdoctoral research associate at Silent Spring Institute, is currently conducting the most comprehensive research on the chemical composition of synthetic braiding hair and its potential health implications we’ve ever had. Her work focuses on evaluating chemical exposure injustices among women, particularly concerning the use of synthetic hair products.While specific findings from Dr Franklin's studies are not yet publicly available, she says: “Now I’m a scientist at Science Spring and they’re talking about flame retardant this, and flame retardant that…they’re bad…’ and I’m like, ‘what you mean flame retardant is bad, I was just at the beauty supply store the other day and it’s on all the [synthetic] hair, what you mean they bad?’ I thought that was good, I don’t want to catch on fire. Point is, seeing that flame retardants are bad you can go to the beauty supply store and it’s all labeled [on the products].” Once Science Spring published the paper, Dr. Franklin’s team found that flame retardants are so bad they should not be used on couches that are used in the household repeatedly. Given this development, she was concerned as to why this wasn't a concern when used on women’s hair and decided to make it a study.AdvertisementADVERTISEMENTIn a post on ‘X’ she says: “Ain’t for nothing that I am concerned about the adverse effects of hair extensions. I have had multiple outbreaks while wearing braids. Anyone else experienced something like this?”“\"... when a synthetic fibre [is braided into] your hair, which is a natural fibre, often the synthetic fibre wins out [and it becomes] a battle between your hair and the braiding hair.\" Stephanie Sey, Clinical trichologist”Despite this, anecdotal reports of allergic reactions and sensitivities continue to circulate. Clinical trichologist Stephanie Sey tells Unbothered that these findings certainly have legs, and are things she sees in the clinic. “The most common thing I see in clinic — as well as from personal experience — is allergic dermatitis in the scalp, so people develop allergies to the synthetic braiding hair due to the chemicals in them. I suspect this is to do with the alkaline coating that aggravates the scalp to the point that it’s unbearable.”“If synthetic hair isn’t washed before use, residues from manufacturing processes can irritate the scalp. No harm in trying an apple cider vinegar solution to mitigate this,” she adds. “However, the efficacy of these rinses remains debated.”Sey also mentions: “People also often forget that when a synthetic fiber [is braided into] your hair, which is a natural fiber, often the synthetic fiber wins out [and it becomes] a battle between your hair and the braiding hair. Once we mix the two, the synthetic hair can cut into our hair and cause areas of fracture and breakage against our natural fibers leaving the hair chronically dry and brittle.” “While all of these findings may be concerning, it's important for us as Black women consumers to interpret them with discernment and caution. ”Health concerns surrounding Black haircare products in general are not new. Back in 2022 a study carried out by the National Institutes of Health (NIH), uncovered that there was substantial evidence to show that frequent use of chemical hair-straightening products may double the risk of uterine cancer, and this led to a slew of lawsuits against manufacturers of chemical relaxers. It’s clear that Black women – a demographic that spends an estimated $2.5 billion annually on haircare – are often misinformed about the potential risks of the products they use and need greater transparency.AdvertisementADVERTISEMENTWhile all of these findings may be concerning, it's important for us as Black women consumers to interpret them with discernment and caution. Sure, we won’t know the extent of the effects of excessive use of synthetic hair until the full studies are released. However, until then the experts advise us to be real real wary! Or at the very least reduce the use of it.What are the environmental and ethical concerns surrounding synthetic hair?The environmental impact of synthetic hair is another growing concern. The synthetic hair industry, valued at billions of pounds, relies heavily on non-biodegradable plastics. Discarded synthetic hair releases microplastics into the environment and then ends up in landfills, where it can take centuries to decompose. In an already heavily strained ecosystem, having nice long hair is hardly a logical reason to contribute to the complex and fraught issue of plastic pollution globally. Ethical issues also plague the industry. Some synthetic hair products are blended with unethically sourced human hair to improve quality while lowering costs. The industry is riddled with unethical sourcing practices, which exploit vulnerable women, often in developing countries, who sell their hair for meager compensation. In some cases, women are pressured and coerced into selling their hair, to provide for their families, while some are outright forced to do so without consent.So what are the best alternatives to synthetic braiding hair?If you’ve been put off and are looking to reduce your reliance on synthetic hair, the options are limited but growing. Non-toxic and sustainable alternatives, such as braiding hair made from banana or pineapple fibers, are gaining traction. Brands like Nourie Hair and Rebundle offer promising solutions, though you might have to weigh up whether factors such as texture adaption, and higher price points will make the switch worth it.AdvertisementADVERTISEMENT“I’m glad that innovative plant-based alternatives to synthetic hair are now available,” explains Donna Auguste, PhD, to Unbothered. Auguste was one of the scientists behind the 2020 VOCs in synthetic hair research. \"As consumers, we're learning more about how haircare can support our health goals.”Although I personally haven’t tried these alternatives (albeit extremely keen too), the general consensus around these plant-based alternatives seems overwhelmingly positive, however, with slight caveats that although better than the alternative, the technology may not be there yet to fully emulate natural hair. Some users have reported struggling with grip during the braiding process as there is a stark difference in texture to synthetic hair.“By week four, I felt like my skin was covered in a tiny layer of fibers, and I was finding them everywhere — in my bed, on my robe, in my moisturizer…” says Amanda Mitchell, a contributor at Refinery 29 when reviewing Norie plant based braiding hair.“Little strands of hair (which feel a little like stuffed fabric fiber or straw) poke out from the braids in the days immediately following them being put in. But I just trimmed them off and they went away after a few days. Additionally, the ends need to be moisturized more often than usual hair, or else they start looking frizzy,” reports a user on Reddit while reviewing Rebundle’s plant-based hair.AdvertisementADVERTISEMENTIn the meantime, here are some expert-recommended practical steps to minimize risks when using synthetic hair:— Wash Before Use: Rinse synthetic hair with a light shampoo or apple cider vinegar solution to remove manufacturing residues. “Soaking it in apple cider vinegar to remove some of that alkaline coating and bring it into more of an acid base is probably a good idea – there is no harm in that, – but my suggestion is to simply wash the hair in a light shampoo solution before use,” says Sey. — Limit Use: Rotate between styles that require synthetic hair and those that don’t to give your scalp a break. “If you can avoid using it regularly it is better, as opposed to back-to-back braids, maybe for special occasions, but try not to use it often.”— Choose Trusted Brands: Opt for synthetic hair from brands that prioritize safety and transparency like Rebundle and Norie Hair.I get it, it’s unlikely we Black women will proactively choose to abandon braids and other styles requiring synthetic hair anytime soon. These styles are deeply rooted in our identity and practical necessity. After all, braiding is more than a hairstyle; it’s a cultural expression, it’s a nuanced beauty ritual, with deep historical meaning and it's truly a form of self-care, we just need to find a way to make it safer, that’s all. Can the gurls just have one nice thing?*X-Pression has been contacted for comment.This article was originally published on Unbothered UKAdvertisementADVERTISEMENT",
  "image": "https://www.refinery29.com/images/11841229.jpg?crop=2000%2C1051%2Cx0%2Cy58",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"editorial-content\"\u003e\u003cdiv\u003e\u003cp\u003ePhotographed by Rochelle Brock.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eBlack women’s metaphorical pledge of \u003ca href=\"https://www.refinery29.com/en-us/2019/11/8712076/learning-to-braid-own-natural-hair\"\u003eallegiance to braids \u003c/a\u003edates back thousands of years. In the 60s, advancements in polymer technology (the manufacture of materials such as plastics, paints, rubber, foam, etc) allowed for the mass production of affordable hair alternatives turning synthetic braiding hair into a cornerstone of Black hair culture and it has since grown into a multi-billion-dollar market. Its affordability, versatility, and wide availability have made synthetic hair the go-to choice for countless women seeking protective styles with extra length, extra volume, and more \u003ca href=\"https://www.refinery29.com/en-gb/2023/06/11433146/knotless-goddess-braids-black-hair-trend\"\u003elongevity like box braids\u003c/a\u003e, twists, cornrows, wigs, and so on.  I for one don’t know life without it. I’ve been getting my hair braided since it was long enough to do so and started adding a bit of synthetic hair by the time I was old enough to ask for it.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWhile synthetic hair offered a cost-effective solution for protective styles, new concerns about its long-term effects are now coming to light. Recently there has been a \u003ca href=\"https://www.instagram.com/reel/DEHF9WuRBqk/?\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003ewave of viral videos\u003c/a\u003e across socials that show Black women experiencing allergic reactions, scalp inflammations, and respiratory issues. From studies indicating \u003ca href=\"https://hsph.harvard.edu/news/synthetic-braiding-hair-used-by-black-women-contain-dangerous-chemicals/#:~:text=Consumer%20Reports%20tested%20ten%20synthetic,linked%20with%20acute%20myeloid%20leukemia.\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"links between synthetic hair and cancer (opens in a new tab)\"\u003elinks between synthetic hair and cancer\u003c/a\u003e, as well as ethical concerns prompting anxiety over its environmental impact, some Black women are reconsidering their use of synthetic braiding hair. But how warranted are these concerns and what alternatives exist?\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003e\u003cstrong\u003eShould Black women be worried about the health implications of wearing synthetic hair?\u003c/strong\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eA \u003ca href=\"https://www.epa.gov/indoor-air-quality-iaq/what-are-volatile-organic-compounds-vocs\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003estudy published in 2020\u003c/a\u003e in the Journal of Occupational and Environmental Hygiene\u003ca href=\"https://journals.sagepub.com/doi/full/10.1177/1178630219890876\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003e \u003c/a\u003efound that synthetic hair products such as braiding hair can emit \u003ca href=\"https://www.epa.gov/indoor-air-quality-iaq/what-are-volatile-organic-compounds-vocs\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003evolatile organic compounds (VOCs)\u003c/a\u003e when heated. These VOCs can be toxic and may contribute to respiratory issues and other health problems. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eSynthetic hair is made from various types of plastic fibers, including polyethylene terephthalate (PET), polypropylene (PP), and polyvinyl chloride (PVC) – VOCs. These fibers are engineered to mimic the look and feel of human hair and are often coated with chemicals to enhance its durability, and texture and give it that post-braid sheen we love. The production process involves melting and stretching these plastics into thin strands, which are then dyed and styled to resemble natural hair. Ever wondered why your freshly done braids itch so much, or why you are experiencing a scalp rash soon after your braider gave you the slickest lemonade braids? Well, once these materials are heated, burned, or degraded, they can release these toxic chemicals, which have been linked to skin irritation, respiratory problems, and even cancer.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eMeanwhile, another \u003ca href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10238826/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003estudy in 2023\u003c/a\u003e corroborated these findings of the correlation of prolonged exposure to the harmful chemicals and ingredients used in some types of synthetic braiding hair and carcinogens. Although the studies aren’t new, they’re not particularly thorough and seem to have gone under the radar, especially when discussing the more sinister effects of excessive use of synthetic hair. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“\u003c/p\u003e\u003cp\u003eAs with many\u003ca href=\"https://www.refinery29.com/en-us/hair-relaxer-lawsuit-black-women-cancer\"\u003e products regularly used by Black women\u003c/a\u003e, the business of synthetic braiding hair is highly unregulated, and subsequently, there is still limited knowledge of its effects under different conditions...\u003c/p\u003e\u003cp\u003e”\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAfter a viral video by Molecular Biologist \u003ca href=\"https://www.instagram.com/p/DEHF9WuRBqk/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eDr. Raven the Science Maven\u003c/a\u003e shared a succinct explainer of the results found in that 2020 study concerning the risks of burning plastic fibers (VOCs), other women have since come out of the woodwork to share their negative experiences with using synthetic braiding hair. “As a Black woman scientist, I don’t use synthetic braiding hair,” stated Dr. Raven. “Most of the synthetic braiding hair that we use found in beauty stores are made of toxic chemicals like acrylonitrile which has been labelled as a probable carcinogen,” she says.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eOther Black women corroborated across socials. “I have psoriasis and I recently got box braids and my scalp started itching and burning,” says a user on TikTok. \u003ca href=\"https://x.com/IfyAniebo\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eDr. Ify Aniebo RV\u003c/a\u003e, an Associate Professor of Genomics and Molecular Biology jumped in on the conversation sharing on the ‘X’ app that she is “no longer confident in the use of synthetic hair for braids and weaves” referencing a 2022 study from The Environmental Protection Agency’ that classifies acrylonitrile “as a probable human carcinogen”. Meanwhile, \u003ca href=\"https://www.tiktok.com/@ninilein23/video/7433514684130577696\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eanother woman on TikTok\u003c/a\u003e shared a video saying: “Tell me why every time I try to braid my hair with X-Pression my scalp is on fire.”* While a video by TikTok creator @semascreation showcasing \u003ca href=\"https://www.tiktok.com/@semascreation/video/7269479256147774763\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003ehow to cleanse synthetic hair\u003c/a\u003e to protect your skin and scalp has gathered millions of views. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eTea is being spilled. As with many\u003ca href=\"https://www.refinery29.com/en-us/hair-relaxer-lawsuit-black-women-cancer\"\u003e products regularly used by Black women\u003c/a\u003e, the business of synthetic braiding hair is highly unregulated, and subsequently, there is still limited knowledge of its effects under different conditions, such as the difference between having it burned to seal or being dipped in hot water, etc. What exactly is being released in the air when synthetic hair is being heated is still being studied.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003e\u003cstrong\u003eDo experts agree that synthetic braiding hair is toxic? Or is it fearmongering?\u003c/strong\u003e \u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThe line between informed caution and fearmongering can be blurry. The research is essential, but it’s important to contextualize the findings. For instance, a study on burning synthetic hair might highlight potential risks, but it doesn’t necessarily translate to everyday exposure during normal use. What’s clear, is we need more comprehensive data to help mitigate any risks to women’s health.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eDr. Elissia Franklin, a chemist and postdoctoral research associate at Silent Spring Institute, is currently conducting the most \u003ca href=\"https://mailchi.mp/2371d2a7502d/beautyjustice\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003ecomprehensive research on the chemical composition of synthetic braiding hair\u003c/a\u003e and its potential health implications we’ve ever had. Her work focuses on evaluating chemical exposure injustices among women, particularly concerning the use of synthetic hair products.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWhile specific findings from Dr Franklin\u0026#39;s studies are not yet publicly available, \u003ca href=\"https://www.instagram.com/p/DEWAJXQOlny/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eshe says\u003c/a\u003e: “Now I’m a scientist at Science Spring and they’re talking about flame retardant this, and flame retardant that…they’re bad…’ and I’m like, ‘what you mean flame retardant is bad, I was just at the beauty supply store the other day and it’s on all the [synthetic] hair, what you mean they bad?’ I thought that was good, I don’t want to catch on fire. Point is, seeing that flame retardants are bad you can go to the beauty supply store and it’s all labeled [on the products].” Once Science Spring published the paper, Dr. Franklin’s team found that flame retardants are so bad they should not be used on couches that are used in the household repeatedly. Given this development, she was concerned as to why this wasn\u0026#39;t a concern when used on women’s hair and decided to make it a study.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIn a post on ‘X’ she says: “Ain’t for nothing that I am concerned about the adverse effects of hair extensions. I have had multiple outbreaks while wearing braids. Anyone else experienced something like this?”\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“\u003c/p\u003e\u003cp\u003e\u0026#34;... when a synthetic fibre [is braided into] your hair, which is a natural fibre, often the synthetic fibre wins out [and it becomes] a battle between your hair and the braiding hair.\u0026#34;\u003c/p\u003e\u003cp\u003e Stephanie Sey, Clinical trichologist\u003c/p\u003e\u003cp\u003e”\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eDespite this, anecdotal reports of allergic reactions and sensitivities continue to circulate. Clinical trichologist Stephanie Sey tells Unbothered that these findings certainly have legs, and are things she sees in the clinic. “The most common thing I see in clinic — as well as from personal experience — is allergic dermatitis in the scalp, so people develop allergies to the synthetic braiding hair due to the chemicals in them. I suspect this is to do with the alkaline coating that aggravates the scalp to the point that it’s unbearable.”\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“If synthetic hair isn’t washed before use, residues from manufacturing processes can irritate the scalp. No harm in trying an apple cider vinegar solution to mitigate this,” she adds. “However, the efficacy of these rinses remains debated.”\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eSey also mentions: “People also often forget that when a synthetic fiber [is braided into] your hair, which is a natural fiber, often the synthetic fiber wins out [and it becomes] a battle between your hair and the braiding hair. Once we mix the two, the synthetic hair can cut into our hair and cause areas of fracture and breakage against our natural fibers leaving the hair chronically dry and brittle.” \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“\u003c/p\u003e\u003cp\u003eWhile all of these findings may be concerning, it\u0026#39;s important for us as Black women consumers to interpret them with discernment and caution. \u003c/p\u003e\u003cp\u003e”\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eHealth concerns surrounding Black haircare products in general are not new. Back in 2022 a study carried out by the National Institutes of Health (NIH), uncovered that there was substantial evidence to show that frequent use of chemical hair-straightening products may double the risk of uterine cancer, and this led to a \u003ca href=\"https://www.refinery29.com/en-us/hair-relaxer-lawsuit-black-women-cancer\"\u003eslew of lawsuits against manufacturers of chemical relaxers\u003c/a\u003e. It’s clear that Black women – a demographic that spends an estimated $2.5 billion annually on haircare – are often misinformed about the potential risks of the products they use and need greater transparency.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWhile all of these findings may be concerning, it\u0026#39;s important for us as Black women consumers to interpret them with discernment and caution. Sure, we won’t know the extent of the effects of excessive use of synthetic hair until the full studies are released. However, until then the experts advise us to be\u003cem\u003e real real \u003c/em\u003ewary! Or at the very least reduce the use of it.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003e\u003cstrong\u003eWhat are the environmental and ethical concerns surrounding synthetic hair?\u003c/strong\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThe \u003ca href=\"https://www.refinery29.com/en-gb/synthetic-wigs-hair-sent-to-landfill\"\u003eenvironmental impact of synthetic hair\u003c/a\u003e is another growing concern. The synthetic hair industry, \u003ca href=\"https://www.gminsights.com/industry-analysis/artificial-hair-integration-market\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003evalued at billions of pounds\u003c/a\u003e, relies heavily on non-biodegradable plastics. Discarded synthetic hair releases microplastics into the environment and then ends up in landfills, where it can take centuries to decompose. In an already heavily strained ecosystem, having nice long hair is hardly a logical reason to contribute to the complex and fraught issue of plastic pollution globally. Ethical issues also plague the industry. Some synthetic hair products are blended with unethically sourced human hair to improve quality while lowering costs. The industry is riddled with unethical sourcing practices, which \u003ca href=\"https://www.refinery29.com/en-gb/2018/06/201466/human-hair-extensions-ethical-sourcing\"\u003eexploit vulnerable women\u003c/a\u003e, often in developing countries, who sell their hair for meager compensation. In some cases, women are pressured and coerced into selling their hair, to provide for their families, while some are outright forced to do so without consent.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003e\u003cstrong\u003eSo what are the best alternatives to synthetic braiding hair?\u003c/strong\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIf you’ve been put off and are looking to reduce your reliance on synthetic hair, the options are limited but growing. Non-toxic and sustainable alternatives, such as braiding hair made from banana or pineapple fibers, are gaining traction. Brands like \u003ca href=\"https://www.nouriehair.com/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eNourie Hair\u003c/a\u003e and \u003ca href=\"https://rebundle.co/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eRebundle\u003c/a\u003e offer promising solutions, though you might have to weigh up whether factors such as texture adaption, and higher price points will make the switch worth it.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“I’m glad that innovative plant-based alternatives to synthetic hair are now available,” explains Donna Auguste, PhD, to Unbothered. Auguste was one of the scientists behind the 2020 VOCs in synthetic hair research. \u0026#34;As consumers, we\u0026#39;re learning more about how haircare can support our health goals.”\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAlthough I personally haven’t tried these alternatives (albeit extremely keen too), the general consensus around these plant-based alternatives seems overwhelmingly positive, however, with slight caveats that although better than the alternative, the technology may not be there yet to fully emulate natural hair. Some users have reported struggling with grip during the braiding process as there is a stark difference in texture to synthetic hair.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“By week four, I felt like my skin was covered in a tiny layer of fibers, and I was finding them everywhere — in my bed, on my robe, in my moisturizer…” says \u003ca href=\"https://www.refinery29.com/en-us/nourie-braiding-hair-review\"\u003eAmanda Mitchell, a contributor at Refinery 29\u003c/a\u003e when reviewing Norie plant based braiding hair.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“Little strands of hair (which feel a little like stuffed fabric fiber or straw) poke out from the braids in the days immediately following them being put in. But I just trimmed them off and they went away after a few days. Additionally, the ends need to be moisturized more often than usual hair, or else they start looking frizzy,” reports a user on Reddit while reviewing Rebundle’s plant-based hair.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIn the meantime, here are some expert-recommended practical steps to minimize risks when using synthetic hair:\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e— \u003cstrong\u003eWash Before Use\u003c/strong\u003e: Rinse synthetic hair with a light shampoo or apple cider vinegar solution to remove manufacturing residues. “Soaking it in apple cider vinegar to remove some of that alkaline coating and bring it into more of an acid base is probably a good idea – there is no harm in that, – but my suggestion is to simply wash the hair in a light shampoo solution before use,” says Sey. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e— \u003cstrong\u003eLimit Use:\u003c/strong\u003e Rotate between styles that require synthetic hair and those that don’t to give your scalp a break. “If you can avoid using it regularly it is better, as opposed to back-to-back braids, maybe for special occasions, but try not to use it often.”\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e— \u003cstrong\u003eChoose Trusted Brands: \u003c/strong\u003eOpt for synthetic hair from brands that prioritize safety and transparency like Rebundle and Norie Hair.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eI get it, it’s unlikely we Black women will proactively choose to abandon braids and other styles requiring synthetic hair anytime soon. These styles are deeply rooted in our identity and practical necessity. After all, braiding is more than a hairstyle; it’s a cultural expression, it’s a nuanced beauty ritual, with deep historical meaning and it\u0026#39;s truly a form of self-care, we just need to find a way to make it safer, that’s all. Can the \u003cem\u003egurls\u003c/em\u003e just have one nice thing?\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003e*X-Pression has been contacted for comment.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eThis article was originally published on Unbothered UK\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "15 min read",
  "publishedTime": "2025-03-20T13:00:42Z",
  "modifiedTime": null
}
