{
  "id": "0c04e2b6-7126-4b01-b48e-190187aab1b5",
  "title": "Humbert announces end of collaboration with coach Chardy",
  "link": "https://www.atptour.com/en/news/humbert-chardy-split-january-2025",
  "description": "Ugo Humbert announced on Tuesday the end of his collaboration with Jeremy Chardy. “End of our beautiful adventure with Jeremy. Thank you for these two magnificent seasons at your side, all the incredible emotions, the precious moments past and all that you taught me,” Humbert wrote on Instagram. “I had a great time by your side. I will always be grateful. I wish you all the best for your new project.”         View this post on Instagram                       A post shared by Ugo Humbert (@ugohumbert) Last year Humbert climbed to a career-high No. 13 in the PIF ATP Rankings and won titles in Marseille and Dubai. The lefty reached his first ATP Masters 1000 final at the Rolex Paris Masters. Humbert reached the fourth round of the Australian Open, where he lost to second seed Alexander Zverev in four sets. [NEWSLETTER FORM]",
  "author": "",
  "published": "Wed, 22 Jan 2025 00:26:00 Z",
  "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
  "categories": [
    "Player News",
    "Ugo Humbert",
    "Jeremy Chardy",
    "2025",
    "Coach"
  ],
  "byline": "",
  "length": 1038,
  "excerpt": "Ugo Humbert announced on Tuesday the end of his collaboration with Jeremy Chardy, who helped him to a career-high No. 13 in the PIF ATP Rankings.",
  "siteName": "ATP Tour",
  "favicon": "",
  "text": "Player NewsHumbert announces end of collaboration with coach Chardy Humbert thanks countryman for 'beautiful adventure' January 22, 2025 Mike Lawrence/ATP Tour Jeremy Chardy helped Ugo Humbert reach a career-high No. 13 in the PIF ATP Rankings. By ATP Staff Ugo Humbert announced on Tuesday the end of his collaboration with Jeremy Chardy. “End of our beautiful adventure with Jeremy. Thank you for these two magnificent seasons at your side, all the incredible emotions, the precious moments past and all that you taught me,” Humbert wrote on Instagram. “I had a great time by your side. I will always be grateful. I wish you all the best for your new project.” Last year Humbert climbed to a career-high No. 13 in the PIF ATP Rankings and won titles in Marseille and Dubai. The lefty reached his first ATP Masters 1000 final at the Rolex Paris Masters. Humbert reached the fourth round of the Australian Open, where he lost to second seed Alexander Zverev in four sets.",
  "image": "https://www.atptour.com/-/media/images/news/2025/01/21/23/18/chardy-humbert.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n    \n\n\n        \u003cp\u003e\u003cspan\u003ePlayer News\u003c/span\u003e\u003c/p\u003e\u003ch2\u003eHumbert announces end of collaboration with coach Chardy\u003c/h2\u003e\n    \u003cp\u003eHumbert thanks countryman for \u0026#39;beautiful adventure\u0026#39;\u003c/p\u003e\n    \u003cp\u003eJanuary 22, 2025\u003c/p\u003e\n\n        \u003cp\u003e\u003cimg src=\"https://www.atptour.com/-/media/images/news/2025/01/21/23/18/chardy-humbert.jpg\" alt=\"Jeremy Chardy helped Ugo Humbert reach a career-high No. 13 in the PIF ATP Rankings.\"/\u003e\n        \u003c/p\u003e\n\n    \u003cdiv\u003e\n        \u003cp\u003eMike Lawrence/ATP Tour\u003c/p\u003e\n        \u003cp\u003e\u003cspan\u003eJeremy Chardy helped Ugo Humbert reach a career-high No. 13 in the PIF ATP Rankings.\u003c/span\u003e\n        \u003cspan\u003eBy ATP Staff\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"https://www.atptour.com/en/players/ugo-humbert/hh26/overview\"\u003eUgo Humbert\u003c/a\u003e announced on Tuesday the end of his collaboration with \u003ca href=\"https://www.atptour.com/en/players/jeremy-chardy/ca12/overview\"\u003eJeremy Chardy\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e“End of our beautiful adventure with Jeremy. Thank you for these two magnificent seasons at your side, all the incredible emotions, the precious moments past and all that you taught me,” Humbert wrote on Instagram. \u003c/p\u003e\n\u003cp\u003e“I had a great time by your side. I will always be grateful. I wish you all the best for your new project.”\u003c/p\u003e\n\u003cblockquote data-instgrm-permalink=\"https://www.instagram.com/p/DFFh7rLvwTr/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e\n\n\u003c/blockquote\u003e\n\n\u003cp\u003eLast year Humbert climbed to a career-high No. 13 in the PIF ATP Rankings and won titles in Marseille and Dubai. The lefty reached his first ATP Masters 1000 final at the \u003ca href=\"https://www.atptour.com/en/tournaments/paris/352/overview\"\u003eRolex Paris Masters\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eHumbert reached the fourth round of the \u003ca href=\"https://www.atptour.com/en/tournaments/australian-open/580/overview\"\u003eAustralian Open\u003c/a\u003e, where he lost to second seed \u003ca href=\"https://www.atptour.com/en/players/alexander-zverev/z355/overview\"\u003eAlexander Zverev\u003c/a\u003e in four sets.\u003c/p\u003e\n\n    \n\n\n\n\n    \n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
