{
  "id": "1b8e9acf-eb01-4fb2-94c7-126d43d83988",
  "title": "More sliding \u0026 sore hips! #NextGenATP Basavareddy learning the ropes on clay",
  "link": "https://www.atptour.com/en/news/basavareddy-aix-en-provence-challenger-2025-feature",
  "description": "Nishesh Basavareddy recalls travelling to Paris at age 12 to play a junior tournament in the French capital. It was one of the first times he was exposed to red clay courts, coinciding with his visits to the USTA National Campus in Orlando. Now living out his dream as a professional tennis player, the American is back in France and again, competing on clay. Set to celebrate his 20th birthday on Friday, Basavareddy captured his first clay-court win at ATP Challenger Tour level or above at the Open Aix Provence Crédit Agricole on Tuesday. Before this month, Basavareddy had not competed on clay since the junior Roland Garros event in 2022. “[In March], I was dealing with a little bit of an injury, so I had to take a little bit of time off. I had to skip Miami,\" Basavareddy told ATPTour.com. \"But then I started prepping on the red clay in Orlando at the national centre. I was there for about 10 days before I headed to Bucharest for my first European clay event.\" At No. 107 in the PIF ATP Rankings, Basavareddy is quick to highlight a unique aspect of clay-court tennis compared to other surfaces. “You’re sliding a lot more so you’re using different muscles than you would on hard. Your muscles get a lot more sore after practice, especially your hips. On top of that, just having balance on clay is huge,” Basavareddy said. “When you are in a corner and you’re trying to recover, if a guy goes behind you, you can maybe lose balance and get off-footed a bit.” Before this season, Basavareddy had not competed at an ATP Challenger Tour event outside of North America. He boasted a standout 41-13 season record at that level last year, with triumphs in Tiburon, California and Puerto Vallarta, Mexico. Basavareddy believes his game can translate well to clay, it is just a matter of time and gaining experience. “After playing on hard for a while, you obviously start to develop some tendencies of trying to take the ball earlier, apply pressure early in the point, take returns early and some of that just gets negated on clay because the conditions are slower,” said Basavareddy, who turned pro in December after spending two years at Stanford University. “So I think it’s just about having discipline, building the points better and the movement is obviously a huge component. But I think when I get used to that, my game can translate quite well because I feel like I can use a drop shot, mix it up a little bit.”  [ATP APP] Basavareddy, a competitor at last year’s Next Gen ATP Finals presented by PIF, will meet Spanish veteran Albert Ramos-Vinolas in the second round of the Aix-en-Provence Challenger. The lefty Ramos-Vinolas, 18 years Basavareddy’s senior, has claimed 200 tour-level wins on clay, including four ATP 250 titles on the surface. The winner will face top seed Alexei Popyrin or three-time major champion Stan Wawrinka, a reflection of the depth field in southern France, where the main-draw cutoff was No. 115 — comparable to some ATP Tour events. “I think they are great for the Tour,” Basavareddy said, discussing the Challenger 175 category, which was introduced in 2023. “...They are definitely good to get high-quality matches and a good opportunity for points as well and good experience. It’s a high-quality field here in Aix and Estoril, just like it was in Phoenix and in Cap Cana. So I think these events are great.” [NEWSLETTER FORM]",
  "author": "",
  "published": "Thu, 01 May 2025 01:09:00 Z",
  "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
  "categories": [
    "Challenger",
    "challenger-news",
    "Nishesh Basavareddy",
    "2025",
    "Aix en Provence"
  ],
  "byline": "",
  "length": 3674,
  "excerpt": "Nishesh Basavareddy recalls travelling to Paris at age 12 to play the renowned Longines Future Tennis Aces, a junior tournament in the French capital. Now the American is back in France and again, competing on clay at the Aix-en-Provence Challenger.",
  "siteName": "ATP Tour",
  "favicon": "",
  "text": "ChallengerMore sliding \u0026 sore hips! #NextGenATP Basavareddy learning the ropes on clay American is competing at the Aix-en-Provence Challenger May 01, 2025 Nicolas Averty Nishesh Basavareddy is No. 107 in the PIF ATP Rankings. By Grant Thompson Nishesh Basavareddy recalls travelling to Paris at age 12 to play a junior tournament in the French capital. It was one of the first times he was exposed to red clay courts, coinciding with his visits to the USTA National Campus in Orlando. Now living out his dream as a professional tennis player, the American is back in France and again, competing on clay. Set to celebrate his 20th birthday on Friday, Basavareddy captured his first clay-court win at ATP Challenger Tour level or above at the Open Aix Provence Crédit Agricole on Tuesday. Before this month, Basavareddy had not competed on clay since the junior Roland Garros event in 2022. “[In March], I was dealing with a little bit of an injury, so I had to take a little bit of time off. I had to skip Miami,\" Basavareddy told ATPTour.com. \"But then I started prepping on the red clay in Orlando at the national centre. I was there for about 10 days before I headed to Bucharest for my first European clay event.\" At No. 107 in the PIF ATP Rankings, Basavareddy is quick to highlight a unique aspect of clay-court tennis compared to other surfaces. “You’re sliding a lot more so you’re using different muscles than you would on hard. Your muscles get a lot more sore after practice, especially your hips. On top of that, just having balance on clay is huge,” Basavareddy said. “When you are in a corner and you’re trying to recover, if a guy goes behind you, you can maybe lose balance and get off-footed a bit.” Before this season, Basavareddy had not competed at an ATP Challenger Tour event outside of North America. He boasted a standout 41-13 season record at that level last year, with triumphs in Tiburon, California and Puerto Vallarta, Mexico. Basavareddy believes his game can translate well to clay, it is just a matter of time and gaining experience. “After playing on hard for a while, you obviously start to develop some tendencies of trying to take the ball earlier, apply pressure early in the point, take returns early and some of that just gets negated on clay because the conditions are slower,” said Basavareddy, who turned pro in December after spending two years at Stanford University. “So I think it’s just about having discipline, building the points better and the movement is obviously a huge component. But I think when I get used to that, my game can translate quite well because I feel like I can use a drop shot, mix it up a little bit.”  Basavareddy, a competitor at last year’s Next Gen ATP Finals presented by PIF, will meet Spanish veteran Albert Ramos-Vinolas in the second round of the Aix-en-Provence Challenger. The lefty Ramos-Vinolas, 18 years Basavareddy’s senior, has claimed 200 tour-level wins on clay, including four ATP 250 titles on the surface. The winner will face top seed Alexei Popyrin or three-time major champion Stan Wawrinka, a reflection of the depth field in southern France, where the main-draw cutoff was No. 115 — comparable to some ATP Tour events. “I think they are great for the Tour,” Basavareddy said, discussing the Challenger 175 category, which was introduced in 2023. “...They are definitely good to get high-quality matches and a good opportunity for points as well and good experience. It’s a high-quality field here in Aix and Estoril, just like it was in Phoenix and in Cap Cana. So I think these events are great.”",
  "image": "https://www.atptour.com/-/media/2024-images/news/2025/04/30/23/48/basavareddy-aixenprovencech-2025.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n    \n\n\n        \u003cp\u003e\u003cspan\u003eChallenger\u003c/span\u003e\u003c/p\u003e\u003ch2\u003eMore sliding \u0026amp; sore hips! #NextGenATP Basavareddy learning the ropes on clay\u003c/h2\u003e\n    \u003cp\u003eAmerican is competing at the Aix-en-Provence Challenger\u003c/p\u003e\n    \u003cp\u003eMay 01, 2025\u003c/p\u003e\n\n        \u003cp\u003e\u003cimg src=\"https://www.atptour.com/-/media/2024-images/news/2025/04/30/23/48/basavareddy-aixenprovencech-2025.jpg\" alt=\"Nishesh Basavareddy is No. 107 in the PIF ATP Rankings.\"/\u003e\n        \u003c/p\u003e\n\n    \u003cdiv\u003e\n        \u003cp\u003eNicolas Averty\u003c/p\u003e\n        \u003cp\u003e\u003cspan\u003eNishesh Basavareddy is No. 107 in the PIF ATP Rankings.\u003c/span\u003e\n        \u003cspan\u003eBy Grant Thompson\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"https://www.atptour.com/en/players/nishesh-basavareddy/b0nn/overview\"\u003eNishesh Basavareddy\u003c/a\u003e recalls travelling to Paris at age 12 to play a junior tournament in the French capital. It was one of the first times he was exposed to red clay courts, coinciding with his visits to the USTA National Campus in Orlando.\u003c/p\u003e\n\u003cp\u003e\nNow living out his dream as a professional tennis player, the American is back in France and again, competing on clay. Set to celebrate his 20th birthday on Friday, Basavareddy captured his first clay-court win at ATP Challenger Tour level or above at the \u003ca href=\"https://www.atptour.com/en/scores/archive/aix-en-provence/7009/2025/results\"\u003eOpen Aix Provence Crédit Agricole\u003c/a\u003e on Tuesday. Before this month, Basavareddy had not competed on clay since the junior \u003ca href=\"https://www.atptour.com/en/tournaments/roland-garros/520/overview\"\u003eRoland Garros\u003c/a\u003e event in 2022.\u003c/p\u003e\n\u003cp\u003e\n“[In March], I was dealing with a little bit of an injury, so I had to take a little bit of time off. I had to skip Miami,\u0026#34; Basavareddy told ATPTour.com. \u0026#34;But then I started prepping on the red clay in Orlando at the national centre. I was there for about 10 days before I headed to Bucharest for my first European clay event.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003ca rel=\"noopener noreferrer\" href=\"https://www.atptour.com/en/news/it-all-adds-up-hub\" target=\"_blank\"\u003e\u003cimg alt=\"It All Adds Up\" src=\"https://www.atptour.com/-/media/2024-images/news/2025/01/07/03/30/it-all-adds-up-banner.jpg?w=100%25\u0026amp;hash=B020DA612BE0D0A67145854EF774A25A\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\nAt No. 107 in the PIF ATP Rankings, Basavareddy is quick to highlight a unique aspect of clay-court tennis compared to other surfaces.\u003c/p\u003e\n\u003cp\u003e\n“You’re sliding a lot more so you’re using different muscles than you would on hard. Your muscles get a lot more sore after practice, especially your hips. On top of that, just having balance on clay is huge,” Basavareddy said. “When you are in a corner and you’re trying to recover, if a guy goes behind you, you can maybe lose balance and get off-footed a bit.”\u003c/p\u003e\n\u003cp\u003e\nBefore this season, Basavareddy had not competed at an ATP Challenger Tour event outside of North America. He boasted a standout 41-13 season record at that level last year, with triumphs in Tiburon, California and Puerto Vallarta, Mexico.\u003c/p\u003e\n\u003cp\u003e\nBasavareddy believes his game can translate well to clay, it is just a matter of time and gaining experience.\u003c/p\u003e\n\u003cp\u003e\n“After playing on hard for a while, you obviously start to develop some tendencies of trying to take the ball earlier, apply pressure early in the point, take returns early and some of that just gets negated on clay because the conditions are slower,” said Basavareddy, who turned pro in December after spending two years at Stanford University. \u003c/p\u003e\n\u003cp\u003e\n“So I think it’s just about having discipline, building the points better and the movement is obviously a huge component. But I think when I get used to that, my game can translate quite well because I feel like I can use a drop shot, mix it up a little bit.” \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca rel=\"noopener noreferrer\" href=\"https://www.atptour.com/en/apps?utm_source=atp\u0026amp;utm_medium=article\u0026amp;utm_campaign=app_banner\" target=\"_blank\"\u003e\u003cimg src=\"-/media/\n9333ed00493246e6a2ad692fa18710b7.ashx\" alt=\"The Official App Of Tennis | Download ATP WTA Live App\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\nBasavareddy, a competitor at last year’s \u003ca href=\"https://www.atptour.com/en/tournaments/next-gen-atp-finals/7696/overview\"\u003eNext Gen ATP Finals presented by PIF\u003c/a\u003e, will meet Spanish veteran \u003ca href=\"https://www.atptour.com/en/players/albert-ramos-vinolas/r772/overview\"\u003eAlbert Ramos-Vinolas\u003c/a\u003e in the second round of the Aix-en-Provence Challenger. The lefty Ramos-Vinolas, 18 years Basavareddy’s senior, has claimed 200 tour-level wins on clay, including four ATP 250 titles on the surface. \u003c/p\u003e\n\u003cp\u003e\nThe winner will face top seed \u003ca href=\"https://www.atptour.com/en/players/alexei-popyrin/p09z/overview\"\u003eAlexei Popyrin\u003c/a\u003e or three-time major champion \u003ca href=\"https://www.atptour.com/en/players/stan-wawrinka/w367/overview\"\u003eStan Wawrinka\u003c/a\u003e, a reflection of the depth field in southern France, where the main-draw cutoff was No. 115 — comparable to some ATP Tour events.\u003c/p\u003e\n\u003cp\u003e\n“I think they are great for the Tour,” Basavareddy said, discussing the Challenger 175 category, which was introduced in 2023. “...They are definitely good to get high-quality matches and a good opportunity for points as well and good experience. It’s a high-quality field here in Aix and Estoril, just like it was in Phoenix and in Cap Cana. So I think these events are great.”\u003c/p\u003e\n\n\n    \n\n\n\n\n    \n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
