{
  "id": "1cb1e8a4-c773-4e38-99f7-415bf69570a4",
  "title": "Alcaraz to face De Minaur in Rotterdam Open final",
  "link": "https://www.bbc.com/sport/tennis/articles/c4g3ypr7mmgo",
  "description": "Carlos Alcaraz will face Alex de Minaur in the Rotterdam Open final on Sunday after defeating Hubert Hurkacz in the semi-finals.",
  "author": "",
  "published": "Sat, 08 Feb 2025 21:27:58 GMT",
  "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
  "categories": null,
  "byline": "BBC Sport",
  "length": 1678,
  "excerpt": "Carlos Alcaraz will face Alex de Minaur in the Rotterdam Open final on Sunday after defeating Hubert Hurkacz in the semi-finals.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Carlos Alcaraz will face Alex de Minaur in the Rotterdam Open final on Sunday after defeating Hubert Hurkacz in the semi-finals.The 21-year-old top seed won 6-4 6-7 (5-7) 6-3 against Poland's Hurkacz at the ATP 500 indoor hard-court event. World number eight De Minaur, 25, booked his place in the final with a straight-set semi-final victory over Mattia Bellucci. The Australian third seed cruised past his Italian opponent 6-1 6-2. Four-time Grand Slam winner Alcaraz made a slow start to his debut at the event and quickly found himself 3-0 down, before fighting back to take the first set. \"I think he had chances to make it 6-0 so I just tried to fight for every ball, every point,\" said the world number three. With the second set going to a tie-break, both players squandered chances to seize the advantage. It was a double fault from Alcaraz at 5-4 up that handed Hurkacz the opportunity to draw level and the 27-year-old took the set after the Spaniard netted a simple backhand. Alcaraz found his stride in the third set, however, and he reached the final with a forehand winner after a thrilling contest. \"I just tried to stay in there, keep fighting all the time and it paid off,\" added Alcaraz.De Minaur's last-four tie was a stroll in contrast.Bellucci had knocked out Daniil Medvedev and Stefanos Tsitsipas on his way to the semi-finals but De Minaur was too strong for the 23-year-old qualifier. De Minaur, who won all of his matches in Rotterdam in straight sets, was runner-up to world number one Jannik Sinner in the final last year. \"The Dutch crowd always treats me very well, and I love coming back here, so hopefully I can get a title this time,\" he said.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7212/live/b736c1d0-e661-11ef-bc01-df929f1ad767.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eCarlos Alcaraz will face Alex de Minaur in the Rotterdam Open final on Sunday after defeating Hubert Hurkacz in the semi-finals.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe 21-year-old top seed won 6-4 6-7 (5-7) 6-3 against Poland\u0026#39;s Hurkacz at the ATP 500 indoor hard-court event. \u003c/p\u003e\u003cp\u003eWorld number eight De Minaur, 25, booked his place in the final with a straight-set semi-final victory over Mattia Bellucci. \u003c/p\u003e\u003cp\u003eThe Australian third seed cruised past his Italian opponent 6-1 6-2. \u003c/p\u003e\u003cp\u003eFour-time Grand Slam winner Alcaraz made a slow start to his debut at the event and quickly found himself 3-0 down, before fighting back to take the first set. \u003c/p\u003e\u003cp\u003e\u0026#34;I think he had chances to make it 6-0 so I just tried to fight for every ball, every point,\u0026#34; said the world number three. \u003c/p\u003e\u003cp\u003eWith the second set going to a tie-break, both players squandered chances to seize the advantage. It was a double fault from Alcaraz at 5-4 up that handed Hurkacz the opportunity to draw level and the 27-year-old took the set after the Spaniard netted a simple backhand. \u003c/p\u003e\u003cp\u003eAlcaraz found his stride in the third set, however, and he reached the final with a forehand winner after a thrilling contest. \u003c/p\u003e\u003cp\u003e\u0026#34;I just tried to stay in there, keep fighting all the time and it paid off,\u0026#34; added Alcaraz.\u003c/p\u003e\u003cp\u003eDe Minaur\u0026#39;s last-four tie was a stroll in contrast.\u003c/p\u003e\u003cp\u003eBellucci had knocked out Daniil Medvedev and Stefanos Tsitsipas on his way to the semi-finals but De Minaur was too strong for the 23-year-old qualifier.  \u003c/p\u003e\u003cp\u003eDe Minaur, who won all of his matches in Rotterdam in straight sets, was runner-up to world number one Jannik Sinner in the final last year. \u003c/p\u003e\u003cp\u003e\u0026#34;The Dutch crowd always treats me very well, and I love coming back here, so hopefully I can get a title this time,\u0026#34; he said.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-02-08T21:27:58.61Z",
  "modifiedTime": null
}
