{
  "id": "21594d35-9e7d-403f-ae45-d5bcc48054f6",
  "title": "Djokovic to begin bid for 25th Grand Slam in Brisbane",
  "link": "https://www.bbc.com/sport/tennis/articles/c5y83vn4y67o",
  "description": "Novak Djokovic will play at the Brisbane International this month before he starts his bid for a 25th Grand Slam at the Australian Open in Melbourne.",
  "author": "",
  "published": "Wed, 04 Dec 2024 07:18:59 GMT",
  "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
  "categories": null,
  "byline": "Sean Kearns",
  "length": 1859,
  "excerpt": "Novak Djokovic will play at the Brisbane International this month before he starts his bid for a 25th Grand Slam at the Australian Open in Melbourne.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Novak Djokovic will play at the Brisbane International before he starts his bid to win a 25th Grand Slam at Melbourne's Australian Open in January. The 37-year-old, a 10-time winner in Melbourne, is tied with Australian Margaret Court on a record 24 Grand Slam singles titles. The Serb, ranked seventh in the world, failed to add to his Grand Slam tally during a frustrating 2024.The tournament in Brisbane, which runs from 29 December until 5 January, is one of the final warm-up events before the Australian Open begins on 12 January. \"I'm excited to be kicking off my Australian swing at the Brisbane International and to compete again at Pat Rafter Arena,\" said Djokovic.\"I am looking forward to experiencing the incredible support from the Australian fans and making this tournament one to remember.\"Meanwhile, Britain's Emma Raducanu will begin her season at the Auckland Classic, which takes place from 30 December to 5 January.Raducanu is on the entry list along with four-time major winner Naomi Osaka and home hope Lulu Sun, who reached the Wimbledon quarter-finals as a qualifier in July.With 99 ATP titles to his name, Djokovic is aiming to join American Jimmy Connors (109) and Swiss Roger Federer (103) as just the third man in the Open era to win 100 career titles.The field in Brisbane features Nick Kyrgios, defending champion Grigor Dimitrov and Holger Rune. Djokovic appointed Andy Murray as his coach for the Australian Open last month.The former British number one was beaten by Djokovic in the final of the Australian Open on four occasions. An exact date for when Murray will start his coaching role has not been finalised but BBC Sport has been told the Scot is not currently planning on being in Brisbane with Djokovic. Djokovic reached the semi-finals of the Australia Open earlier this year, losing to eventual winner Jannik Sinner.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_sport/1269/live/84cb0750-b20a-11ef-a7e9-e72ab6369e72.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eNovak Djokovic will play at the Brisbane International before he starts his bid to win a 25th Grand Slam at Melbourne\u0026#39;s Australian Open in January. \u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe 37-year-old, a 10-time winner in Melbourne, is \u003ca href=\"https://www.bbc.com/sport/tennis/66766337\"\u003etied with Australian Margaret Court on a record 24 Grand Slam singles titles.\u003c/a\u003e \u003c/p\u003e\u003cp\u003eThe Serb, ranked seventh in the world, failed to add to his Grand Slam tally during a frustrating 2024.\u003c/p\u003e\u003cp\u003eThe tournament in Brisbane, which runs from 29 December until 5 January, is one of the final warm-up events before the Australian Open begins on 12 January. \u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m excited to be kicking off my Australian swing at the Brisbane International and to compete again at Pat Rafter Arena,\u0026#34; said Djokovic.\u003c/p\u003e\u003cp\u003e\u0026#34;I am looking forward to experiencing the incredible support from the Australian fans and making this tournament one to remember.\u0026#34;\u003c/p\u003e\u003cp\u003eMeanwhile, Britain\u0026#39;s Emma Raducanu will begin her season at the Auckland Classic, which takes place from 30 December to 5 January.\u003c/p\u003e\u003cp\u003eRaducanu is on the entry list along with four-time major winner Naomi Osaka and home hope Lulu Sun, who reached the Wimbledon quarter-finals as a qualifier in July.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eWith 99 ATP titles to his name, Djokovic is aiming to join American Jimmy Connors (109) and Swiss Roger Federer (103) as just the third man in the Open era to win 100 career titles.\u003c/p\u003e\u003cp\u003eThe field in Brisbane features Nick Kyrgios, defending champion Grigor Dimitrov and Holger Rune. \u003c/p\u003e\u003cp\u003eDjokovic \u003ca href=\"https://www.bbc.com/sport/tennis/articles/ckgzvlxyvxgo\"\u003eappointed Andy Murray\u003c/a\u003e as his coach for the Australian Open last month.\u003c/p\u003e\u003cp\u003eThe former British number one was beaten by Djokovic in the final of the Australian Open on four occasions. \u003c/p\u003e\u003cp\u003eAn exact date for when Murray will start his coaching role has not been finalised but BBC Sport has been told the Scot is not currently planning on being in Brisbane with Djokovic. \u003c/p\u003e\u003cp\u003eDjokovic reached the semi-finals of the Australia Open earlier this year, losing to eventual winner Jannik Sinner.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-12-04T07:18:59.977Z",
  "modifiedTime": null
}
