{
  "id": "2a0d9ead-d955-453b-946d-82703cc6cd62",
  "title": "Stella Artois ATP Perfect Serve: Vote now for May’s most clutch delivery",
  "link": "https://www.atptour.com/en/news/stella-artois-atp-perfect-serve-may-2025",
  "description": "May brought countless serves across the ATP Tour, but three stood out for their boldness, precision and high-stakes impact. From Holger Rune’s marathon hold to Carlos Alcaraz’s calm under pressure and Alexandre Muller’s underarm surprise, these moments defined what the Perfect Serve is all about. In this second edition of ATP Perfect Serve, brought to you by Stella Artois, we spotlight three standout serves. Now it’s your turn to decide who delivered May’s best under pressure during the European clay swing. Watch the video below, then head to our Stella Artois ATP Perfect Serve hub to vote for your favourite! Visit the Stella Artois ATP Perfect Serve hub to vote for your favourite now! In May, three standout serves turned the tide in key matches. Rune, down 1-4 to Francisco Comesana in Rome, fought through a gruelling 23-minute service game, saving six break points and the last with a 121 mph serve followed by a winner. Rome champion Alcaraz also showed nerves of steel in the Italian capital. Trailing 15/40 when serving for the first set against Jack Draper, the Spaniard landed three first serves and reeled off four straight points to take the set, saving eight break points overall. Meanwhile, in Hamburg, Alexandre Muller delivered the month’s most audacious moment, catching Alexander Zverev off guard with a perfectly timed underarm serve that won the point and stunned the crowd. Nothing Major podcast hosts Sam Querrey, Jack Sock and Steve Johnson weighed in with their thoughts on which player did it best. But ultimately, the decision is yours! Stella Artois, one of the world's leading premium beer brands, is a Gold Partner and Official Beer of the ATP Tour through 2028. [NEWSLETTER FORM]",
  "author": "",
  "published": "Thu, 12 Jun 2025 17:55:00 Z",
  "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
  "categories": null,
  "byline": "",
  "length": 1927,
  "excerpt": "Carlos Alcaraz, Holger Rune and Alexandre Muller are featured in the Stella Artois Perfect Serve series for May",
  "siteName": "ATP Tour",
  "favicon": "",
  "text": "Stella Artois ATP Perfect Serve: Vote now for May’s most clutch delivery Alcaraz, Muller, Rune have been nominated June 12, 2025 ATP Tour/Getty Images By ATP Staff May brought countless serves across the ATP Tour, but three stood out for their boldness, precision and high-stakes impact. From Holger Rune’s marathon hold to Carlos Alcaraz’s calm under pressure and Alexandre Muller’s underarm surprise, these moments defined what the Perfect Serve is all about. In this second edition of ATP Perfect Serve, brought to you by Stella Artois, we spotlight three standout serves. Now it’s your turn to decide who delivered May’s best under pressure during the European clay swing. Watch the video below, then head to our Stella Artois ATP Perfect Serve hub to vote for your favourite! Visit the Stella Artois ATP Perfect Serve hub to vote for your favourite now! In May, three standout serves turned the tide in key matches. Rune, down 1-4 to Francisco Comesana in Rome, fought through a gruelling 23-minute service game, saving six break points and the last with a 121 mph serve followed by a winner. Rome champion Alcaraz also showed nerves of steel in the Italian capital. Trailing 15/40 when serving for the first set against Jack Draper, the Spaniard landed three first serves and reeled off four straight points to take the set, saving eight break points overall. Meanwhile, in Hamburg, Alexandre Muller delivered the month’s most audacious moment, catching Alexander Zverev off guard with a perfectly timed underarm serve that won the point and stunned the crowd. Nothing Major podcast hosts Sam Querrey, Jack Sock and Steve Johnson weighed in with their thoughts on which player did it best. But ultimately, the decision is yours! Stella Artois, one of the world's leading premium beer brands, is a Gold Partner and Official Beer of the ATP Tour through 2028.",
  "image": "https://www.atptour.com/-/media/2024-images/news/2025/06/11/18/15/stella-perfect-serve-may-2025-candidates.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n    \n\n\n    \u003ch2\u003eStella Artois ATP Perfect Serve: Vote now for May’s most clutch delivery\u003c/h2\u003e\n    \u003cp\u003eAlcaraz, Muller, Rune have been nominated\u003c/p\u003e\n    \u003cp\u003eJune 12, 2025\u003c/p\u003e\n\n        \u003cp\u003e\u003cimg src=\"https://www.atptour.com/-/media/2024-images/news/2025/06/11/18/15/stella-perfect-serve-may-2025-candidates.jpg\" alt=\"\"/\u003e\n        \u003c/p\u003e\n\n    \u003cdiv\u003e\n        \u003cp\u003eATP Tour/Getty Images\u003c/p\u003e\n        \u003cp\u003e\u003cspan\u003e\u003c/span\u003e\n        \u003cspan\u003eBy ATP Staff\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eMay brought countless serves across the ATP Tour, but three stood out for their boldness, precision and high-stakes impact. From \u003ca href=\"https://www.atptour.com/en/players/holger-rune/r0dg/overview\"\u003eHolger Rune\u003c/a\u003e’s marathon hold to \u003ca href=\"https://www.atptour.com/en/players/carlos-alcaraz/a0e2/overview\"\u003eCarlos Alcaraz\u003c/a\u003e’s calm under pressure and \u003ca href=\"https://www.atptour.com/en/players/alexandre-muller/mp20/overview\"\u003eAlexandre Muller\u003c/a\u003e’s underarm surprise, these moments defined what the Perfect Serve is all about.\u003c/p\u003e\n\u003cp\u003eIn this second edition of ATP Perfect Serve, brought to you by Stella Artois, we spotlight three standout serves. Now it’s your turn to decide who delivered May’s best under pressure during the European clay swing.\u003c/p\u003e\n\u003cp\u003eWatch the video below, then head to our Stella Artois ATP Perfect Serve hub to vote for your favourite!\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003e\u003ca rel=\"noopener noreferrer\" href=\"https://www.atptour.com/en/latest/stella-atp-perfect-serve\" target=\"_blank\"\u003eVisit the Stella Artois ATP Perfect Serve hub to vote for your favourite now!\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn May, three standout serves turned the tide in key matches. Rune, down 1-4 to \u003ca href=\"https://www.atptour.com/en/players/francisco-comesana/c0df/overview\"\u003eFrancisco Comesana\u003c/a\u003e in Rome, fought through a gruelling 23-minute service game, saving six break points and the last with a 121 mph serve followed by a winner.\u003c/p\u003e\n\u003cp\u003eRome champion Alcaraz also showed nerves of steel in the Italian capital. Trailing 15/40 when serving for the first set against \u003ca href=\"https://www.atptour.com/en/players/jack-draper/d0co/overview\"\u003eJack Draper\u003c/a\u003e, the Spaniard landed three first serves and reeled off four straight points to take the set, saving eight break points overall.\u003c/p\u003e\n\u003cp\u003eMeanwhile, in Hamburg, \u003ca href=\"https://www.atptour.com/en/players/alexandre-muller/mp20/overview\"\u003eAlexandre Muller\u003c/a\u003e delivered the month’s most audacious moment, catching \u003ca href=\"https://www.atptour.com/en/players/alexander-zverev/z355/overview\"\u003eAlexander Zverev\u003c/a\u003e off guard with a perfectly timed underarm serve that won the point and stunned the crowd.\u003c/p\u003e\n\u003cp\u003eNothing Major podcast hosts \u003ca href=\"https://www.atptour.com/en/players/sam-querrey/q927/overview\"\u003eSam Querrey\u003c/a\u003e, \u003ca href=\"https://www.atptour.com/en/players/jack-sock/sm25/overview\"\u003eJack Sock\u003c/a\u003e and \u003ca href=\"https://www.atptour.com/en/players/steve-johnson/j386/overview\"\u003eSteve Johnson\u003c/a\u003e weighed in with their thoughts on which player did it best. But ultimately, the decision is yours!\u003c/p\u003e\n\u003cp\u003eStella Artois, one of the world\u0026#39;s leading premium beer brands, is a Gold Partner and Official Beer of the ATP Tour through 2028.\u003c/p\u003e\n\n\n    \n\n\n\n\n    \n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
