{
  "id": "497775a0-bda4-4b01-82e6-0bdc1272a851",
  "title": "Sinner reveals toughest part of grass transition, recovery from Alcaraz epic",
  "link": "https://www.atptour.com/en/news/sinner-wimbledon-2025-preview",
  "description": "Jannik Sinner has cemented his status as one of the dominant forces on the ATP Tour over the past year, but as he returns to Wimbledon, there’s still unfinished business. The No. 1 player in the PIF ATP Rankings has had time to reflect on his gut-wrenching defeat to Carlos Alcaraz at Roland Garros, where he let slip three consecutive championship points. Now, his focus shifts to another challenge: the tricky transition from clay to grass. When asked about the biggest hurdle in adapting to grass-court tennis, Sinner was direct in his response. “Movement, for sure, because the movement is the most important part for us tennis players,” Sinner said in Saturday’s pre-tournament press conference. “If someone moves well, it means that he is a good player. That's how I see tennis from outside. “You have to cover the spots more, improvise a little bit more on the other sides. It's a very different game style we see on grass.” Despite the difficulties of switching surfaces, Sinner has already shown he’s capable of adjusting. Last season, just two weeks after falling in the Roland Garros semi-finals, the Italian lifted his first grass-court trophy in Halle. However, his title defence at the German ATP 500 didn’t go as planned this year, with Sinner bowing out in the second round to Alexander Bublik. That loss, coupled with his defeat to rival Alcaraz, who now leads Sinner 8-4 in their Lexus ATP Head2Head series, might raise doubts over his momentum heading into Wimbledon. But the top seed is unfazed. “Honestly, I feel ready to play. We are practising very well,” said Sinner. “What happened in the past is in the past already. I feel good. I feel especially mentally I feel in a very good spot. Halle was a little bit different, because before I haven't had so much time to cut that off. Now it's gone, and I also see the reactions of other players and people. They [said] the level is very, very high. Just privileged to be in this position. “We are working very hard. I feel like I'm playing great, great tennis on grass. Hopefully I can show this also in the match court. I'm just looking forward to going on court and to compete and enjoy the time.” Sinner has plenty of positive memories at the All England Club. While Wimbledon remains the only major where he’s yet to reach the final, he’s enjoyed deep runs — reaching the semi-finals in 2023, losing to Novak Djokovic, and making the quarter-finals in 2022 and 2024. “It feels good again after one year coming back here,” said Sinner, who faces countryman Luca Nardi in his opener. “I'm very happy. I have some good feelings coming here, even though it's a bit different than last year, coming with the win in Halle. “But it's good. I had some time off before coming here. We are practicing very well. The days are long. So I feel ready to compete again.” [NEWSLETTER FORM]",
  "author": "",
  "published": "Sat, 28 Jun 2025 16:43:00 Z",
  "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
  "categories": [
    "Match Preview",
    "Wimbledon",
    "2025",
    "Jannik Sinner"
  ],
  "byline": "",
  "length": 3079,
  "excerpt": "Jannik Sinner previews his quest for a maiden Wimbledon title.",
  "siteName": "ATP Tour",
  "favicon": "",
  "text": "Match Preview Top seed addresses the media ahead of quest for maiden Wimbledon title June 28, 2025 Dan Istitene/Getty Images Jannik Sinner practises on Friday at Wimbledon. By ATP Staff Jannik Sinner has cemented his status as one of the dominant forces on the ATP Tour over the past year, but as he returns to Wimbledon, there’s still unfinished business. The No. 1 player in the PIF ATP Rankings has had time to reflect on his gut-wrenching defeat to Carlos Alcaraz at Roland Garros, where he let slip three consecutive championship points. Now, his focus shifts to another challenge: the tricky transition from clay to grass. When asked about the biggest hurdle in adapting to grass-court tennis, Sinner was direct in his response. “Movement, for sure, because the movement is the most important part for us tennis players,” Sinner said in Saturday’s pre-tournament press conference. “If someone moves well, it means that he is a good player. That's how I see tennis from outside. “You have to cover the spots more, improvise a little bit more on the other sides. It's a very different game style we see on grass.” Despite the difficulties of switching surfaces, Sinner has already shown he’s capable of adjusting. Last season, just two weeks after falling in the Roland Garros semi-finals, the Italian lifted his first grass-court trophy in Halle. However, his title defence at the German ATP 500 didn’t go as planned this year, with Sinner bowing out in the second round to Alexander Bublik. That loss, coupled with his defeat to rival Alcaraz, who now leads Sinner 8-4 in their Lexus ATP Head2Head series, might raise doubts over his momentum heading into Wimbledon. But the top seed is unfazed. “Honestly, I feel ready to play. We are practising very well,” said Sinner. “What happened in the past is in the past already. I feel good. I feel especially mentally I feel in a very good spot. Halle was a little bit different, because before I haven't had so much time to cut that off. Now it's gone, and I also see the reactions of other players and people. They [said] the level is very, very high. Just privileged to be in this position. “We are working very hard. I feel like I'm playing great, great tennis on grass. Hopefully I can show this also in the match court. I'm just looking forward to going on court and to compete and enjoy the time.” Sinner has plenty of positive memories at the All England Club. While Wimbledon remains the only major where he’s yet to reach the final, he’s enjoyed deep runs — reaching the semi-finals in 2023, losing to Novak Djokovic, and making the quarter-finals in 2022 and 2024. “It feels good again after one year coming back here,” said Sinner, who faces countryman Luca Nardi in his opener. “I'm very happy. I have some good feelings coming here, even though it's a bit different than last year, coming with the win in Halle. “But it's good. I had some time off before coming here. We are practicing very well. The days are long. So I feel ready to compete again.”",
  "image": "https://www.atptour.com/-/media/2024-images/news/2025/06/28/17/15/sinner-wimbledon-2025-practice.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n    \n\n\n        \u003cp\u003e\u003cspan\u003eMatch Preview\u003c/span\u003e\u003c/p\u003e\n    \u003cp\u003eTop seed addresses the media ahead of quest for maiden Wimbledon title\u003c/p\u003e\n    \u003cp\u003eJune 28, 2025\u003c/p\u003e\n\n        \u003cp\u003e\u003cimg src=\"https://www.atptour.com/-/media/2024-images/news/2025/06/28/17/15/sinner-wimbledon-2025-practice.jpg\" alt=\"Jannik Sinner practises on Friday at Wimbledon.\"/\u003e\n        \u003c/p\u003e\n\n    \u003cdiv\u003e\n        \u003cp\u003eDan Istitene/Getty Images\u003c/p\u003e\n        \u003cp\u003e\u003cspan\u003eJannik Sinner practises on Friday at Wimbledon.\u003c/span\u003e\n        \u003cspan\u003eBy ATP Staff\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"https://www.atptour.com/en/players/jannik-sinner/s0ag/overview\"\u003eJannik Sinner\u003c/a\u003e has cemented his status as one of the dominant forces on the ATP Tour over the past year, but as he returns to \u003ca href=\"https://www.atptour.com/en/tournaments/wimbledon/540/overview\"\u003eWimbledon\u003c/a\u003e, there’s still unfinished business.\u003c/p\u003e\n\u003cp\u003eThe No. 1 player in the PIF ATP Rankings has had time to reflect on his gut-wrenching defeat to \u003ca href=\"https://www.atptour.com/en/players/carlos-alcaraz/a0e2/overview\"\u003eCarlos Alcaraz\u003c/a\u003e at \u003ca href=\"https://www.atptour.com/en/tournaments/roland-garros/520/overview\"\u003eRoland Garros\u003c/a\u003e, where he let slip three consecutive championship points. Now, his focus shifts to another challenge: the tricky transition from clay to grass.\u003c/p\u003e\n\u003cp\u003eWhen asked about the biggest hurdle in adapting to grass-court tennis, Sinner was direct in his response.\u003c/p\u003e\n\u003cp\u003e“Movement, for sure, because the movement is the most important part for us tennis players,” Sinner said in Saturday’s pre-tournament press conference. “If someone moves well, it means that he is a good player. That\u0026#39;s how I see tennis from outside.\u003c/p\u003e\n\u003cp\u003e“You have to cover the spots more, improvise a little bit more on the other sides. It\u0026#39;s a very different game style we see on grass.”\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.atptour.com/en/news/it-all-adds-up-hub\" target=\"_blank\"\u003e\u003cimg alt=\"It All Adds Up\" src=\"https://www.atptour.com/-/media/2024-images/news/2025/01/07/03/30/it-all-adds-up-banner.jpg?w=100%25\u0026amp;hash=B020DA612BE0D0A67145854EF774A25A\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eDespite the difficulties of switching surfaces, Sinner has already shown he’s capable of adjusting. Last season, just two weeks after falling in the \u003ca href=\"https://www.atptour.com/en/tournaments/roland-garros/520/overview\"\u003eRoland Garros\u003c/a\u003e semi-finals, the Italian lifted his first grass-court trophy in Halle.\u003c/p\u003e\n\u003cp\u003eHowever, his title defence at the German ATP 500 didn’t go as planned this year, with Sinner bowing out in the second round to \u003ca href=\"https://www.atptour.com/en/players/alexander-bublik/bk92/overview\"\u003eAlexander Bublik\u003c/a\u003e. That loss, coupled with his defeat to rival Alcaraz, who now leads Sinner 8-4 in their Lexus ATP Head2Head series, might raise doubts over his momentum heading into \u003ca href=\"https://www.atptour.com/en/tournaments/wimbledon/540/overview\"\u003eWimbledon\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eBut the top seed is unfazed.\u003c/p\u003e\n\u003cp\u003e“Honestly, I feel ready to play. We are practising very well,” said Sinner. “What happened in the past is in the past already. I feel good. I feel especially mentally I feel in a very good spot. Halle was a little bit different, because before I haven\u0026#39;t had so much time to cut that off. Now it\u0026#39;s gone, and I also see the reactions of other players and people. They [said] the level is very, very high. Just privileged to be in this position.\u003c/p\u003e\n\u003cp\u003e“We are working very hard. I feel like I\u0026#39;m playing great, great tennis on grass. Hopefully I can show this also in the match court. I\u0026#39;m just looking forward to going on court and to compete and enjoy the time.”\u003c/p\u003e\n\n\u003cp\u003eSinner has plenty of positive memories at the All England Club. While \u003ca href=\"https://www.atptour.com/en/tournaments/wimbledon/540/overview\"\u003eWimbledon\u003c/a\u003e remains the only major where he’s yet to reach the final, he’s enjoyed deep runs — reaching the semi-finals in 2023, losing to \u003ca href=\"https://www.atptour.com/en/players/novak-djokovic/d643/overview\"\u003eNovak Djokovic\u003c/a\u003e, and making the quarter-finals in 2022 and 2024.\u003c/p\u003e\n\u003cp\u003e“It feels good again after one year coming back here,” said Sinner, who faces countryman \u003ca href=\"https://www.atptour.com/en/players/luca-nardi/n0bg/overview\"\u003eLuca Nardi\u003c/a\u003e in his opener. “I\u0026#39;m very happy. I have some good feelings coming here, even though it\u0026#39;s a bit different than last year, coming with the win in Halle.\u003c/p\u003e\n\u003cp\u003e“But it\u0026#39;s good. I had some time off before coming here. We are practicing very well. The days are long. So I feel ready to compete again.”\u003c/p\u003e\n\n\n    \n\n\n\n\n    \n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
