{
  "id": "a0e79057-1fcb-4073-99cf-f284354631a8",
  "title": "Rio draw revealed: Zverev, Musetti lead field",
  "link": "https://www.atptour.com/en/news/rio-de-janeiro-2025-draw",
  "description": "Alexander Zverev will aim for his first title of the season at next week’s Rio Open presented by Claro, where the top seed learned his place in the draw Saturday. The Australian Open finalist, who suffered an early exit during his return to clay in Buenos Aires, will look to rebound at the ATP 500. Zverev, No. 2 in the PIF ATP Rankings, begins his title quest against China’s Buyunchaokete. View Draw [ATP APP] Competing in just his second tour-level event in South America, Zverev is seeded to meet Chilean Nicolas Jarry in the quarter-finals, which would be a rematch of last year’s title match at the ATP Masters 1000 event in Rome. Zverev lifted the trophy in Rome and captured another Masters 1000 title later that season in Paris. Second seed Lorenzo Musetti is seeking his second ATP 500 title and first at any level since 2022. Beginning against a qualifier, the Italian is in the same half as third seed Alejandro Tabilo and defending champion Sebastian Baez. Brazilian star Joao Fonseca will return to his home tournament, where last year he captured his maiden tour-level win as World No. 655 in the PIF ATP Rankings. Champion at December’s Next Gen ATP Finals presented by PIF, Fonseca will begin against Frenchman Alexandre Muller. Should Fonseca win that encounter, he could next meet eighth seed Tomas Martin Etcheverry — who the 18-year-old beat in Buenos Aires. [NEWSLETTER FORM]",
  "author": "",
  "published": "Sat, 15 Feb 2025 21:37:00 Z",
  "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
  "categories": [
    "Rio de Janeiro",
    "2025",
    "Alexander Zverev"
  ],
  "byline": "",
  "length": 1612,
  "excerpt": "Alexander Zverev will aim for his first title of the season at next week’s Rio Open presented by Claro, where the top seed learned his place in the draw Saturday.",
  "siteName": "ATP Tour",
  "favicon": "",
  "text": "Rio de Janeiro Home favourite Fonseca returns to ATP 500 February 15, 2025 Marcelo Endelli/Getty Images Alexander Zverev will make his Rio de Janeiro debut. By ATP Staff Alexander Zverev will aim for his first title of the season at next week’s Rio Open presented by Claro, where the top seed learned his place in the draw Saturday. The Australian Open finalist, who suffered an early exit during his return to clay in Buenos Aires, will look to rebound at the ATP 500. Zverev, No. 2 in the PIF ATP Rankings, begins his title quest against China’s Buyunchaokete. View Draw Competing in just his second tour-level event in South America, Zverev is seeded to meet Chilean Nicolas Jarry in the quarter-finals, which would be a rematch of last year’s title match at the ATP Masters 1000 event in Rome. Zverev lifted the trophy in Rome and captured another Masters 1000 title later that season in Paris. Second seed Lorenzo Musetti is seeking his second ATP 500 title and first at any level since 2022. Beginning against a qualifier, the Italian is in the same half as third seed Alejandro Tabilo and defending champion Sebastian Baez. Brazilian star Joao Fonseca will return to his home tournament, where last year he captured his maiden tour-level win as World No. 655 in the PIF ATP Rankings. Champion at December’s Next Gen ATP Finals presented by PIF, Fonseca will begin against Frenchman Alexandre Muller. Should Fonseca win that encounter, he could next meet eighth seed Tomas Martin Etcheverry — who the 18-year-old beat in Buenos Aires.",
  "image": "https://www.atptour.com/-/media/images/news/2025/02/15/21/25/zverev-rio-draw-2025.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n    \n\n\n        \u003cp\u003e\u003cspan\u003eRio de Janeiro\u003c/span\u003e\u003c/p\u003e\n    \u003cp\u003eHome favourite Fonseca returns to ATP 500\u003c/p\u003e\n    \u003cp\u003eFebruary 15, 2025\u003c/p\u003e\n\n        \u003cp\u003e\u003cimg src=\"https://www.atptour.com/-/media/images/news/2025/02/15/21/25/zverev-rio-draw-2025.jpg\" alt=\"Alexander Zverev will make his Rio de Janeiro debut.\"/\u003e\n        \u003c/p\u003e\n\n    \u003cdiv\u003e\n        \u003cp\u003eMarcelo Endelli/Getty Images\u003c/p\u003e\n        \u003cp\u003e\u003cspan\u003eAlexander Zverev will make his Rio de Janeiro debut.\u003c/span\u003e\n        \u003cspan\u003eBy ATP Staff\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"https://www.atptour.com/en/players/alexander-zverev/z355/overview\"\u003eAlexander Zverev\u003c/a\u003e will aim for his first title of the season at next week’s \u003ca href=\"https://www.atptour.com/en/tournaments/rio-de-janeiro/6932/overview\"\u003eRio Open presented by Claro\u003c/a\u003e, where the top seed learned his place in the draw Saturday.\u003c/p\u003e\n\u003cp\u003e\nThe \u003ca href=\"https://www.atptour.com/en/tournaments/australian-open/580/overview\"\u003eAustralian Open\u003c/a\u003e finalist, who suffered an early exit during his return to clay in Buenos Aires, will look to rebound at the ATP 500. Zverev, No. 2 in the PIF ATP Rankings, begins his title quest against China’s \u003ca rel=\"noopener noreferrer\" href=\"https://www.atptour.com/en/players/yunchaokete-bu/y09v/overview\" target=\"_blank\"\u003eBuyunchaokete\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca rel=\"noopener noreferrer\" href=\"https://www.protennislive.com/posting/2025/6932/mds.pdf\" target=\"_blank\"\u003eView Draw\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca rel=\"noopener noreferrer\" href=\"https://www.atptour.com/en/apps?utm_source=atp\u0026amp;utm_medium=article\u0026amp;utm_campaign=app_banner\" target=\"_blank\"\u003e\u003cimg src=\"-/media/\n9333ed00493246e6a2ad692fa18710b7.ashx\" alt=\"The Official App Of Tennis | Download ATP WTA Live App\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\nCompeting in just his second tour-level event in South America, Zverev is seeded to meet Chilean \u003ca href=\"https://www.atptour.com/en/players/nicolas-jarry/j551/overview\"\u003eNicolas Jarry\u003c/a\u003e in the quarter-finals, which would be a rematch of last year’s title match at the ATP Masters 1000 event in Rome. Zverev lifted the trophy in Rome and captured another Masters 1000 title later that season in Paris.\u003c/p\u003e\n\u003cp\u003e\nSecond seed \u003ca href=\"https://www.atptour.com/en/players/lorenzo-musetti/m0ej/overview\"\u003eLorenzo Musetti\u003c/a\u003e is seeking his second ATP 500 title and first at any level since 2022. Beginning against a qualifier, the Italian is in the same half as third seed \u003ca href=\"https://www.atptour.com/en/players/alejandro-tabilo/te30/overview\"\u003eAlejandro Tabilo\u003c/a\u003e and defending champion \u003ca href=\"https://www.atptour.com/en/players/sebastian-baez/b0bi/overview\"\u003eSebastian Baez\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\nBrazilian star \u003ca href=\"https://www.atptour.com/en/players/joao-fonseca/f0fv/overview\"\u003eJoao Fonseca\u003c/a\u003e will return to his home tournament, where last year he captured his maiden tour-level win as World No. 655 in the PIF ATP Rankings. Champion at December’s \u003ca href=\"https://www.atptour.com/en/tournaments/next-gen-atp-finals/7696/overview\"\u003eNext Gen ATP Finals presented by PIF\u003c/a\u003e, Fonseca will begin against Frenchman \u003ca href=\"https://www.atptour.com/en/players/alexandre-muller/mp20/overview\"\u003eAlexandre Muller\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003e Should Fonseca win that encounter, he could next meet eighth seed \u003ca href=\"https://www.atptour.com/en/players/tomas-martin-etcheverry/ea24/overview\"\u003eTomas Martin Etcheverry\u003c/a\u003e — who the 18-year-old beat in Buenos Aires.\u003c/p\u003e\n\n    \n\n\n\n\n    \n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
