{
  "id": "b6d39d9f-7621-44cd-a097-3ef25bc735b7",
  "title": "Impressive Raducanu beats Kasatkina in Strasbourg",
  "link": "https://www.bbc.com/sport/tennis/articles/cre9qpny8dyo",
  "description": "Emma Raducanu produces an encouraging display to reach the second round in Strasbourg as she continues to build momentum before the French Open.",
  "author": "",
  "published": "Mon, 19 May 2025 18:05:39 GMT",
  "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
  "categories": null,
  "byline": "Harry Poole",
  "length": 2907,
  "excerpt": "Emma Raducanu produces an encouraging display to reach the second round in Strasbourg as she continues to build momentum before the French Open.",
  "siteName": "BBC Sport",
  "favicon": "https://static.files.bbci.co.uk/core/website/assets/static/icons/touch/sport/touch-icon-512.239d26b83e.png",
  "text": "Emma Raducanu produced an encouraging display to reach the second round in Strasbourg as she continued to build momentum before the French Open.The British number two, who accepted a late wildcard for the tournament, was in fine form in a 6-1 6-3 win over world number 17 Daria Kasatkina.World number 43 Raducanu had not won a set in three previous meetings with Kasatkina but the inconsistent Australian failed to win a single service game.Raducanu will face American Danielle Collins in the last 16 as she continues her preparations for the French Open, which begins on Sunday.\"I'm really proud of my performance - I was very aggressive and I maintained my focus in the second set when it was getting close,\" Raducanu, 22, said afterwards.\"I think I've been building towards this. It's a great feeling.\"As I spend more time on clay I'm beginning to like it more and more. I'm building my relationship with the surface.\"After reaching the Miami Open quarter-finals in March and moving back inside the world's top 50, Raducanu chose to take a \"physical and mental\" break from competitive action.That meant she did not begin her clay court swing until a month later in Madrid.A second-round exit in the Spanish capital was followed by last week's run to the Italian Open fourth round, where she managed to win three clay-court matches in a row for the first time in her career.Victory over Kasatkina was another indication the Briton is hitting her stride at the ideal time before her second French Open campaign begins.The players exchanged breaks of serve in a scrappy start to the match but, after being gifted a second game by Kasatkina, Raducanu took charge.A hold of serve without reply allowed her to grow in confidence and she was soon dictating play with punishing, powerful groundstrokes.Taking full advantage of her opponent's continued struggles on serve, Raducanu reeled off five consecutive games to win her first set in four meetings with Kasatkina.The second set was not straightforward. Raducanu's opening hold of serve proved invaluable as it was followed by a run of seven consecutive breaks, with former world number eight Kasatkina digging in. Raducanu could not hide her delight after unleashing a superb backhand down the line to close in on victory, eventually ending Kasatkina's resistance with her fourth match point.Raducanu reached the second round in her only previous Roland Garros appearance in 2022.The 2021 US Open champion is currently working with Mark Petchey - a former coach of Andy Murray - on an informal basis, having been without a full-time coach since January.Elsewhere on Monday, fellow Briton Harriet Dart was knocked out in the first round of French Open qualifying, losing 6-1 6-2 to Ukrainian 21-year-old Anastasiya Soboleva.Heather Watson and Francesca Jones will begin their bids to join Raducanu, Katie Boulter and Sonay Kartal in the main draw on Tuesday.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ca53/live/64533e50-34d9-11f0-ac8f-578ab9a74773.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eEmma Raducanu produced an encouraging display to reach the second round in Strasbourg as she continued to build momentum before the French Open.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe British number two, who accepted a late wildcard for the tournament, was in fine form in a 6-1 6-3 win over world number 17 Daria Kasatkina.\u003c/p\u003e\u003cp\u003eWorld number 43 Raducanu had not won a set in three previous meetings with Kasatkina but the inconsistent Australian failed to win a single service game.\u003c/p\u003e\u003cp\u003eRaducanu will face American Danielle Collins in the last 16 as she continues her preparations for the French Open, which begins on Sunday.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m really proud of my performance - I was very aggressive and I maintained my focus in the second set when it was getting close,\u0026#34; Raducanu, 22, said afterwards.\u003c/p\u003e\u003cp\u003e\u0026#34;I think I\u0026#39;ve been building towards this. It\u0026#39;s a great feeling.\u003c/p\u003e\u003cp\u003e\u0026#34;As I spend more time on clay I\u0026#39;m beginning to like it more and more. I\u0026#39;m building my relationship with the surface.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAfter reaching the Miami Open quarter-finals in March and moving back inside the world\u0026#39;s top 50, Raducanu chose to take a \u0026#34;physical and mental\u0026#34; break from competitive action.\u003c/p\u003e\u003cp\u003eThat meant she did not begin her clay court swing until a month later in Madrid.\u003c/p\u003e\u003cp\u003eA second-round exit in the Spanish capital was followed by last week\u0026#39;s run to the Italian Open fourth round, where she managed to win three clay-court matches in a row for the first time in her career.\u003c/p\u003e\u003cp\u003eVictory over Kasatkina was another indication the Briton is hitting her stride at the ideal time before her second French Open campaign begins.\u003c/p\u003e\u003cp\u003eThe players exchanged breaks of serve in a scrappy start to the match but, after being gifted a second game by Kasatkina, Raducanu took charge.\u003c/p\u003e\u003cp\u003eA hold of serve without reply allowed her to grow in confidence and she was soon dictating play with punishing, powerful groundstrokes.\u003c/p\u003e\u003cp\u003eTaking full advantage of her opponent\u0026#39;s continued struggles on serve, Raducanu reeled off five consecutive games to win her first set in four meetings with Kasatkina.\u003c/p\u003e\u003cp\u003eThe second set was not straightforward. Raducanu\u0026#39;s opening hold of serve proved invaluable as it was followed by a run of seven consecutive breaks, with former world number eight Kasatkina digging in. \u003c/p\u003e\u003cp\u003eRaducanu could not hide her delight after unleashing a superb backhand down the line to close in on victory, eventually ending Kasatkina\u0026#39;s resistance with her fourth match point.\u003c/p\u003e\u003cp\u003eRaducanu reached the second round in her only previous Roland Garros appearance in 2022.\u003c/p\u003e\u003cp\u003eThe 2021 US Open champion is currently working with Mark Petchey - a former coach of Andy Murray - on an informal basis, having been without a full-time coach since January.\u003c/p\u003e\u003cp\u003eElsewhere on Monday, fellow Briton Harriet Dart was knocked out in the first round of French Open qualifying, losing 6-1 6-2 to Ukrainian 21-year-old Anastasiya Soboleva.\u003c/p\u003e\u003cp\u003eHeather Watson and Francesca Jones will begin their bids to join Raducanu, Katie Boulter and Sonay Kartal in the main draw on Tuesday.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-05-19T18:05:39.525Z",
  "modifiedTime": null
}
