{
  "id": "c8b98ff9-b468-4a4f-8b23-14c537a7eaee",
  "title": "'It's a struggle' - Djokovic loses again",
  "link": "https://www.bbc.com/sport/tennis/articles/crknjg66k18o",
  "description": "Novak Djokovic suffers his third straight defeat as Dutch lucky loser Botic van de Zandschulp pulls off a shock win.",
  "author": "",
  "published": "Sun, 09 Mar 2025 06:22:47 GMT",
  "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
  "categories": null,
  "byline": "Jonathan Jurejko",
  "length": 3311,
  "excerpt": "Novak Djokovic suffers his third straight defeat as Dutch lucky loser Botic van de Zandschulp pulls off a shock win.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Novak Djokovic suffered his third straight defeat as Dutch lucky loser Botic van de Zandschulp pulled off a shock victory in the second round at Indian Wells.The seventh seed lost 6-2 3-6 6-1 to the world number 85 in a subdued performance.Since memorably beating Carlos Alcaraz in the Australian Open quarter-finals, the 37-year-old has lost to Alexander Zverev in the semi-finals in Melbourne, Matteo Berrettini in Doha and now Van de Zandschulp.The 24-time Grand Slam champion won only one title last year - albeit the elusive Olympic gold he had always coveted - and failed to win a major for the first time since 2017.\"Things are obviously different for me in the last couple of years. I've been struggling to play on the desired level,\" said the Serb.\"Every now and then, I have couple good tournaments, but mostly it's really a challenge. It's a struggle for me.\"Djokovic was bidding to create more history with a standalone record sixth men's title in Indian Wells.But, having been given a first-round bye, he fell in his opening match after producing a string of ugly mistakes.In a performance well below his high standards, Djokovic made 37 unforced errors and only hit 16 winners to mitigate the damage.\"Congratulations to my opponent. It was just a bad day in the office, I guess,\" said Djokovic, who has not gone beyond the third round in his past four Indian Wells appearances.It was the former world number one's second successive exit at the hands of a lucky loser, having lost to Italy's Luca Naldi last year.Djokovic's return of serve - one of the hallmarks of his unparalleled success - was particularly poor against Van de Zandschulp, who swamped the Serb's second serve to convert five of eight break point opportunities.He recovered from a poor start and looked as if he had settled down by quickly levelling the match.But more \"awful\" mistakes, which he put down to a lack of rhythm caused by higher bouncing balls on the recently-changed courts, allowed Van de Zandschulp to take control of the decider.Even the return of Britain's Andy Murray to his coaching team could not prevent a below-par performance.The pair, who are planning to head together to the Miami Open which follows Indian Wells, will be hoping Djokovic's problems are not deep-rooted.Time is clearly catching up with Djokovic, who turns 38 in May, but his performances in Melbourne showed he can still beat most opponents if he is fully fit and motivated.Van de Zandschulp, who lost in qualifying before getting a reprieve after withdrawals from the main draw, is growing accustomed to causing upsets.Last year, the powerful Dutchman knocked Carlos Alcaraz out of the US Open before ending Rafael Nadal's career in his farewell tournament at the Davis Cup. Both of those victories demonstrated his ability to maintain his composure when chasing a big scalp.The same quality was shown again as Van de Zandschulp won eight of the final 10 games having been a double break down in the second set.\"I kept my cool during the whole match,\" he said. \"I need to be cool against the big guys.\"The second set was tough but I did well getting back to 5-3 and turning the momentum back.\"Meanwhile, Spanish second seed Alcaraz started his defence of the men's title with a routine 6-4 6-2 win against French opponent Quentin Halys.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ee40/live/13b2f580-fc85-11ef-94c2-43da9beddb89.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eNovak Djokovic suffered his third straight defeat as Dutch lucky loser Botic van de Zandschulp pulled off a shock victory in the second round at Indian Wells.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe seventh seed lost 6-2 3-6 6-1 to the world number 85 in a subdued performance.\u003c/p\u003e\u003cp\u003eSince memorably beating Carlos Alcaraz in the Australian Open quarter-finals, the 37-year-old has lost to Alexander Zverev in the semi-finals in Melbourne, Matteo Berrettini in Doha and now Van de Zandschulp.\u003c/p\u003e\u003cp\u003eThe 24-time Grand Slam champion won only one title last year - albeit the elusive Olympic gold he had always coveted - and failed to win a major for the first time since 2017.\u003c/p\u003e\u003cp\u003e\u0026#34;Things are obviously different for me in the last couple of years. I\u0026#39;ve been struggling to play on the desired level,\u0026#34; said the Serb.\u003c/p\u003e\u003cp\u003e\u0026#34;Every now and then, I have couple good tournaments, but mostly it\u0026#39;s really a challenge. It\u0026#39;s a struggle for me.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eDjokovic was bidding to create more history with a standalone record sixth men\u0026#39;s title in Indian Wells.\u003c/p\u003e\u003cp\u003eBut, having been given a first-round bye, he fell in his opening match after producing a string of ugly mistakes.\u003c/p\u003e\u003cp\u003eIn a performance well below his high standards, Djokovic made 37 unforced errors and only hit 16 winners to mitigate the damage.\u003c/p\u003e\u003cp\u003e\u0026#34;Congratulations to my opponent. It was just a bad day in the office, I guess,\u0026#34; said Djokovic, who has not gone beyond the third round in his past four Indian Wells appearances.\u003c/p\u003e\u003cp\u003eIt was the former world number one\u0026#39;s second successive exit at the hands of a lucky loser, having lost to Italy\u0026#39;s Luca Naldi last year.\u003c/p\u003e\u003cp\u003eDjokovic\u0026#39;s return of serve - one of the hallmarks of his unparalleled success - was particularly poor against Van de Zandschulp, who swamped the Serb\u0026#39;s second serve to convert five of eight break point opportunities.\u003c/p\u003e\u003cp\u003eHe recovered from a poor start and looked as if he had settled down by quickly levelling the match.\u003c/p\u003e\u003cp\u003eBut more \u0026#34;awful\u0026#34; mistakes, which he put down to a lack of rhythm caused by higher bouncing balls on the recently-changed courts, allowed Van de Zandschulp to take control of the decider.\u003c/p\u003e\u003cp\u003eEven the return of Britain\u0026#39;s Andy Murray to his coaching team could not prevent a below-par performance.\u003c/p\u003e\u003cp\u003eThe pair, who are planning to head together to the Miami Open which follows Indian Wells, will be hoping Djokovic\u0026#39;s problems are not deep-rooted.\u003c/p\u003e\u003cp\u003eTime is clearly catching up with Djokovic, who turns 38 in May, but his performances  in Melbourne showed he can still beat most opponents if he is fully fit and motivated.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eVan de Zandschulp, who lost in qualifying before getting a reprieve after withdrawals from the main draw, is growing accustomed to causing upsets.\u003c/p\u003e\u003cp\u003eLast year, the powerful Dutchman knocked Carlos Alcaraz out of the US Open before ending Rafael Nadal\u0026#39;s career in his farewell tournament at the Davis Cup. \u003c/p\u003e\u003cp\u003eBoth of those victories demonstrated his ability to maintain his composure when chasing a big scalp.\u003c/p\u003e\u003cp\u003eThe same quality was shown again as Van de Zandschulp won eight of the final 10 games having been a double break down in the second set.\u003c/p\u003e\u003cp\u003e\u0026#34;I kept my cool during the whole match,\u0026#34; he said. \u0026#34;I need to be cool against the big guys.\u003c/p\u003e\u003cp\u003e\u0026#34;The second set was tough but I did well getting back to 5-3 and turning the momentum back.\u0026#34;\u003c/p\u003e\u003cp\u003eMeanwhile, Spanish second seed Alcaraz started his defence of the men\u0026#39;s title with a routine 6-4 6-2 win against French opponent Quentin Halys.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-03-09T06:22:47.358Z",
  "modifiedTime": null
}
