{
  "id": "e3cf24f1-768d-4627-9a12-2518061c7708",
  "title": "Shang unchanged ahead of Jeddah bow: 'I'm still the same happy kid'",
  "link": "https://www.atptour.com/en/news/shang-jeddah-2024-media-day",
  "description": "Shang Juncheng's success has helped fuel a tennis boom in China. The first player from his nation to compete at the Next Gen ATP Finals presented by PIF, the 19-year-old is now eager to be a part of the game's growth in Saudi Arabia.  \"This event, they've had so many great players in the past and a lot of good champions,\" he said. \"So I think coming here is really special, especially coming into Jeddah. Maybe a couple of years ago there wasn't too much tennis action going on, but now we have the WTA Finals and the Next Gen Finals here, so I'm really looking forward to it.\" [ATP APP] Shang enters Jeddah as a member of the Top 50 in the PIF ATP Rankings, having reached a career-high of No. 47 in October after winning his first tour-level title in Chengdu. He lost just one set in that run at the ATP 250 and beat Lorenzo Musetti in the final. Despite his quick rise up the rankings — and his more than $1 million in prize money this season — Shang remains the same person as his game evolves. \"I think I'm still the same happy kid,\" he said. \"I try to be happy on the court, try to learn every day what I can do better what needs to be improved. I think it's just a little bit of a challenge each day to make me a better player.\" Shang posted a 5-3 record at the Grand Slams this season (he bowed out in qualifying at Roland Garros) and reached the main-draw second round at all four ATP Masters 1000s at which he competed. Apart from his Chengdu title, he singled out his performance at the majors as a season highlight and took particular pride in completing the year without injury or illness. Ironically, he had an eye infection early in the offseason, but he still enjoyed some downtime on holiday in Dubai, complete with shopping and beach time. In recent months, Shang has also started a gluten-free diet, part of an overall effort to live a more professional lifestyle. Shang's parents are also key influences. His father, Yi, was a professional football player; his mother, Na, was a world champion table tennis player. \"I think the mentality is the same, that you go on court, you try 100 per cent,\" he said about taking lessons from their sporting careers. \"That's what they've been telling me all the time: You've got to be a competitor, but at the same time you've got to know your values — that maybe sometimes winning is not the most important thing. More to enjoy the competition and enjoy the people watching you. I think at the end of the day it's [the people] who are next to you that's the most important thing.\" While Shang and his fellow Jeddah competitors continue to learn about life as professional tennis players, their experience at the Next Gen ATP Finals provides a rare chance to compete exclusively amongst peers. \"The eight of us here, we know each other inside-out. We grew up all together, we're all around the same age,\" he said. \"It's really special because on Tour you play the older guys, not people your age. So coming here, I think it's some sort of pressure that I'm playing kids that are like me, my age.\" [NEWSLETTER FORM]",
  "author": "",
  "published": "Tue, 17 Dec 2024 22:09:00 Z",
  "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
  "categories": [
    "Next Gen ATP Finals",
    "Juncheng Shang",
    "2024"
  ],
  "byline": "",
  "length": 3336,
  "excerpt": "China's Shang Juncheng has not let his success this season change him as a person. He enters Jeddah inside the Top 50 of the PIF ATP Rankings, having won his first tour-level title this season on home soil in Chengdu.",
  "siteName": "ATP Tour",
  "favicon": "",
  "text": "Next Gen ATP Finals Chinese star first player from his nation to compete at youth showcase December 17, 2024 Corinne Dubreuil/ATP Tour Shang Juncheng opens his Jeddah campaign Wednesday against Luca Van Assche. By ATP Staff Shang Juncheng's success has helped fuel a tennis boom in China. The first player from his nation to compete at the Next Gen ATP Finals presented by PIF, the 19-year-old is now eager to be a part of the game's growth in Saudi Arabia.  \"This event, they've had so many great players in the past and a lot of good champions,\" he said. \"So I think coming here is really special, especially coming into Jeddah. Maybe a couple of years ago there wasn't too much tennis action going on, but now we have the WTA Finals and the Next Gen Finals here, so I'm really looking forward to it.\" Shang enters Jeddah as a member of the Top 50 in the PIF ATP Rankings, having reached a career-high of No. 47 in October after winning his first tour-level title in Chengdu. He lost just one set in that run at the ATP 250 and beat Lorenzo Musetti in the final. Despite his quick rise up the rankings — and his more than $1 million in prize money this season — Shang remains the same person as his game evolves. \"I think I'm still the same happy kid,\" he said. \"I try to be happy on the court, try to learn every day what I can do better what needs to be improved. I think it's just a little bit of a challenge each day to make me a better player.\" Shang posted a 5-3 record at the Grand Slams this season (he bowed out in qualifying at Roland Garros) and reached the main-draw second round at all four ATP Masters 1000s at which he competed. Apart from his Chengdu title, he singled out his performance at the majors as a season highlight and took particular pride in completing the year without injury or illness. Ironically, he had an eye infection early in the offseason, but he still enjoyed some downtime on holiday in Dubai, complete with shopping and beach time. In recent months, Shang has also started a gluten-free diet, part of an overall effort to live a more professional lifestyle. Shang's parents are also key influences. His father, Yi, was a professional football player; his mother, Na, was a world champion table tennis player. \"I think the mentality is the same, that you go on court, you try 100 per cent,\" he said about taking lessons from their sporting careers. \"That's what they've been telling me all the time: You've got to be a competitor, but at the same time you've got to know your values — that maybe sometimes winning is not the most important thing. More to enjoy the competition and enjoy the people watching you. I think at the end of the day it's [the people] who are next to you that's the most important thing.\" While Shang and his fellow Jeddah competitors continue to learn about life as professional tennis players, their experience at the Next Gen ATP Finals provides a rare chance to compete exclusively amongst peers. \"The eight of us here, we know each other inside-out. We grew up all together, we're all around the same age,\" he said. \"It's really special because on Tour you play the older guys, not people your age. So coming here, I think it's some sort of pressure that I'm playing kids that are like me, my age.\"",
  "image": "https://www.atptour.com/-/media/images/news/2024/12/17/20/28/shang-jeddah-preview-2024.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n    \n\n\n        \u003cp\u003e\u003cspan\u003eNext Gen ATP Finals\u003c/span\u003e\u003c/p\u003e\n    \u003cp\u003eChinese star first player from his nation to compete at youth showcase\u003c/p\u003e\n    \u003cp\u003eDecember 17, 2024\u003c/p\u003e\n\n        \u003cp\u003e\u003cimg src=\"https://www.atptour.com/-/media/images/news/2024/12/17/20/28/shang-jeddah-preview-2024.jpg\" alt=\"Shang Juncheng opens his Jeddah campaign Wednesday against Luca Van Assche.\"/\u003e\n        \u003c/p\u003e\n\n    \u003cdiv\u003e\n        \u003cp\u003eCorinne Dubreuil/ATP Tour\u003c/p\u003e\n        \u003cp\u003e\u003cspan\u003eShang Juncheng opens his Jeddah campaign Wednesday against Luca Van Assche.\u003c/span\u003e\n        \u003cspan\u003eBy ATP Staff\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eShang Juncheng\u0026#39;s success has helped fuel a tennis boom in China. The first player from his nation to compete at the \u003ca href=\"https://www.atptour.com/en/tournaments/next-gen-atp-finals/7696/overview\"\u003eNext Gen ATP Finals presented by PIF\u003c/a\u003e, the 19-year-old is now eager to be a part of the game\u0026#39;s growth in Saudi Arabia. \u003c/p\u003e\n\u003cp\u003e\u0026#34;This event, they\u0026#39;ve had so many great players in the past and a lot of good champions,\u0026#34; he said. \u0026#34;So I think coming here is really special, especially coming into Jeddah. Maybe a couple of years ago there wasn\u0026#39;t too much tennis action going on, but now we have the WTA Finals and the Next Gen Finals here, so I\u0026#39;m really looking forward to it.\u0026#34;\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca rel=\"noopener noreferrer\" href=\"https://www.atptour.com/en/apps?utm_source=atp\u0026amp;utm_medium=article\u0026amp;utm_campaign=app_banner\" target=\"_blank\"\u003e\u003cimg src=\"-/media/\n9333ed00493246e6a2ad692fa18710b7.ashx\" alt=\"The Official App Of Tennis | Download ATP WTA Live App\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eShang enters Jeddah as a member of the Top 50 in the PIF ATP Rankings, having reached a career-high of No. 47 in October after winning his first tour-level title in Chengdu. He lost just one set in that run at the ATP 250 and beat \u003ca href=\"https://www.atptour.com/en/players/lorenzo-musetti/m0ej/overview\"\u003eLorenzo Musetti\u003c/a\u003e in the final. Despite his quick rise up the rankings — and his more than $1 million in prize money this season — Shang remains the same person as his game evolves.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I think I\u0026#39;m still the same happy kid,\u0026#34; he said. \u0026#34;I try to be happy on the court, try to learn every day what I can do better what needs to be improved. I think it\u0026#39;s just a little bit of a challenge each day to make me a better player.\u0026#34;\u003c/p\u003e\n\u003cp\u003eShang posted a 5-3 record at the Grand Slams this season (he bowed out in qualifying at \u003ca href=\"https://www.atptour.com/en/tournaments/roland-garros/520/overview\"\u003eRoland Garros\u003c/a\u003e) and reached the main-draw second round at all four ATP Masters 1000s at which he competed. Apart from his Chengdu title, he singled out his performance at the majors as a season highlight and took particular pride in completing the year without injury or illness.\u003c/p\u003e\n\u003cp\u003eIronically, he had an eye infection early in the offseason, but he still enjoyed some downtime on holiday in Dubai, complete with shopping and beach time. In recent months, Shang has also started a gluten-free diet, part of an overall effort to live a more professional lifestyle.\u003c/p\u003e\n\n\u003cp\u003eShang\u0026#39;s parents are also key influences. His father, Yi, was a professional football player; his mother, Na, was a world champion table tennis player.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I think the mentality is the same, that you go on court, you try 100 per cent,\u0026#34; he said about taking lessons from their sporting careers. \u0026#34;That\u0026#39;s what they\u0026#39;ve been telling me all the time: You\u0026#39;ve got to be a competitor, but at the same time you\u0026#39;ve got to know your values — that maybe sometimes winning is not the most important thing. More to enjoy the competition and enjoy the people watching you. I think at the end of the day it\u0026#39;s [the people] who are next to you that\u0026#39;s the most important thing.\u0026#34;\u003c/p\u003e\n\u003cp\u003eWhile Shang and his fellow Jeddah competitors continue to learn about life as professional tennis players, their experience at the Next Gen ATP Finals provides a rare chance to compete exclusively amongst peers.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The eight of us here, we know each other inside-out. We grew up all together, we\u0026#39;re all around the same age,\u0026#34; he said. \u0026#34;It\u0026#39;s really special because on Tour you play the older guys, not people your age. So coming here, I think it\u0026#39;s some sort of pressure that I\u0026#39;m playing kids that are like me, my age.\u0026#34;\u003c/p\u003e\n\n    \n\n\n\n\n    \n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
