{
  "id": "f13b9246-7828-44c3-a384-6bffaff885b6",
  "title": "This is Ugo Humbert: An ascendant star \u0026 a musician",
  "link": "https://www.atptour.com/en/news/humbert-monte-carlo-2024-feature",
  "description": "Editor's Note: This story was originally published on 12 April 2024. At the 2024 Rolex Paris Masters, Frenchman Ugo Humbert thrilled his home crowd with a memorable upset win against Carlos Alcaraz.  The top of the PIF ATP Live Race To Turin is littered with the sport’s biggest stars. Of the eight players currently holding a qualification position for the Nitto ATP Finals, seven have competed in the season finale and the other, fifth-placed Alex de Minaur, is in the world’s Top 10. The player in ninth place is Rolex Monte-Carlo Masters quarter-finalist Ugo Humbert. The Frenchman, very much in contention for a spot in Turin, has quietly been playing the best tennis of his career and is even ahead of 12th-placed Novak Djokovic in the Live Race. “I saw that and it was really, really funny. At the end of Dubai, my coach said ‘It's funny, you are seventh in the race and Djokovic is eighth’. I was proud!” Humbert told ATPTour.com. “For me it's more and more exciting because my goal is that I would like to reach the Top 10. So I am trying to find the details to achieve this goal.” So far this season Humbert has won titles in Marseille and Dubai. The lefty’s record is 18-5 and he has only lost two matches in straight sets. His formula for success is no secret. Humbert is performing better on both serve and return than he has on average throughout his career. According to Infosys ATP Stats, the French No. 1 has made improvements this year in service games won (87%), buoyed by a higher rate of break points saved (68%) and second-serve points won (58%). He has also won a higher percentage of return games (21%), in part helped by a bump in second-serve return success (53%). The 6’2” lefty has a powerful game. Humbert hits a flat ball and is unafraid of standing on top of the baseline to put pressure on his opponent. His breakthrough under coach Jeremy Chardy, once the No. 25 player in the PIF ATP Rankings, has been more mental than technical. He has been working hard at staying calm under pressure. “Try to stay calm and really, really present on this point, on each ball,” Humbert said. “I try to repeat things that I'm confident in my choices [with] to have more chance to win the point.” [ATP APP] Staying calm while trying to make progress has been part of Humbert’s life since he was a child, and not just on the tennis court. When the Frenchman was five years old, his parents had him begin taking piano lessons. At 12, when he moved to Paris train under the French Tennis Federation, Humbert took his piano with him and played it for an hour a day. Listening to Humbert play the piano today is a thrilling experience — passers-by would think he is a musician, not a tennis player. But for the 25-year-old, one came much easier than the other. “Tennis for sure because it was my passion. Piano, I didn't want to play at the beginning, but it was my parents who forced me to play,” Humbert said, cracking a laugh. “So for two or three years, of course I was terrible because you cannot play anything. And after three or four years, when I could do something, some melodies, it was a little bit better.” Humbert also began learning the guitar at age 10, but stopped for more than five years. About two years ago, he began playing it more often and has been travelling with a Silent Guitar. Fans have enjoyed watching social media posts in which he has played the guitar and his girlfriend, WTA player Tessah Andrianjafitrimo, has sung. “He likes playing the blues, rock and jazz music. He loves the piano, the guitar. He loves this kind of music,” Andrianjafitrimo said. “I think he has fun in it. He has so much fun, so he can relax.” Humbert added: “For me, it's more fun to play piano than guitar because I'm better at piano, so it's easier to handle a little bit. But it's nice to play some music, to think about something different, to be not in tennis every time.” Humbert’s aggressive, front-foot game is the opposite of his laid-back personality. The Frenchman explained that even though his game appears a certain way, his mindset is not much different than when he is sitting at the piano. “In tennis, okay, I play strong, fast. But inside I try in my mind to be really calm and really cool and really focus on what I have to do. And piano for me, it's exactly the same,” Humbert said. “Even if I play something like Mozart, Beethoven, a classical song, it's exactly the same. Mentally I have to be calm and focused on what I have to do.” Photo: ATP Tour/Getty Images That focus has helped Humbert climb into Nitto ATP Finals contention and within striking range of the world’s Top 10. Former World No. 10 Lucas Pouille has been happy to see the recent surge from his countryman. The 30-year-old believes Humbert still has room to grow, too. “In his game, no limits. I think he has no limits and mentally as well,” Pouille said. “Two years ago he was feeling not so well. He went back in the rankings, outside of the Top 100. Last year, this time of year [in March], he was playing a Challenger in Pau. “It's always great to see a French player coming back to the top. And I think we've been used to having those kinds of players in the Top 10, Top 20, Top 30, Top 100. We had so many that it's important to still have some players like this.” Humbert is at No. 13 in the PIF ATP Live Rankings and Pouille explained his feeling that “Top 15 is the beginning for him”. “Hopefully he can perform well in the Grand Slams soon. That's where the big points are. That's where he still hasn't played as well as he wants,” Pouille said. “But I'm sure it will come soon because of the confidence he has now. I think he is one step better than he used to be.” .videoWrapper { position: relative; padding-bottom: 56.25%; /* 16:9 */ padding-top: 25px; height: 0; } .videoWrapper iframe { position: absolute; top: 0; left: 0; width: 100%; height: 100%; } In a way Humbert’s ascent has been similar to his increasing comfort as a musician. Step by step he has continued to work and learn. Now, he is one of the best tennis players in the world. “I think [it takes] time. You started when you are super young, and you started to play some tournaments. You are better and better with pressure,” Humbert said. “For me when you work hard, and you feel you are better and better and ready to go in competition, you feel less pressure.” THIS IS TENNIS - ATP Tour 2024 campaign is all about reaching out to fans celebrating, championing and showcasing the very best from tennis both on and off court. Check out our hero brand film. [NEWSLETTER FORM]",
  "author": "",
  "published": "Thu, 31 Oct 2024 21:02:00 Z",
  "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
  "categories": [
    "This Is Tennis",
    "Player Features",
    "Monte-Carlo",
    "2024",
    "Ugo Humbert"
  ],
  "byline": "",
  "length": 6602,
  "excerpt": "Learn more about Frenchman Ugo Humbert, one of the fastest-rising stars on the ATP Tour who off the court enjoys playing music, especially the piano and the guitar.",
  "siteName": "ATP Tour",
  "favicon": "",
  "text": "This Is Tennis Learn more about the Frenchman on and off the court October 31, 2024 Tessah Andrianjafitrimo Ugo Humbert enjoys playing the guitar and the piano. By Andrew Eichenholz Editor's Note: This story was originally published on 12 April 2024. At the 2024 Rolex Paris Masters, Frenchman Ugo Humbert thrilled his home crowd with a memorable upset win against Carlos Alcaraz.  The top of the PIF ATP Live Race To Turin is littered with the sport’s biggest stars. Of the eight players currently holding a qualification position for the Nitto ATP Finals, seven have competed in the season finale and the other, fifth-placed Alex de Minaur, is in the world’s Top 10. The player in ninth place is Rolex Monte-Carlo Masters quarter-finalist Ugo Humbert. The Frenchman, very much in contention for a spot in Turin, has quietly been playing the best tennis of his career and is even ahead of 12th-placed Novak Djokovic in the Live Race. “I saw that and it was really, really funny. At the end of Dubai, my coach said ‘It's funny, you are seventh in the race and Djokovic is eighth’. I was proud!” Humbert told ATPTour.com. “For me it's more and more exciting because my goal is that I would like to reach the Top 10. So I am trying to find the details to achieve this goal.” So far this season Humbert has won titles in Marseille and Dubai. The lefty’s record is 18-5 and he has only lost two matches in straight sets. His formula for success is no secret. Humbert is performing better on both serve and return than he has on average throughout his career. According to Infosys ATP Stats, the French No. 1 has made improvements this year in service games won (87%), buoyed by a higher rate of break points saved (68%) and second-serve points won (58%). He has also won a higher percentage of return games (21%), in part helped by a bump in second-serve return success (53%). The 6’2” lefty has a powerful game. Humbert hits a flat ball and is unafraid of standing on top of the baseline to put pressure on his opponent. His breakthrough under coach Jeremy Chardy, once the No. 25 player in the PIF ATP Rankings, has been more mental than technical. He has been working hard at staying calm under pressure. “Try to stay calm and really, really present on this point, on each ball,” Humbert said. “I try to repeat things that I'm confident in my choices [with] to have more chance to win the point.” Staying calm while trying to make progress has been part of Humbert’s life since he was a child, and not just on the tennis court. When the Frenchman was five years old, his parents had him begin taking piano lessons. At 12, when he moved to Paris train under the French Tennis Federation, Humbert took his piano with him and played it for an hour a day. Listening to Humbert play the piano today is a thrilling experience — passers-by would think he is a musician, not a tennis player. But for the 25-year-old, one came much easier than the other. “Tennis for sure because it was my passion. Piano, I didn't want to play at the beginning, but it was my parents who forced me to play,” Humbert said, cracking a laugh. “So for two or three years, of course I was terrible because you cannot play anything. And after three or four years, when I could do something, some melodies, it was a little bit better.” Humbert also began learning the guitar at age 10, but stopped for more than five years. About two years ago, he began playing it more often and has been travelling with a Silent Guitar. Fans have enjoyed watching social media posts in which he has played the guitar and his girlfriend, WTA player Tessah Andrianjafitrimo, has sung. “He likes playing the blues, rock and jazz music. He loves the piano, the guitar. He loves this kind of music,” Andrianjafitrimo said. “I think he has fun in it. He has so much fun, so he can relax.” Humbert added: “For me, it's more fun to play piano than guitar because I'm better at piano, so it's easier to handle a little bit. But it's nice to play some music, to think about something different, to be not in tennis every time.” Humbert’s aggressive, front-foot game is the opposite of his laid-back personality. The Frenchman explained that even though his game appears a certain way, his mindset is not much different than when he is sitting at the piano. “In tennis, okay, I play strong, fast. But inside I try in my mind to be really calm and really cool and really focus on what I have to do. And piano for me, it's exactly the same,” Humbert said. “Even if I play something like Mozart, Beethoven, a classical song, it's exactly the same. Mentally I have to be calm and focused on what I have to do.” Photo: ATP Tour/Getty Images That focus has helped Humbert climb into Nitto ATP Finals contention and within striking range of the world’s Top 10. Former World No. 10 Lucas Pouille has been happy to see the recent surge from his countryman. The 30-year-old believes Humbert still has room to grow, too. “In his game, no limits. I think he has no limits and mentally as well,” Pouille said. “Two years ago he was feeling not so well. He went back in the rankings, outside of the Top 100. Last year, this time of year [in March], he was playing a Challenger in Pau. “It's always great to see a French player coming back to the top. And I think we've been used to having those kinds of players in the Top 10, Top 20, Top 30, Top 100. We had so many that it's important to still have some players like this.” Humbert is at No. 13 in the PIF ATP Live Rankings and Pouille explained his feeling that “Top 15 is the beginning for him”. “Hopefully he can perform well in the Grand Slams soon. That's where the big points are. That's where he still hasn't played as well as he wants,” Pouille said. “But I'm sure it will come soon because of the confidence he has now. I think he is one step better than he used to be.” In a way Humbert’s ascent has been similar to his increasing comfort as a musician. Step by step he has continued to work and learn. Now, he is one of the best tennis players in the world. “I think [it takes] time. You started when you are super young, and you started to play some tournaments. You are better and better with pressure,” Humbert said. “For me when you work hard, and you feel you are better and better and ready to go in competition, you feel less pressure.” THIS IS TENNIS - ATP Tour 2024 campaign is all about reaching out to fans celebrating, championing and showcasing the very best from tennis both on and off court. Check out our hero brand film.",
  "image": "https://www.atptour.com/-/media/images/news/2024/04/12/02/01/humbert-guitar-this-is-tennis-april-2024.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n    \n\n\n        \u003cp\u003e\u003cspan\u003eThis Is Tennis\u003c/span\u003e\u003c/p\u003e\n    \u003cp\u003eLearn more about the Frenchman on and off the court\u003c/p\u003e\n    \u003cp\u003eOctober 31, 2024\u003c/p\u003e\n\n        \u003cp\u003e\u003cimg src=\"https://www.atptour.com/-/media/images/news/2024/04/12/02/01/humbert-guitar-this-is-tennis-april-2024.jpg\" alt=\"Ugo Humbert enjoys playing the guitar and the piano.\"/\u003e\n        \u003c/p\u003e\n\n    \u003cdiv\u003e\n        \u003cp\u003eTessah Andrianjafitrimo\u003c/p\u003e\n        \u003cp\u003e\u003cspan\u003eUgo Humbert enjoys playing the guitar and the piano.\u003c/span\u003e\n        \u003cspan\u003eBy Andrew Eichenholz\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\u003cem\u003eEditor\u0026#39;s Note: This story was originally published on 12 April 2024. At the 2024 \u003ca href=\"https://www.atptour.com/en/tournaments/paris/352/overview\"\u003eRolex Paris Masters\u003c/a\u003e, Frenchman \u003ca href=\"https://www.atptour.com/en/players/ugo-humbert/hh26/overview\"\u003eUgo Humbert\u003c/a\u003e thrilled his home crowd with a memorable upset win against \u003ca href=\"https://www.atptour.com/en/players/carlos-alcaraz/a0e2/overview\"\u003eCarlos Alcaraz\u003c/a\u003e.\u003c/em\u003e \u003c/p\u003e\n\u003cp\u003eThe top of the PIF ATP Live Race To Turin is littered with the sport’s biggest stars. Of the eight players currently holding a qualification position for the \u003ca href=\"https://www.atptour.com/en/tournaments/nitto-atp-finals/605/overview\"\u003eNitto ATP Finals\u003c/a\u003e, seven have competed in the season finale and the other, fifth-placed \u003ca href=\"https://www.atptour.com/en/players/alex-de-minaur/dh58/overview\"\u003eAlex de Minaur\u003c/a\u003e, is in the world’s Top 10.\u003c/p\u003e\n\u003cp\u003eThe player in ninth place is \u003ca href=\"https://www.atptour.com/en/tournaments/monte-carlo/410/overview\"\u003eRolex Monte-Carlo Masters\u003c/a\u003e quarter-finalist \u003ca href=\"https://www.atptour.com/en/players/ugo-humbert/hh26/overview\"\u003eUgo Humbert\u003c/a\u003e. The Frenchman, very much in contention for a spot in Turin, has quietly been playing the best tennis of his career and is even ahead of 12th-placed \u003ca href=\"https://www.atptour.com/en/players/novak-djokovic/d643/overview\"\u003eNovak Djokovic\u003c/a\u003e in the Live Race.\u003c/p\u003e\n\u003cp\u003e“I saw that and it was really, really funny. At the end of Dubai, my coach said ‘It\u0026#39;s funny, you are seventh in the race and Djokovic is eighth’. I was proud!” Humbert told ATPTour.com. “For me it\u0026#39;s more and more exciting because my goal is that I would like to reach the Top 10. So I am trying to find the details to achieve this goal.”\u003c/p\u003e\n\u003cp\u003eSo far this season Humbert has won titles in Marseille and Dubai. The lefty’s record is 18-5 and he has only lost two matches in straight sets.\u003c/p\u003e\n\u003cp\u003eHis formula for success is no secret. Humbert is performing better on both serve and return than he has on average throughout his career. \u003c/p\u003e\n\u003cp\u003eAccording to Infosys ATP Stats, the French No. 1 has made improvements this year in service games won (87%), buoyed by a higher rate of break points saved (68%) and second-serve points won (58%). He has also won a higher percentage of return games (21%), in part helped by a bump in second-serve return success (53%).\u003c/p\u003e\n\u003cp\u003eThe 6’2” lefty has a powerful game. Humbert hits a flat ball and is unafraid of standing on top of the baseline to put pressure on his opponent. His breakthrough under coach \u003ca href=\"https://www.atptour.com/en/players/jeremy-chardy/ca12/overview\"\u003eJeremy Chardy\u003c/a\u003e, once the No. 25 player in the PIF ATP Rankings, has been more mental than technical. He has been working hard at staying calm under pressure.\u003c/p\u003e\n\u003cp\u003e“Try to stay calm and really, really present on this point, on each ball,” Humbert said. “I try to repeat things that I\u0026#39;m confident in my choices [with] to have more chance to win the point.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca rel=\"noopener noreferrer\" href=\"https://www.atptour.com/en/apps?utm_source=atp\u0026amp;utm_medium=article\u0026amp;utm_campaign=app_banner\" target=\"_blank\"\u003e\u003cimg src=\"-/media/\n9333ed00493246e6a2ad692fa18710b7.ashx\" alt=\"The Official App Of Tennis | Download ATP WTA Live App\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eStaying calm while trying to make progress has been part of Humbert’s life since he was a child, and not just on the tennis court. When the Frenchman was five years old, his parents had him begin taking piano lessons.\u003c/p\u003e\n\u003cp\u003eAt 12, when he moved to Paris train under the French Tennis Federation, Humbert took his piano with him and played it for an hour a day. \u003ca rel=\"noopener noreferrer\" href=\"https://www.instagram.com/p/Cmiym8njbWc/\" target=\"_blank\"\u003eListening to Humbert play the piano today\u003c/a\u003e is a thrilling experience — passers-by would think \u003ca rel=\"noopener noreferrer\" href=\"https://www.instagram.com/p/CRCtEqXgjAz/\" target=\"_blank\"\u003ehe is a musician\u003c/a\u003e, not a tennis player.\u003c/p\u003e\n\u003cp\u003eBut for the 25-year-old, one came much easier than the other.\u003c/p\u003e\n\u003cp\u003e“Tennis for sure because it was my passion. Piano, I didn\u0026#39;t want to play at the beginning, but it was my parents who forced me to play,” Humbert said, cracking a laugh. “So for two or three years, of course I was terrible because you cannot play anything. And after three or four years, when I could do something, some melodies, it was a little bit better.”\u003c/p\u003e\n\n\u003cp\u003e\n\u003ciframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/WocXrkNSIho?si=WfBlEjxYUAYVws7_\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\n\u003cp\u003eHumbert also began learning the guitar at age 10, but stopped for more than five years. About two years ago, he began playing it more often and has been travelling with a Silent Guitar. Fans have enjoyed watching social media posts in which he has played the guitar and his girlfriend, WTA player Tessah Andrianjafitrimo, has sung.\u003c/p\u003e\n\u003cp\u003e“He likes playing the blues, rock and jazz music. He loves the piano, the guitar. He loves this kind of music,” Andrianjafitrimo said. “I think he has fun in it. He has so much fun, so he can relax.”\u003c/p\u003e\n\u003cp\u003eHumbert added: “For me, it\u0026#39;s more fun to play piano than guitar because I\u0026#39;m better at piano, so it\u0026#39;s easier to handle a little bit. But it\u0026#39;s nice to play some music, to think about something different, to be not in tennis every time.”\u003c/p\u003e\n\u003cp\u003eHumbert’s aggressive, front-foot game is the opposite of his laid-back personality. The Frenchman explained that even though his game appears a certain way, his mindset is not much different than when he is sitting at the piano.\u003c/p\u003e\n\u003cp\u003e“In tennis, okay, I play strong, fast. But inside I try in my mind to be really calm and really cool and really focus on what I have to do. And piano for me, it\u0026#39;s exactly the same,” Humbert said. “Even if I play something like Mozart, Beethoven, a classical song, it\u0026#39;s exactly the same. Mentally I have to be calm and focused on what I have to do.”\u003c/p\u003e\n\u003cp\u003e\n\u003cimg src=\"https://www.atptour.com/-/media/images/news/2024/04/12/05/51/humbert-portrait-2024.jpg\" alt=\"\u0026lt;a href=\u0026#39;https://www.atptour.com/en/players/ugo-humbert/hh26/overview\u0026#39;\u0026gt;Ugo Humbert\u0026lt;/a\u0026gt;\"/\u003e\u003cbr/\u003e\n\u003cem\u003e\u003csup\u003ePhoto: ATP Tour/Getty Images\u003cbr/\u003e\n\u003c/sup\u003e\u003c/em\u003eThat focus has helped Humbert climb into \u003ca href=\"https://www.atptour.com/en/tournaments/nitto-atp-finals/605/overview\"\u003eNitto ATP Finals\u003c/a\u003e contention and within striking range of the world’s Top 10.\u003c/p\u003e\n\u003cp\u003eFormer World No. 10 \u003ca href=\"https://www.atptour.com/en/players/lucas-pouille/pf39/overview\"\u003eLucas Pouille\u003c/a\u003e has been happy to see the recent surge from his countryman. The 30-year-old believes Humbert still has room to grow, too.\u003c/p\u003e\n\u003cp\u003e“In his game, no limits. I think he has no limits and mentally as well,” Pouille said. “Two years ago he was feeling not so well. He went back in the rankings, outside of the Top 100. Last year, this time of year [in March], he was playing a Challenger in Pau. \u003c/p\u003e\n\u003cp\u003e“It\u0026#39;s always great to see a French player coming back to the top. And I think we\u0026#39;ve been used to having those kinds of players in the Top 10, Top 20, Top 30, Top 100. We had so many that it\u0026#39;s important to still have some players like this.”\u003c/p\u003e\n\u003cp\u003eHumbert is at No. 13 in the PIF ATP Live Rankings and Pouille explained his feeling that “Top 15 is the beginning for him”.\u003c/p\u003e\n\u003cp\u003e“Hopefully he can perform well in the Grand Slams soon. That\u0026#39;s where the big points are. That\u0026#39;s where he still hasn\u0026#39;t played as well as he wants,” Pouille said. “But I\u0026#39;m sure it will come soon because of the confidence he has now. I think he is one step better than he used to be.”\u003c/p\u003e\n\n\u003cp\u003eIn a way Humbert’s ascent has been similar to his increasing comfort as a musician. Step by step he has continued to work and learn. Now, he is one of the best tennis players in the world.\u003c/p\u003e\n\u003cp\u003e“I think [it takes] time. You started when you are super young, and you started to play some tournaments. You are better and better with pressure,” Humbert said. “For me when you work hard, and you feel you are better and better and ready to go in competition, you feel less pressure.”\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eTHIS IS TENNIS - ATP Tour 2024 campaign is all about reaching out to fans celebrating, championing and showcasing the very best from tennis both on and off court. \u003ca rel=\"noopener noreferrer\" href=\"https://www.youtube.com/watch?v=gCmln80FSR8\" target=\"_blank\"\u003eCheck out our hero brand film\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\n    \n\n\n\n\n    \n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": null,
  "modifiedTime": null
}
