{
  "id": "f47bb4fe-1b54-452e-8756-1f5ddaed6ad6",
  "title": "Fearnley ready for 'hostile' pro-Kyrgios crowd - day two preview",
  "link": "https://www.bbc.com/sport/tennis/articles/c8j871lk19eo",
  "description": "Britain's Jacob Fearnley is expecting a febrile atmosphere when he faces Nick Kyrgios at the Australian Open, while Jack Draper and Jodie Burrage also play on day two.",
  "author": "",
  "published": "Sun, 12 Jan 2025 10:04:52 GMT",
  "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
  "categories": null,
  "byline": "Jonathan Jurejko",
  "length": 3939,
  "excerpt": "Britain's Jacob Fearnley is expecting a febrile atmosphere when he faces Nick Kyrgios at the Australian Open, while Jack Draper and Jodie Burrage also play on day two.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Australian Open 2025Dates: 12-26 January Venue: Melbourne ParkCoverage: Live radio commentary on Tennis Breakfast from 07:00 GMT on BBC 5 Sports Extra, plus live text commentaries on the BBC Sport website and appBritain's Jacob Fearnley hopes his experience of playing in some \"pretty hostile environments\" will prepare him for facing home favourite Nick Kyrgios in a boisterous Australian Open atmosphere.The 23-year-old has been handed the blockbuster first-round draw on his overseas Grand Slam debut.The pair meet at Melbourne Park on Monday at 19:00 local time (08:00 GMT) on John Cain Arena.It is the third show-court at Melbourne Park and is a ticketless stadium known to attract a noisy crowd.However, Fearnley learnt his trade in a United States college tennis system known for its \"brutal\" atmospheres, and he believes that could stand him in good stead.\"I will try to ignore [the crowd] as best as I can,\" said the Scot, who also faced Novak Djokovic in the second round at Wimbledon last year.\"Obviously I've been to some pretty hostile environments. Probably not [in front of] as many people going to be watching on Monday.\"I've definitely had some nasty things thrown in my direction. You just have to ignore it and move on.\"Kyrgios, 29, is making his Grand Slam comeback after a long absence with a wrist injury that left him fearing for his career.The 2022 Wimbledon finalist can be a polarising figure, but is loved by the Melbourne fans who always back him loudly on Cain.With Kyrgios playing for the first time since 2022, it is bound to be a tinderbox occasion packed with emotion and noise.\"I'm a huge fan of his,\" said Fearnley, who enjoyed one of the fastest rises in the history of the ATP rankings last season.\"I think there are some people out there that don't agree with the stuff he does. \"But I think it's great for the sport. He increases viewership. He puts people in seats.\"Fearnley has also deleted Instagram from his phone because of the volume of messages he has been receiving after the draw was announced.\"I wanted to try and stay as centered as possible,\" he added.British eyes also on Draper, Burrage and... MurrayFearnley is not the only Briton who will attract attention on day two at Melbourne Park.British men's number one Jack Draper begins his campaign against Argentine clay-court specialist Mariano Navone on court three at about 16:00 local time (05:00 GMT).Draper, seeded 15th, is looking to back up his run to the US Open semi-finals at the final major of 2024.The 23-year-old left-hander has not played competitively since the end of October, having picked up a hip injury during the off-season.In order to build up match sharpness, he practised against 24-time major champion Novak Djokovic and world number one Jannik Sinner last week on Rod Laver Arena.\"When I first came onto the tour, I remember putting my name down in Miami and no-one wanted to hit with me,\" Draper recalled.\"That is obviously a bit different now.\"It's really great to be able to spar with that kind of level of intensity and work ethic.\"In the women's draw, British number seven Jodie Burrage returns to Grand Slam action against French qualifier Leolia Jeanjean on court 13 at 11:00 local time (00:00 GMT)Burrage is using a protected injury ranking after missing six months of last season with wrist and ankle problems.The 25-year-old contemplated quitting tennis because she did not know how much \"fight\" she had left.Meanwhile, there is one more Briton who will be in the stands on Monday.Former world number one Andy Murray retired from the sport in August, but has made a shock return to coach his long-time rival Djokovic. Murray, 37, says he could not turn down the \"unique opportunity\" to help Serbia's Djokovic win a record-extending 11th men's title.Another triumph for the 37-year-old Serb, who starts against American teenager Nishesh Basavareddy, will also be a standalone all-time record 25th major.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5f58/live/c8ed0c40-d0ae-11ef-8ac8-7bd62bbf7ce5.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eAustralian Open 2025\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eDates:\u003c/b\u003e 12-26 January \u003cb\u003eVenue: \u003c/b\u003eMelbourne Park\u003c/p\u003e\u003cp\u003e\u003cb\u003eCoverage: \u003c/b\u003eLive radio commentary on Tennis Breakfast from 07:00 GMT on BBC 5 Sports Extra, plus live text commentaries on the BBC Sport website and app\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eBritain\u0026#39;s Jacob Fearnley hopes his experience of playing in some \u0026#34;pretty hostile environments\u0026#34; will prepare him for facing home favourite Nick Kyrgios in a boisterous Australian Open atmosphere.\u003c/p\u003e\u003cp\u003eThe 23-year-old has been handed the blockbuster first-round draw on his overseas Grand Slam debut.\u003c/p\u003e\u003cp\u003eThe pair meet at Melbourne Park on Monday at 19:00 local time (08:00 GMT) on John Cain Arena.\u003c/p\u003e\u003cp\u003eIt is the third show-court at Melbourne Park and is a ticketless stadium known to attract a noisy crowd.\u003c/p\u003e\u003cp\u003eHowever, Fearnley learnt his trade in a United States college tennis system \u003ca href=\"https://www.bbc.com/sport/tennis/articles/c70w1r5yjz2o\"\u003eknown for its \u0026#34;brutal\u0026#34; atmospheres\u003c/a\u003e, and he believes that could stand him in good stead.\u003c/p\u003e\u003cp\u003e\u0026#34;I will try to ignore [the crowd] as best as I can,\u0026#34; said the Scot, who also faced Novak Djokovic in the second round at Wimbledon last year.\u003c/p\u003e\u003cp\u003e\u0026#34;Obviously I\u0026#39;ve been to some pretty hostile environments. Probably not [in front of] as many people going to be watching on Monday.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;ve definitely had some nasty things thrown in my direction. You just have to ignore it and move on.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eKyrgios, 29, is \u003ca href=\"https://www.bbc.com/sport/tennis/articles/cx2knypyy0lo\"\u003emaking his Grand Slam comeback\u003c/a\u003e after a long absence with a wrist injury that left him fearing for his career.\u003c/p\u003e\u003cp\u003eThe 2022 Wimbledon finalist can be a polarising figure, but is loved by the Melbourne fans who always back him loudly on Cain.\u003c/p\u003e\u003cp\u003eWith Kyrgios playing for the first time since 2022, it is bound to be a tinderbox occasion packed with emotion and noise.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m a huge fan of his,\u0026#34; said Fearnley, who enjoyed one of the fastest rises in the history of the ATP rankings last season.\u003c/p\u003e\u003cp\u003e\u0026#34;I think there are some people out there that don\u0026#39;t agree with the stuff he does. \u003c/p\u003e\u003cp\u003e\u0026#34;But I think it\u0026#39;s great for the sport. He increases viewership. He puts people in seats.\u0026#34;\u003c/p\u003e\u003cp\u003eFearnley has also deleted Instagram from his phone because of the volume of messages he has been receiving after the draw was announced.\u003c/p\u003e\u003cp\u003e\u0026#34;I wanted to try and stay as centered as possible,\u0026#34; he added.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"British-eyes-also-on-Draper-Burrage-and-Murray\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eBritish eyes also on Draper, Burrage and... Murray\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eFearnley is not the only Briton who will attract attention on day two at Melbourne Park.\u003c/p\u003e\u003cp\u003eBritish men\u0026#39;s number one \u003cb\u003eJack Draper\u003c/b\u003e begins his campaign against Argentine clay-court specialist Mariano Navone on court three at about 16:00 local time (05:00 GMT).\u003c/p\u003e\u003cp\u003eDraper, seeded 15th, is looking to back up his run to the US Open semi-finals at the final major of 2024.\u003c/p\u003e\u003cp\u003eThe 23-year-old left-hander has not played competitively since the end of October, having picked up a hip injury during the off-season.\u003c/p\u003e\u003cp\u003eIn order to build up match sharpness, he practised against 24-time major champion Novak Djokovic and world number one Jannik Sinner last week on Rod Laver Arena.\u003c/p\u003e\u003cp\u003e\u0026#34;When I first came onto the tour, I remember putting my name down in Miami and no-one wanted to hit with me,\u0026#34; Draper recalled.\u003c/p\u003e\u003cp\u003e\u0026#34;That is obviously a bit different now.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s really great to be able to spar with that kind of level of intensity and work ethic.\u0026#34;\u003c/p\u003e\u003cp\u003eIn the women\u0026#39;s draw, British number seven \u003cb\u003eJodie Burrage\u003c/b\u003e returns to Grand Slam action against French qualifier Leolia Jeanjean on court 13 at 11:00 local time (00:00 GMT)\u003c/p\u003e\u003cp\u003eBurrage is using a protected injury ranking after missing six months of last season with wrist and ankle problems.\u003c/p\u003e\u003cp\u003eThe 25-year-old \u003ca href=\"https://www.bbc.com/sport/tennis/articles/ckgx5e3lkjwo\"\u003econtemplated quitting tennis\u003c/a\u003e because she did not know how much \u0026#34;fight\u0026#34; she had left.\u003c/p\u003e\u003cp\u003eMeanwhile, there is one more Briton who will be in the stands on Monday.\u003c/p\u003e\u003cp\u003eFormer world number one \u003cb\u003eAndy Murray\u003c/b\u003e retired from the sport in August, but has made a shock return to coach his long-time rival Djokovic. \u003c/p\u003e\u003cp\u003eMurray, 37, says he \u003ca href=\"https://www.bbc.com/sport/tennis/articles/cvgxgk6y1xlo\"\u003ecould not turn down the \u0026#34;unique opportunity\u0026#34;\u003c/a\u003e to help Serbia\u0026#39;s Djokovic win a record-extending 11th men\u0026#39;s title.\u003c/p\u003e\u003cp\u003eAnother triumph for the 37-year-old Serb, who starts against American teenager Nishesh Basavareddy, will also be a standalone all-time record 25th major.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-12T10:04:52.818Z",
  "modifiedTime": null
}
